{
	"computerMonitors": [
		{
			"id": "mi_1ULD",
			"title": "Sceptre 20 inch LED Monitor 1600 x 900 HD+ 75Hz HDMI VGA Build-in Speakers, 99% sRGB Wall Mount Ready Black 2021 (E205W-16003RTT)",
			"price": "$80.52",
			"image": "https://m.media-amazon.com/images/I/51I8EhF1XoS._AC_SX450_.jpg",
			"description": "SCEPTRE 20\" Full HD Slim LED Monitor 1600 x 900 HD+ Resolution Up to 75Hz Refresh Rate 2 x HDMI Ports & 1 VGA Port Built-In Speakers Adaptive Sync",
			"reviews": {
				"customerProfileNames": [
					"CharlieMiller",
					"Buyer",
					"Customer",
					"Jason",
					"Chife",
					"miguelcanales",
					"KC",
					"RedOutlaw509"
				],
				"customerProfilePictures": [
					"https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif"
				],
				"customerRatings": [
					"5.0 out of 5 stars",
					"5.0 out of 5 stars",
					"5.0 out of 5 stars",
					"5.0 out of 5 stars",
					"5.0 out of 5 stars",
					"5.0 out of 5 stars",
					"5.0 out of 5 stars",
					"5.0 out of 5 stars"
				],
				"customerReviewTitles": [
					"Microsoft 365 Family | Premium Office Apps | Up to 6 users | 3 Months Free, Plus 12-Month Subscription\nMicrosoft 365 Family | Premium Office Apps | Up…",
					"Microsoft 365 Personal | Premium Office Apps | 1 User, Up to 5 Devices | 3 Months Free, Plus 12-Month Subscription\nMicrosoft 365 Personal | Premium Office…",
					"Save $30 at checkout | Adobe Acrobat Pro DC subscription with auto-renewal\nSave $30 at checkout | Adobe Acrobat Pro DC…",
					"Save 68% on McAfee Total Protection 3 Device\nSave 68% on McAfee Total Protection 3 Devi…",
					"Nice monitor plus great customer service",
					"Excellent screen for the price",
					"Satisfied Customer",
					"Pretty good",
					"Great Product for Price",
					"Worth the money recommended",
					"Very good",
					"Great beginners gaming monitor"
				],
				"customerReviewBodies": [
					"Nice monitor. works well. Sound is a little weak but I didn't buy it for the speakers.\nThe best part of the monitor is the customer service. I thought I had installed the stand incorrectly (I didn't) and wrote Sceptre. I got a prompt email back and a video. I still wasn't satisfied with the angle of the monitor and wrote back. I got an email almost immediately explaining that I could angle the monitor by hand.\nGreat customer service to solve a silly, self-inflicted problem. Thanks, Sceptre!",
					"My job includes coding and reading. I needed another screen to place the code on one and the text on second one. And this screen is doing it, and doing it well. Also good quality for movies.\nThe builtin speakers are low quality, though. I do not use them as my computer is connected to JBL.\nAll in all for that price, and for that type of work, if you are looking for basic screen, with minimal requriements, it will not dissapoint you. Guaranteed.",
					"I purchased this monitor for work because I needed a second screen. It’s the perfect size because I didn’t want a huge bulky screen. It was very easy to set up and the price was perfect. The HDMI cord doesn’t come with the the monitor and I purchased one separate. Overall, I’m very please with the monitor.",
					"My camera sucks for my phone but the monitor is good",
					"This did what I needed it to do for a second monitor. The display is nice and there are plenty of picture modes. The blue light reduction is really nice if your working on your computer for hours at a time. Nice size display as well. Highly recommend for the shopper not looking to spend a lot.",
					"Wide screen good colors",
					"Value for money",
					"Great for beginners, it’s small so it’s perfect to travel with, can’t really say anything else, besides this was a good buy."
				]
			}
		},
		{
			"id": "9s94Tng",
			"title": "LG 27MP400-B 27” Full HD (1920 x 1080) IPS Display with 3-Side Virtually Borderless Design, AMD FreeSync and OnScreen Control – Black",
			"price": "$189.88",
			"image": "https://m.media-amazon.com/images/I/81Q5sjpgRDS._AC_SY450_.jpg",
			"description": "The product is multiple voltage compatible, that voltage arrange is 100-240V",
			"reviews": {
				"customerProfileNames": [
					"RBV",
					"Doglover",
					"JoeBob",
					"Ken",
					"RoyBlaze",
					"jeff",
					"SriharshaPolisetty",
					"EleanoreMcKee"
				],
				"customerProfilePictures": [
					"https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif",
					"https://images-na.ssl-images-amazon.com/images/S/amazon-avatars-global/747ea6ab-c956-4ed2-891f-18b856f64144._CR0,0.0,333,333_SX48_.jpg"
				],
				"customerRatings": [
					"5.0 out of 5 stars",
					"5.0 out of 5 stars",
					"5.0 out of 5 stars",
					"5.0 out of 5 stars",
					"5.0 out of 5 stars",
					"5.0 out of 5 stars",
					"5.0 out of 5 stars",
					"5.0 out of 5 stars"
				],
				"customerReviewTitles": [
					"Microsoft 365 Family | Premium Office Apps | Up to 6 users | 3 Months Free, Plus 12-Month Subscription\nMicrosoft 365 Family | Premium Offic…",
					"Microsoft 365 Personal | Premium Office Apps | 1 User, Up to 5 Devices | 3 Months Free, Plus 12-Month Subscription\nMicrosoft 365 Personal | Premium Offic…",
					"Save $30 at checkout | Adobe Acrobat Pro DC subscription with auto-renewal\nSave $30 at checkout | Adobe Acroba…",
					"Save 68% on McAfee Total Protection 3 Device\nSave 68% on McAfee Total Protection 3 D…",
					"LG has worked well for us. This 27-inches monitor is no exception...",
					"27\" Monitor",
					"Perfect inexpensive monitor for Raspberry Pi",
					"This is a reasonably priced monitor, huge, giving me a great view of my work.",
					"No complaints, a really good monitor.",
					"Just ordered it...so far.so good",
					"Just okay",
					"So easy to set up and connect."
				],
				"customerReviewBodies": [
					"Item will come repackaged.",
					"Brands are funny things. A brand that one customer loves is another customer's Bête noire. I historically have had very good luck with LG products. This monitor continues our satisfaction with our two \"dumb\" LG TVs. (\"Dumb\" as in no ability to connect a TV's embedded spyware, oops I mean \"streaming service\", to the Interwebs).\n\nBut note that I'm not a display connoisseur. There will be those who evaluate displays at the atomic level. I'm not one of them. For me, this 27-inces display does exactly what I purchased it to do.",
					"I added this as a 2nd monitor to my 17\" laptop for my part-time job. The quality is very good. Shipment was faster than the expected delivery time. Set up was so easy. This is a great monitor for the size and money.",
					"Good inexpensive monitor for amateur radio and software development with Raspberry Pi. Display is clean, bright, and sharp. For how I'm using the monitor, a more expensive one would be a waste of money.",
					"This monitor is very large, with a 23x13 screen (27\" diagonal). The control is a tiny \"joystick\" thing on the bottom, that takes a bit of getting use to. The picture is sharp and the colors are crisp. Although there are available on-screen adjustments, I thankfully didn't have a need of them.",
					"I sit outside in my garden with my laptop. I am older and the 17\" screen is getting smaller as I age. In other words even with glasses, it is harder to see things and worse, my main screen is 34\" and I'm spoiled. So I needed a bigger monitor out there and this is it. Couldn't be happier with it. Price is nice too.",
					"Lg is nice. My 27\" Monter is nice. I tried to go out to the thrift shops , Tolal JUCK...Buy New!!!",
					"Monitor does not loom modern. Its very bulky and looks and feels outdated. Only positive thing in this is its cheap and having 3 side borderless display. No issues as such. Have been using this for a while",
					"Ease of connecting and screen quality awesome."
				]
			}
		},
		{
			"id": "lA8E0mR",
			"title": "Sceptre 24\" Professional Thin 75Hz 1080p LED Monitor 2x HDMI VGA Build-in Speakers, Machine Black (E248W-19203R Series)",
			"price": "$90.22",
			"image": "https://m.media-amazon.com/images/I/71rXSVqET9L._AC_SX450_.jpg",
			"description": "Whether you are a gamer or a movie buff, the Sceptre E248W-19203R monitor is the way to go. 1080P resolution (1920 x 1080 pixels) delivers stunning color and picture detail on a 22 inch screen. A 5 millisecond response time displays action sequences with the highest Degree of clarity. Enjoy HDMI, and VGA inputs to connect all video and gaming devices. Lamp Life 50,000+ Hours. The brightness level is 250 cd/m2 ans the viewing angle is 175 degree (horizontal and vertical).Colors : 16.7M (6-bit Hi-FRC).Contrast Ratio:1000 : 1",
			"reviews": {
				"customerProfileNames": [
					"JohnMoran",
					"tevepaugh",
					"JMinton",
					"DanielPena"
				],
				"customerProfilePictures": [
					"https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif",
					"https://images-na.ssl-images-amazon.com/images/S/amazon-avatars/default._CR0,0,1024,1024_SX48_.png"
				],
				"customerRatings": [
					"5.0 out of 5 stars",
					"5.0 out of 5 stars",
					"5.0 out of 5 stars",
					"5.0 out of 5 stars"
				],
				"customerReviewTitles": [
					"Microsoft 365 Family | Premium Office Apps | Up to 6 users | 3 Months Free, Plus 12-Month Subscription\nMicrosoft 365 Family | Premium Office Apps | Up…",
					"Microsoft 365 Personal | Premium Office Apps | 1 User, Up to 5 Devices | 3 Months Free, Plus 12-Month Subscription\nMicrosoft 365 Personal | Premium Office…",
					"Save $30 at checkout | Adobe Acrobat Pro DC subscription with auto-renewal\nSave $30 at checkout | Adobe Acrobat Pro DC…",
					"Save 68% on McAfee Total Protection 3 Device\nSave 68% on McAfee Total Protection 3 Devi…",
					"I am extremelly impressed with this monitor! Great buy specially for gaming!",
					"Just calm down, It's was only $104.",
					"My go-to for office monitors.",
					"Just got two of these bad boys. pulled them out of the box added ..."
				],
				"customerReviewBodies": [
					"I have a GTX 1060 laptop, set up is easy and there was no need for me to calibrate anything, I even dare say this monitor looks better than my own laptop screen at 1080p.\n\nAt first i thought it didn not support 75Hz and the colors were washed out and it was too bright, also on the nvidia panel it said 1080p at 60Hz however this is what you gotta do to fix it.\n\n\"CALIBRATION\"\n\n1. Connect via HDMI\n2. Open Display settings and make sure that they are set so that only the 2nd display is turned on, do not put duplicate or extend.\n3. Open Nvidia control panel and go to \"Change Resolution\"\n4. You will see two lists, one will say HD, UHD etc, the other one at the bottom will say \"PC\", (changing the first list will project your laptop screen to the second screen however your laptop is 60Hz and the monitor is 75Hz that is why its limited to 60Hz and colors are washed out, changing the second list will basically use your laptop to power up the monitor at full 75Hz 1080p with the right color calibration.)\n5. On list two \"PC\" change the resolution to 1080p and 75Hz\n\nAnd there you go, now you can use your 75Hz monitor for gaming, make sure to change the settings indvidually in games to 75Hz or they will still run at 60Hz and the colors will be washed out.\n\nNow onto the review\n\n*** REVIEW ***\nThe screen resolution is full 1920x1080p at 75Hz, the colors are very accurate, it looks no where near like a TN panel, I would say its in between a TN panel and an IPS panel but closer to IPS.\n\nIt comes with speakers which are ok for the price but I recommend headphones or your own speakers which are probably better if you got this for gaming.\n\nThis is what comes in the package\n- Monitor\n- 4 screws for mounting\n- Two screws for setting up the monitor (non adjustable height(\n- HDMI to VGA cable\n- VGA to VGA cable\n\nI really recommend this monitor even if not for gaming, its a great price for what you get and it even comes with two cables.\n\nHowever one thing to note is that the difference between 60Hz and 75Hz is hard to notice in games. Playing Witcher 3 and Rise of Tomb Raider at locked in 75FPS wasn't anything much more amazing than 60FPS. However it is still an improvement.\n\nOne last thing to confider if you’re debating on a 75Hz vs 144Hz monitor\n- If you have a graphics card such as the GTX 770,970,1060 Most games (witcher, call of duty, battlefield wont go back 80 fps on ultra / high graphics) so you wont be able to take advantage of a 144Hz monitor, so I suggest this one. UNLESS you play on medium/low settings.\n- If you have a graphics card such as a GTX 770,780,980,1070 and above, I suggest the 144Hz monitor since these can run most tiles at well above 100FPS so you can take advantage of the monitor.\n\n*** UPDATE ***\nEarlier on the review I said the difference between 60Hz and 75Hz was negligible, I take it back.\n\nI played on my laptop which is limited to 60Hz and it feels bad and slugish compared to 75Hz, once you go higher refresh rate you can never go back\n\nIts one of those things you dont realise until its taken away, great improvement.",
					"If you are rating this like you ordered a $500 top of the line gaming monitor, then it's YOU that has issues, not the product. For under $120 this monitor well surpassed my expectations initially, as for longevity, we'll see. Great picture quality, thin appearance, and pretty small bezels. Came with HDMI cord (wasn't expecting that) and spacers for wall mounts/other mounting kits. Usable UI for adjustments if that's your thing. I honestly just set it up, plugged it in and bobs you're uncle. Again, it was only $104 when I ordered it, so this review is based on that. What else can be said? 24 inches is 24 inches, 75 hertz is 75 hertz, colors are colored and cords do cord things! For the price, it's definitely recommended and expectations where exceeded. Don't buy a monitor under $120 and try to review it like a $500 god-like gaming accessory.\nSo to recap, the monitor monitors, cords cord, and the stand stands. Cough into you elbow, stop driving 100mph and don't go to Walmart just to browse the electronics during a pandemic.\nUpdate- Jan 2021-\nturns out that you shouldn't sit near anything valuable while in vr. Still worked great even after I had smacked/punched it accidentally in vr......well at least the first 8 or 9 times anyway. The last hit did it in for good unfortunately but clearly not at all any fault of the brand. So, don't tell yourself you'll not do something again(sit to close to the monitor) but then repeatedly do it again and again expecting a different outcome. Wait, what's the definition of insanity again? 🤔",
					"Needed two new monitors for a new PC in the office. Went with this because it was the best value in terms of size vs price. I'd also purchased these for clients in the past and heard they were happy with them. After seeing the complaints about the colors being washed out, I gave my monitors away and decided if there were any problems with these I'd either live with it or fix it.\n\nOut of the box the monitors were fine. The only complaint I can come up with is that the VESA mounts are lower on the back due to the slim design. After looking at settings, I determined that for me as an IT manager I didn't need to recalibrate the screens at all. Granted, I spend most of my time looking at text documents, configuration pages for network equipment, and the accounting software my company uses. I couldn't speak to color calibration for individuals doing video or photo production.\n\nOne thought on the others experiencing washed out colors - HDMI out on a computer kind of expects a TV. Televisions and Monitors will sometimes have different ranges for black levels, which can cause the screen to look washed out. If you're experiencing this, check the control panel for your graphics driver. You should be able to adjust black levels and fix the issue. This has been a driving factor in my preference for just about anything over HDMI. (Display Port is king, for what it's worth.)",
					"Just got two of these bad boys. pulled them out of the box added the thread extenders put them on my monitor tree. Set up was easy, resolution is perfect for my needs (Business). Did some initial setup with adjusting the view area of the screen but the auto adjustment made that very simple. I use the VGA connections so can't speak to the HDMI but for the Price these are amazing. One thing that I will mention is that they use a proprietary Power cord but that is more just for information it has a very large plug so you will need to account for that when planning your Power set up.",
					"T",
					"Al principio sentía que carecía de brillo pero me acostumbre, las imágenes se ven muy bien, la frecuencia de actualización es de 74.973 Hz con windows, el modelo que me mandaron no coincide con la descripción pero creo que es mejor, recibí el E248W-19203RT, y otra cosa importante es que es de 24\" contando el marco por lo que da 23.85\" de pantalla en realidad, una ultima cosa es que las bocinas no son buenas, es buena opción si utilizaras más tus auriculares u otra bocina ya que estas ofrecen una calidad pobre como si de un dispositivo movil se tratara.",
					"",
					"You definitely get what you pay for, but I think this monitor is okay for what I wanted it for (a 2nd monitor to read news or check something out while playing a game or a movie on the main screen.\n\nGood points?\n-Nice and thin\n-Bright\n-I don't seem to have any dead pixels.\n\nThe Bad?\n\n-monitor flickers or temporarily goes blank if you move it any distance (bad connection on the HDMI port, but fine if you leave it alone. If it's a real problem, you can try the other HDMI port.\n\n-Screen isn't wonderful. If I look at it closely, you can see the pixels on the screen and around the edges of letters.\n\n-Feels plasticky - you notice it when using the menu buttons.\n\nOverall, if bought at a good price, it will probably serve you well, but I wouldn't use it for a main display.",
					"this thing is really good and is funny how no one is really talking about it but i guess is cause their not LG\non older pcs there this really annoying thing where on my 1000$ 2020 IPS monitor video's look bad and have ghosting. on this they look smooth and clean. games also run just as good as my expensive monitor even has adaptive sync. for under 200$ this thing is king strong recommend. NOTE: the down side of this monitor is the speakers sound like they were pulled from headphones and slapped on the back their really bad but aside from that great product..",
					"The designer of this product made something really wonderful. There's tiny attention to detail in materials choices, packaging. Some artistic, some functional.\n\nFor example, the plastic cover which protects the screen is taped on. They picked that tape carefully, and I can tell because it firmly held the cover in place, but when I accidentally stuck the tape to the screen it pulled away easily without leaving any glue behind. It's highly functional and intuitive. I am very happy with this monitor.\n\nOn function: Unlike monitors I've used before where plugs are inserted vertically, the HDMI ports are horizontal which makes it at least 20x easier to manage plugs. The power supply uses a smaller cord which is way easier to hide. The monitor and mount are very light weight. This monitor came with screws and a proper fitting to install the monitor on a wall bracket or arm.\n\nDrawback: the HDMI cable which comes with the monitor is short(ish). If you expect to use this cable double check the length. I had a nice one already so problem solved."
				]
			}
		},
		{
			"id": "t64XOes",
			"title": "ASUS VP229HE 21.5” Monitor, 1080P Full HD, 75Hz, IPS, FreeSync/Adaptive-Sync, Eye Care, HDMI VGA, Frameless, VESA Wall Mountable, BLACK",
			"price": "$129.99",
			"image": "https://m.media-amazon.com/images/I/71PWAuyc74L._AC_SY450_.jpg",
			"description": "The 21.5 inch ASUS VP229HE monitor delivers incredibly sharp imagery with its frameless IPS panel for wide angle viewing. Enjoy up to 75Hz refresh rate with Adaptive-Sync/FreeSync™ technology to eliminate tracing and ensure crisp video playback while viewing comfortably with TÜV Rheinland-certified Flicker-free and Low Blue Light technology.",
			"reviews": {
				"customerProfileNames": [
					"Joey",
					"DakotaLove",
					"M.Martinez",
					"Arideni",
					"Cooper",
					"M.S.Prager",
					"NathanH."
				],
				"customerProfilePictures": [
					"https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif",
					"https://images-na.ssl-images-amazon.com/images/S/amazon-avatars-global/68fa87ec-4cff-4b68-8689-d4b33ee91429._CR0,0,500,500_SX48_.jpg"
				],
				"customerRatings": [
					"4.0 out of 5 stars",
					"5.0 out of 5 stars",
					"2.0 out of 5 stars",
					"5.0 out of 5 stars",
					"1.0 out of 5 stars",
					"3.0 out of 5 stars",
					"5.0 out of 5 stars"
				],
				"customerReviewTitles": [
					"Microsoft 365 Family | Premium Office Apps | Up to 6 users | 3 Months Free, Plus 12-Month Subscription\nMicrosoft 365 Family | Premium Office Apps | Up…",
					"Microsoft 365 Personal | Premium Office Apps | 1 User, Up to 5 Devices | 3 Months Free, Plus 12-Month Subscription\nMicrosoft 365 Personal | Premium Office…",
					"Save $30 at checkout | Adobe Acrobat Pro DC subscription with auto-renewal\nSave $30 at checkout | Adobe Acrobat Pro DC…",
					"Save 68% on McAfee Total Protection 3 Device\nSave 68% on McAfee Total Protection 3 Devi…",
					"IF YOU NOTICE DISCOLORATION WITH A NVIDIA GPU AND HDMI SIGNAL: READ THIS!",
					"Perfect For The Price!",
					"WARNING: This monitor does NOT have an adjustable base!",
					"Excellent, dependable for gaming.",
					"This monitor was GREAT, at first",
					"Beware of huge Amazon misrepresentation",
					"Work Horse of a Monitor"
				],
				"customerReviewBodies": [
					"Go to your NVIDIA control panel, and click on \"Change resolution\" under Display. Scroll down, click on \"Output dynamic range\" and set it to full. I've included a picture for help with this. It should fixed colors that look washed out, without having to modify any color settings. If you already made some, I suggest you factory reset your monitor (in the menus) as it will look strange after doing this. Other than that problem, this monitor looks great! Also, you shouldn't have to worry if you're using DVI.",
					"I Love it! (Pictures included)\n\nPurchased on 5/31, Arrived 6/09.\n(9 Days) was free shipping over $49.\n-Box arrived undamaged.\n\nUpon opening the box, it had all components. Nicely individually wrapped. It included\n-Stand\n-Monitor\n-Power cable\n-DVI cable\n-VGA cable\n-ASUS VIP Member Notice\n-Quick Start Guide.\n\nAfter taking everything out of the box it was EXTREMELY easy to assemble. I can't stress that enough, a 12 year old could figure it out. The cords had caps on them to prevent dust and bending of the pins but again were simple to take off.\n\nOn the back of the monitor, it had\n-HDMI port\n-DVI port\n-VGA port\n-3.5mm audio port. (Needs input from HDMI cable)\n\nAfter putting it all together, the final product was beautiful.\n-It worked perfectly!\n-There were no dead pixels.\n-The colors were vibrant.\n-The images and letters were sharp.\n-The picture is just amazing.\n-The quality is outstanding.\nIt was just perfect. I LOVE this product and I'm 100% completely satisfied with my purchase. I did not receive a discount for my review either.\n\nI would DEFINITELY recommend.\n\nUPDATE: It's been a month since I purchased it and still had no problems with it.",
					"I specifically bought this monitor to use as a second screen because it was shown in the pictures as having an adjustable base, there's several pictures where you see the monitor flipped on it's side and adjusted up and down. Like the other reviewer said this is NOT the case. Look closely at the images from the back and you'll notice two different mounting bases. This monitor comes with the fixed one which only allows for a slight up/down tilt. No height or rotation allowed. You've been warned.",
					"I've owned this monitor for 7 years--purchased in Q1 2016. Great for gaming with a fast response time (5ms), but image quality for professional use is lacking since it doesn't cover the entire RGB spectrum (which most normal monitors don't, but it's still true so I knock a point for that). It's close and great if calibrated, but not 100% RGB color profile. There are faster response <2ms for the \"updated\" model, but I have no experience with that one. However, it's $10 cheaper and given my prior experiences with Asus over the last decade, wouldn't hesitate to check that model out instead. It is model no. Asus VP228HE and now marketed specifically for gaming whereas this one, at the time of purchase, was not. This doesn't mean anything, just marketing, but if you had any doubts well now you know this line was made w/ good specs for gaming. For 21.5-22\" it's perfect median between the old 19\" standard luxury and commonplace 24\" monitors for desktops nowadays (though I'm sure mainstream is yet to reach that size).\n\nThe best feature of the reviewed model was actually the removable base w/ a folding thumb screw. I've moved at least 3x and lived in 3 states since owning this monitor and the fact the base removes has made travel w/ it very easy--not sure if there's easier/better solutions for folks who travel w/ their entire setup, but this is definitely a good feature.",
					"This monitor was GREAT, at first. I have owned this monitor for about 10 months at this point, and I originally purchased 3 of them... In the last week, I have had pixels constantly going dead on me, on ALL of the monitors. I believe I am still within my warranty, and will try and get a swap. I will update my review as things progress.",
					"T",
					"I've had 2 of these monitors for a decade. I was extremely happy with the picture. I got a cheap desk mount and the results have been impressive. Now, I'm retiring the monitors to get a pair with AMD FreeSync and sharper colors. I've used these for long stretches of gaming, days of grueling college work, video editing, and general multitasking. If you need something that's going to go the distance, I can't recommend this model enough. At this point, I should say that I wouldn't recommend this for photo editing or gaming. Too much new tech out there that isn't compatible.",
					"I needed an inexpensive monitor to use as a second stream for streaming our church services. I bought this because of the price and good ratings. The picture is decent and quality is good.\n\nObviously, this isn't a gaming monitor, but for every use, it's a nice HDMI monitor.\n\n*the only disappointment is that in the box I got a VGA cable and a DVI cable. However, there was no HDMI cable! That's so wrong. To advertise it as an HDMI monitor but not include the cable. Makes more sense to save money by not including the other two cables and throw in the HDMI cable instead. Just an honest opinion.",
					"The monitor is worth 4 stars but I give 2 stars because I got a problem with the image resolution... When I open a youtube video in full screen, I got some kind of lag when the video play and I don't know how to resolve this... but when it's rasterized everything is good. I try all the wire that come with the screen and nothing change... same when I swipe a page up and down I got some kind of lag in the screen resolution... I will check for help online but it's the first time I experience this much trouble setting a monitor... I had my computer with a 42'' screen Samsung before buying this and I got no problem at all.\n\nOverall the screen is beautiful\nPrice is good 175$\nPoor rating because it's very complicated to set",
					"I bought this monitor specifically for old games that require a 4:3 aspect ratio, and for a Dreamcast. This monitor does indeed have a true 4:3 aspect ratio, and not a 5:4 aspect ratio. My VGA connected Dreamcast in particular does not display anything incorrectly on this monitor at all.\n\nThe picture is also very crisp, vivid, and clear, with ample colour, contrast, and brightness settings to customize it.\n\nThe only things I don't like about it are the lack of height and tilt adjustments in the monitor stand. The monitor sits low by itself, and has a slight lean forward by about 5%. Other than that, this is a great purchase.",
					"Me gustó mucho, en particular el tamaño.\nTiene relación de pantalla 5x4 (resolución máxima 1284 x 1024) lo cual es justo lo que estaba buscando.\nMuy buena imagen en particular si se configura a 75ghz (soporta también 60ghz) de frecuencia de refresco de pantalla.\nTrae varios modos de configuración de prefábrica para brincar entre ellos: estandar, gamer, nocturo (para no alterar el sueño), entre otros.\nBuena manufactura como suele ser ASUS.\nOjo: La base tipo VESA qeu se ve en algunas imágenes con la pantalla vertical en vez de horizontal, no viene incluida en el paquete.\n-----------------------------------------------------\nQuitar base original para cambiar a soporte VESA:\n1-Quitar base redonda plana inferior.\n2-Con un desarmador plano, empujar adentro de la base que aún se encuentra pegada al monitor por la legueta interna hasta que bote la tapa.\n3-terminar de retirar la tapa superior del soporte.\n4-Desatorinllar los tornillos de cruz restantes que fijan la mitad de la base al monitor lo cual libera la base.\nlisto (dejo foto)",
					"",
					"It works for me because I just wanted a secondary monitor to use Facebook and discord on but the colour is so washed out. Black isnt even black, its grey. Next to my colour match monitor it looks terrible, but it gets the job done. So if you aren't looking for good colour quality and just want a cheap monitor this one will work. Wouldn't recommend for gaming or watching videos"
				]
			}
		},
		{
			"id": "0lpR3nu",
			"title": "HP VH240a 23.8-Inch Full HD 1080p IPS LED Monitor with Built-In Speakers and VESA Mounting, Rotating Portrait & Landscape, Tilt, and HDMI & VGA Ports (1KL30AA) - Black",
			"price": "$169.99",
			"image": "https://m.media-amazon.com/images/I/71trhuzbhML._AC_SY606_.jpg",
			"description": "Get the best productivity from home or at the office with the virtually borderless HP VH240a 23.8-Inch display featuring an ergonomic stand, built-in speakers and an ultra-slim design at a competitively low price point. Great for projects requiring portrait and landscape mode screen rotation, the VH240a also includes a 178° positional viewing angle for the best quality no matter where you sit. You can also mount the display on a wall or arm bracket with a 100m VESA mounting pattern located on the back of the monitor arm. Connect your Windows, Mac, or any laptop featuring an HDMI port with an included HDMI cord. The video card of the connected PC must be capable of supporting 1920 x 1080 at 60 Hz and include 1 HDMI or 1 VGA output to drive the monitor at the preferred mode.",
			"reviews": {
				"customerProfileNames": [
					"NicholasStrezynski",
					"MG",
					"DragonNoRebyu",
					"BL",
					"Zach",
					"Kenny"
				],
				"customerProfilePictures": [
					"https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif",
					"https://images-na.ssl-images-amazon.com/images/S/amazon-avatars-global/091ea25a-f942-437d-8bf7-cb0c3ebfc543._CR0,0,375,375_SX48_.jpg",
					"https://images-na.ssl-images-amazon.com/images/S/amazon-avatars-global/9fd9a377-40f9-497a-a15a-1eee36bc332f._CR0,0,494,494_SX48_.jpg"
				],
				"customerRatings": [
					"5.0 out of 5 stars",
					"5.0 out of 5 stars",
					"4.0 out of 5 stars",
					"3.0 out of 5 stars",
					"4.0 out of 5 stars",
					"1.0 out of 5 stars"
				],
				"customerReviewTitles": [
					"Microsoft 365 Family | Premium Office Apps | Up to 6 users | 3 Months Free, Plus 12-Month Subscription\nMicrosoft 365 Family | Premium Offic…",
					"Microsoft 365 Personal | Premium Office Apps | 1 User, Up to 5 Devices | 3 Months Free, Plus 12-Month Subscription\nMicrosoft 365 Personal | Premium Offic…",
					"Save $30 at checkout | Adobe Acrobat Pro DC subscription with auto-renewal\nSave $30 at checkout | Adobe Acroba…",
					"Save 68% on McAfee Total Protection 3 Device\nSave 68% on McAfee Total Protection 3 D…",
					"Superb monitor",
					"Perfect for work & multiple monitors!",
					"Great for viewing and gaming. Not so much on sound....",
					"Highly adjustable, but takes up a lot of space and has weak speakers",
					"For the price, its amazing",
					"Worked for a month and then it died. After ..."
				],
				"customerReviewBodies": [
					"Manufacturer Refurbished to like new. 90 days warranty. No video cable included.",
					"This laptop sits at just over 4 stars while some of the other similarly priced and comparable monitors from Spectre, Lenovo, and other brands hover around 4.5 stars. This gave me pause, but after looking through many of the 1-3 star reviews it was clear that the majority had harshly penalized the monitor due to its reportedly lackluster audio performance. My laptop has surprisingly decent sound so I could essentially care less about the monitor's speakers. Now if my laptop didn't sound good then I would have simply connected my laptop to my Bluetooth speaker, my old PC speakers, my blue tooth headphones, or hell even my surround sound if I felt so inclined. Those reviews are overly demanding imo.\n\nFirst Impression: Time spent from opening the box to having the monitor up and running was under 5 minutes. Well designed packaging and easy to put together - no screwdriver required. Came with both a HDMI and an Aux cord... ok cool I appreciate that but whatever. First glance of the monitor on my 38\" x 24\" desk and I'm satisfied with its footprint. The screen bezels are tiny which looks good and helps manage size. Another plus is how the base extends behind the screen as opposed to extruding in front which would take up valuable real estate in front of the monitor. The monitor and my laptop share the desk very well, and there is even generous room for an open notebook directly in front of the monitor. I'm glad that I went with a 23.8\" monitor over something like a 20-22\" as that last 1-3 inches makes a noticeable difference in screen size. The design and style of the product is very sleek and it looks great on my desk. It definitely doesn't advertise its modest price tag with its expensive and luxury appearance.\n\nEarly performance: When I connected my laptop (a lightly upgraded Lenovo T440P Thinkpad, maybe a $400 laptop) via HDMI to the monitor I was met with a large snowy-owl staring at me (one of the photos that Windows cycles through before/during log-in). The picture was bright, edges were sharp, and the snow-white feathers of the owl looked like a true pure white. The contrast between the white of the owl, its dark eyes and the brown of the tree was great and everything looked realistic and accurate. After logging in I went into the Windows display settings and made a few simple adjustments on how I wanted the laptop to display to the monitor, it was very easy and intuitive to do.\n\nFirst thing I did was browse some HD Youtube videos (a Lord of the Rings fight scene, and Planet Earth) and I was immediately impressed. The screen kept up with the intense action/pace of the LotR fight without any lagging frames or stuttering. Planet Earth's tropical videos looked bright and accurately colorful while the following cave video was properly dark and intense with moments of brightness. Here the speed of some of the small critters gave the monitor a little bit of blurring, especially when the color of the animal was similar to the color of the background. I then switched over to Netflix, browsed a bit, and decided on Planet Earth again since the show has so many amazing spectacles to view. Everything looked just as great and in some cases even a little bit better. The speed of the animals didn't seem to blur as with youtube (note: I didn't watch the exact same video so this is highly anecdotal.) When it came to reading text and more general browsing of the web I was pleased. Letters had sharp corners, and the additional amount of text that fits on the screen vs my 14\" laptop made for less scrolling.\n\nHappy with the video playback I rotated the monitor (set monitor to top height, grasp edges of screen, and twist it to the right) to portrait. The rotation felt smooth and solid. Boy does it make for a long screen, but I'm confident I will use it when working with long lists of data, programming, using Excel, etc. I am glad I will have the option.\n\nWeaknesses: As mentioned before the sound is definitely weak. The volume is low, audio sounds pretty \"shallow\", and there just isn't much to report there. In my mostly quiet apartment I could hear and understand the audio from the monitor, but it admittedly wasn't long before I reverted back to my laptop sound. Nonetheless having an at least usable audio option as a back-up is better than nothing. I will generally award more points to any item that exceeds the expectations of its main function than I will penalize a product for including an average to below-average \"extra\" that is not vital to performance. If my computer chair gave me a back massage I would be very pleasantly surprised, but if it had a lumpy seat, didn't spin smoothly, and was stuck at a certain height I wouldn't be so pleased. I'll choose the chair that I can be comfortable in for hours, spins effortlessly and noiselessly, and adjusts height easily.\n\nI can't speak to using the monitor for gaming and whether it can handle that demand as I don't have the gaming tech knowledge, the gaming experience, or even a game to test it with.\n\nFinal Pros: Sleek aesthetic/design, stand rotates landscape-to-portrait, tiny bezels, good brightness, dark blacks, efficient footprint, simple and\nsmooth tilt/height adjustments\n\nFinal Cons: Weak speakers, minor blurring at times of very fast moving video.\n\nI highly recommend it!",
					"This monitor is a great deal for the price and size. I use these for my office and cannot comment on performance for detailed graphics, etc -- for common work tasks, even HD video, these do a great job just as you'd expect. I love that the bezel around the monitor is very thin so if you use mulitple monitors, you can get them very close together. I am not using the provided stand as I have these on a swing-arm mount but I'm very happy with these monitors. Just make note - these do not have a Display Port input , only HDMI and VGA. I needed a Display Port to HDMI adapting cable which is a very cheap cost and I'm so pleased with this purchase!",
					"I ordered this monitor because I wanted to make a makeshift area for my powerful, but old laptop. When I took it out of the box, I was impressed by the size of the screen. It's quite wide and sturdy so you have no fear of it wobbling around. So on to the testing. The hdmi and vga are good for selection. I use hdmi and turned it on. The images are gorgeous. The IPS definitely makes the FHD shine thru and thru. Images are vivid, movies are amazing, and you have plenty of room to see all of your windows. Everything was great....till I switched the sound from my laptop to the monitor. They REALLY dropped the ball there. I have to put the sound up on the monitor AND my laptop to even hear anything! I barely have to turn up the sound on my laptop to hear it so I don't know if they put all their money into the screen or decided the speakers were a last minute decision. SO if you plan on using this monitor with a tower pc, please have external speakers as your default because the monitor speakers are mediocre. So for those looking for a replacement monitor, a low price IPS screen, or a productivity/work/some gaming screen, I can suggest this to you. Those looking for a monitor with minimum fuss to it, I can sortof recommend it to you because it's easy to setup. But I strongly advise you to have external speakers in order to enjoy any sound while being hooked up to this monitor.",
					"Bought this for the height adjustment. The swivel ability is a nice bonus. At max height with standard widescreen orientation, the bottom of the monitor comes about 7\" off the desktop.\n\nMonitor has nice color and clarity, but the built-in speakers are very weak. My laptop speakers are louder; when I plug it into the monitor, I have to boost the volume around twice as high to get the same decibel output.\n\nThe monitor also takes up a lot of space in the back for the adjustable support; if you place the monitor up against a wall, the actual monitor sits 7-8\" from the wall, where a non-adjustable monitor would sit 3-4\" from the wall. I use a low-profile desk, so this monitor takes up a lot more space than a standard one. Knowing what I know now, I'm not sure I would make this purchase for my needs.",
					"The thing to remember with this product is you get what you pay for. I am a second year finance major, and I was looking for an additional monitor to use with my laptop. All I would need it for is spreadsheets, word processing, and internet use, so I didn't need a brand new 4k 34in ultra wide whatever. I just needed a simple cheap monitor that would get the job done, and this did exactly that. No, it doesn't have the best resolution, and no it doesn't have the best color correctness. But you can't compare a $120 monitor to a $1300 monitor. For a college student or home office this in my mind is the best monitor you can get for the money, and I fully intend to get a second one.",
					"Worked for a month and then it died. After 5 calls to HP support and numerous attempts to resolve the issue they decided to send me a refurbished one. 3 months later I received a refurbished one that was dead out of the box. Decided to cut my losses and threw it away. Never buying HP again.",
					" ",
					"",
					"The monitor works great for general and multipurpose use in my case (casual gaming, document processing, coding, media consumption). The faster response time options are great for gaming in general but remember to switch back to the default option when you're done because it will introduce weird artifacts during normal use.\n\nFor normal media consumption, the screen is great. It gets bright, pictures look clear and sharp in almost any angle thanks to the IPS panel. The screen speaker sucks major balls so don't even think about using it. Color isn't entirely accurate on this screen but for media consumption, it is totally acceptable.\n\nHowever when it comes to color accurate works such as image/video editing, digital art/illustration... any kind of work that requires accurate colors and wide color space (sRGB, AdobeRGB...), you better look elsewhere. This screen produces mediocre color accuracy and color gamut (72% sRGB) and while this is more than enough for casual usage, professionals need to find better solutions such as the Dell Ultrasharp line of monitors (U2417...) for better color and picture quality.\n\nThe stand itself is great, offers a lot of flexibility with adjustments for height, tilt, swivel and even portrait (90 degrees) orientation, perfect for processing documents, numbers and coding. The screen uses the standard 100x100 VESA mount so a wide variety of third-party stands and mounts are supported. Connections are limited but straight to the point, HDMI is pretty much all I need but VGA is also here as well in case you're still stuck in the 2000s.\n\nOverall, good monitor for the price, suitable for CASUAL gaming, office work, coding, document processing, media consumption (Video, movie...), NOT for professionals, color accurate works, and competitive gaming. And please for the love of god, DO NOT USE THE BUILT IN SPEAKERS for you will bleed from your earholes. You have been warned.",
					"El monitor es bueno, la funcionalidad para ponerlo vertical, es poco útil por que no cuenta con un sensor que haga el cambio aunque se agradece, este giro lo debes hacer manualmente en tu ordenador. En los juegos no es nada extraordinario pero bestante bien, el ajuste de altura es un muy buen punto, las bocinas no son las mejores así que no esperes un audio de gran cálidad. La pantalla evita la reflexión de la luz eso es muy bueno.",
					"",
					"Muy buen monitor para trabajo de oficina. Si eres diseñador o necesitas que cubra el espectro Adobe no es opción, pero si solo lo necesitas para el hogar o trabajo de oficina es perfecto. Marcos muy delgados, la base no es estorbosa y además puedes girarlo verticalmente constantemente de una forma muy fácil.",
					"",
					"Lamentablemente el producto llegó roto, adquirí varios artículos para el armado de mi PC y el monitor está roto, el empaque estaba sin daño pero adjunto foto del monitor!!!!",
					""
				]
			}
		},
		{
			"id": "xOe9FHb",
			"title": "BenQ 27 Inch IPS Monitor | 1080P | Proprietary Eye-Care Tech | Ultra-Slim Bezel | Adaptive Brightness for Image Quality | Speakers | GW2780,Black",
			"price": "$161.14",
			"image": "https://m.media-amazon.com/images/I/61XgyzdY-mL._AC_SY450_.jpg",
			"description": "BenQ GW2780 27 inch frameless IPS monitor combines Ultra slim bezels with hidden cable management. Complementing BenQ exclusive eye-care technology with low Blue light technology and flicker-free performance for extended viewing comfort, industry-leading brightness Intelligence technology delivers exquisite details in any ambient lighting environment. BenQ patented brightness Intelligence technology sensor will automatically detect your ambient lighting surrounds and automatically adjust the screen brightness to protect your eyes from longer on screen periods",
			"reviews": {
				"customerProfileNames": ["Bill", "Evan", "ArthurSenior", "Detromentum"],
				"customerProfilePictures": [
					"https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif",
					"https://images-na.ssl-images-amazon.com/images/S/amazon-avatars-global/253bdee1-2bc3-475f-8fcc-230453ec73e8._CR62,0,375,375_SX48_.jpg",
					"https://images-na.ssl-images-amazon.com/images/S/amazon-avatars-global/41d1ff96-47fe-41f5-a6ef-96a81a058017._CR83,0,333,333_SX48_.jpg",
					"https://images-na.ssl-images-amazon.com/images/S/amazon-avatars-global/2f765931-2c9d-4497-b9fc-5f3fca526492._CR62,0,375,375_SX48_.jpg",
					"https://images-na.ssl-images-amazon.com/images/S/amazon-avatars-global/8d2b9155-9c20-4474-8c55-2fb7ca739a3f._CR0,0,492,492_SX48_.jpg",
					"https://images-eu.ssl-images-amazon.com/images/S/amazon-avatars-global/d0c083a4-35f5-4bc8-8dda-129212a2e6c0._CR0,0,500,500_SX48_.jpg"
				],
				"customerRatings": [
					"5.0 out of 5 stars",
					"5.0 out of 5 stars",
					"5.0 out of 5 stars",
					"5.0 out of 5 stars"
				],
				"customerReviewTitles": [
					"Microsoft 365 Family | Premium Office Apps | Up to 6 users | 3 Months Free, Plus 12-Month Subscription\nMicrosoft 365 Family | Premium Office Apps | Up…",
					"Microsoft 365 Personal | Premium Office Apps | 1 User, Up to 5 Devices | 3 Months Free, Plus 12-Month Subscription\nMicrosoft 365 Personal | Premium Office…",
					"Save $30 at checkout | Adobe Acrobat Pro DC subscription with auto-renewal\nSave $30 at checkout | Adobe Acrobat Pro DC…",
					"Save 68% on McAfee Total Protection 3 Device\nSave 68% on McAfee Total Protection 3 Devi…",
					"Very good quality",
					"Great for Photo Editing",
					"A Affordable Quality IPS Monitor That Is Good For Most Things!",
					"Great for work!"
				],
				"customerReviewBodies": [
					"W",
					"I",
					"BenQ is a new brand to me, never heard of them before. But I saw the reviews and most people were raving about this one, so I thought I would give it a shot, considering the price was good on it. I bought this monitor for use with my tablet, I use it to monitor a security camera feed, as well as surf the web, watch video's, and do a little gaming. I have a 55\" 4K TV for my main computer, so I really only needed the monitor for the tablet.\n\nPACKAGING: The package that it comes in is certainly not thrilling to look at. It has a generic look to it to re-emphasize the fact that, you did not buy a high end monitor. However, they did package the monitor up very well in the box it came in, foam on both sides, and everything that comes with it neatly tucked away in the foam as well.\n\nWHATS INCLUDED: The box contains the monitor itself, a power cord, and a short HDMI cable. Also included, is a quick start guide, warranty sheet, and a driver disk, which also has the full product manual in PDF form.\n\nWARRANTY: BenQ monitors come with a 3-year warranty, which is pretty good! Oddly however, they changed their policy, and you no longer have to register your product with them, in order to validate your warranty. You are however, required to keep your purchase receipt as proof of ownership, if you should ever have to use your warranty. For online shoppers, that is your invoice page, take a screenshot.\n\nSETTING UP: Setting this monitor up is super simple, place monitor face down on the protective foam bag. Grab both pieces that make up the stand, connect them together, then screw in the built in nut, then push the stand into the monitor until it locks in place. What is great about this stand, is that it has a place to rout your cables for a neat install. Rout your power cable, and your data cable through the keepers within the stand, then plug them in. Then put the backing cover back on the stand, it only wants to go on properly one-way.\n\nPORTS: This monitor has the standard 3-pin computer cable port for power. This monitor comes with the ancient standard VGA port, the previous standard HDMI port, and the latest standard, Display port. It also has a speaker port, and a microphone port. I have it connected up to my tablet using HDMI at 1080P 60-hertz.\n\nSPEAKERS: Some people might not know that this monitor is a unique one, that actually comes with speakers. The built-in speakers however are pretty horrible, but this is to be expected due to the monitors size. The speakers can't be over 2-inches in diameter more then likely, which is why the sound is so weak in volume. The sound quality is terrible, the speakers do not produce quality bass, nor quality highs. The speakers pretty much just produce mid-range. Recommendation, use a pair of Edifier R1700BT bookshelf speakers, or a pair of headphones.\n\nSCREEN: The screen is an IPS (In Plane Switching) design that measures 23.8-inches diagonally from corner to corner. Unlike a TN (Twisted Nematic) panel which suffers from poor blacks, and major color distortion when viewed at an angle, IPS panels maintain quality deep rich color, with quality blacks, and practically no viewing angles. The only drawback to an IPS display, is that it has a higher response time, and as is with this screen 8ms, and is only 60 herts refresh rate, which is why its not great for gaming.\n\nGAMING: As an addition to the previous paragraph, this monitor would not be good for competitive gaming. A true gaming monitor should have a response time of 3ms or lower, and up to a 144 hertz refresh rate or better. The 8ms that this monitor supports, can cause you to see ghosting. And operating at only 60-herts, an action in the game, can happen quicker, then you can see it, which means, you have a higher chance of getting fragged in online play, rather then you doing the fragging.\n\nHowever, having said that, if your a non-competitive gamer, and you only play single player games like Dead Effect, or simple games like Plants Vs Zombies, this monitor will actually be fine for gaming.\n\nQUALITY: The quality that this monitor provides is pretty good for the price. While it may not be the best monitor for gaming, it does however produce rich color that actually looks really good. This monitor seems to prefer warmer tones to colors, even if I set the display to be a more cooler blue, it still is warmer then many other screens that I've used. If your looking for a monitor that provides you 100% accurate color reproduction, this may not be the one for you. If your willing to deal with the warmer tones, then this will be just fine for you.\n\nThe quality of blacks is probably one of the best I've seen on computer monitors, there is very little light leak through on the edges, its hardly noticeable at all. With a TN panel, you would see grey's instead of blacks, and there would be light leak all over the place. There are no dead pixel's that I can see, and the screen is very smooth with a matt finish, which helps reduce glare. The monitor uses a thin bezel design as well, which I like.\n\nMENU: This monitor uses a simple menu system, with the use of 4-different buttons, to navigate. Its not the easiest, nor the most logical menu setup, that I've ever used, but it works. Whats a cool however, is that the monitor displays what each button does on screen, so you don't have to look under the monitor with a flashlight to see its icon. (Icons only display on screen when in menu) I turned off all dynamic options, both brightness, and contrast, I don't need my monitor making choices on my behalf. I set the brightness to 50% and the contrast to 70%.\n\nEYECARE: This monitor comes with patented EyeCare technology. The company makes it seem so fancy in marketing. All it is, is there is a photocell under the monitor that senses light. When the light is low in the room, it darkens your screen. When the light is bright in the room, it razes the brightness of the screen. Basically, this EyeCare technology is best suited for those who stair at a screen all day in an office, and don't want to have headaches. You can turn this feature on/off in the menu.\n\nBEST SUITED FOR?: In my opinion, this monitor is best for people who do office work, production work, programming, security office camera feeds, web surfing, Youtube watching, and light gaming. Additionally, this would make a great streaming monitor as well.\n\nWHO IS THIS NOT FOR?: This monitor is not for people who are heavy gamers. Because of the naturally warmer color tones, this may not be the most accurate monitor for photo editing or video editing. However, if your not bothered by that, I still say its a good monitor for production work.\n\nWHAT WOULD I PREFER? I'd prefer a menu layout that was more logical. I'd prefer separate volume up and down buttons, instead of having to enter the menu to change volume. It would be nice if the monitor had a Tosslink port for audio input, most computer's today have a Tosslink audio output port. I'd also prefer higher quality speakers, if your going to put speakers in your monitor, do it right. And if you had a Tosslink connection, you'd have a high resolution sample rate and frequency response, which could actually produce quality sound.\n\nCONCLUSION: This monitor has been working out great for me. I am actually surprised at how good the quality of the screen is, for the cost. It used to be you had to spend 400 dollars or more to get an IPS monitor of this size, I'm very impressed, for the purpose I am using it for. While it may not be the best monitor, its a pretty good one for the price. Considering my usage of this monitor, I am going to give it a 5 out of 5 stars.\n\nPS: Picture of monitor showing rainbow color, is me running the tablet in Daydream COLORS mode, which is like a screensaver. And the other picture showing me playing a game on my tablet, is the game Dead Effect.",
					"These are fantastic monitors that I've been using for work for about a month now. The screens are matted not glossy which took some time to get used to since my old ones were glossy. I actually like this better now because there is no glare! The design looks very professional and they line up very well together!\n\nSetup was very simple, the base basically snaps together and then you screw it onto the monitor with the built in screw. The monitors also have a spot that you can attach a wall mount to if you felt you needed to do that.\n\nAfter selling monitors for years at my previous job, I'd say these are a great find for the price!",
					"Es un monitor muy elegante, con un panel ips magnifico. Tengo dos monitor del mismo modelo y son una chulada. Para diseño, video y películas están 100% recomendados sobre todo con su entrada Displayport. Para gamer competitivo no lo recomiendo porque tiene 5ms, yo lo uso para juegos ocasional desde PC y Consolada y en ambos anda con excelente desempeño. En resumen, si te gustan imágenes nitidas y fieles de color y jugar (no competitivo o pro-player) este monitor es para tí!",
					"",
					"I work from home doing software development and was looking for the following:\n- 27\"\n- mountable\n- thin bezel since I wanted to mount two\n- eye care tech since I'm on the computer all day long\n- IPS display\n\nThese are exactly the above, and so far look great and really do have a super thin bezel. I would not hesitate to buy these again. You end up paying a bit more to find all the above + mountable, but it is definitely worth it. Way better than stacking books.",
					"Soy estudiante de Ingeniería en Ciencias Computacionales, por mi carrera debo estar mucho tiempo en la computadora, por lo que mi antiguo monitor me lastimaba mucho la vista (tenía resolución de 1360 x768 y tenia mucho brillo ya que era tv/monitor). Aprovechando el Black Frigday, adquirí el monitor a buen precio, y al leer la descripción del producto este cumplía con mis necesidades básicas. De vez en cuando juego en mi PC por lo que los juegos mejoraron bastante, al estar estudiando no tengo fatiga visual, el brillo de la pantalla se adapta automáticamente al nivel de brillo de tu habitación y se ve muy clara la imagen.\nLo recomiendo ampliamente por el precio que pague, la caja y el equipo venían en muy buenas condiciones y llego 3 días antes de lo esperado.\nPara ser mi primera compra, ¡todo salio muy bien!",
					"",
					"Que tal, comparto mi reseña\n\n1. Entrega\nPedido: 24/05/2020\nEntregado: 29/05/2020\n\n2. Pros\n- Diseño minimalista y perfecto\n- Tiene muchas funcionalidades para ergonomía\n- Fácil de instalar\n- Tiene altavoces\n- Salidas de conectividad aceptables y las necesarias\n- Casi no tiene márgenes por su diseño bisel\n- Cable HDMI como accesorio\n- Cuenta con orificios para poder ponerle una base o brazo flexible (esto último haré)\n- La calidad de los vídeos y de las aplicaciones son geniales\n\n3. Contras\n- En mi Macbook Pro Retina de 15'' al conectarle el cable HDMI no puede sacar el audio\n\n4. Conclusión\nElegí este producto porque buscaba un monitor que sea bueno, bonito y barato. No tengo más palabras para este monitor, pero recomiendo que veas reseñas en vídeo tanto del fabricante como de personas que se dedican a la creación de contenido. Así mismo, no está de más que vayas a la página del fabricante para que leas las características y funciones que tiene, para mi es el mejor monitor que he tenido. Estoy feliz con mi elección\n\nSaludos",
					"",
					"It is the same as GW280 but has a 'T', meaning much-appreciated stand's functionality. The AdobeRGB is nearly 71.52%. It solely is not made for photographers, who have to deal with better color gamut reproduction. However, it's better to have than nothing or disgusting TN or VA panels. Aye, I would recommend it to those AdobeRGB obsessed photographers, this monitor. However, if they could, they better get a colorimeter to adjust the display's brightness and color based upon the ambient light of their editing rooms because the panel has a slight yellow tint infringement."
				]
			}
		},
		{
			"id": "fix4pND",
			"title": "Dell P2419H 24 Inch LED-Backlit, Anti-Glare, 3H Hard Coating IPS Monitor - (8 ms Response, FHD 1920 x 1080 at 60Hz, 1000:1 Contrast, with ComfortView DisplayPort, VGA, HDMI and USB), Black",
			"price": "$299.99",
			"image": "https://m.media-amazon.com/images/I/91ddm+P-VCL._AC_SY450_.jpg",
			"description": "Optimize your workspace with this efficient 24\" monitor built with an ultrathin bezel design a small footprint and comfort-enhancing features. The three-sided ultrathin bezel design lets you enjoy an uninterrupted view of your content across multiple monitors. And, with dual monitors, you can increase your productivity by up to 18%. Display position adjustments = Height-adjustable stand (130mm), tilt (-5 degrees to 21 degrees ) , Swivel (-45 degrees to 45 degrees ) and pivot (-90 degrees to 90 degrees).",
			"reviews": {
				"customerProfileNames": [
					"R.Lowe",
					"NicholasF.",
					"Sood007",
					"JCsGotThis",
					"Jenn",
					"MrfoxIL",
					"DanielMiller"
				],
				"customerProfilePictures": [
					"https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif",
					"https://images-eu.ssl-images-amazon.com/images/S/amazon-avatars-global/default._CR0,0,1024,1024_SX48_.png",
					"https://images-eu.ssl-images-amazon.com/images/S/amazon-avatars-global/141fb4e7-9ed2-452b-a5d7-443ea87f1b26._CR0,0,375,375_SX48_.jpg"
				],
				"customerRatings": [
					"5.0 out of 5 stars",
					"5.0 out of 5 stars",
					"5.0 out of 5 stars",
					"5.0 out of 5 stars",
					"5.0 out of 5 stars",
					"5.0 out of 5 stars",
					"5.0 out of 5 stars"
				],
				"customerReviewTitles": [
					"Microsoft 365 Family | Premium Office Apps | Up to 6 users | 3 Months Free, Plus 12-Month Subscription\nMicrosoft 365 Family | Premium Offic…",
					"Microsoft 365 Personal | Premium Office Apps | 1 User, Up to 5 Devices | 3 Months Free, Plus 12-Month Subscription\nMicrosoft 365 Personal | Premium Offic…",
					"Save $30 at checkout | Adobe Acrobat Pro DC subscription with auto-renewal\nSave $30 at checkout | Adobe Acroba…",
					"Save 68% on McAfee Total Protection 3 Device\nSave 68% on McAfee Total Protection 3 D…",
					"Excellent monitors for programming",
					"24\" Dell Monitors for Dual Monitor Professional Work",
					"Good solid monitor",
					"Good Quality, Good Picture , Fair price",
					"IT Department Always Knows Best",
					"Worked great for me",
					"The view on the screen is spactular"
				],
				"customerReviewBodies": [
					"Dell Factory Refurbished. Like New",
					"I",
					"I tried several other monitors of various brands and sizes which I did not like. I ordered two of these for a dual monitor set up for my home office. We use the same monitors at my corporate office but in the 21.5” size. The price point seems to be reasonable. They came with the required DP cables and work great. The monitors have a lot of great features, i.e. they are totally adjustable (swivel, height, tilt, 90 degrees turn), and have plenty of USB connections, etc. They don't come with speakers though. One of the drawbacks is having a cable salad in the back of it once you set them up, which is a mess that needs to be organized with some cable management straps. The picture quality is great for what I do (professional work, I.e. e-mails, internet, MS Office applications, etc.). I would highly recommend this monitor.",
					"Works perfectly what I need it for. Not sure how it would hold up for gamers etc. I’m mainly on spreadsheets, etc all day long so it works for my needs. Thin bezel is nice sleek design element. Very bright screen with anti glare finish makes it comfortable to look At for long periods of time. The best part about this monitor is the flexibility in the screen orientation and height adjustment which I’m always changing.",
					"I order 4 of these to replace my aging HPL2045ws One of them was starting to have issues over heating. I think they are almost 10 years old but were high end when I bought them. So 24\" to replace 20\" similar resolution. These new monitors are slightly better resolution. I almost don't notice it though. What I do notice is the size difference. So that was a good change. I don't want anything bigger. I already have to turn my head too much to see things.\n\nThe Quality of these dell are as expected from a well known company. The price was mid range for this size and resolution. Well worth the extra $20-$40 each to know that I was not going to get 2 bad monitors of the 4 I purchased. For me these are equivalent to a matched set. I need all 4 to be in good condition for a long time to come. Replacing one with a different type/brand would for sure cause me to have to replace all.\n\nI am very happy with the purchase. All 4 arrived same day (2 day prime delivery) and I was able to mount them on my 4 monitor Versa mount stand quick and easy. They are light weight and always cool to the touch. Another upgrade to the old HP LCDs I had. Office stays cooler now. No issues with Nvidia cards and Windows 10 or 2018 Server.\n\nI would recommend these to anyone looking for good monitors for Cad, Software development or general office use. Video seems really good on them too but that is not something I really know a lot about.",
					"When buying a monitor for working at home - I first bought based on price, thinking that it wouldn't make much difference and I was so wrong -- the other monitor didn't even HAVE all the colors -- washed out and distorted. I decided to look for a Dell monitor like the one my IT department put on my desk at work for use with my Macbook Pro - and I am super happy with the results. I haven't done any color calibration or changes - just plugged it into my new C-dock and away I went. Happy as with the quality out of the box. Thanks for prompt delivery!",
					"I don't know how relevant this review will be to others, but...\nI am in Software/Operations. I do a lot of e-mails and powerpoints, but also do some coding. I have a dual-monitor setup for my home office with I guess a VESA mount. (little square) mounting point.\nOne of my old monitors died and I decided to replace both.\nA few years ago, i had run DVI cables and power cables from the monitors to my docking station, about 10 feet away. I wasn't really looking forward to rerunning everything for new cables, etc...\nI had purchased two DVI to HDMI converters.\n\nJust for me, the swap out of the monitors was like scary easy. I always expect some bumps...but this went WAY easier than I had thought.\n\nThe VESA mounting area was perfect on the monitor and it came with its own screws for them. The power adapter took the same 3 prong adapter that my old monitors took (so no rerunning power). The HDMI inputs are downward facing so the cords don't stick out from the back but point downwards, so the cables look good.\n\nAnyway, good monitors with a nice picture and very easy setup.",
					"I highly recommend this product for anyone looking to purchase a beautiful computer monitor. I purchased two of them and now am able to have multiple programs all open at the same time with great vision. It has really increased my production significantly.",
					"I",
					"Brilliant 24 inch monitor, have owned 5 Dell Monitors before this and this one is perfect and as usual Dell doesn't disappoint, my purpose is to use it as a vertical monitor in addition to my primary and secondary 24 and 20 inch Dells so I use it mostly to read books, browse and for stock market usage and my GTX 1070 is fully capable to run all three so I am taking maximum leverage out of my setup.\n\nVertical monitors are a god send for browsing as you can see an entire page without much scrolling so a Landscape and Portrait monitor should be standard for everyone who is doing serious business with their PC, it's 2020 people wake up.",
					"I",
					"Out of the box...\n\nContents include:\n• The monitor & stand parts (easy to assemble, screwdrivers weren't needed)\n• UK 3-pin power cable/plug (C13 IEC fitting in monitor side, cable approx 120cm long)\n• 1 display-port to display-port cable (170cm long end to end)\n• 1 USB type A (PC end) to USB 3.0 type B cable (approx same length as display port cable),\n• Installation and help chart (one side of A4) and safety guide\n\nPolitical:\n• Made in China\n\nPorts (same as description obviously):\n• Power cable connection IEC C14\n• 1 DisplayPort\n• 1 HDMI (although HDMI can carry sound, this monitor does not have built in speakers or a headphones port)\n• 1 VGA\n• 1 USB 3.0 Type B (connects to PC for extending your USB ports only, this is not a touch screen)\n• 4 USB type As (for connecting more peripherals,. 2 at the back and 2 at the left side)\n\nPackaging:\n• Sometimes people do complain about monitors having dead pixels or backlight bleeding on arrival, so in case you're wondering, they don't use bubble wrap or polystyrene protection, instead they use cardboard folded into protective shapes, but the monitor does feel solid and good quality and as you'll see from my first impression below the monitor worked perfectly.\n\nFirst impressions...\n\nVery good monitor, good crisp image and backlight looks even across entire screen. The good Lord has ensured I received a unit with no dead pixels so this is a very beautiful monitor. I've rotated my monitor portrait, you can rotate it either clockwise or anticlockwise whichever is more suitable for where you want the cable and buttons to face, (rotating it may make the side USB ports impractically positioned). You have to change orientation in your PC display settings, it does not automatically match the rotation of the monitor (this is standard). The screen face has a flat design that is not inset behind a frame which makes it look a bit more modern and the screen is closer to the edge, useful if you are connecting multiple displays.\n\nAlthough I'm not using the USB port extension (I positioned monitor too far away and have enough on my PC) I did test it, able to connect my mouse and also charge/tether my phone through it so first impressions seems it's as good as the USB ports in the PC itself. Although the pictures don't show this, the hole in the stand is for threading your cables through, with minimal stretching when rotating the display. As well as rotating landscape/portrait (z-axis) you can also adjust the vertical height and rotate slightly up or down (around x-axis), and the stand arm rotates at the base, (around the y axis).\n\nUPDATE (after a couple of months of usage, I intend to buy another one)\nStill works fine after a few months of using the product, no issues. I have the monitor next to my TV which is the main screen, the colours are slightly more vibrant/bright on my TV (games and pictures look more colourful on my TV), although discerning shades of colour is better on the Dell monitor (because my TV doesn't always show distinctions between lighter/darker colours very well). I'm soon going to buy another one of this monitor to replace my TV which is now starting to show dead blotches on the screen and it's spreading, some sort of LCD leprosy.",
					"I spent a lot of time researching 24\" monitors for a home office and this was my choice.\n\nYou are spoilt for choice in this size category of monitors, some of which are significantly cheaper. After room research, I decided I needed the height adjustment - I was then left with a handful. Further research and reviews lead me to purchasing this monitor.\n\nThe monitor comes very well packaged and its the first time I've come across a monitor that has been engineered to simply click together - no screws/bolts etc required. Using the supplied power cable, an existing HDMI cable and the supplied USB cable I was off. I recall reading a review on here that said the USB ports don't work - they do for me and have been extremely useful in using additional devices. They are high speed and work without any issues.\n\nThe height, swivel and angle adjustments all work very smoothly and allow you to adjust the screen perfectly, it was just what I was expecting.\n\nI was quite amazed by the screen quality and consistency. I opted for a back lit LED monitor in the hopes that the lighting and colour would be even and I was pleasantly surprised this this - it does a great job of spreading even light, colour and sharpness. My laptop has a 4K AMOLED screen so I am used to viewing the finest picture quality which often makes other laptops a bit of a pain to read but I was genuinely pleasantly surprised by this, especially given the price point.\n\nNot only is the screen great quality and consistent, the monitor itself looks great with its thin bezels and space saving footprint. I have been recommending to everybody wanting one!"
				]
			}
		},
		{
			"id": "06-84Em",
			"title": "ViewSonic VX2252MH 22 Inch 2ms 60Hz 1080p Gaming Monitor with HDMI DVI and VGA Inputs",
			"price": "$129.99",
			"image": "https://m.media-amazon.com/images/I/610TOgGZRmL._AC_SY450_.jpg",
			"description": "ViewSonic VX2252MH is a 22\" (21.5\" Viewable) 60Hz Full HD, glossy-finish display that offers the ultimate visual experience for gaming and multimedia entertainment. The VX2252MH features clearmotiv II technology that delivers 2ms ultra-fast response times for blur-free images during extreme gaming, and an ultra-high 50M: 1 Mega dynamic Contrast Ratio for sharp, crisp color performance for enjoying movies. Integrated D-Sub, DVI and HDMI inputs provide flexible connectivity for high-definition multimedia devices and gaming consoles, and dual built-in 2W Stereo speakers complete the package for multimedia enjoyment. With a VESA-mountable design, the VX2252MH can also be used as a wall-mounted display for any of your gaming and\nVideo entertainment needs. A 3-year limited warranty and the industry's best Pixel performance policy make the VX2252MH a great long-term investment.",
			"reviews": {
				"customerProfileNames": [
					"Ranger69",
					"BeeJay",
					"GauravK.",
					"TheresaV.",
					"MichaelV.",
					"Peredy",
					"GraqCon"
				],
				"customerProfilePictures": [
					"https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif"
				],
				"customerRatings": [
					"5.0 out of 5 stars",
					"5.0 out of 5 stars",
					"5.0 out of 5 stars",
					"5.0 out of 5 stars",
					"5.0 out of 5 stars",
					"5.0 out of 5 stars",
					"5.0 out of 5 stars"
				],
				"customerReviewTitles": [
					"Microsoft 365 Family | Premium Office Apps | Up to 6 users | 3 Months Free, Plus 12-Month Subscription\nMicrosoft 365 Family | Premium Offic…",
					"Microsoft 365 Personal | Premium Office Apps | 1 User, Up to 5 Devices | 3 Months Free, Plus 12-Month Subscription\nMicrosoft 365 Personal | Premium Offic…",
					"Save $30 at checkout | Adobe Acrobat Pro DC subscription with auto-renewal\nSave $30 at checkout | Adobe Acroba…",
					"Save 68% on McAfee Total Protection 3 Device\nSave 68% on McAfee Total Protection 3 D…",
					"It's the Picture, stupid!",
					"Good Monitor",
					"Good for work, gaming, or movies.",
					"Great quality and easy to use",
					"Why buy anything else?",
					"Works but as a side monitor not main",
					"Great Monitor!!!"
				],
				"customerReviewBodies": [
					"Well protected in carton, comes with many cables, vesa 100 mounts, good size for desktop, has many picture adjustments, still has the Dsub input along with hdmi and dvi, audio mini input and outputs, fairly lightweight. Mounted on my swing arm very quickly. Doesn't come with set up operator manual, I downloaded that from the website which really helped understand the front controls and the sequence of how to use them. It does have stereo speakers but don't expect much fidelity, good for background iTunes music, not much better than my old 60s transistor radio. There is no sound adjustment for bass or treble like an EQ, but this is not a tv it is a monitor. Probably add a small soundbar if you want good music playing. A nice sharp picture at a good price.",
					"I really like this monitor. I needed a monitor with integrated speaker, because I don't have external speakers with my computer (and I don't want them). So I was concerned when I read some of the reviews that said the sound was not good. I haven't found that to be the case at all. In fact, I think the sound is a bit better than my old monitor. I did discover that the factory setting was only at 50%, but I raised it up to 100% with the button on the bottom of the monitor, and of course I can still adjust the sound in the normal way with the speaker icon, so I'm happy with the sound. I'm also happy with the size of the monitor and with the image clarity, etc. And setting it up was super easy, which is important to me, because I'm no techie. So this monitor is working out very well for me. Glad I bought it.",
					"My model: ViewSonic VX2452MH 24\" 1080p\nUsing for ~4 months.\n\nI needed a second monitor to extend my laptop's display. For work use, I use it as a second monitor for coding and browsign internet. For home use, I use is to play games, watch sports, TV/movies/Netflix. This is my main entertainemnt display because I dont use the TV that much and this is convenient in my room.\n\nI bought this after a lot of research on TN, IPS, VA, etc. panels. TN panels have a complaint of having untrue colors at a wider angle like more than 160 degrees. Even though I am not using it at that wide angle, I don't see any color distortion. Resolution is really good (1920 x 1080) and it's really nice to have a lot of space for multiple windows instead of switching. It's very easy to assemble too; it took about 10 minutes.\n\nGreat monitor overall and worth the price (I bought it at $120). I would recommend it for any use case since there is a 22\" and 27\" variant too.",
					"M",
					"N",
					"T",
					"I have bought three ViewSonic VX2452MH 24 Inch 2ms 60Hz 1080p this year. I have to say they work great and they display a very good picture. I use them for work and my kids use them for school. I have given them a 5 star because for the price and quality, they do a good job. I will say the sound quality is BAD. That is the only down side. I use external speakers, so its not a big deal for me. The packaging was the ViewSonic box, but it arrive in one piece with no issues. Each of my monitors were delivered on time. I would recommend this monitor to anyone based on the value and quality.",
					"Bought this for my son to play his Xbox One games on.\nThe picture quality is very crisp and clear. He is really pleased with it.\nOnly one problem, my youngest son wants one now.",
					"I now have two of these for my custom set up PC gaming machine, nice clean crisp viewing with a multitude of settings, simple easy, great value, could not ask for more for the money thank you",
					"Excellent picture and great design. Speakers quiet but what I expected.",
					"I'm happy with the screen - it's good, the only reason I didn't give it 5 Stars is because I found the speakers to be very poor...",
					" I am fairly unhappy with this monitor. I went with it because of the 3 year warranty. I have literally set up the monitor at my desk. I have barely touched the monitor since I bought it. About maybe 3-4 weeks in to owning it, I noticed that there was some dead pixels on the top right side of the screen. I figured out how to make a warranty claim, which was difficult. Viewsonic wanted me to pay about $50 shipping to ship it to their repair facility to have it warranted for their defective screen. It is there mistake they should take responsibility for it the shipping costs, I didn't pay them for a defective product.\n\nI did alot of research in buying this monitors. Like days and days of research. I liked that it had the 3 year warranty, because i thought that they would stand behind their product. I was dead wrong. I am not rich, and it is disappointing to have spent my money on a monitor only to find that mislead me about the quality and warranty of it.\n\nIf you can wait a year I would wait for 4k monitors to become cheaper. 4K monitors will become the new standard soon. If like high quality sound then you will need to buy separate speakers. The built in speakers have some bass, but not alot. Included in the review is a video with the motion test, and the speaker test recorded on my phone. The video I posted i think is an accurate test of the sound quality of what the monitor is like in person.\n\nHaving read other reviews here I agree with other reviews in that if you can save and buy a higher quality 4K product you would be better off. It seems that there are defective models out there, so buyer beware.\n\n\"A 3-year limited warranty and the industry's best pixel performance policy make the VX2452mh a great long-term investment.\" (Is a gross exaggeration.)\n\nPros:\n1. Built in speakers.\n2. Good 1080 image quality excluding the dead pixels.\n3. Stylish design.\n4. The back light is good. It can dimly lite my room at night.\n5. The patriot logo on the left top side is cute.\n6. The price point is reasonable given the 1080p and the speakers.\n7. The power light is large. The power light is blue when on and orange on stand by.\n8. 24 inches is a nice size for browsing the web and light gaming.\n9. The monitor has no warm parts.\n10. I am not an expert but the contrast looks good.\n\nCons:\n1. The warranty is useless because you have to pay for shipping to have it repaired ($50-60). With all the time and hassle you might as well buy another monitor.\n2. The speakers are passable. Good for Youtube\n3. No meaningful Bluelight filter mode. (The ad copy is an exaggeration.)\n4. No meaningful Gaming Mode. (The ad copy is an exaggeration.)\n5. Bezels are large.\n6. The stand is flimsy plastic. (Wobbles easily)\n7. The menu buttons are cheap and hard to use. (The screen moves when you press the buttons)\n8. No HDMI cable included.\n9. No height adjustment, can slightly tilt only.\n10. Kinda dull color (For browsing the web and gaming it is fine)\n11. TN panel with poor viewing angles. (You will have to tilt it if you move around alot.)\n12. The screen itself is fragile."
				]
			}
		},
		{
			"id": "DL9TOgk",
			"title": "HP V28 4K Monitor - Computer Monitor with 28-inch Diagonal Display, 3840 x 2160 at 60 Hz, and 1ms Response Time - AMD Freesync Technology - Dual HDMI and DisplayPort - Low Blue Light - 8WH57AA#ABA",
			"price": "$199.99",
			"image": "https://m.media-amazon.com/images/I/91qiMPsFiXL._AC_SX450_.jpg",
			"description": "Immerse yourself in entertainment with the HP V28 4K Monitor*. With four times the pixels as an FHD computer monitor, you’ll experience significantly sharper, more premiere image clarity, for theatre quality viewing in the comfort of your own home. Plus, when using AMD FreeSync™ technology** paired with your AMD graphics card, you’ll enjoy fluid, artifact-free performance on your monitor 4k. And with HDMI 2.0 at a 60Hz refresh rate***, watch, play, and stream flicker-free.\n\n*4K content required to view full 4K images.\n**FreeSync™ is only available when it is connected to DisplayPort or HDMI. FreeSync is an AMD® technology enabled on FHD or QHD displays and is designed to eliminate stuttering and/or tearing in games and videos by locking a display’s refresh rate to the frame rate of the graphics card. AMD Radeon Graphics and/or AMD A-Series APU-compliant monitors with DisplayPort/HDMI Adaptive-Sync required. AMD 15.11 Crimson driver (or newer) required to support FreeSync over HDMI. Adaptive refresh rates vary by monitor.\n***All performance specifications represent the typical specifications provided by HP's component manufacturers; actual performance may vary either higher or lower.",
			"reviews": {
				"customerProfileNames": [
					"SeanFromFlorida",
					"SAM",
					"W.",
					"Sean",
					"AlanS.",
					"Steve",
					"Cathy",
					"MD"
				],
				"customerProfilePictures": [
					"https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif"
				],
				"customerRatings": [
					"3.0 out of 5 stars",
					"5.0 out of 5 stars",
					"5.0 out of 5 stars",
					"5.0 out of 5 stars",
					"4.0 out of 5 stars",
					"5.0 out of 5 stars",
					"5.0 out of 5 stars",
					"5.0 out of 5 stars"
				],
				"customerReviewTitles": [
					"Microsoft 365 Family | Premium Office Apps | Up to 6 users | 3 Months Free, Plus 12-Month Subscription\nMicrosoft 365 Family | Premium Offic…",
					"Microsoft 365 Personal | Premium Office Apps | 1 User, Up to 5 Devices | 3 Months Free, Plus 12-Month Subscription\nMicrosoft 365 Personal | Premium Offic…",
					"Save $30 at checkout | Adobe Acrobat Pro DC subscription with auto-renewal\nSave $30 at checkout | Adobe Acroba…",
					"Save 68% on McAfee Total Protection 3 Device\nSave 68% on McAfee Total Protection 3 D…",
					"Amazing monitor, Dual Monitor Mac users beware!",
					"Beautiful 4K monitor, Full 3840 X 2160 resolution, easy setup!",
					"Awesome good deal",
					"Best monitor i have ever owned, hands down",
					"Attention Macbook Users, Buy an Official Apple Thunderbolt 3 Cable! Included USB-C Cable is Trouble!",
					"Beautiful Screen and GREAT resolution",
					"Great product!",
					"Well built. Works as expected."
				],
				"customerReviewBodies": [
					"Manufacturer Refurbished to like new. Power adapter and cable included. Well packed. No Video cable included.",
					"I really love the business class HP monitors, as they calibrate the displays for color accuracy, and they have amazing monitor stands (up/down, tilt, swivel support). I really wanted to love this monitor, but as I use a Macbook Pro (2016 and 2019) computer, for some reason the Mac doesn't like having 2 of these monitors.\n\nGetting the Mac to output to both of these using the included USBC cable didn't work at all. Yes, this Macbook Pro can support multiple monitors - I had 2 LG USB-C monitors working at the same time. Only one of the HPs would work - I tried all the \"no signal\" troubleshooting tips online to no avail. I used a DisplayPort to USBC cable and eventually got both working at the same time (one using USBC, and other DP to USBC), but the problems didn't end there. I usually leave the monitors on and let the computer make them go to sleep, and they did, but sometimes both monitors wouldn't wake up.\n\nWith that said, I did try these monitors on a Windows Lenovo laptop that had 2 USBC ports and they worked just fine. So the issue above seems to be isolated to Mac laptops (I tried a 15\" MPB 2016 and 15\" 2019 MBP).\n\nSide note - the HDMI port (using HDMI to USBC) looked amazing on OSs that support HDR. I had to go into the display settings within the Mac and switch to a different color profile, but the colors just popped.",
					"I bought 2 of these and have them both connected to a HP Z-Book laptop through a HP USB-C/A docking station. Easily driving both at full 4K resolution (3840 x 2160) with crisp clear results. Setup was straight forward and simple. Very Satisfied with this product.",
					"Resolution was too much. Lol. Had to crank it back so I could read the screen. Super sharp and crisp right out of the box. Excellent monitor and very good quality. Highly recommend.",
					"i always love HP build quality, the stand is painted metal and very solid but light enough to not be clumsy and the best part No Screwdriver neeeded!!! IT CLIPS ONTO THE BACK TO BE EASILY REMOVED !!! BEST DESIGN EVER!\ni cant say enough good things about this monitor, best picture and color quality with Top Tier build quality, I love HP!",
					"UPDATE: It has been a few days and now the monitor is having problems waking even with the apple thunderbolt 3 cable. Pretty disappointing since its a very nice monitor otherwise.\n\nThis monitor is very nice. I love the stand and the picture quality. I am using it with a 2019 MacBook Pro 15, and initially I was having issues out of the box with the included USB-C cable, as many other users have reported as well. Whenever I would disconnect the MacBook from the monitor and then plug it back in, the monitor would not recognize that a source was connected until I physically unplugged the monitor and plugged it back in. Pushing the button on the monitor to toggle the it on and off did nothing. It would not wake it on its own. It had to be completely unplugged from the wall and plugged back in order for the source to be recognized, talk about annoying! I decided to buy Apple's Thunderbolt 3 cable to see if that would help. It fixed the issue 100 percent. It now functions flawlessly without any issues at all. This is the solution for anyone having problems. It's unfortunate that this cable costs $40 and is pretty much necessary for us MacBook users, but I got the monitor on sale for such a low price I do not mind. This monitor is beautiful, especially for the price. And the stand it comes with is very high quality. After replacing the cable, I can now highly recommend this monitor. I just wish it came with a better cable in the box.\n\nFor anyone having issues using their MacBook with this monitor, BUY AN APPLE THUNDERBOLT 3 CABLE",
					"this screen is awesome - I've bought 4 now!!! BUT, be sure your graphics can drive a true 4K, most are saying 4K compatable but only produce 1024 output... BE SURE YOU HAVE 4K, which is really 3070 but is still amazing!!!",
					"Upgraded from 23\" monitors to these for my home office and they are great! Easy on the eyes.",
					"Well built. Works as expected. Perfectly sized. great usbc display port uplink. But needs occasional hard reset",
					"Good monitor. Not the highest end, but for the price it's quite good. You would have to spend a lot more to get a little better. The colors were pretty accurate right out of the box. I only made minor adjustments. I'm not in the bleeding edge of gaming but it performs well with what I do play.",
					"Bought it to extend my desktop, works well for the price.\nI wish switching inputs was a bit faster, you need to cycle through all of them and it takes more than a few seconds for the monitor to identify and sync to the signal, or realise that theres nothing there. However, its a minor annoyance. If I needed to do that every day, or multiple times a day, I would probably look for a different monitor. If you never need to do that and only want to use a single input, theres no reason not to consider this monitor.",
					"This monitor is wack. The gamma and brightness are completely off, even after installing the calibration information available on HP's website for this specific monitor. Worse yet, mine came with a dead pixel which is SUPER noticeable. I thought maybe it would go away, but it has not yet. For the price I paid for this monitor, I fully expected something that was not only a good value, but also worked well. This does not.\n\nEDIT: April 12, 2021. After class, I put my computer to sleep mode and lay down, gaining a bit of energy to continue during exam time. I wake up, ready to write my final papers and exams. Screen is messed up. I think I just got a bad panel.",
					"Bought one for $301.95 CAD. Noticed on day 1 that the screen would occasionally flicker, or the brightness would jump up then fade down. There were also vertical stripes, often quite faint but sometimes they'd be straight-up glitchy, as if the screen were made of skinny corduroy.\nI requested a replacement, which turned out to have the exact sames issues, so I sent it back and went for another product. As an aside, they received the return a day late and charged me a $60 fee >:|\nDuring all this I noticed the price on this item fluctuate every week or so (it's currently $340.60). I think they were trying to offload defective or previously returned units to unsuspecting customers or something.",
					"I'm using this for photo work, and it performs quite well. I Spydered it, and it turned out to be pretty much on the money. I'm now a 4K fan. Wouldn't go back. Only niggle: the screen text on drop down menus etc. is now smaller."
				]
			}
		},
		{
			"id": "3zTHrYs",
			"title": "Acer SB220Q bi 21.5 Inches Full HD (1920 x 1080) IPS Ultra-Thin Zero Frame Monitor (HDMI & VGA Port), Black",
			"price": "$128.00",
			"image": "https://m.media-amazon.com/images/I/81QpkIctqPL._AC_SY450_.jpg",
			"description": "The Acer SB220Q bi 21. 5\" Widescreen LCD IPS display combines stylish ultra-thin functionality with amazing 1920 x 1080 resolution, allowing you to enjoy High-Definition entertainment in the comfort of your home. Incredible 100, 000, 000: 1 contrast ratio and rapid 4ms response time highlight the advanced technology, The SB220Q bi LCD also features multiple inputs (HDMI & VGA) for greater compatibility and a Kensington lock slot to protect your investment. Standby power consumption - 450 maw. (UM. WS0AA. 003). Height without stand - 11. 9 inches, Width - 19. 6 inches, Depth - 1. 4 inches. Weight (Approximate) - 4. 41 pounds. Weight with stand (Approximate) - 5. 47 pounds.",
			"reviews": {
				"customerProfileNames": [
					"JoshuaRhine",
					"Seth",
					"Gergly",
					"SamA",
					"kierysma",
					"Henry",
					"Leandro",
					"N.Myers"
				],
				"customerProfilePictures": [
					"https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif",
					"https://images-na.ssl-images-amazon.com/images/S/amazon-avatars-global/2cf03ad8-b28e-44f1-aa37-673b8978e821._CR0,0,500,500_SX48_.jpg"
				],
				"customerRatings": [
					"5.0 out of 5 stars",
					"5.0 out of 5 stars",
					"5.0 out of 5 stars",
					"5.0 out of 5 stars",
					"5.0 out of 5 stars",
					"4.0 out of 5 stars",
					"5.0 out of 5 stars",
					"4.0 out of 5 stars"
				],
				"customerReviewTitles": [
					"Microsoft 365 Family | Premium Office Apps | Up to 6 users | 3 Months Free, Plus 12-Month Subscription\nMicrosoft 365 Family | Premium Offic…",
					"Microsoft 365 Personal | Premium Office Apps | 1 User, Up to 5 Devices | 3 Months Free, Plus 12-Month Subscription\nMicrosoft 365 Personal | Premium Offic…",
					"Save $30 at checkout | Adobe Acrobat Pro DC subscription with auto-renewal\nSave $30 at checkout | Adobe Acroba…",
					"Save 68% on McAfee Total Protection 3 Device\nSave 68% on McAfee Total Protection 3 D…",
					"Absolutely Amazing Value - Some other features not even listed!",
					"This monitor absolutely does tilt",
					"Probably one of the best purchases I've ever made.",
					"Probably the best monitor I’ve seen till now.",
					"Yup, it's a Keeper",
					"No tilt, but great value",
					"Beautiful",
					"Great quality screen for the money"
				],
				"customerReviewBodies": [
					"This monitor is definitely a good value. Does it have superb color and contrast? No. Does it boast the best refresh rate on the market? No. But if you're tight on money, this thing looks and preforms great for the money. It has a Matte screen which does a great job at eliminating glare. The chassis it's enclosed within is absolutely stunning. It features a VGA and and HDMI port. The screen automatically detects signals and turns on when a source is turned on. When the selected source turns off it quickly scans and switches to any other sources. If no connections are available it goes into standby automatically. The power chord is a good 6 or more feet and easy to wrap with half of it being very thin wire. The ON LED is not distracting or too bright. When it's off it looks like a borderless monitor. And unlike what other people say it does have tilt, just not forward or left to right. It stands up straight or leans back. Unfortunately it doesn't have VESA mount holes, but under 100 you can't be that serious about your monitor setup. Small text has some problems fully rendering when using VGA so I recommend using HDMI. If you use the Windows 10 settings to configure how text is displayed though it fixes this, but not all will know how to do that. It doesn't have speaker, and I am thankful that most monitors don't. This monitor has A LOT of settings for gaming, night use, color adjustments, and general settings and all can be saved into 3 different gaming profiles. You can even change what settings appear in the quick menu. When u press any of the menu buttons, the menu pops up and clearly illustrates all the buttons. This monitors menus are super easy to understand and navigate and that's a rarity in its own. Also worth noting; it can display crosshairs and display the monitors current refresh rate. It also packs FreeSync for AMD graphics card users. If you only have DVI, you can get DVI to HDMI chords as long as your computer's video out supports it. The base and monitor couple together with one screw that features a hand flap so you don't need a screw diver if you don't want to use one. It is decently sturdy and the screen doesn't distort even when pressed on with strong pressure. The base is quite large, but wont be a problem for most. I haven't noticed any screen delay compared to my 300 dollar 1ms response time monitor (and I'm pretty picky). It's contrast is a little flat in some scenarios but appears much more dynamic in games, especially with some tweaking. With that said, I like that it looks flat when working on documents because it makes it much easier to focus.\n\nAll in all, this monitor is filled with a good balance of features and looks like a very solid 1080p 75Hz IPS screen for any monitor under $160, let alone the $80 I paid. If you don't absolutely need a better refresh rate and aren't planning on spending more than 200 dollars then I would say just buy this monitor. It's durable, feature packed, and looks fantastic in all use-case scenarios. I'd give it 1000 stars if I could.",
					"I've seen many other reviews saying this monitor does not tilt, but it in fact does. I'm guessing people didn't take a close enough look at the hinge mechanism in the base, which attaches to the main display and allows for backwards tilt of approximately 15 degrees. The monitor is very light, thin, has small bezels, and produces reasonably good colors. It doesn't have a vesa mount, but I knew that before purchasing it, and wasn't planning to mount it. For $89, it is a great value.",
					"Aside from my computer and PS4, this is probably one of the best things I've ever purchased. I use it every single day without error and everything always looks amazing. I'm a broke college kid and really needed something sufficient for PS4, homework, movies, everything really. I was torn between this and the HP pavilion and I have no regrets from picking this one! The screen is definitely big enough (perfect for having multiple pages open for homework) and is insanely vibrant and good quality for the price. I have absolutely no complaints, and even with a horrible $2 thunderbolt to HDMI cable for my Mac, it still looks absolutely amazing.",
					"I just got this monitor few days ago and setting up literally took a minute. Colors are so vibrant and bright. Darks are good and brights are rich. I work in a IT field and I’ve seen and used a lot of monitors, this is by far the best I’ve used till date. I’ve only used vga and it’s already better than using hdmi in most of the monitors. I can only imagine what it would be after using with an hdmi cable. Its a steal for the price I got.",
					"Read over the reviews at least 10 times weighing the pros and cons but I decided to go for it and I'm glad that I did! Like others stated, it took maybe 5-6 minutes to unpack and get up and running. I wanted a larger screen to use when I work from home as my 10 inch laptop keeps me squinting and bending over. The monitor is SUPER lightweight and very sleek. It comes with the VGA cord but no HDMI cord, luckily I have several laying around the house. I did have to prop it up a bit in the front since there is no tilt option, but that wasn't a deal breaker for me. I use this for basic internet and word processing, no gaming or watching movies and it's been working great for me!",
					"I am somewhat satisfied with my purchase. The price was great, and looks great too. Easy to assemble. Came with vga and power cord. Colors look amazing, no annoying power indicator lights. The options menu is very easy to navigate. I didn't want to do this, but I had to dock a star as it lacked the ability to tilt. It's at a permanent position so I'm gonna have to stack an extra book below to go the position I want. Otherwise, 10/10",
					"This monitor is perfect. It has really good image quality, it has incredible black tones, and super quick response time. The size is the only thing that bothers me, but I would definitely buy another one of these monitors to have two displays. Believe me when I say that it is a really good monitor.",
					"This is a basic, no frills, monitor with a beautiful picture & well deserved reputation for lasting a long time. No built in speaker, get a different model if that is what you want. Not for the novice, as the only usable instruction is \"turn off computer before installing\". There are 5 buttons on the bottom edge of the monitor, but pictograms are useless. But, don't worry; after you make all connections & power up the computer & monitor, the monitor checks connections & automatically picks the correct settings for you. If you have an HDMI connection on your computer (preferably on the back panel), use that instead of the VGA cable to get the best quality picture. (You must supply the cable.)",
					"This monitor really knocked my socks off! I was expecting just another monitor, like my old one. I needed a new one for my wife so I grabbed this. It isn't kidding when they say it is thin. It's very light weight, which doesn't matter to me much. The colour quality is top notch and response is perfect, no blurriness or anything. But what surprised me is that I will sometimes watch videos on it, and when I do, I will move to a livingroom chair I have in the corner to watch it which sits lower. With my old monitor that would make the video much darker and I would have to adjust it so that the monitor was facing almost directly at me to get a good image. With this one, I sat down and the image was just fine without even turning it or angling it down or anything!!! It didn't get darker, very minimal glare on it. The black is nice and black like it should be (with some nice options in the monitor settings to adjust the blackness). It has a ton of settings for the monitor. The refresh rate of 75 is nice. I'm a casual gamer and it is perfect for that, the colours in my game really looked nice. I can't say enough about this, I was FINALLY pleasantly surprised (as opposed to so much I have purchased that didn't work). Well worth the money by far!",
					"relación calidad-precio exacta, pagas por lo que tiene este monitor, lastimosamente es un monitor de 6bits + frc no es de 8 bits verdaderos, esto sirve para gaming por la respuesta tan rápida que tiene pero no para ver colores buenos, en realidad no tiene buenos colores, en general se ven deslavados pero no puedo pedir mas por este precio tan bajo. en cuanto ángulos de visión... tienes que estar directo a el, no puedes verlo de ningún lado porque veras el sangrado de luz de fondo o los colores aun mas deslavados, tiene muy buen brillo, de echo te lastima si lo pones al máximo en la noche, es extremadamente brillante. por default mi tarjeta nvidia lo detecta como un monitor de 75hz, escondiendo los otros modos de 60 hz 50 hz 30hz 25hz 24 hz 23.7 hz. tiene buena nitidez y tiene buenos negros pero repito existe el sangrado de luz de fondo aunque no sea tan severo y repito es bueno para gaming no para colores vivos o ver películas con colores vibrantes y bonitos. Lo que si me molesta de estos paneles es que ni en la pagina oficial mencionan el echo de que es de 6 bits y no 8, lo cual si marca una gran diferencia en rango dinamico y colores, si de por si 8 bits tiene colores pobres, imaginen 6bits: terribles.\nEs mi primer monitor y no tengo mucho dinero entonces vale la pena.\nEso si estoy impresionado con lo delgado que esta el panel pero en si su diseño no es muy bonito que digamos.",
					"",
					"Edit of my original review.\n\nIs this the greatest monitor? Probably not. Do I use it fine? Of course. If you want perfect brightness distribution then go buy another monitor. The two bottom corners have noticeable bright spots that can be a bit distracting when the monitor is displaying darker backgrounds. Overall, I'm giving this monitor 5/5 because it works great. I use it to play games and have no complaints.\n\nI've never had a higher refresh rate than 60Hz but I personally wouldn't spend too much more on any higher because I find games are playable at this refresh rate and FPS it provides. Would I spend more money on a higher resolution and higher refresh rate eventually? Maybe. But for now, this works great.\n\nBuy this monitor if you're not too serious about insane detail.",
					"Compré este monitor por el simple hecho de que era un 1080p 75hz de Acer. Me sorprendió que estas características estuviese a sólo 1,700mxn. No esperaba mucho de él, pero en estos tres meses me dio una gran sorpresa.\n\nEl monitor es increíblemente liviano y delgado. La fuente de poder es externa, lo que ahorra costos y ayuda a su estética general.\nCumple con todo, el full HD, los 75hz, y es IPS ( no he probado el FreeSYNC, no uso AMD)\nPros:\n+Es muy ligero, facilita mucho la limpieza del escritorio y el transporte.\n+Costo/beneficio, es de los mejores que puedes encontrar, superando a monitores 1080p60hz\n+Tiene varios perfiles personalizables y puedes alternar entre ellos fácilmente.\n+Tiene unos 30 grados de inclinación para mejor visualización\n\nCons:\n-La base es de un plástico ligero y barato. Aunque para el peso del monitor, no necesita más.\n-Por default tiene un filtro verde muy molesto. Pero Se arregla en 10 minutos corrigiendo el color.\n-Los botones los tiene en la parte inferior, Cuesta algo de trabajo moverse en el menú a ciegas, y el botón de apagado es igual a todos los demás botones.\n-Tiene unos bordes negros que hacen parecer que no está dando la resolución total, pero te acostumbras fácilmente.\n\nRecomiendo ampliamente este monitor 100%.",
					"",
					"To begin with, the monitor went to me for a very long time due to a delivery company error, but the seller sent me a new one without any problems. I was surprised that it is so thin and light. In size to me just right. the picture is very juicy and does not bother your eyes, after the old monitors it’s quite nice to see a very colorful picture, the same bonus is that there are 75 hertz and this is REALLY felt in games. Of the minuses, I can only say that in the lower left part of the screen, when the black picture appears, the light is visible there, but this is only when you turn on the black background, and everything is in order. So for the overall impression of delivery and to the quality of the goods, I will put 4."
				]
			}
		},
		{
			"id": "ZWmDD3Z",
			"title": "HP 24mh FHD Monitor - Computer Monitor with 23.8-Inch IPS Display (1080p) - Built-In Speakers and VESA Mounting - Height/Tilt Adjustment for Ergonomic Viewing - HDMI and DisplayPort - (1D0J9AA#ABA)",
			"price": "$174.99",
			"image": "https://m.media-amazon.com/images/I/91fAU6mxFsL._AC_SX450_.jpg",
			"description": "The HP 24mh FHD Monitor has all the style and performance you need in a monitor without breaking the bank. Experience more desk space than you thought possible with this height-adjustable ultra-slim HP monitor. The attractive, micro-edge design adds stylish beauty to any environment, be it your desk or living room. Seeing is believing as this Full HD display gives you IPS technology and ultra-wide viewing angles that combine to give you an amazing view at up to 178°. Conveniently connect your pc and consoles with HDMI and DisplayPort ports, while VESA mounting gives you the freedom to put your IPS monitor wherever it looks best. Built-in 2W speakers complete the 1080p monitor and enhance your entertainment.",
			"reviews": {
				"customerProfileNames": [
					"Lindguini",
					"Jen",
					"TravisL.Holliday",
					"Doug",
					"FelixJ.",
					"Geraldmcginley",
					"Mezzy",
					"Customer"
				],
				"customerProfilePictures": [
					"https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif",
					"https://images-na.ssl-images-amazon.com/images/S/amazon-avatars-global/0d6d1327-1265-4be9-a8b3-9f52a5eac08b._CR0,0,460,460_SX48_.jpg",
					"https://images-na.ssl-images-amazon.com/images/S/amazon-avatars-global/17a0eaaa-1743-46b0-bc3c-3c57997eb6b9._CR0,0,456,456_SX48_.jpg"
				],
				"customerRatings": [
					"5.0 out of 5 stars",
					"5.0 out of 5 stars",
					"5.0 out of 5 stars",
					"5.0 out of 5 stars",
					"5.0 out of 5 stars",
					"4.0 out of 5 stars",
					"5.0 out of 5 stars",
					"5.0 out of 5 stars"
				],
				"customerReviewTitles": [
					"Microsoft 365 Family | Premium Office Apps | Up to 6 users | 3 Months Free, Plus 12-Month Subscription\nMicrosoft 365 Family | Premium Offic…",
					"Microsoft 365 Personal | Premium Office Apps | 1 User, Up to 5 Devices | 3 Months Free, Plus 12-Month Subscription\nMicrosoft 365 Personal | Premium Offic…",
					"Save $30 at checkout | Adobe Acrobat Pro DC subscription with auto-renewal\nSave $30 at checkout | Adobe Acroba…",
					"Save 68% on McAfee Total Protection 3 Device\nSave 68% on McAfee Total Protection 3 D…",
					"Great monitor + 75Hz + HOW TO FIX LOW VOLUME SOUND",
					"Great monitor for the price!",
					"VALUE IS UNBEATABLE",
					"Great value!!",
					"Issues now",
					"MONITOR REALLY DOESNT HAVE SPEAKERS",
					"Great Monitor and Excellent Value",
					"Outstanding product and service"
				],
				"customerReviewBodies": [
					"Manufacturer Refurbished to like new. 90 days warranty. Included in the box: HP 24MH monitor, Power adapter/cable and HDMI cable.",
					"This HP 24mh monitor has a clear, crisp display and is the perfect size for desktop use (not too big, not too small). It accepts both HDMI and DisplayPort inputs (and even VGA for old school PCs). While Windows will select 60Hz refresh rate by default, you can go into Windows' display settings and select 75Hz refresh rate for this monitor. The 75Hz refresh rate really does help smooth out motion. You should also go into the monitor's \"Image\" menu setting and set Response Time to Level 3 which provides the best VSYNC performance. One of the best features that places this monitor above and beyond its price range is the 90-degree rotating screen, height adjustment, and swiveling base. The stand is rock-solid without any wobble. The speakers are just fine once you discover the menu control I explain below:\n\nHOW TO FIX LOW VOLUME SOUND: The built-in speakers are better than some reviewers indicate. I believe most people don't discover that the monitor menu has its own volume control that's set to 50% volume by factory default. If you just connect this monitor to the PC you'll automatically get sound through the HP speakers via HDMI or DisplayPort (you only have to use the separate audio cable when using the VGA input). But no matter how high you turn up your PC volume control, you'll only get 50% volume from the monitor's speakers which is why people complain about low volume. To fix this, all you need to do is go to the \"Management\" tab of the monitor menu, select \"Audio\", and then turn up the volume control from 50 (default) to 100 and you'll find the monitor speakers are plenty loud. After that, you'll only have to use your PC volume control as normal.\n\nThis is a great quality monitor with features beyond its price range. Fantastic value, HP!\n\nADDITIONAL NOTE: HP sells an identical monitor to the HP 24mh under the model P24h. The only difference is that the P24h has a black plastic logo strip along the bottom instead of silver like the 24mh. Everything else is identical (specs, speakers, height adjustable stand, etc.) plus the P24h comes with both an HDMI cable and a DisplayPort cable.",
					"Great budget Full HD monitor with DisplayPort, HDMI and VGA ports. Can rotate (clockwise) to portrait mode, height adjustable and can tilt. Loved that it doesn’t have a power brick. 110-220 volt.\n\n04-Oct-2020 Update: Bought another one and just installed today to an older PC that have DVI (via DVI-HDMI adapter) and used the audio cable provided (PC audio out to monitor audio in). By default, the analog audio is not enabled so you have to go into the monitor's menu, navigate to Management->Audio and check the box next to the Analog audio for the speakers to work.",
					"after six months of working in quarantine on a laptop, I had to break down and buy a monitor. I have an HP EliteBook and this monitor seemed similar to what we use at the office, so I ordered it. I can’t tell you how EASY it was to set up right out of the box. It has built in speakers and the HDMI cord plugs right into my laptop. Now I can use the monitor as my main screen and the laptop as my secondary screen, if needed. But honestly this monitor is so big I don’t even know what to do with all the screen space I have now. At this price, I’m going to gift one to my direct report so she can benefit from having a larger screen. Do yourself a favor and buy this monitor for your home. You will be so glad you did.",
					"Absolutely nothing wrong with these monitors they are great especially for a office environment like I needed. Highly recommend. I bought three of them as you can see by the picture. There's nothing like having three monitors.",
					"I bought this monitor back in September and it’s been great but now I have a horizontal line going down the screen.",
					"I DISLIKED THE FACT THAT THE MONITOR WAS ADVERTISED TO HAVE BUILT IN SPEAKERS. THERE ARE NO SPEAKERS! I LIKE THAT THE DISPLAY IS REALLY CRISP AND BRIGHT.",
					"Bought this monitor for my son. He docks it with his laptop, and has also connected his Switch and Mini NES to it via HDMI. The picture is great, and the sound is surprisingly good for a monitor. The monitor easily adjusts vertically, and the tilt also works well so you can get it into the ideal position. The controls are easy to use and you can tell it is well built, it is not flimsy like other monitors in this price range. Definitely recommend it.",
					"I",
					"This monitor has very good build quality, you can move it and position it anyway you like. It's really flexible!!\nThe picture quality is very sharp and in my opinion it's excellent for the price , the different viewing options that HP includes are good and I always use the low blue light mode when it's dark in my room.\n\nEven doe it's not advertised :\nTHIS MONITOR HAS A 75HZ REFRESH RATE (you can enable it on your graphics card options)\n\nTo wrap it all up I was looking for a monitor for online school, programming and casual web browsing / watching netflix, and I'm super satisified with the product.",
					"T",
					"Attractive, height adjustment appreciated, display quality average at best. Buy this for the stand adjustment, but the screen itself was kinda meh. First monitor I've ever set up where I felt I immediately had to tweak its settings. Don't get me wrong, it's not terrible. But I've seen better monitors. I kept it though so how bad can it really be.",
					"Easy to assemble. Image quality is *chef's kiss* formidable. Flexible with the tilting and height adjustment. Even the sound quality is fantastic. I would buy a second one as Monitor #2 but my desk is too small. I highly recommend this monitor for everyday use (I use it for online schooling).",
					"Exactly my husband bought this for himself, I told him which one to buy. It works great he wanted to give me, that one and I laughed no I have the best already I've had mine for the long time. I only like Samsung or Benq. He likes it so that's all that matters."
				]
			}
		},
		{
			"id": "5yADb8Q",
			"title": "Sceptre 27-Inch FHD LED Gaming Monitor 75Hz 2X HDMI VGA Build-in Speakers, Ultra Slim Metal Black",
			"price": "$130.08",
			"image": "https://m.media-amazon.com/images/I/61FYOyYCg1S._AC_SX450_.jpg",
			"description": "The product is multiple voltage compatible, that voltage arrange is 100-240V",
			"reviews": {
				"customerProfileNames": [
					"JuStMrS1MPS0N",
					"Ammishaddai",
					"TedJoy",
					"Paul",
					"RenzoCon"
				],
				"customerProfilePictures": [
					"https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif",
					"https://images-na.ssl-images-amazon.com/images/S/amazon-avatars-global/debfdf1a-1dea-4f2f-bb45-7df5b2b7d563._CR75,0,250,250_SX48_.jpg",
					"https://images-na.ssl-images-amazon.com/images/S/amazon-avatars-global/24094d46-9a96-4eb5-af56-27a9b6d5d252._CR0,0,500,500_SX48_.jpg"
				],
				"customerRatings": [
					"5.0 out of 5 stars",
					"5.0 out of 5 stars",
					"5.0 out of 5 stars",
					"4.0 out of 5 stars",
					"5.0 out of 5 stars"
				],
				"customerReviewTitles": [
					"Microsoft 365 Family | Premium Office Apps | Up to 6 users | 3 Months Free, Plus 12-Month Subscription\nMicrosoft 365 Family | Premium Office Apps | Up…",
					"Microsoft 365 Personal | Premium Office Apps | 1 User, Up to 5 Devices | 3 Months Free, Plus 12-Month Subscription\nMicrosoft 365 Personal | Premium Office…",
					"Save $30 at checkout | Adobe Acrobat Pro DC subscription with auto-renewal\nSave $30 at checkout | Adobe Acrobat Pro DC…",
					"Save 68% on McAfee Total Protection 3 Device\nSave 68% on McAfee Total Protection 3 Devi…",
					"I think it's a steal of a deal.",
					"BUY THIS, DONT DOUBT IT!",
					"Worked right out of the box.",
					"Very nice for a budget 1080p 27in screen",
					"May 2020 Review - You get what you pay for"
				],
				"customerReviewBodies": [
					"For just over a hundred bucks these are the best monitors I've used. You get a nice bit of gear here for not a lot of money.\n\nPros;\n\n+Cost is lower than low\n+Build of monitor itself is great (I'll mention the stand in the cons below)\n+has AMD Freesync\n+75Hz is not bad for people that don't need to go nuts with gaming. I play casually and don't want to spend a lot for a feature I don't need.\n+Has vesa mounts built in to the monitor, Very convenient (especially at this price)\n+Fast shipping, with NO dead pixels(I bought 2 for myself, and a third for a friend, and had no damage whatsoever). People writing bad reviews must've gotten unlucky I suppose.\n+Bezels are surprisingly very discrete.\n+27 inches of screen are the sweet spot for me, any bigger and you're turning your head to look. Any smaller and you run out of space to work with.\n\nCons;\n\n-The stand is awful, wobbly as heck, but if you have a sturdy desk, or plan to mount them it's not even an issue.\n-5ms response is a bit lackluster with all the rest of the features it has, but for the price I Still can't complain.\n-Not really sure why they have a vga input instead of a Dvi input... I haven't used vga in over a decade. But glad they included two Hdmi's to make up for it.\n-screen bleeds quite a bit when black, but I personally don't care but it's a con to most so I'm including it.\n-Don't use the built in speakers unless you have too, they are exactly how bad you'd expect. I tested them just for kicks. No bueno.\n\nOverall this is is worth the money, chances are if you're looking at budget monitors, you don't truly need anything more. This will work for everyday use. From basic photo editing, gaming, and watching movies, to just having a bigger screen for all your tasks. Either way. I like it. Hope this helps!",
					"I was skeptical at first because of the really good price this monitor has. But decided to buy it anyways, it's super huge, super clean, the audio is pretty good for the price, thin bezel makes it really good for watching films and heavy gaming, I also use it A LOT for programming. The large size of 27 is very good for any school work related stuff, especially if you have to split your screen etc. I would definitely recommend guys!",
					"I'm a writer and editor and so I spend more hours each day in front of my monitors than any normal human being should.\n\nIn the course of my work I usually have two monitors going away full blast, one usually to do the writing on, the other to keep notes or outlines or that sort of thing on. It's for the second thing that I'm using this new Sceptre monitor.\n\nThe colors and text so far have stayed crisp and clear and the monitor puts out a fair amount of bright light so I don't have to keep squinting at it or fiddling with it.\n\nI don't know how it would work for gaming or for high-powered video work but for what I do, it's very good. Also, the fact that it was very low-priced was pretty nice.\n\nSo, if you're planning on using this for just general PC type stuff (including browsing) I'd recommend it wholeheartedly.",
					"Pros: Huge! Matte screen lots of inputs. Slim bezel, Mine came with a DVI to HDMI cable, no HDMI\n\nCons: Buttons on the back. Power adapter is a wall-wart. Stand a bit wobbly\n\nMy biggest issue with this monitor is the buttons being located on the back. If using multiple of these ( I have 2 side-by-side in landscape) the buttons are a pain in the ass to use. I use one as dual purpose for a PC and RPI. To switch inputs is an exercise in contortion if you use the left monitor as I do. I would have preferred them on the bottom edge but I have the feeling this was done so these screen could mounted in portrait with multiple monitors. If the buttons had be arrange horizontally instead of vertical this would be less of an issue.\n\nThe power brick that comes with these monitors is the wall-wart kind where the plugs are on the brick. I would have liked to see a brick with a short pig tail like a laptop brick so less outlet space is taken up. the cable is plenty long enough however.\n\nThe stand was super easy to attach and in the future I expect it to be just as easy to remove should I need to. However it is a bit wobbly at the point where the stand attaches to the monitor. Though I attribute that to it being such a large monitor and there will be some flex no matter what. It is by no means excessive. Some day I may buy monitor arm so it's great that there is a vesa mount option.\n\nI so far I love these monitors. The brushed look and matte screen make them look very clean. For anyone concerned they would look very smart in a business setting. These are the first screens I've bought brand new for personal use and I have no complaints. I use my PC for coding, 3D CAD, Wed surfing, movies/Youtube and some light gaming and everything looks great. They are supper bright. I may attempt to do a color calibrating but Overall I'm happy with the current setting. I did change to the Movie setting with bluelight shift 30%",
					"Literally. You get what you pay for. This is a 27\" screen with relatively thin bezels, good screen quality, and absolutely easy to set up.\n\nIts a hundred dollars people, don't go ordering and expect to receive some top of the line LG/Samsung smart monitor quality type of build. Know what you're buying. It's a hundred dollar monitor. Sure, the stand/base is made of very thin plastic and does not seem uber durable, but if you're a normal person who keeps it on a stable desk (even better, wall-mount it) and doesn't have much trouble toppling the whole desk over, not much of a problem. Audio is definitely low tier for sure, but I use headphones/soundbar so it doesnt bother me. Buttons on the back are not so easy to navigate but give it a week, you won't even notice it. Right most for power, second right most of source change, and left most for settings. Figured it out in 30 mins and have had no issues with it since.\n\nEasy quick plug in and play. Comes with an HDMI cable and product manual. No dead pixels, no scratches, no issues.\n\nAgain, for a ONE HUNDRED dollar monitor, not much to complain about. Cheers to Spectre. Great deal right here."
				]
			}
		},
		{
			"id": "gRe8VZc",
			"title": "ASUS 31.5” 4K HDR Monitor (VP32UQ) - UHD (3840 x 2160), IPS, 100% sRGB, HDR10, Speakers, Adaptive-Sync/FreeSync, Low Blue Light, Eye Care, VESA Mountable, Frameless, DisplayPort, HDMI, Tilt",
			"price": "$354.99",
			"image": "https://m.media-amazon.com/images/I/71tBpOvi89S._AC_SY450_.jpg",
			"description": "The product is multiple voltage compatible, that voltage arrange is 100-240V",
			"reviews": {
				"customerProfileNames": [
					"BobW",
					"IkaMusume",
					"ABM",
					"JuanDominguez",
					"YancyFurbeyre",
					"Customer",
					"mmart1014",
					"GaryOliver"
				],
				"customerProfilePictures": [
					"https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif"
				],
				"customerRatings": [
					"5.0 out of 5 stars",
					"3.0 out of 5 stars",
					"5.0 out of 5 stars",
					"5.0 out of 5 stars",
					"5.0 out of 5 stars",
					"5.0 out of 5 stars",
					"5.0 out of 5 stars",
					"5.0 out of 5 stars"
				],
				"customerReviewTitles": [
					"Microsoft 365 Family | Premium Office Apps | Up to 6 users | 3 Months Free, Plus 12-Month Subscription\nMicrosoft 365 Family | Premium Offic…",
					"Microsoft 365 Personal | Premium Office Apps | 1 User, Up to 5 Devices | 3 Months Free, Plus 12-Month Subscription\nMicrosoft 365 Personal | Premium Offic…",
					"Save $30 at checkout | Adobe Acrobat Pro DC subscription with auto-renewal\nSave $30 at checkout | Adobe Acroba…",
					"Save 68% on McAfee Total Protection 3 Device\nSave 68% on McAfee Total Protection 3 D…",
					"Excellent performance",
					"Bad color out of the box, backlight bleed. No dead pixels.",
					"Excellent Monitor with Crystal Clear Picture",
					"Excelente...",
					"",
					"Second monitor",
					"Nice 32\" 4K IPS monitor",
					"Best Monitor I've Ever Owned!",
					"Monster Monitor"
				],
				"customerReviewBodies": [
					"One of the big problems with product reviews is that people who are having trouble with a product tend to be far more likely to submit a review than happy customers. I bought two of this model for my new PC. I have a hefty Nvidia graphics card. I am replacing two Dell 32\" displays.\n\nThe Asus units run much cooler than my old Dells. I had orginally planned on buying 2 new 32\" Dell displays. Their 4K model costs $300 more than the Asus. Setup was really easy. I suggest avoiding any settings on the monitor itself. A small joystick in the back controls all functionality. If this monitor is being connected to a PC, do NOT set the resolution to 4K. That's for video. Select one of the PC resolutions in your display control panel. Chances are good that the computer already picked the optimum setting.\n\nBe sure to reboot the PC after installing the monitor. Any weird looking stuff will most likely disappear. I'm using a preview version of Windows 11. It did a very good job setting the display up. I changed the default text size from 150% to 175%. Other than that, my video card and the PC took care of the rest.\n\nImages are razor sharp. I have one monitor connected to the display port and the other to HDMI on my video card. The result is perfection! Colors are perfect and match between the monitors. I use the digital sRGB video, so no tuning is possible. None is needed.\n\nIf you are a gamer, you can set up the advanced sync on each monitor. I don't play games, so everything, including streaming video, is perfect. I love this product!",
					"N",
					"I'm not a gamer but use my monitors mainly for Office Products, Email, Internet, YouTube and things like that.\n\nI purchase 2 of these in a dual setup and they have been excellent in both picture quality and reliability.\n\nMy favorite resolution is at 2560 x 1440 @ 175% (old guy) but they do look very good. I prefer IPS screens for their picture quality, clarity and brightness and these don't disappoint. I normally go for the Asus ProArt Monitors but wanted to give these a try and so far I couldn't be happier.\n\nABM",
					"Este monitor es sencillamente excelente para video juegos, lo he probado con juegos de pc, xbox one y Nintendo switch y puedo decirles que es increible lo bien que se ven en este monitor, es como si el monitor les diera un toque grafico extra, lo recomiendo 100 por 100.",
					"",
					"T",
					"This is a nice big bright sharp 32\" 4K IPS monitor at a great price. Inputs, speakers, display, everything works as it should. I've been using it for a month for office, browser and coding and have no complaints.",
					"Amazing picture quality, especially for the price! 10/10 would absolutely recommend!",
					"It's the best computer monitor I've ever owned. I hooked it up to my New Mac-Mini and returned the best picture I've ever seen on any monitor Apple has ever made.",
					"The first one came broken (The box it was delivered in was way too big), I've left the image in for reference. My second image is it working with LTT playing on YouTube.\n\nI wanted this monitor specifically because I'm in front of a large window and needed the brightness. It is really difficult to find monitors in the 300+ nits for this price point (and 4K). They're all either 200-250 or you're paying $1000 to get to 700+. This monitor lands somewhere between 300-350 and in front of a window looks fine.\n\nThis is also an IPS monitor, so the viewing angles are great. Again, really hard to find IPS monitors for this size, price, brightness, etc. Overall I'm very happy with it, but only have been using it for a day. Will continue updating this review, but right now, after the 1000 monitors I've researched this is the best value for the features.\n\nThe only nit pick I have with this monitor is that the port switching is a little annoying and doesn't always pick up an HDMI signal. I'm not sure if it is my Mac, my USB/HDMI hub or the monitor. But it isn't a huge issue.",
					"Me parece un buen monitor, yo lo uso para el trabajo. Sin embargo siento que para llegar con ese precio se saltaron algunas cosas.\n\nTengo un problema al seleccionar la señal de entrada, para cambiar entre HDMI y DP tengo que tener un dispositivo conectado en el puerto que esta actualmente seleccionado. Si apago el monitor lo desconecto y luego lo prendo e intento cambiar el método de entrada no me deja, es un poco frustante.\n\nSi ignoro esto me parece buen monitor.",
					"",
					"Trabajo mucho con la suite de adobe y necesitaba más resolución por aquello de los espacios de trabajo. El monitor es grande y la resolución es buena al 125% de escalado, pero siento que los modos de pantalla no son muy buenos y los colores un poco oscuros.\nSi eres un profesional y requieres un monitor para diseño, foto o video te recomiendo mejor los ProArt de Asus, son mucho mejores.",
					"",
					"THE TOTAL LACK OF SETTING IS STILL SLOWING ME DOWN.",
					"Muy recomendable y llego antes de lo esperado.",
					""
				]
			}
		},
		{
			"id": "2MrTw8T",
			"title": "HP V223ve FHD Monitor, 1080p VA Display,75Hz Refresh Rate, 21.5-inch Computer Screen,TÜV certified Low Blue Light Mode, Ergonomic Tilt,3000:1 Contrast Ratio,HDMI & VGA Ports,VESA Mounting (2021),Black",
			"price": "$124.90",
			"image": "https://m.media-amazon.com/images/I/61+R6lkowKL._AC_SX466_.jpg",
			"description": "Browse the web, stream your shows, and get work done on the everyday HP V223ve FHD Monitor. This HP computer monitor’s 21.5-inch Full HD screen boasts unparalleled visuals every time you turn it on (1). What’s more is that the 1080p monitor features a 75Hz refresh rate for smoother images, plus a superb contrast ratio for better color differentiation (2). No matter where you view your HP monitor, the VA panel ensures image clarity is maintained across ultra-wide 178-degree horizontal and vertical viewing angles. Easily connect a laptop, an external storage drive, or an additional monitor with the HDMI and VGA ports. Get the most out of a PC monitor designed for both comfort and efficiency. The TÜV certified Low Blue Light Mode limits the strain put on your eyes, while the tilt-adjustable display ensures comfortable posture all day. Beyond this HDMI monitor’s comfort settings, the narrow bezel design keeps things stylish and productive, letting you see more of your favorite show or word document. Customize your display with ease thanks to the intuitive HP Display Center software; through the host PC, you can personalize every little detail from display settings, screen partitioning, and even dimming the screen. Further customize the way you use this monitor with standard 100 x 100 millimeters VESA mounting options (3). This 75Hz monitor’s energy-efficient design isn't just for you but the environment too, as your device reduces power consumption and energy costs. Plus, the materials used in the packaging are 100% sustainably sourced and recyclable (4). Rest easy as your monitor is covered by an HP 1-year limited hardware warranty. (1) Full high-definition (FHD) content is required to view FHD images. (2) During video playback only, depending on series of frames or time duration. (3) Bracket not included. (4) 100% outer box/corrugate cushion packaging made from sustainably sourced certified and recycled fibers. Fiber cushions are made from 100% recycled wood fiber and organic material. Excludes plastic bags and plastic foam sheeting. 06/04/2021_r1 tg.",
			"reviews": {
				"customerProfileNames": [
					"ArielSurprises",
					"ladeybugg",
					"KiraWilliams",
					"RafaelRodriguez",
					"Dani",
					"GregLaurich",
					"KamLabyrinth",
					"Zadok"
				],
				"customerProfilePictures": [
					"https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif"
				],
				"customerRatings": [
					"5.0 out of 5 stars",
					"5.0 out of 5 stars",
					"5.0 out of 5 stars",
					"5.0 out of 5 stars",
					"5.0 out of 5 stars",
					"5.0 out of 5 stars",
					"5.0 out of 5 stars",
					"5.0 out of 5 stars"
				],
				"customerReviewTitles": [
					"Microsoft 365 Family | Premium Office Apps | Up to 6 users | 3 Months Free, Plus 12-Month Subscription\nMicrosoft 365 Family | Premium Offic…",
					"Microsoft 365 Personal | Premium Office Apps | 1 User, Up to 5 Devices | 3 Months Free, Plus 12-Month Subscription\nMicrosoft 365 Personal | Premium Offic…",
					"Save $30 at checkout | Adobe Acrobat Pro DC subscription with auto-renewal\nSave $30 at checkout | Adobe Acroba…",
					"Save 68% on McAfee Total Protection 3 Device\nSave 68% on McAfee Total Protection 3 D…",
					"Crisp Color and Image Quality",
					"Excellent quality monitor!",
					"Great value for what you pay for",
					"Great for Home Office",
					"Needs CPU",
					"My wife loves it",
					"Affordable, and Suited my needs.",
					"Great Work Monitor"
				],
				"customerReviewBodies": [
					"Manufacturer Refurbished to like new. 90-day warranty. No video cable included",
					"This is the 2nd monitor that my daughter's added to her PC setup. She's so frustrated b/c no matter what she does she can't get the colors to match on both screens - she was very specific & clear that it's not a flaw with the monitor (the other monitor is not equal in quality, 2+ years old). She likes this monitor quite a bit. In fact, I think she's planning on buying a 2nd monitor so they will match & cuz she loves it!",
					"Great monitor. Bought this to use for a second screen while teleworking. I love it! May get a second one, made me realize how lousy my laptop screen is. 😁",
					"These are great so far for playing games! I did have to buy a HDMI to Display Port cable but for games like Monster Hunter Rise and Dyinglight 2 the graphics have been great so far!",
					"I have a work issued 14\" laptop. This monitor plugs into the HDMI port and is ready to go. Makes life so much easier.",
					"Idky I thought the whole computer was in the box... like the CPU was in the screen. This is just a monitor like it clearly says it is. Lol\nGreat quality for the price. My son uses for gaming. He loves.",
					"We had to buy a new monitor so my wife could work from her parent's house. She was able to get it up and running with no problem. She really likes it and it makes work so much easier for her to accomplish. It was literally plug and play.",
					"Dunno how these do for videos, or gaming, as I got them for work, but my spreadsheets look fine.",
					"I use this monitor 8 hours a day at work. Very clear and doesn’t seem to fatigue my eyes much. Overall, it just does what you want a monitor to do."
				]
			}
		},
		{
			"id": "D9L6lTd",
			"title": "SAMSUNG T350 Series 27-Inch FHD 1080p Computer Monitor, 75Hz, IPS Panel, HDMI, VGA (D-Sub), 3-Sided Border-Less, FreeSync (LF27T350FHNXZA)",
			"price": "$149.99",
			"image": "https://m.media-amazon.com/images/I/61B8Lq5NXmL._AC_SY450_.jpg",
			"description": "Seamless screen with 3-sided border-less display stretches from edge to edge for immersive viewing and maximum concentration. With refined dark blue gray exterior, the screen brings more sleek and modern look.",
			"reviews": {
				"customerProfileNames": [
					"NathanFlanery",
					"DylanAlexanderCothern",
					"CitationXpilot",
					"Thao",
					"TODIV4",
					"RuthH",
					"Landru"
				],
				"customerProfilePictures": [
					"https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif",
					"https://images-na.ssl-images-amazon.com/images/S/amazon-avatars-global/a41f5d73-ae14-491f-9f4a-1064e59e3179._CR0,0,180,180_SX48_.jpg"
				],
				"customerRatings": [
					"5.0 out of 5 stars",
					"5.0 out of 5 stars",
					"5.0 out of 5 stars",
					"5.0 out of 5 stars",
					"5.0 out of 5 stars",
					"5.0 out of 5 stars",
					"5.0 out of 5 stars"
				],
				"customerReviewTitles": [
					"Microsoft 365 Family | Premium Office Apps | Up to 6 users | 3 Months Free, Plus 12-Month Subscription\nMicrosoft 365 Family | Premium Office Apps | Up…",
					"Microsoft 365 Personal | Premium Office Apps | 1 User, Up to 5 Devices | 3 Months Free, Plus 12-Month Subscription\nMicrosoft 365 Personal | Premium Office…",
					"Save $30 at checkout | Adobe Acrobat Pro DC subscription with auto-renewal\nSave $30 at checkout | Adobe Acrobat Pro DC…",
					"Save 68% on McAfee Total Protection 3 Device\nSave 68% on McAfee Total Protection 3 Devi…",
					"Beautiful Monitors straight out of the box!! No screen adjustments necessary.",
					"Great monitor all around.",
					"Buy this monitor.",
					"great monitor for its price",
					"we like it",
					"Picture is gorgeous, sharp.",
					"Good quality, works perfectly."
				],
				"customerReviewBodies": [
					"I got 2 of these for $140/ea after trying both the \"Sceptre 20\" 1600 x 900 75Hz LED Monitor 2X HDMI VGA Built-in Speakers, sRGB 99% Machine Black (E209W-16003RT Series)\" and the \"HP V20 HD+ Monitor | 19.5-inch Diagonal HD+ Computer Monitor with TN Panel and Blue Light Settings | HP Monitor with Tiltable Screen HDMI and VGA Port | (1H848AA#ABA)\" on sale for $115/ea and $95/ea respectively. The HP's are normally like $120/ea and the worst monitors I have ever seen.\n\nThe HP's were the WORST! I couldn't tell the difference when I Googled something and had already clicked on it and it changed from blue, to a kind of purplish-looking color that Google links change to after you have already been to them. They did not fade in color from right to left, but it was DRASTIC from top to bottom (MUCH more important). I couldn't stand them. Just looking straight-on was ALWAYS miserable.\n\nThe Spectre's were not much better. Very similar screen problems. If the colors, brightness, and tint looked correct at the top, they looked washed-out on the bottom. And if you changed the angle up or down to make the bottom look good, the top was either over-saturated or washed-out. There was NO angle, up or down, you could put either the Spectre's or the HP's at where both the top and bottom looked good! I was starting to think I might have to spend $200+/ea to get monitors that didn't look horrible.\n\nBut then these went on sale and I am familiar with Samsung's reputation for making good quality electronics, especially screens. So I got them. I had to wait almost 3 weeks to get them. But it was worth the wait. These look GREAT from any normal viewing angle and have very nice and even blacks, grays, and all colors. You can adjust the colors, tint, and brightness; but there is no need to. And in my experience, a good screen (TV or monitor) should not need any adjustments. It SHOULD come from the manufacturer with the best settings possible with the exception of perhaps brightness depending on your room. BUT, adjusting the brightness should NOT throw everything else so out of wack that you need to start adjusting your color settings or much of anything else. And with these Samsungs YOU DON'T!!\n\nSet-up was simple. They have very nice, thin bezzles. And look GREAT straight out of the box! No adjustments necessary! Not many features. But they look great, both the screens and aesthetically speaking. That's all I wanted and these Samsung's deliver.",
					"I was a little hesitant by some of the reviews I saw for this monitor when I was originally looking for a new monitor to order online. After receiving this one I can tell you that there's nothing to be worried about. Many reviewers state their monitor stopped working after a week or something for no reason. That hasn't happened to me at all. In fact, this monitor has given me no trouble whatsoever and I've had it for probably about a month now. I got it during a discount, when it was 130 I believe, and for that price it's a great deal. Good size and picture, surprisingly lightweight which was good for the mount I bought for it, and seemingly a great fit for now. Will try to update if any of that changes, but I doubt it will.\n\nPersonally if you're looking for a gaming monitor, like I was, I would recommend this as my perfect 2nd monitor if you're looking to do a dual monitor setup. This one would probably be a bit small for a main monitor and I think if you're looking for a higher quality setup I'd look for something slightly larger than this. That said though, it would do just fine if you're willing to sacrifice some size for budget constraints. It can handle any game you want to put on it perfectly fine.\n\nI will say if you're looking to mount this monitor to anything other than the standing mount it comes with, you'll need to buy more bolts, as it only came with two and many other monitor mounts will require more than that. Luckily I had some spares that fit the size so that wasn't a problem for me.\n\nTL;DR: Overall, I highly recommend this monitor for anyone looking for a good balance between features and price for a gaming monitor.",
					"These monitors are amazing. I just stacked three 27’s for Flight Sim 2020 and it is absolutely insane beautiful! For the price these can’t be beat!",
					"For watching video and play games are great for the price, editing is good too unless you have to do lots of shading and wide range of shade within a color ( light pink, super light pink, pastel pink.... ) those are hard to catch on this monitor, i had to do some photoshop for a webtoon and this character cloth is white but has many shade due to lighting affect, took me a while to realized i was using the wrong shade. ( the color code was just a shy number away from the actual color ) you can’t really tell unless u zoom in. but in all this was best deal for its prices.",
					"easy to set up - great picture - lightweight but quite stable",
					"I'm a sound editor and use this monitor as my main monitor. Picture is gorgeous, sharp. And the monitor weighs practically nothing so I can carry it from room to room, which is very convenient in these COVID times while working from home. Good price for a monitor. I'm not a gamer so I don't know how the response time is.",
					"Our family room is just off from the kitchen, but the TV is angled where we cannot see it from the kitchen, so I rigged a HD wireless transmitter and connected it to the receiver to this TV in the kitchen. With the sound bar in the family room loud enough where we just keep the kitchen TV on mute. Make cooking much more entertaining!",
					"The package seems to be opened before, looks like a returned item. It also has multiple dead pixels... Don't even know if I can return it...",
					"Do not buy this just because it's cheap. That's what I did and then had to return it. it's small, permanently tilted slightly downwards (you cannot adjust the stand) and the screen quality is crap. Next to my other (middle of the line but decent monitor) I could easily tell that the colour saturation was way off and the picture quality was fuzzy. I adjusted setting after setting even, but the monitor is just plain bad. I'd spend the extra hundred bucks and get a decent monitor or even a used one from someone in your area if you're on a tight budget. This monitor is for the birds.",
					"I bought 2 of those screens. One present 2 areas of dead pixels (no standard solution to fix them has worked).\nOverall good compromise quality/prrice (about 228$ each including taxes). I mounted them of a 2 arm stands, and the installation is satisfying (good access to ports). Very happy with the eye saving mode.",
					"I bought this monitor to use as a second screen because of online school and working on just the laptop screen was not enough. Fits great for my desk size. I use it as my main screen because it fits everything and spitview works good with this size. The stand that it comes with was too bulky and eating up all my desk space. Plus it doesn’t let you tilt the screen and angle was permanently tilted upwards a little bit. I bought a wall mount to fix this issue and it works/works great. the colours are a little weird when watching Netflix or prime. And I do wish there was a USB port. But other than that I think this is a great monitor for its price!! Highly recommended",
					"This is not a genuine Samsung Product. This ships in a box that says \"LED Monitor\" but this box seems tampered with. Upon further checking, the screen itself seems somewhat loosely fit on to the monitor base. When I press the screen, I could see the liquid crystal layer and this just did it for me. Just filed a return.\n\nNOTE: This is an LCD screen which is super overpriced for the price."
				]
			}
		},
		{
			"id": "AX4zMBx",
			"title": "SAMSUNG S33A Series 24-Inch FHD 1080p Computer Monitor, HDMI, VA Panel, Wideview Screen, Eye Saver Mode, Game Mode (LS24A336NHNXZA), Black",
			"price": "$169.99",
			"image": "https://m.media-amazon.com/images/I/71HzQ-dvztL._AC_SX450_.jpg",
			"description": "The Samsung S33A FHD monitor has a wide viewing angle and 3000:1 contrast ratio that gives you a clear, vivid display the whole way around. With Eye Saver, Flicker Free Technology and Game Mode, you can work and play with less strain and more efficiency. HDMI and D-Sub ports make connectivity easier. Wide 178° viewing angle keeps documents and graphics consistently accurate. Game Mode optimizes screen contrast to give player a competitive edge.",
			"reviews": {
				"customerProfileNames": [
					"JosephHocking",
					"MichaelL",
					"MonicaU",
					"DaleAvery",
					"RachaelPfeiffer",
					"fuel98rider",
					"MattS.",
					"Customer"
				],
				"customerProfilePictures": [
					"https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif"
				],
				"customerRatings": [
					"4.0 out of 5 stars",
					"5.0 out of 5 stars",
					"5.0 out of 5 stars",
					"5.0 out of 5 stars",
					"4.0 out of 5 stars",
					"4.0 out of 5 stars",
					"2.0 out of 5 stars",
					"2.0 out of 5 stars"
				],
				"customerReviewTitles": [
					"Microsoft 365 Family | Premium Office Apps | Up to 6 users | 3 Months Free, Plus 12-Month Subscription\nMicrosoft 365 Family | Premium Office Apps | Up…",
					"Microsoft 365 Personal | Premium Office Apps | 1 User, Up to 5 Devices | 3 Months Free, Plus 12-Month Subscription\nMicrosoft 365 Personal | Premium Office…",
					"Save $30 at checkout | Adobe Acrobat Pro DC subscription with auto-renewal\nSave $30 at checkout | Adobe Acrobat Pro DC…",
					"Save 68% on McAfee Total Protection 3 Device\nSave 68% on McAfee Total Protection 3 Devi…",
					"Perfectly functional but beware the product images",
					"Affordable and excellent quality picture",
					"This is a great product",
					"So far they are doing just what i hoped they would.",
					"Good for the price.",
					"Good for using with a laptop",
					"HDMI port is the only port that works on both monitors I bought",
					"Keep looking"
				],
				"customerReviewBodies": [
					"T",
					"Sets up in minutes right out of the box. Comes with HDMI Cable. Great Picture quality",
					"Makes my life easier with this being a second monitor",
					"works fine and price was reasonable.",
					"This monitor is perfect for my WFH split. It's less than $200, what do you other reviewers expect? Slim and sleek, looks great on my desk. Easy to set up (less than 1 minute to be honest). The base isn't that supportive of the monitor, if my desk shakes a little so does the monitor. Came with HDMI and power cable so you are ready to go straight from the box. Pleased with this purchase.",
					"I bought this for my son to use in his dorm rather than struggling looking at his laptop screen. For that purpose, it is perfect. It is not a high-end monitor for gaming, and for me that was not its purpose. It is a good quality monitor for use in normal computing tasks. I will by another one for my daughter when she leaves next summer for college.",
					"HDMI port is the only port that works. Bought 2 at same time and both have the same issue. Only need one port but having to wait and buy new cords and splitters so I could use all 3 of my monitors was pretty annoying. Sitting there stuck with 3 monitors in front of me but only being able to use 1 is really the only reason I wrote this. Good picture quality though!",
					"Poor picture quality"
				]
			}
		},
		{
			"id": "bkgOkmO",
			"title": "SAMSUNG TU872 Series 32-Inch 4K UHD (3840x2160) Computer Monitor, Thunderbolt 3 Daisy Chain, HDMI, Display Port, Height Adjustable Stand, 3 Yr WRNTY (LF32TU872VNXGO)",
			"price": "$790.03",
			"image": "https://m.media-amazon.com/images/I/916vPDhMBSL._AC_SX450_.jpg",
			"description": "The Samsung F32TU872VN features Thunderbolt 3 for blazingly fast data transfer speeds. Thunderbolt 3 also offers a single-cable solution which carries power and data, as well as an ultra-fast and secure wired Ethernet (LAN) connection, making for a clean, clutter-free workspace. And with 4K/UHD 3840 x 2160 resolution, you get four times the resolution of a standard 1080p monitor. See more lines of code, more spreadsheet columns, more web content, more documents at once. And with support for 1 billion colors, 99.9% sRGB and HDR10, every image and video will be rich, lifelike and full of razor-sharp detail.",
			"reviews": {
				"customerProfileNames": [
					"zoegreg",
					"MBosmarth",
					"MikeBentley",
					"Joel",
					"Customer",
					"Customer",
					"Northumbrian",
					"Holger",
					"CyrilS."
				],
				"customerProfilePictures": [
					"https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif"
				],
				"customerRatings": [
					"5.0 out of 5 stars",
					"1.0 out of 5 stars",
					"3.0 out of 5 stars",
					"5.0 out of 5 stars",
					"5.0 out of 5 stars",
					"4.0 out of 5 stars",
					"5.0 out of 5 stars",
					"5.0 out of 5 stars"
				],
				"customerReviewTitles": [
					"Microsoft 365 Family | Premium Office Apps | Up to 6 users | 3 Months Free, Plus 12-Month Subscription\nMicrosoft 365 Family | Premium Offic…",
					"Microsoft 365 Personal | Premium Office Apps | 1 User, Up to 5 Devices | 3 Months Free, Plus 12-Month Subscription\nMicrosoft 365 Personal | Premium Offic…",
					"Save $30 at checkout | Adobe Acrobat Pro DC subscription with auto-renewal\nSave $30 at checkout | Adobe Acroba…",
					"Save 68% on McAfee Total Protection 3 Device\nSave 68% on McAfee Total Protection 3 D…",
					"Much better than expected.",
					"Be aware of Samsung's customer \"support\"",
					"A medium-quality, entirely adequate Thunderbolt Monitor",
					"Good Purchase",
					"Great Monitor",
					"So far so good, has some quirks",
					"The only monitor I need for work",
					"Category leader"
				],
				"customerReviewBodies": [
					"Brand new in open box",
					"I wasn't expecting a lot from this monitor because of the price, but once I received it and adjusted the settings I am very happy with the picture quality. I have it hooked up to a MacBook Air M1 and it has worked flawlessly. The text is sharp and the colors bright. The Thunderbolt jacks on the back are a huge lifesaver. I would definitely purchase again.",
					"I",
					"I was looking for a 32 inch monitor with support for Thunderbolt 3. As most T3 monitors are very expensive, I decided to give this one a whirl. First, the T3 ports are tight enough to grip the Thunderbolt cable connectors without slipping out. Second, I have a couple other monitors on the work bench here (one being the built-in for a 2019 MacBook Pro 16); in order to get this monitor to be as bright as the other two I finally had to turn Game Mode to Always On, which disables a few of the other slide controls for the monitor. Otherwise the monitor just isn't bright enough for my needs, no matter what the other slide controls were set to. Third, the color quality is reasonable tho just a tetch washed out from the backlighting. Fourth, the T3 daisy-chaining feature works, I have a dual SSD drive with T2 ports at the end of the T3 chain, and the backups happen at night without issues, but about this I have a caveat: when you design a monitor that has Thunderbolt support, you have to consider what else user might hook up to it besides a second monitor, and allow user to turn off the display part without powering the whole Thunderbolt chain down with it. Right? Meanwhile I just set a blank screen saver to start after five minutes, causing the screens to go as black as possible -- but the backlights still glow.\n\nWhat else? I use the VESA mount for the monitor and have set aside the stand that comes with the monitor. The stand works fine, by the way.\n\nI did pick up a color calibrator and used it to adjust the display profile.\n\nWould I buy a second one? Yes, altho I have not yet done so. It is an adequate monitor for developing code (I am not developing color-accurate work product), the only thing that really bugged me is the brightness.\n\nFeatures I did not play with: PiP\nI do play Warcraft with this thing, seems to work fine at 60Hz.\n\nAddendum on 2021-05-24:\nI bought a second one of these as a refurb. Jury still out.\nOne thing I belatedly noticed: the screen becomes much brighter (and the refresh rate jumps from 30Hz to 60Hz) when you uncheck High Dynamic Range under Apple macOS System Preferences>Displays while running Big Sur.",
					"I was hesitant to buy this because of the price. It was in my list for a long time and when I decided to go with it, the price increased a lot, Fortunately I found it offered by another seller at an even better price than before. The picture quality is great and works with my Mac Mini very well. It has features like the ability to rotate the screen to portrait which is a nice touch. I wish it had speakers and a web camera. Mostly because they need to be removed when rotating. By not having them, it does allow me to put more money into features I care about. I like it that I can plug them into the USB ports on the monitor. I have had the monitor for a little over a month now an am very happy with my purchase.",
					"This monitor is really great and all you need .. Screen is huge ... I love that I can easily open multiple things and have additional space below to leave messaging open ... Super cool I love it ... For Picture Quality, I would have given 5 stars but it seems to not be as balanced in the reds ... so when on my MBP the picture seems balanced and on here there is a bit of red ... I think I can calibrate it ... Great investment for matching with MBPRO",
					"This is definitely a good \"for the price\" monitor, I use it for my recording studio and general internet with a top-of-the-line 2017 MacBook Pro. I thought this monitor was an especially good deal because the 2 TB3 ports and 2 USB ports spared me having to spend another $200 on a hub for all of the outboard gear I need to use with the MacBook. Interesting issue I had was a pretty bad hiss/crackle through the headphone port of my MacBook when it was plugged into the \"laptop\" Thunderbolt port on the back on the monitor. Looks like there has been a problem with headphone jacks/power supply interference with MacBooks for 10+ years, so this might not be the monitor's fault. I switched the laptop to the other Thunderbolt port and the noise went away. The MacBook is still charging via the other Thunderbolt port, so not sure what's going on with all that. The SSD I now have plugged into the \"laptop\" Thunderbolt port still works as expected and I don't notice anything odd like extra heat or anything. Fingers crossed I'm not setting myself up for a failure of some sort, I prefer my gear, especially brand new stuff, to be setup to spec, but again, for the price...\n\nUpdate 12/23/20: There’s a headphone jack on the back of the monitor (duh). I ran my audio line out of there and there’s no interference with the MacBook Pro when it’s plugged into the 90w TB3 port on the monitor.",
					"It's the perfect monitor for work. 4K is so much resolution you won't need a second screen.\n\nI bought a second one for my GF - we both love it, months in. This screen is massively underrated.",
					"I did a head to head of the Samsung 32 inch and the HP 27 inch; Samsung was either equal or superior in all technical aspects. The price was the same so the choice was easy. I have found the performance to be excellent and the picture quality close to our Samsung home theater installation. The only quibble was a minor one - only an HDMI to HDMI connector was provided; I needed to get a new connector before I could install the monitor.",
					"El monitor va genial con cualquier computadora con thunderbolt 3. Carga tanto mi Macbook pro de 13\" como mi Macbook pro de 16\". No es el monitor con el refresh rate más rápido pero va bien para el PS5, lo reconoce como 4k 60 Hz con el puerto HDMI. ojo, la página de Samsung dice que trae un \"modo juego\" pero viene deshabilitado, creo que solo es accesible en el Display Port pero no puedo confirmarlo.",
					""
				]
			}
		},
		{
			"id": "tjjHTHw",
			"title": "Sceptre 20\" 1600x900 75Hz Ultra Thin LED Monitor 2x HDMI VGA Built-in Speakers, Machine Black Wide Viewing Angle 170° (Horizontal) / 160° (Vertical)",
			"price": "$80.72",
			"image": "https://m.media-amazon.com/images/I/51v6h2TfPCL._AC_SX450_.jpg",
			"description": "At 20\", The Sceptre E205W-16003R monitor is your best option for both work and play. 1600 x 900 resolution delivers vivid colors and sharp images on a 20 inch screen. A 5 millisecond response time displays action sequences with the highest Degree of clarity. Enjoy HDMI, DVI, and VGA inputs to connect all video and gaming devices. Signal compatibility: digital signal Frequency - 30 – 80 kHz (horizontal)/ 60 – 75 kHz (vertical), HDMI input signal support - 1080/60P, 1080/60i, 720P, 480P, 480i, VGA input signal support - up to 1600 x 900 at the rate of 75Hz. The brightness is 250 CD/M2. Power Range: (V, A, Hz) 100 – 240 VAC, 50/60 Hz, 1.1A (Max.).",
			"reviews": {
				"customerProfileNames": [
					"Stevie",
					"PetrayrisDelAngel",
					"Rosalyn",
					"Kita",
					"UncleJimmy",
					"Mark"
				],
				"customerProfilePictures": [
					"https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif",
					"https://images-na.ssl-images-amazon.com/images/S/amazon-avatars-global/5616c36f-cfb9-4ec1-b9a5-5da3813c1c8c._CR0,41.0,250,250_SX48_.jpg"
				],
				"customerRatings": [
					"5.0 out of 5 stars",
					"5.0 out of 5 stars",
					"4.0 out of 5 stars",
					"5.0 out of 5 stars",
					"5.0 out of 5 stars",
					"5.0 out of 5 stars"
				],
				"customerReviewTitles": [
					"Microsoft 365 Family | Premium Office Apps | Up to 6 users | 3 Months Free, Plus 12-Month Subscription\nMicrosoft 365 Family | Premium Office Apps | Up…",
					"Microsoft 365 Personal | Premium Office Apps | 1 User, Up to 5 Devices | 3 Months Free, Plus 12-Month Subscription\nMicrosoft 365 Personal | Premium Office…",
					"Save $30 at checkout | Adobe Acrobat Pro DC subscription with auto-renewal\nSave $30 at checkout | Adobe Acrobat Pro DC…",
					"Save 68% on McAfee Total Protection 3 Device\nSave 68% on McAfee Total Protection 3 Devi…",
					"Great Picture, Color and Clarity, Nice Monitor",
					"Exactly what I needed.",
					"Not exactly what it seems but working great... so far",
					"Must Buy This!",
					"The best bang for your buck you'll find anywhere",
					"I'm don't know why I would buy a more expensive monitor-this one is great."
				],
				"customerReviewBodies": [
					"This is a really nice little monitor. I was not expecting much for a low-end monitor at a rock bottom price, but have to admit I am pleasantly surprised. Really, no cons at this price point. Pluses:\n\n1. Very clear, sharp screen for a 1600 x 900 display. Has a better picture than a new 1920 x 1080 HP monitor I have.\n2. Very good standard color saturation - not washed out at all. I did not feel the need to adjust color or brightness settings.\n3. Good font clarity and sharpness.\n4. Has integrated speakers, a nice surprise for such an inexpensive monitor, where many higher-end models don't include speakers. Speakers are not incredibly loud but are very clear and not tinny. The speakers work through the DVI to HDMI cable and there is no need for an extra audio cable.\n5. Comes with a DVI-D to HDMI cable as well as a standard VGA to VGA cable. Monitor has a VGA output and two HDMI outputs, as well as audio outputs if you would rather not use the integrated speakers.\n6. The monitor stand snaps to the base, and the stand screws into the monitor with just two screws. There is a strong hinge built in which allows easy tilting for your viewing preferences. Took a couple minutes to assemble.\n7. Box comes with a screwdriver, so you don't need to have tools of your own.\n8. Nice color-coded ports on the back.\n\nThis is my first Sceptre monitor and based on this, I will be likely to consider this brand again. Very pleased.",
					"The monitor is large which I love and it has very good picture quality. The monitor does not adjust for height ( it does not move up or down ). It does however, tilt up or down which works fine for me. It is very easy to set up and there is no installation needed. The monitor comes with all cables you need. Great value for the money!",
					"T",
					"Easy to set up and use. Product was in perfect condition. The screen is very clear. Now I am ready to start my work from home. Will be ordering another one soon. I use this with my labtop using only an HDMI cord.",
					"I bought this monitor for my new computer, and I can't believe the quality. I have always wanted a dual-monitor set up, but couldn't afford two high-end monitors. I bought a Dell computer, and a 24\" Dell monitor to go with it. This one was for my second monitor, I bought a 20\" to save some desk space. The picture quality is essentially identical to the Dell, I really can't tell a difference in resolution, and the speakers are actually pretty decent. They're located on the back of the monitor, so the sound is a little muffled, but it beats having to buy separate speakers, and mess with all the cords that go along with them. The bezel isn't quite as thin as the Dell, which is to be expected considering the price discount, but it's not bad. I kind of wish I had bought two of these and saved money on the Dell monitor (which, by the way, arrived broken--I had to have Dell ship me a replacement).",
					"A very good value. I just needed a 20\" monitor to replace one that had gone bad on a two-monitor system-I needed to match the size so that was important. I hadn't heard of Sceptre, but the reviews were positive, so I ordered one. It arrived in two days, well packaged and padded. I was impressed that a screwdriver and two different connector cables were included with the purchase. Assembly was easy and intuitive. Plugged it in and connected to my computer and it booted right up. I've used it for one day and have been quite pleased. I imagine if it was side by side with a gaming display I might notice some quality disparities, but for my purposes this works extremely well. It takes up less space on my desk than the previous monitor while maintaining the same display area.",
					"Ya tengo un mes de uso con el monitor y puedo decir que me ha resultado super útil para realizar labores de oficina. Ayuda mucho que tenga dos entradas HDMI ya que así puedo conectar mi pc personal y tener dos pantallas compartidas.\nLo recomiendo mucho.",
					""
				]
			}
		},
		{
			"id": "Kgrev8H",
			"title": "LG 22MP400-B 22” Full HD (1920 x 1080) VA Display with AMD FreeSync and OnScreen Control – Black",
			"price": "$89.99",
			"image": "https://m.media-amazon.com/images/I/91I8pdfn1KS._AC_SY450_.jpg",
			"description": "Expand your desktop. Work, watch and play in Full High Definition. LG’s 22 inch Full HD (1920 x 1080) VA monitor portrays true color, bringing a clear view to your work and lifelike scenes to games, movies, shows and videos.",
			"reviews": {
				"customerProfileNames": [
					"GloriaLynn",
					"JCArcht",
					"TroySato",
					"XiuqiaoLin",
					"Craig",
					"Oshagold",
					"Rody",
					"James"
				],
				"customerProfilePictures": [
					"https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif"
				],
				"customerRatings": [
					"5.0 out of 5 stars",
					"5.0 out of 5 stars",
					"5.0 out of 5 stars",
					"5.0 out of 5 stars",
					"3.0 out of 5 stars",
					"3.0 out of 5 stars",
					"5.0 out of 5 stars",
					"5.0 out of 5 stars"
				],
				"customerReviewTitles": [
					"Microsoft 365 Family | Premium Office Apps | Up to 6 users | 3 Months Free, Plus 12-Month Subscription\nMicrosoft 365 Family | Premium Offic…",
					"Microsoft 365 Personal | Premium Office Apps | 1 User, Up to 5 Devices | 3 Months Free, Plus 12-Month Subscription\nMicrosoft 365 Personal | Premium Offic…",
					"Save $30 at checkout | Adobe Acrobat Pro DC subscription with auto-renewal\nSave $30 at checkout | Adobe Acroba…",
					"Save 68% on McAfee Total Protection 3 Device\nSave 68% on McAfee Total Protection 3 D…",
					"Great additional monitor",
					"Better Than I expected",
					"Great monitor",
					"Good screen",
					"Average Monitor",
					"Power saving good.",
					"Great product",
					"GREAT VIEW"
				],
				"customerReviewBodies": [
					"Item will come in original packaging. Packaging will be damaged.",
					"Working remotely, I needed an additional monitor to hook up to my laptop. The high quality of this monitor makes it very easy to do my work and to have a clear image of what I'm working on.\n\nThis is my 2nd LG monitor; the old Dell monitor work had provided me wasn't doing the trick\n\nNow I have 2 clear, crisp LG monitors.",
					"This LG monitor exceeded my expectations. Color rendition is nice, and the large screen makes doing graphics and CAD a snap. I debated going with a 4K monitor but this monitor has the screen resolution and sharpness I needed. It works.",
					"Bought this for working at home. Very light and screen is very good. Don’t know about gaming as it’s strictly for work.",
					"My son chose the screen for his first self built computer. Good price, the pictures looks clear, it’s worth to buy!",
					"Your average monitor. Nothing to write home about.\n\nAssembled easily, and was up and running in no time.\n\nNot the greatest picture quality or contrast ratio, but its ideal for a POS environment, which is what it was purchased for. Definitely not for photo editing or gaming.",
					"Power saving good.",
					"Great product",
					"Got this as a second monitor at work. Very happy with it. I hooked it up through HDMI. I had to download drivers, after that it worked great. I really like the sharp picture. I recommend this monitor. also It is great price."
				]
			}
		},
		{
			"id": "XDF_lEY",
			"title": "SAMSUNG 23.5” CF396 Curved Computer Monitor, AMD FreeSync for Advanced Gaming, 4ms Response Time, Wide Viewing Angle, Ultra Slim Design, LC24F396FHNXZA, Black",
			"price": "$176.94",
			"image": "https://m.media-amazon.com/images/I/91ubktnbNVL._AC_SX450_.jpg",
			"description": "Enjoy a truly immersive viewing experience with the Samsung CF390 Curved Screen Computer Monitor. The 1800R curvature of the screen lets you enjoy big, bold and stunning panoramic views while you work or play. With its design inspired by the curve of the human eye, this monitor delivers a comfortable and enjoyable viewing experience for your home or office use. Featuring an ultra slim and sleek profile, it measures less than 0.5-inch thick. Samsung’s advanced VA panel technology minimizes light leakage across the entire screen and corners to deliver deeper, more uniform blacks. AMD FreeSync dynamically syncs the screen refresh rate with the frame rate of your content to minimize input latency and dramatically reduce image tearing and stutter during gaming. With its 4ms response time, you'll see the fastest on-screen motion clearly and smoothly with less blur, judder, and ghosting. The fast response time provides a steady visual, allowing gamers to compete at the highest level. Eye Saver Mode optimizes your viewing comfort by reducing blue light emissions and flickers at the touch of a button. The excellent 3000:1 contrast ratio delivers deep blacks and bright whites, so you can see clearly in the darkest or brightest scenes. The brightness is 200cd/m2. The Eco-Saving Plus feature reduces screen brightness to save power.",
			"reviews": {
				"customerProfileNames": [
					"MJ",
					"Manny",
					"OrcusVaruna",
					"Galaveo",
					"MikeAllred",
					"Rivera",
					"JoeyPurrazzo"
				],
				"customerProfilePictures": [
					"https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif",
					"https://images-na.ssl-images-amazon.com/images/S/amazon-avatars-global/2d7748fa-8425-461c-b8fe-022a7a89212b._CR0,0,500,500_SX48_.jpg",
					"https://images-na.ssl-images-amazon.com/images/S/amazon-avatars-global/e391fc64-677a-423b-b189-0605bcf12ec1._CR0,0,500,500_SX48_.jpg",
					"https://images-na.ssl-images-amazon.com/images/S/amazon-avatars-global/ff3c94eb-1fd6-4732-9cf3-b74c061dce13._CR0,33.0,266,266_SX48_.jpg"
				],
				"customerRatings": [
					"5.0 out of 5 stars",
					"4.0 out of 5 stars",
					"5.0 out of 5 stars",
					"5.0 out of 5 stars",
					"5.0 out of 5 stars",
					"1.0 out of 5 stars",
					"5.0 out of 5 stars"
				],
				"customerReviewTitles": [
					"Microsoft 365 Family | Premium Office Apps | Up to 6 users | 3 Months Free, Plus 12-Month Subscription\nMicrosoft 365 Family | Premium Offic…",
					"Microsoft 365 Personal | Premium Office Apps | 1 User, Up to 5 Devices | 3 Months Free, Plus 12-Month Subscription\nMicrosoft 365 Personal | Premium Offic…",
					"Save $30 at checkout | Adobe Acrobat Pro DC subscription with auto-renewal\nSave $30 at checkout | Adobe Acroba…",
					"Save 68% on McAfee Total Protection 3 Device\nSave 68% on McAfee Total Protection 3 D…",
					"Beautiful Images",
					"Update your view settings (provided in review) to make picture quality look better",
					"Great inexpensive curved console gaming monitor.",
					"Good Overall, but had Backlight Bleed",
					"Have 4 of them now...",
					"Audio/Video",
					"best curved monitor for home office"
				],
				"customerReviewBodies": [
					"Item will come in original packaging. Packaging will be damaged.",
					"Bought two of these for my home office. They look amazing. I mounted them as you can see in the photo but it worked great. Looks a little odd in the back as the piece that hooks into the stand isn't something you can remove, but I'm not worried about that at all. If you're looking for a decent table-top mount, I went with the \"VIVO Dual LED LCD Monitor Free-standing Desk Stand (Model STAND-V002F) and that's why you see in the photo.",
					"OVERALL PICTURE QUALITY -> Good. OOTB settings are not optimal but can be adjusted to make the picture look good. (See settings below)\nVIDEO QUALITY -> Very good\nTEXT QUALITY -> Fair -> Average\nBLACK DEPTH -> Average\nWHITE -> Very good\nCOLORS -> Very good\nSIZE -> 23.5\" diagonal screen view\nVESA -> The monitor has a VESA mount compatibility, my suggestion is go for a mount.\n\nPROS:\n-Extremely lightweight\n-Good picture (after settings adjustment) even in bright light\n-Low price & excellent value for money\n-VESA Compliant\n\nCONS:\n-Basic monitor with no add-ons like speakers or USB\n-Don't expect the samsung LED TV quality at this price\n\nOVERALL: I recommend the monitor because you won't find anything better at this price. However I do recommend buying a mount so that you have a better viewing angle and won't hurt your neck.\n\nThe unit I got had been repackaged and missing the screws to the stand which makes it a little unstable. I'm likely going to order 2x27\" instead.\n\nUPDATE TO SETTINGS\nIf you are not liking the picture quality on your Samsung Monitor particularly if your screen is pale looking, you need to adjust the settings. Samsung should have done a better job at providing this OOTB but they haven't.\n\nPlease follow these settings in the order listed\n\n1) Goto MENU -> SYSTEM\nFreeSync: ULTIMATE ENGINE\n\n2) Goto MENU -> PICTURE\nBrightness: 56\nContrast: 94\nSharpness: 36\n(COLOR)\nRed: 50\nGreen: 54\nBlue: 100\nSamsung Magic Upscale: Mode1\nHDMI Black level: Low\nEye Saver Mode: OFF\nGame Mode: OFF\n\nLeave a comment or upvote if it helps please.",
					"A freesync Xbox monitor that uses the same Samsung 75hz va panel found in basically every 75hz curved monitor on the market but at 50-70 less then those options. As for the poor reviews about the bad backlight bleed my guess would be they have brightness up way too high or their console/pc is set incorrectly. For Xbox users you must set the console to PC RGB and use the settings I put in the attached photos, they will get you a more than decent image.",
					"I love this monitor overall. The picture is great and everything on it looks so much better. However when the screen is black, there is significant backlight bleed. I'm not really bothered by this because my old TV did the same thing and I got used it, but some of you may be bothered by it. But other than that, the curve is nice and the quality is amazing. The LED light is sorta bright, so I end up putting some tape over it so I can sleep at night, but its no big deal. The picture quality is so much nicer than my old TV, and it was a 1080p as well.",
					"These are great value, decent curved monitors. We have them mounted in pairs and love the look. When seated in front of them the curve seems to disappear and it's a great surface to work from multiple windows from. These are not high end gaming monitors, but they work well in the office environment and the occasional steam side game...",
					"Video quality is 'alright' at best.\n\nNo built-in speakers, but the monitor has volume controls? ha thanks.",
					"Bought two of these 24 inch curved samsungs and I am in LOVE. Before I say anything else if you are a SERIOUS gamer maybe get something slightly more expensive.. If you are working from home, making music, or want to have a bad ass new set up for once get these.. I know im slightly biased because I'm a galaxy nut, but they are exactly what I was looking for. They are 1080p so the picture quality is perfect and exactly as advertised as far as I'm concerned. If you're a picky gamer pay 3 times as much for slightly better resolution and a higher frame rate and stop crying. Read the description its 60 hz which is all I need. I bought a type c docking station, connected it to my samsung galaxy flex alpha, and if you have two extra monitors make sure that it supports triple display, so double check that unless you only plan on connecting one monitor. Or double check if you use Mac, I know those are weird. One hdmi cord from each monitor into the docking station and you're rolling! No speakers, but I use a jbl flip via aux cord to laptop if im not wearing headphones anyways. Was not planning on mounting them when I originally purchased, but the way the stands are, it makes the monitors look like they're slightly off center when side by side, making a seamless connection between the two nearly impossible. My desk is not able to have a C-clamp mount so I bought a free standing mount and now they line up PERFECTLY. Very happy with the picture. Settings aren't complicated, i.e. my dad could figure out how to make it look good and he can barely send a text. Game mode automatically changes the settings to a great picture but has the brightness all the way up. I love it because next time you go to use your computer it's back to normal.. unless you choose game mode always on. Good luck",
					"Monitor de buenas características, con buena imagen, tanto brillo como nitidez\nEl único inconveniente que le veo es que, una vez armado, es difícil remover la base para poder guardarlo nuevamente en su caja para transportarlo.\nNo cuenta con bocinas pero tiene un jack de 3.5mm\nEl menú es sencillo de usar, en mi caso, el cursor que tiene en la parte posterior, el cual también es el botón de encendido, está un poco rígido al moverlo hacia abajo, sin embargo funciona y ya que es un producto de importación prefiero no devolverlo, para no tener que esperar a que me manden otro\nEl precio varía mucho, pero siendo paciente lo pude comprar en aproximadamente $3,150.00 pesos, y a 18 meses sin intereses",
					"",
					"Hasta el momento, una semana de uso, la pantalla es genial, los colores todo. soy desarrollador de sw siempre estoy frente a la computadora, y si eh notado que mis ojos descanzan mas con este monito.",
					"",
					"Con este monitor he podido ver mis series favoritas mientras trabajo, lo único que me parece muy devastador sobre el diseño, es que necesitas desarmarla completamente y con mucho cuidado para colocarle un soporte de pantallas.",
					"",
					"Muy buen monitor y una calidad de imagen excelente el único detalle es q la base es fija y no se puede ajustar ni siquiera la inclinación",
					"",
					"Es un super monitor. Precio muy accesible y además de buena marca. Muy feliz!!!",
					""
				]
			}
		},
		{
			"id": "zQ62MhE",
			"title": "SAMSUNG SR35 Series 24-Inch FHD 1080p Computer Monitor, 75Hz, IPS Panel, HDMI, VGA (D-Sub), 3-Sided Border-Less, FreeSync (LS24R350FZNXZA)",
			"price": "$129.99",
			"image": "https://m.media-amazon.com/images/I/91l+VjqPr7L._AC_SX450_.jpg",
			"description": "TBD.",
			"reviews": {
				"customerProfileNames": ["Sam", "Alvin", "MatthewM."],
				"customerProfilePictures": [
					"https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif",
					"https://images-na.ssl-images-amazon.com/images/S/amazon-avatars-global/95135381-0dd6-484b-af5c-410df631d2a0._CR291,0,858,858_SX48_.jpg"
				],
				"customerRatings": [
					"5.0 out of 5 stars",
					"5.0 out of 5 stars",
					"1.0 out of 5 stars"
				],
				"customerReviewTitles": [
					"Microsoft 365 Family | Premium Office Apps | Up to 6 users | 3 Months Free, Plus 12-Month Subscription\nMicrosoft 365 Family | Premium Office Apps | Up…",
					"Microsoft 365 Personal | Premium Office Apps | 1 User, Up to 5 Devices | 3 Months Free, Plus 12-Month Subscription\nMicrosoft 365 Personal | Premium Office…",
					"Save $30 at checkout | Adobe Acrobat Pro DC subscription with auto-renewal\nSave $30 at checkout | Adobe Acrobat Pro DC…",
					"Save 68% on McAfee Total Protection 3 Device\nSave 68% on McAfee Total Protection 3 Devi…",
					"My first curved screen",
					"This Monitor by Samsung is a GREAT Buy!!",
					"DO NOT BUY, YOU HAVE BEEN WARNED."
				],
				"customerReviewBodies": [
					"I work from my home office as a software engineer so I'm in front of my screens practically all day. I bought 3, two for me and one for my wife. I replaced two 24\" HP flat screens with these bad boys. These being my first curved screens, I was a bit concerned that I wouldn't like the curved effect (it seemed a bit gimmicky to me), however, I couldn't be happier. The brightness and clarity of these screens are also superior to my previous screens. I fiddled with brightness, sharpness, contrast but, in the end, I didn't have to tweak them all that much. The default settings are pretty nice. While these screens are larger, they still have a max resolution of 1920 x 1080 so don't expect a super fine HD quality image.\n\nThey were a breeze to assemble. Just snap the base into the slot in the monitor. I like the stand itself. It's very low profile and leaves more space on my desk for my keyboard (wireless, illuminated, Logitech K800 - I suggest picking one up) and mouse (Microsoft wireless laser mouse 5000 - nothing fancy, gets the job done). When I bump my desk there is a bit of a wobble to the screens but it's not bad or very noticeable. Sometimes when I'm vigorously typing away, I will get a little wobble, but, again, I remain unperturbed. I was crossing my fingers (figuratively of course) when I pulled the screens from the box and examined them for damage. The surface of each of the three screens I purchased was in flawless shape and after getting them hooked up, I looked for any dead pixels, color lines, etc. that would be a no-go. I'm pleased to say that all three screens were in top shape.\n\nI primarily use Visual Studio and I found that I had to change the font from the default Consolas to another, finer, monotype font (I found a free one called Monofur that works perfectly at 12pt) in order to optimize font clarity and lines of code on the screen. With these screens Consolas at 12pt was way too big. And simply reducing the font made it ugly (pixelated, blocky, etc.) so I wanted something better. I'm not sure how well the screenshot will translate to your current screen but I've captured a little snippet to share how clear my screen looks to me.\n\nAs for the curved effect, I was a bit concerned after reading other reviews, some of which go on about how terrible they are for spreadsheets. I'm not sure what that's all about since I find that these screens are ideal for looking at long lines of text across the screen for extended periods. When these screens are in front of you the curve itself is almost imperceptible. As I mentioned, I use two screens sitting side-by-side and I find that these perfectly wrap my work area in a more immersive way that my previous non-curved screens. My wife works on the other computer as an editor (so again lots of text and spreadsheets) and she absolutely loves it.\n\nThe ONLY complaint I have at the moment is that when I sit these two screens adjacent to each other, the tops/bottoms don't line up perfectly. One edge is raised about 1/4\" over the other. I haven't fiddled with the monitor positions too much to see if I can correct it since I don't really notice it while I'm working. I have a few thoughts on how to remedy it if it actually starts bothering me so I really can't complain.\n\nOverall, if you're looking for a nice upgrade to your current screen without breaking the bank, these screens will do the job nicely.",
					"Let me start this review by stating that the Monitor came in today. It is an upgrade from a 23inch Gateway Monitor that I was using (still working great but now on my wife's computer). I took my time over that last several weeks and I was trying to figure out what type of monitor to get. (There are HUNDREDS!!) I narrowed it down by screen size, clarity, curved screen and peoples reviews. I fell in on this one. First it's a 27\". Second it's a curved screen. Those first two choices were important to me. Then I slogged through a ton of reviews. I really narrowed my search by (VERIFIED Purchase). Way to many frauds out there. I also looked at reviews on YouTube. At the end of the day the Samsung models won hands down. Then after more looking and more narrowing I settled on the 27-inch Business 390 Series C27F390FHN Curved Screen LED-Lit Monitor. I believe I hit the Jack Pot on this one. The set up took no time at all. Once it was on I used my HP Diagnostic tool to do a Video test. I checked for dead Pixels... NONE!!! The screen is crisp and clear. I'm not a gamer. However, I have played (a small amount) of War Thunder in the Past. So, I'm now going to see how that does. I'm not worried that it won't meet expectations. The reviews said it was good for Gaming too. So far so good. I'll see how this monitor holds up over the test of time.",
					"S",
					"The display port shown in one of the product pictures is not on the actual product. I was very disappointed as I have a docking station for display ports but only one HDMI-port. I would have contacted the supplier with this complaint but I can't seem to find any contact information.",
					"Product is advertised to be 75Hz and is only 71.9hz max. This is misleading and false advertisement. No excuse for this..\n\nBox also came in with a huge gash in the bottom of the box as if it were dropped on something.\n\nWhen the connector cable is bumped or nudged in the slightest, the monitor goes black and I can't seem to get video back unless I disconnect and reconnect the HDMI cable. This is a side effect which I can only assume is happening because the product was damaged in shipping. Very disappointed..",
					"I ordered two of these and they worked well with my VESA mount.\n\nNothing to worry about regarding image quality. Good colors and good white point. I had to turn off Freesync to get 75 Hz to work.\n\nThe reason I knocked a star off is that on one of my two monitors there's a bit of visible backlight bleed at the bottom. It's not too big of a deal for the second screen but I think that if it were my main I would have been a bit disappointed.",
					"Image Quality is really poor, very similar to CRT monitors that existed 10~15 years ago! The height and orientation cannot be adjusted and are fixed.\nAlso when it arrived, it was missing the screws to fix the monitor to the leg that it came with... Also the monitor itself looks nice but the plastic material in the leg seems to be really cheap!\nAlso be aware that to return this you need to pay a lot of money for the return shipping so don't risk.",
					"So I have x2 of these curved monitors wall mounted not sure if the pic will do justice but I have no complaints with them"
				]
			}
		}
	]
}
