{
	"gamingLaptops": [
		{
			"id": "NwmStih",
			"title": "Acer Nitro 5 AN515-55-53E5 Gaming Laptop | Intel Core i5-10300H | NVIDIA GeForce RTX 3050 Laptop GPU | 15.6\" FHD 144Hz IPS Display | 8GB DDR4 | 256GB NVMe SSD | Intel Wi-Fi 6 | Backlit Keyboard",
			"price": "$743.28",
			"image": "https://m.media-amazon.com/images/I/81bc8mA3nKL._AC_SX355_.jpg",
			"description": "Acer gaming laptops deliver advanced performance for all gamers. The Nitro lineup of gaming PCs and accessories are ideal for casual gamers who are ready for something better. The Acer Nitro 5 AN515-55 is equipped with a beautiful 15.6 inch FHD display to help you visualize the win. The latest NVIDIA GeForce RTX 30 series GPU supports 2nd Gen Ray Tracing Cores, 3rd Gen Tensor Cores, DLSS, Resizable BAR, Microsoft DirectX 12 Ultimate, and so much more. With Killer Ethernet and Wi-Fi 6, get quicker matchmaking and never worry about disconnecting during a game. The Acer Nitro 5 with Intel Core i5 processing power enables impressive performance whether you're challenging your buddies to battle or focusing on a new hobby. This Acer Nitro laptop is configured with 8GB RAM memory and 256GB solid-state drive storage space, and the ability to upgrade as needed. Use the HDMI 2.0 port for a monitor, use power-off USB charging, and plug in your favorite accessories with the array of USB Type-A and USB Type-C ports. (NH.QB0AA.001).",
			"reviews": {
				"customerProfileNames": [
					"jazz",
					"ZachWolfe",
					"Jordan",
					"MauriceA.Taylor",
					"Amycenter"
				],
				"customerProfilePictures": [
					"https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif"
				],
				"customerRatings": [
					"5.0 out of 5 stars",
					"5.0 out of 5 stars",
					"5.0 out of 5 stars",
					"5.0 out of 5 stars",
					"5.0 out of 5 stars"
				],
				"customerReviewTitles": [
					"Microsoft 365 Family | Premium Office Apps | Up to 6 users | 3 Months Free, Plus 12-Month Subscription\nMicrosoft 365 Family | Premium Offic…",
					"Microsoft 365 Personal | Premium Office Apps | 1 User, Up to 5 Devices | 3 Months Free, Plus 12-Month Subscription\nMicrosoft 365 Personal | Premium Offic…",
					"Save $30 at checkout | Adobe Acrobat Pro DC subscription with auto-renewal\nSave $30 at checkout | Adobe Acroba…",
					"Norton 360 Deluxe 2022 - Antivirus\nNorton 360 Deluxe 2022 - Antivirus",
					"Runs Sims 4 beautifully!",
					"Laptop won’t turn on? READ THIS!",
					"DOESNT CHARGE UPON OPENING",
					"Great value gaming laptop, with some standard laptop tweaks",
					"leer las instrucciones..",
					""
				],
				"customerReviewBodies": [
					"Factory Refurbished by Acer, 90 Days End-User USA Warranty",
					"I’m in love with this laptop. I was looking for a review about running the sims 4 with a lot of packs but now that I have it, i’ll say it. This laptop runs the Sims 4 on Ultra graphics with all of the packs and tons of CC and mods BEAUTIFULLY. It doesn’t miss a single beat. Loads in less than 30 seconds, and that’s only with 8 gb of RAM. The screen quality is so nice too, it looks like it has an overlay almost. It starts up quickly, loads web pages super fast. I can see myself thoroughly enjoying watching movies on this laptop even. I don’t know how it compares to other gaming or high end laptops, but if you’re like me and you have a piece of crap laptop and you’re used to it taking almost an hour to load the Sims on medium graphics, you will be BLOWN AWAY. The laptop is super light and thin. The keyboard has a nice feel to it, i like the back light but i wish you could change the color. I played with it for 6 hours straight and the fans are super quiet, and it doesn’t heat up that much at all. It does slow down a little without being hooked up, but i don’t plan on using it portably so I can’t speak to that. This was worth every penny, and I’m really grateful for Acer packing so much power at a good price. I don’t see how it gets any better than this for little ol’ me",
					"This laptop is a bit different from others that I have owned in the past. The charging cable is a bit un-intuitive in the sense that you have to really jam that thing in there in order for it to actually work. In the past, all I had to do was gently plug it in.\n\nWhen I got mine in the mail, I thought it was DOA because it wouldn’t turn on after I plugged it in. You’re actually supposed to press the cable in until you hear a clicking noise. Only then will it work. If you’re like me, don’t panic and give it a try!",
					"When I opened the laptop and plugged it in there was absolutely no activity, charging light did not turn on and laptop had no precharge. After a panicky hour of trying to figure out what's wrong with my brand new very expensive laptop, and realizing how many one star reviews were here for this exact issue, I cannot stress this enough, SHOVE THE CHARGER IN. It is VERY SNUG and you really REALLY have to push it hard. There is a very significant click of the charger going in, and as soon as it did everything was fine. Haven't used it yet, but wanted to update, as I now understand what all the one star reviews about this laptop being DOA are really about. Happy gaming!",
					"This is my newest laptop since 2017, but the laptop I had was from 2016. Far faster than my old one (of course) and runs every program to its max. For gaming a 3050 ti is limited to mostly 1080p gaming unless you play some of the lighter games where you can eek out 144op, but you can easily get 120fps on most games with some tweaks with around 70 to 90 fps on larger AAA titles. One of the first things you have to do with any Acer laptop is go into control panel and change the power settings, they come standard with USB and HDD/SSD auto power off which pretty much puts your laptop to sleep whether you change sleep settings or not. Also, press the (N) button by the num pad, click on the gear icon, and click to make the keyboard backlight stay on. I read some reviews online that said the keyboard backlight would turn off automatically, luckily my last laptop was a Acer predator and they have the same settings basically. Fans are almost non existent when just browsing and you can control them (finally) when doing some intense gaming (or using programs like CAD or the like). Also, the power cord is a dual step process, the first click means nothing, you have to push in till you hear a second click. I was looking for a 17\" inch laptop with more than 2 USB A ports, those ports NOT on the right side (mouse interference), could game at atleast 1080p/above 60 fps, a better processor, and had a ethernet port. Sounds like alot but most laptops are 15\" inch with 2 USB A ports and no ethernet ports now. I'm satisfied with this purchase.\n\n*Particular Notes: This comes with Norton installed, Firefox, a planet 9 link, and Windows 11. There's a small learning curve with Windows 11 and I hate Norton, but it's easy to uninstall and Windows 11 is whatever. There is no bloatware on this model, I know there is a model that has Alexa but this one doesn't have it. The SSD is pretty fast but not the fastest, it's better than good enough.*",
					"que bruto pongale 0... recibi la laptop hace un par de dias y me asuste mucho, porque no encendia, ni cargaba ni encendia ninguna luz.. la deje toda la noche conectada pensando que podia haber venido descargada de bateria, pero nada.. al dia siguiente ya estaba a punto de contactar a soporte para enviarla a garantia, y me puse a leer el manual. cuya instruccion decia, al conectar el cargador asegurese de empujarlo hasta escuchar un click...ahi estaba el fallo. despues de conectarlo correctamente, encendio de una y hasta ahora vade maravillas..",
					"",
					"Muy buena laptop, para jugar está increíble, quizá no tiene tanta memoria pero se puede expandir. Lo único \"malo\" fue que me tardo 1mes en llegar, parecía de Ali expréss Haha, 15 días en confirmar y 15 en llegar aún habiendo pagado priority.\n\nLa seguiré usando y más adelante veré si actualizo mi comentario.",
					"",
					"D",
					"",
					"The laptop is nice for gamers on a budget. I did not have the time to test many games but I played Fallout 4 with graphics settings maxed out and Mechwarrior 5 on medium without any drops in FPS. Battery life is OK for a gaming laptop. It boots in a few seconds. Fan noise is omnipresent when gaming or doing other ressource intensive tasks but it is near silent when watching videos or browsing.\n\nWhat I don't like:\n-Fingerprint magnet!!! (Even when I'm not eating potato chips!)\n-HDMI port on right side so cable can be a little in the way when using mouse.\n\nWhat I like:\n-2 m.2 slot (1 free) and 1 sata 2.5\" (upgrade is easy)\n-keyboard is great to use and I like the red color\n-anti-glare screen\n-Speakers are nice (for laptop speakers) compared to other laptops I checked.",
					" Es una muy buena laptop, fácil de upgradear, una pantalla que si da los 144 Hz, un procesador muy decente y la tarjeta gráfica tiene lo suyo, a pesar de ser de 4 GB, corre el CoD Warzone a 80 fps con todo alto\nAún me falta probarlo con más juegos, pero Minecraft, Left 4 Dead, rocket league, da todo a más de 100 fps estables\nSolamente es recomendable invertir en más memoria (Tiene slot para una SSD y un HDD) y otra memoria ram (máximo 32 GB en ambos slots)\nSi vas iniciando, es una muy buena opción, no es pesada, es bonita y solamente le echaría en falta la entrada para micrófono, de ahí en fuera todo bien",
					"",
					"AS A LOT OF THE 1 STAR REVIEW MENTIONED, THE THING WONT TURN ON WHEN I RECIEVED IT. DONT THINK YOU ARE GOING TO BE LUCKY AND WONT ENCOUNTER THIS ISSUE. BECAUSE IT IS A COMMON PROBLEM AND IF IT HAPPENS IT IS VERY ANNOYING!!!!!!!! I HATE IT HERE"
				]
			}
		},
		{
			"id": "qXxfj0k",
			"title": "Razer Blade 17 Gaming Laptop: NVIDIA GeForce RTX 3080 Ti - 12th Gen Intel 14-Core i9 CPU - 17.3\" 4K 144Hz - 32GB DDR5 RAM - 1TB PCIe SSD - Windows 11 - Chroma RGB - Thunderbolt 4 - SD Card Reader",
			"price": "$4,299.99",
			"image": "https://m.media-amazon.com/images/I/71CMCq8IMFL._AC_SY355_.jpg",
			"description": "Within its sleek 15” chassis, the new Razer Blade 17 is equipped with the latest Intel 12th Gen H-Series processors for maximum performance. Paired with NVIDIA’s GeForce RTX 30 Ti series graphics for stunning visuals that are brought to life with a variety of displays.",
			"reviews": {
				"customerProfileNames": [
					"Katya",
					"ToryM.Petersen",
					"Customer",
					"JailBreakOverlander",
					"Colin",
					"Anton",
					"Gary",
					"TheReviewer"
				],
				"customerProfilePictures": [
					"https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif",
					"https://images-na.ssl-images-amazon.com/images/S/amazon-avatars-global/ff85aef6-b4af-4c8c-9ef2-bf6cb50f8525._CR0,0,442,442_SX48_.jpg"
				],
				"customerRatings": [
					"5.0 out of 5 stars",
					"1.0 out of 5 stars",
					"3.0 out of 5 stars",
					"2.0 out of 5 stars",
					"3.0 out of 5 stars",
					"1.0 out of 5 stars",
					"4.0 out of 5 stars",
					"1.0 out of 5 stars"
				],
				"customerReviewTitles": [
					"Microsoft 365 Family | Premium Office Apps | Up to 6 users | 3 Months Free, Plus 12-Month Subscription\nMicrosoft 365 Family | Premium Office Apps | Up…",
					"Microsoft 365 Personal | Premium Office Apps | 1 User, Up to 5 Devices | 3 Months Free, Plus 12-Month Subscription\nMicrosoft 365 Personal | Premium Office…",
					"Save $30 at checkout | Adobe Acrobat Pro DC subscription with auto-renewal\nSave $30 at checkout | Adobe Acrobat Pro DC…",
					"Norton 360 Deluxe 2022 - Antivirus\nNorton 360 Deluxe 2022 - Antivirus",
					"I love using this",
					"Lasted two weeks",
					"WYSIWYG - Don't trust their service desk to answer questions.",
					"I fell for it Again, Dont buy this laptop. spare yourself",
					"The rtx 3080 better, turns off fast and the cooling is louder and way worse how is this better",
					"do not buy product from this seller xbox app not working, windows services update not working.",
					"Great laptop that runs hot.",
					"Why waste your money?"
				],
				"customerReviewBodies": [
					"This laptop is incredible. It feels so good to use and I feel that justifies the high price almost by itself.\nBut all the specs work together real well.\n\nI have no problems with the speakers.\n\nKeyboard is great. Display is great.\nPerformance is killer.\n\nIt handles most everything with ease. Temps stay low, but I try to make sure I always have it elevated in some way -- either with little feet or with a cooling pad (I often don't actually use the fans on the pad, just want to raise it).\n\nMost of the time I run it with only GPU (optimus disables via bios).\nI always run it with Intel Turbo Boost off.\n\nMost of the time temps are <= 60, but if I play anything that maxes out the graphics, it will get to around 80s (amazing for a laptop).\n\nThe fans are silent at 2600 rpm, and anything above you can hear them, but I can tune it out if I have something playing in the background (I don't wear headphones, if I did, this would be a non-issue).\nEven with the fans loud, they are not annoying at all. The max speed is very tolerable.\n\nI predict this will be a laptop I'll use for several years, and I have no doubt it will serve me well.",
					"This will likely be the last Razer device I've purchased. I really want to remain loyal to the company but I've recently bought things such as keyboards, mice and others that just didn't cut the mustard. For whatever reason though, I decided to drop 4k on a top of the line laptop to replace my 6 year old Origin PC. That was a mistake.\n\nLet's start however, with the positives.\n\nThe computer is slick. I bought a Blade 17 with 32gb of RAM and a 3080TI. It's super thin, easily 40% thinner than my 6 year old Origin and very light for a 17 inch laptop (comparatively speaking). The screen is beautiful, crisp and bright and you definitely notice the 240hz in QHD. It's fantastic.\n\nIt's also surprisingly quiet. I expected more fan noise but there is very little to be honest. I bought a laptop cooler just in case because I wanted to protect my new baby from overheating but it seems to do well on it's own. I've never seen the GPU heat go above 58 degrees Celsius in any game thus far.\n\nWhen I got it ready and got my games installed, I was very pleased. The computer could easily push 140 FPS in the most demanding games and still didn't feel hot to the touch. It crushed anything I loaded and I briefly debating using this in lieu of my personally built desktop with a 3070 and 32gb of ram because I felt this laptop was outperforming it in many regards. Unfortunately, that lasted about two weeks.\n\nSuddenly I started seeing artifacts and flickers in games. Previous experience instantly told me that is not a good sign. My FPS dropped dramatically. Whereas in my favorite shooters I was seeing between 70 and 120 FPS, I now see 40 at the most, usually 35 or less. Nothing I do changes this. Every game looks great but runs awful.\n\nI ran additional benchmarks on the computer to see what was wrong. The GPU is now benchmarking at ZERO percent after just two weeks. Either I got a lemon of a GPU or perhaps the chassis cooling is not what i's cracked up to be. Either way, spending four THOUSAND dollars on what should be a premier gaming laptop and it lasting all of two weeks is beyond unacceptable. Spending 4000 dollars on anything should all but guarantee and near perfectly functioning device. Sadly, that is not what I received.\n\nI received something that performed slightly above where I expected for about two weeks. However, after two weeks, my 6 year old Origin PC with a GTX 570 can actually play my favorite games at a higher FPS than this computer.\n\nIt would appear that Razer's QC is once again lacking. I would stay away from this laptop and consider a different brand.",
					"These are wonderful machines, but they are not configurable. What you see is what you get (WYSIWYG). I knew this when purchasing my machine, but had a few specific questions before spending the money and I contacted their support desk for clarity. I explained that I was researching models and wanted a touch screen. I was seeing conflicting information online and I was assured that R709-0423x product line has a touch screen, so I ordered one. To my surprise, no touch screen! I contacted their support people again and referenced my case number. They acknowledged that what I was told was wrong, but ignored me when I asked for recourse. Don't trust the service people to answer product questions!",
					"I own 5 razer blade pro 17's I have a 2019 i7 3080 a 202 i7 3080 early 12 i7 3080 and late 21 i9 3080 and this new 14 core 3080ti is literally 300% slower upload 4k video from premiere pro 22 and the early 21 i7 blows it away. and of course razer being razer its \"oh well' must be your wifi problem is I have a cat 6 ethernet connect at 5g all were tested side by side under exact same parameters. sending it back and never going razer again",
					"Worse cooling and gaming than normal rtx 3080 razer laptop",
					"do not buy product from this seller xbox app not working, windows services update not working. They refuse to return money. Well, let's see how much money they lose through the return of the court, the cost of a lawyer is minimal, but they will also pay them.",
					"Just got it today. It's beautiful, it runs smooth. The 4k is awesome. It's light and thin. The only issue I have with it, is that it runs hot. Primarily on thr left side. I have to use a laptop fan accessory underneath to mitigate the heat.",
					"Multiple features didn't even work (screen looked bad, touchscreen didn't function, drivers didn't exist for multiple OEM components....)\n\nBut why stop there? Waste your time with RAZER support, which is about as soul sucking as comcast or trying to cancel your AOL.",
					"Debating to return it. Bought what I thought was the beast. 12 generation I9, UHD, 17 inches, 3080ti. From the first day, it's acting weird. Fan makes huge noise. Laptop gets very hot that I barely can touch it. In so many times screen turns black while running games and it stops the game and other times it just restart on its own even though the laptop just started. This is $6000 CAD laptop that we talk about, not a cheap machine."
				]
			}
		},
		{
			"id": "I2p4GJU",
			"title": "Acer Predator Helios 300 PH315-54-760S Gaming Laptop | Intel i7-11800H | NVIDIA GeForce RTX 3060 Laptop GPU | 15.6\" Full HD 144Hz 3ms IPS Display | 16GB DDR4 | 512GB SSD | Killer WiFi 6 | RGB Keyboard",
			"price": "$1,211.30",
			"image": "https://m.media-amazon.com/images/I/71nz3cIcFOL._AC_SX355_.jpg",
			"description": "Acer gaming laptops deliver advanced performance for all gamers. The Predator lineup of gaming PCs and accessories are ideal for everyday gamers who need powerful products that can handle daily use and overclocking. The Acer Predator Helios 300 PH315-54 is powered up with the latest 11th Generation Intel Core i7 processor, giving you power, speed, and intelligent processing when you need it most. The new NVIDIA GeForce 30 Series graphics card is powered by award-winning Ampere architecture, and boasts new Ray Tracing cores, Tensor cores, and streaming multiprocessors for realistic graphics. The incredibly fast 144Hz refresh rate will keep up with your beautiful graphics in crisp Full HD for high-octane gameplay. When you're playing online, Intel Killer DoubleShot Pro keeps you connected to your match or chatroom by allowing your Predator laptop to use both Ethernet and Wi-Fi at the same time. This Predator gaming notebook is also equipped with hardware that can keep up with the powerful internal specs. Our specially engineered 5th Generation AeroBlade 3D Fan uses wind-guiding Vortex Flow to increase airflow and cooling from intake to exhaust, so your computer stays cool no matter the task. Our customized keyboard has see-through concave-shaped WASD keycaps, and dedicated keys for Turbo overclocking and PredatorSense. PredatorSense is the ultimate tool to let you control and customize your gaming laptop, from overclocking to fan speed to game profiles and more. (NH.QC2AA.003).",
			"reviews": {
				"customerProfileNames": ["BrianS.", "Jeffrey"],
				"customerProfilePictures": [
					"https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif"
				],
				"customerRatings": ["1.0 out of 5 stars", "5.0 out of 5 stars"],
				"customerReviewTitles": [
					"Microsoft 365 Family | Premium Office Apps | Up to 6 users | 3 Months Free, Plus 12-Month Subscription\nMicrosoft 365 Family | Premium Offic…",
					"Microsoft 365 Personal | Premium Office Apps | 1 User, Up to 5 Devices | 3 Months Free, Plus 12-Month Subscription\nMicrosoft 365 Personal | Premium Offic…",
					"Save $30 at checkout | Adobe Acrobat Pro DC subscription with auto-renewal\nSave $30 at checkout | Adobe Acroba…",
					"Save 68% on McAfee Total Protection 3 Device\nSave 68% on McAfee Total Protection 3 D…",
					"BIOS settings are LOCKED! Can't change boot order, upgrade storage, or disable UEFI for Linux",
					"(Detailed Review) TEMP FIX/BEST LAPTOP!"
				],
				"customerReviewBodies": [
					"Factory Refurbished by Acer (90 days end user warranty)",
					"I",
					"Okay, so I was hesitant on this laptop because some of the reviews mentioned bad temperatures. I was concerned with getting a laptop with bad thermal paste (which does happen). However, the laptop came super well! Lots of reviewers fail to mention the healthy temperature levels. Idle should be 30-45c. And under full load it should never go past 85c. EVER!!! If it goes past, it's likely it could either be, 1: Bad Thermal Paste/application, 2: Bad Fans, 3:Lack of contact with HeatSinks. 4: Bad Ventilation. If buying new, and the temps aren't matching, exchange it, as shipping can sometimes damage components. Laptops generally require maintenance. If heavy using, 1-2 Years. Make sure those temps never go past 85c. Over time you will have to replace the thermal paste or fans may give out. Grizzly Kryonaute is the best paste. Those are very very easy fixes. Just keep that in mind when buying ANY gaming laptop! If you are scared to tamper with it, buy some insurance and send it to acer. (Continuing with the review......) With poor ventilation I was reaching 85c. I bought a laptop cooler, the IETS with rubber rings. I'm getting incredible temperatures! Never going past 78c! This laptop is very heavy on proper Ventilation. If you look at the design there are a ton of vents from the bottom that push out through the top of the keyboard. S1I think a laptop cooler is necessary if you're gonna be gaming. This thing is incredible. I'm running games on High/Max settings (Elden Ring, warzone, apex) and getting awesome frames. I upgraded the ram to 32GB and this thing is a work horse. Dual rank 3200 32gb ram will increase your frames by about 15, and more opened tabs!! ;) I also installed a 2tb samsung ssd. (Which I highly recommend you do) It is much easier to install an nvme than the SATA one. So I would recommend getting a m.2 nvme. Opening the back piece for upgrades can be a challenge. There Is a trick to it, and it's likely you will break something if you don't get it right. So don't force it! So be very careful and gentle when doing it. Use a pick to slowly Pry it open. Pull from the vents back side. The battery can get kinda hot too. So make sure it's in a good spot. You can also set the battery charge level to 80% for longer battery lifespan. That's pretty much it! It's an amazing laptop for the price and power! Bang for your buck! Happy gaming!",
					"Como antecedente, he tenido laptops como dell precision m4800, hp pavilion dv6 y la última era una MSI leopard PRO i7 7700HQ GTX 1050, 32 ram y ssd, entonces mi opinión sobre la predator Helios 300 estará muy basada en la experiencia que tuve con esta última. El uso que le doy a mis computadoras es de diseño mecánico, simulaciones \"pesadas\" y obviamente videojuegos.\n\nTeclado\nEn primer lugar, tenía dudas por que el teclado estaba en inglés, pero con un par de configuraciones es muy fácil usarlo. Hasta pensé en comprar un modelo anterior que estaba un poco más caro pero que tenía el teclado en español, y que bueno que no lo hice.\nEl recorrido de las teclas es muy corto y se siente bien al tacto, se calienta muy poco por la transferencia de calor de la CPU y GPU (no es incómodo), en general no es un teclado que resalte mucho\n\nPantalla\nPensé que sería muy similar a la MSI (IPS Full HD con retroiluminación led) pero los 144Hz y el panel IPS si marcan mucho la diferencia, incluso se ve mejor que mi monitor, que es un LG 34UM69G-B monitor Ultra Wide IPS de 34 pulgadas.\n\nCPU y GPU\nNo hay mucho que decir, los datos técnicos son muy claros. En lo personal me están ahorrando mucho tiempo de productividad, por ejemplo, con la MSI tardaba 1 hora en hacer una simulación y con la Helios tardo 20 minutos. Si se siente el salto.\nEn el renderizado 3D también se siente más fluido y tarda un 40% menos, aproximadamente\nAclaro que es mi percepción.\nIgual para los juegos, se siente bien correr todos los FarCry en Ultra o casi casi Ultra. Un mundo de diferencia de la GTX 1050\n\nRAM\nAntes tenía 32 GB en la MSI y todo bien, pero ahora, con 16 GB de ram si noto mucha diferencia al trabajar y tener distintos programas de diseño y simulación abiertos. Estoy en proceso de subir la memoria a 32 GB, he visto que hay que tener cuidado con las frecuencias y el dual chanel para seleccionar bien el tipo ram. Actualizaré si existe algo relevante.\nPara los juegos está bien, en las revisiones que le he dado nunca se satura.\n\nChasis y construcción\nLa calidad de la predatos Helios 300, en cuanto a su construcción y materiales, es de sensación muy premium, se nota que el calibre (grosor) de las placas del chasis son más grandes, por lo que se siente muy sólida y resistente. Las dimensiones creo que están bien optimizadas, me gusta que los perfiles de los marcos de la pantalla no sean tan gruesos.\n\nExpansión\nLa que compré venia con un SSD de 500 GB M.2 NVME PCIE 4, pero tiene una ranura adicional de M.2 NVME PCIE y también trae un accesorio que se conecta a la placa madre y agregar un SSD o HDD sata. Es decir, puedes tener dos unidades SSD M.2 NVME PCIE y una unidad SATA 2.5.\nYo le agregué un M.2 NVME PCIE Samsung EVO 980 de 1TB y un SSD Kingston A400, 960GB, SATA III, 2.5'', 7mm, por lo que ahora tengo 2.5 TB.\nEn cuanto a la ram, tiene 16 GB DDR4 a 3200 MHz, creo que acepta hasta 32 GB y estoy en proceso de agregarla. Actualizaré si existe algo relevante.\n\nRuido y calentamiento\nLos ventiladores en su máxima velocidad suenan mucho, pero hasta el momento no he tenido y/o utilizado una laptop \"gamer\" que no tenga este problema, la ventilación es necesaria para mantener las temperaturas. Mi laptop MSI leopard pro suena igual y algunas laptops de amigos y conocidos con características similares tienen esta desventaja.\nCabe mencionar que en casi todos los equipos tu puedes regular la relación de temperatura/velocidad de ventiladores, pero si quieres cuidar el equipo y sacarle más provecho puedes utilizar directamente el botón \"turbo\"\nLas temperaturas son muy estables, no llegan a mas de 70 grados (hasta ahora), con la MSI facil estaban a 95 grados funcionando al 100. En cargas normales rondan los 40 grados, igual la MSI y las otras que he probado.\n\n-------------- Actualización 5 meses después de la compra\nPor el tipo de trabajo que realizo tuve que agregar mas ram (32 gb 2x16gb) y todo funciona mejor. Es muy fácil abrirla y hacer los distintos upgrades, además en YouTube aparecen muchos videos explicando como hacerlo.\n\nCosas positivas\nMe gusta que tenga thunderbolt 4 por que le pude conectar un HUB que me facilita la vida al momento de conectarla y desconectarla en mi área de trabajo.\nEl botón turbo funciona bien, es decir, en otras laptops que tienen este botón solo es para aumentar la velocidad de los ventiladores, pero en esta laptops si aumenta las frecuencias sin tener que modificar nada más.\nDespués de 5 meses no ha tenido ninguna falla o problema.\nSigue siendo igual de facil trabajar con el teclado en inglés, solo es cuestion de cambiarlo a inglés internacional. Tambien el windows, es muy facil pasarlo al español sin reinstalar ni nada de eso.\n\nCosas negativas\nEl monitor tiene una iluminación muy marcada en las esquinas superiores, como si algo estuviera presionando la pantalla por detrás. En mi caso se nota mucho por que siempre tengo fondos de pantalla y temas en color negro.\nLos ventiladores se ensucian muy rápido, pero esto es igual que en cualquier lap con prestaciones similares, ya que requiere ventiladores muy potentes, que por cierto, los que tiene esta laptop son los más potentes que he visto.\nLa aplicación de Predator Sense es muy basica a comparacion de la MSI DragonForce (son de esas aplicaciones que vienen precargadas con casi todas las laptops gamer para ver temperaturas, hacer \"overclock\", etc.)\n\nPor último, si la compran, traten de no actualizar a windows 11, al menos en lo que se reparan muchas fallas que tiene. En W10 todo era perfecto y después de que actualicé, comenzaron problemas de compatibilidad con dispositivos de audio que se conectan por bluetooth y usb. También el rendimiento baja un poco, además de que tarda un poco más en iniciar, que es imperceptible si no estás acostumbrado a trabajar en ssd. Pero en fin, esto es para cualquier equipo, de echo tengo conocidos que tienen laptops similares en características pero de marcas diferentes y les ha ido peor.\n\n--Actualizaré en algunos meses",
					"",
					"First thing you notice as you set up the laptop is how loud this thing is. The fans are real loud. So much so that it gets annoying and my wife closes my laptop when I leave the room.\nAlso, it overheats. It is not uncommon for this laptop to do 85 degrees. And no, its not on my lap. I had it mounted on a stand and I even added little pegs to elevate it from the stand to promote air circulation. Didn't change anything.\nSo this week I oprdered a 5 fan cooling pad. It still overheats. I run it around 76-78 degrees with the 5 fan cooling pad\nThis is a major issue for the lonmgevity of the machine. I would not recommend this buy. If could I would return it but i,ve had it for 2.5 months now. I should have returned it immediately. DO NOT RECOMMEND!",
					"I purchased this computer about 2 or three weeks ago and used it extensively the first few days as I needed to work on the move. I see clients on line through Zoom and other platforms. I was not happy with the initial camera quality for the price and prestige of the brand and this model. If I had my camera on it would freeze zoom and kick me out then say that my camera was not available for the rest of the session.\nI have read on the acer forum that this is a known issue and there are no real resolutions to it. As I already have a Logitech Brio camera I have just attached that and have not had an issue since.\nIf you are looking to depend on the internal camera for the work or gaming/streaming that you are doing, this is NOT your computer. If you don't care about the camera then this is a powerful and functional laptop.",
					"This computer came appearing totally fine. Unfortunately it emits a horrible ear piercing high pitch sound whenever it is on so now I have to send it back to get fixed causing me to be without a computer for two weeks. At least the warranty covers it’s repair. I will update my review when I get my laptop back.",
					"This laptop is amazing. Bought nearly 2 years ago at a cheaper than currently advertised price (I paid $1,600 CAD + tax via a 5 month payment plan).\n\nIt comes with the common laptop accessory (power supply, I'd recommend getting a second power supply, or atleast just the AC wire part of it, so you can leave the AC part plugged in at the desk at all times while travelling with the DC portion and another spare AC wire for it)\n\nIt also comes with a hardware wire. Do not lose this wire as it'll be needed for if ever one wishes to connect a secondary internal storage device.\n\nI had lost mine and needed to order a replacement which was difficult to find.\n\nI managed to fit a regular 4tb hard disk drive inside (not recommended) and had to get alternative screws that were a little bit longer so that i could screw most of the shell/case back in place.\n\nWill eventually 3d print some type of shell/case spacer, but using electrical tape in the meantime to give a \"sealed appearance\" to that additional 2mm gap caused by the thickness of that 4tb laptop sized hdd (being a bit thicker than anything under 2tb).\n\nEventually plan to replace that 500GB NVMe SSD with something larger, maybe a 2TB NVMe SSD...\n\nI replaced the OS, using a dual-boot approach. Both using a custom Windows 10 image from Ghostspectre (both using their \"Superlite\"/without defender option).\n\n1 of the dual-boot is extremely light, as it has nothing at all in it except for whatever is needed for gaming (and also having access to a portable/non installed version of firefox). By doing so, the OS now uses the least possible amount of ressources, leaving a much more \"unused difference\" of ressources available to be used by games, being able to output a higher graphic quality.\n\nThe other OS in the dual boot is setup as a regular OS manner with apps like microsoft office, AutoCAD, Wondershare Filmora, etc etc etc...\n\nEventually plan to include a Windows 7 and a Windows 8.1 within the dual boot options for even lesser used ressources (while using OpenShell as a Windows 8.1 Start Menu replacement, giving it a \"Windows 7 look-a-like Start Menu\" instead of that fullscreen thing).\n\nKnowing that Windows 7 and 8.1 aren't exactly DirectX12 friendly, many games nowadays also supports \"Vulkan\" (which Vulkan is supported in both Windows 7 Windows 8.1 and up)."
				]
			}
		},
		{
			"id": "MYMmStD",
			"title": "Newest MSI GF63 Premium Gaming Laptop, 15.6\" FHD Thin-Bezel Display,10th Gen Intel Quad-Core i5-10300H, 16GB RAM, 1TB SSD, GeForce GTX 1650 4GB, Backlit Keyboard, Windows 10",
			"price": "$819.99",
			"image": "https://m.media-amazon.com/images/I/716sWoIVxDS._AC_SX355_.jpg",
			"description": "We sells computers with professional upgrade and customization. The manufacturer box will be opened by our engineers for customizing and testing. Defects & blemishes are significantly reduced by our in depth inspection & testing.\n\n \n\nProcessor: Intel Core i5-10300H 10th Gen, 2.50 GHz base frequency, up to 4.50 GHz with Intel Turbo Boost Technology\n\nGraphics: NVIDIA® GeForce® GTX 1650 Max-Q 4GB GDDR6\n\nOperating system: Windows 10 Home 64-bit\n\nMemory: 16GB DDR4 SDRAM\n\nHard Drive: 1TB SSD\n\nOptical Drive: No\n\nDisplay: 15.6\" FHD (1920*1080), IPS-Level 60Hz 45%NTSC Thin Bezel\n\nTouchscreen: No\n\nBacklit Keyboard: Single backlight with Anti-Ghost key+ silver lining\n\nInternet Connectivity: Ethernet, Wi-Fi\n\nWireless Networking: Intel Wi-Fi 6 AX201(2*2 ax)\n\nAudio: Nahimic 3 / Hi-Res Audio\n\nBuilt-in HD Webcam: Yes\n\nPorts: 1 USB 3.1 Gen 1 Type-C, 3 USB 3.2 Gen 1 Type-A, 1 HDMI, 1 RTL8111HS-CG, 1 Audio Input, 1 Audio Output,\n\nColor: Black\n\nBattery type: 3 cell (51Whr)\n\nDimensions L x W x H (inches): 14.13\"x9.99\"x0.85\"\n\nWeight: 4.10 lbs",
			"reviews": {
				"customerProfileNames": [
					"A.D.M",
					"StephenM.",
					"AndrePadilla",
					"RonaldoLouis",
					"JairAntonioMedina",
					"Eric",
					"JessicaAudsley",
					"PatrickChavez"
				],
				"customerProfilePictures": [
					"https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif"
				],
				"customerRatings": [
					"5.0 out of 5 stars",
					"5.0 out of 5 stars",
					"5.0 out of 5 stars",
					"5.0 out of 5 stars",
					"5.0 out of 5 stars",
					"5.0 out of 5 stars",
					"1.0 out of 5 stars",
					"3.0 out of 5 stars"
				],
				"customerReviewTitles": [
					"Microsoft 365 Family | Premium Office Apps | Up to 6 users | 3 Months Free, Plus 12-Month Subscription\nMicrosoft 365 Family | Premium Offic…",
					"Microsoft 365 Personal | Premium Office Apps | 1 User, Up to 5 Devices | 3 Months Free, Plus 12-Month Subscription\nMicrosoft 365 Personal | Premium Offic…",
					"Save $30 at checkout | Adobe Acrobat Pro DC subscription with auto-renewal\nSave $30 at checkout | Adobe Acroba…",
					"Save 68% on McAfee Total Protection 3 Device\nSave 68% on McAfee Total Protection 3 D…",
					"Excellent, so far",
					"Decent gaming laptop",
					"Amazing and Outstanding graphics.",
					"Very good product",
					"It's a very good to start in gaming",
					"Love it",
					"The computer might be great if I could use it!!",
					"Not very Impressed"
				],
				"customerReviewBodies": [
					"I've just had this laptop for 1 day, but so far it's excellent. It works nice and smooth, very good display, good audio, it doesn't get hot quickly, it's not noisy. It looks very beautiful, too, very good quality.\nThe keyboard is very nice, user friendly.\nThe games I installed on it work perfectly.\nI never had a MSI before, I like it. For now, this is a very good purchase for me.",
					"So far no issues playing this gen games, I also do some animation on it with no issues. Very happy with it 2 months in.",
					"Awesome graphics, cool red light up keyboard, enough space for many games, very fast, perfect for gaming and work. It can play literally every game on Steam smoothly.",
					"Fastest than my previous",
					"It's very good only the battery life but on the rest it's very good",
					"Love the computer just has a short battery life",
					"S",
					"The display is so dark I had to adjust the Brightness to 80% and it still could be Brighter.",
					"Es rápida, no da problemas con software pesado, pantalla chida, a veces da lata con el wifi",
					""
				]
			}
		},
		{
			"id": "nxv9HMo",
			"title": "ASUS TUF FX706 VR Ready Gaming Laptop, 17.3\" 144Hz FHD, Intel 11th Gen i5-11260H 6-Core Processor, NVIDIA GeForce RTX 3050, 16GB DDR4 RAM, 1TB PCIe SSD, RGB Backlit KB, Win10 + Microfiber Cloth",
			"price": "$949.99",
			"image": "https://m.media-amazon.com/images/I/81GfvoGyPYL._AC_SX355_.jpg",
			"description": "Computers sold with professional upgrade and customization. The manufacturer box will be opened by our engineers for customizing and testing. Defects & blemishes are significantly reduced by our in depth inspection & testing.\n\n \n\nProcessor: Intel Core i5-11260H 2.60GHz Processor (11th Gen, upto 4.4 GHz, 12MB Cache, 6-Cores)\n\nGraphics:NVIDIA RTX 3050 Ti 4GB GDDR6 Dedicated Graphics,\n\nOperating system:Windows 10 Home-64 Operating System\n\nMemory: 16GB DDR4 SDRAM\n\nHard Drive: 1TB PCIe SSD\n\nOptical Drive: No\n\nDisplay: 17.3\"\" Full HD (1920x1080) 144Hz Refresh Rate 16:9 IPS Display\n\nNonTouch screen: \n\nBluetooth: Bluetooth 5.2\n\nWLAN Connectivity: 802.11ax Wifi, Bluetooth 5.2, Ethernet LAN (RJ-45)\n\nAudio: HD Audio with Stereo Speakers\n\nKeyboard: Full-size Black RGB Backlit Keyboard\n\nBuilt-in HD Webcam: 720p HD Webcam\n\nPorts: 3 USB 3.2 Gen1, HDMI (upto 4K(3840 x 2160) at 60Hz), Thunderbolt 4 (Type-C), Headphone/Microphone Combo Jack\n\nColor: Eclipse Gray\n\nBattery: 180W Power Supply, 3-Cell 48 WHr Battery\n\nDimensions L x W x H (inches): 15.8\"\" x 10.5\"\" x 1.02\"\"\n\nWeight: 5.09 lbs",
			"reviews": {
				"customerProfileNames": [
					"JoseEduardoGomezGuevara",
					"LAFenwick",
					"DavidWilson",
					"YisselR",
					"Anthony",
					"RodrigoRojasChavarra",
					"PabloLeal",
					"DPH"
				],
				"customerProfilePictures": [
					"https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif"
				],
				"customerRatings": [
					"5.0 out of 5 stars",
					"5.0 out of 5 stars",
					"5.0 out of 5 stars",
					"5.0 out of 5 stars",
					"5.0 out of 5 stars",
					"5.0 out of 5 stars",
					"5.0 out of 5 stars",
					"5.0 out of 5 stars"
				],
				"customerReviewTitles": [
					"Microsoft 365 Family | Premium Office Apps | Up to 6 users | 3 Months Free, Plus 12-Month Subscription\nMicrosoft 365 Family | Premium Office Apps | Up…",
					"Microsoft 365 Personal | Premium Office Apps | 1 User, Up to 5 Devices | 3 Months Free, Plus 12-Month Subscription\nMicrosoft 365 Personal | Premium Office…",
					"Save $30 at checkout | Adobe Acrobat Pro DC subscription with auto-renewal\nSave $30 at checkout | Adobe Acrobat Pro DC…",
					"Save 68% on McAfee Total Protection 3 Device\nSave 68% on McAfee Total Protection 3 Devi…",
					"Muy bueno",
					"",
					"Exactly what I needed, absolutely perfect.",
					"It has great performance and satisfying visuals",
					"Muy buena compra",
					"",
					"NO GPU!!!! - Resolved",
					"Excelente compra la recomiendo 100%",
					"",
					"Entrega Rápida y eficaz",
					"",
					"Great laptop."
				],
				"customerReviewBodies": [
					"Yo compre este portatil principalmente para edicion, hasta el dia de Hoy me ha ido muy bien con el.\nEl portatil tiene 3 Modos: Silencioso, Equilibrado y Turbo, este ultimo se obtiene conectado el cargador.\nEn cuanto al modo silenciosos y Equilibrado en Edicion de video, el rendimiento podria mejorar, sin embargo con el modo turbo se aprovecha muchisimo mejor todos los componentes de la Portatil, esto tambien aplicaria para juegos, van super fluidos.\nEn cuanto a su bateria, este portatil no esta diseñado para estar desconectado del cargador mucho tiempo, ya que solo dura unas 2 horas sin conexion y luego hay que cargarlo de nuevo, siendo un producto Gamer es normal que no este diseñado para esto ya que los juegos hoy en dia necesitan de muchos recursos, la mejor forma de disfrutar de el es estando en la mesa y tenerlo conectado.\nEl portatil en general esta muy bien para tareas pesadas y estresantes de renderizado, muy recomendado.",
					"",
					"Spectacular gaming laptop. It looks gorgeous and well-made and handles all tasks with speed and ease. I love asus products and this was no different. It is great for intensive video editing, which is mostly what I use it for. However it has handled other tasks extremely well. I love this laptop, it was exactly what I needed and has been a very reliable partner to increase my productivity as its rendering speeds are great. Its connectivity is amazing and I love the design choices personally. The RGB light up keyboard is also really nice. The keyboard is solid with no flex, the touchpad is great and overall its very good qaulity. Im so happy I decided to get this model, it truly is a really good gaming machine.",
					"I enjoy it’s diversity and flexibility in configuring it for work and play. I am really satisfied with the performance.",
					"Hasta ahora la resolucion de la pantalla es muy buena, buen funcionamiento y muy rapida",
					"",
					"There is no GPU recognized on this device, can't open it without voiding warranty. Now to deal with customer service... will update.\n\nCustomer service was great. Fast, quick and no hassle.\n\nThere was a GPU, it is believed that during shipping the jostling about unseated the GPU from the motherboard (makes sense and is a very logical theory) and isn't a normal thing to have happen.\n\nReplacement works perfect and considering how well customer service handled the issue, we purchased a 2nd one.",
					"Procesador muy rápido, alto desempeño",
					"",
					"Producto excelente llegó tal cual las fotos y el tiempo de entrega es lo mejor",
					"",
					"Have had for a month so far. Has great speed and quiet operation. Good bang for the buck. Will update in the future.",
					"Delivery was pretty quick, very happy the purchase. Would have given 5 stars if the battery life was at least half decent."
				]
			}
		},
		{
			"id": "A2dQb3W",
			"title": "Alienware M15 R6 Gaming Laptop - 15.6-inch FHD (1920 x 1080) 1ms 360Hz Display, Core i7-11800H, 32GB DDR4 RAM, 1TB SSD, NVIDIA RTX 3070 8GB Graphics, Windows 11 Home - Black",
			"price": "$1,949.99",
			"image": "https://m.media-amazon.com/images/I/71J1lHBTo3L._AC_SY355_.jpg",
			"description": "Alienware gaming laptops are engineered with advanced performance for all gamers. The Alienware m15 R6 is designed with 11th generation Intel Core i7-11800H processors. This gaming laptop offers smoother gameplay during high-speed action thanks to NVIDIA G-SYNC technology that synchronizes your display’s refresh rate with the performance your graphics card is capable of—on the 360Hz FHD (1920 x 1080) resolution display. Each m15 R6 is made with low blue light technology that makes it easier on the eyes without harming image quality giving you confidence to game for hours on end. Dual fans pull in cool air from the top and bottom vents, and exhales exhaust out the left, right, and rear vents for optimal cooling of the core components.",
			"reviews": {
				"customerProfileNames": [
					"Amby",
					"JuanSmith",
					"gary",
					"MKirksey",
					"TrentonCowmann",
					"ParrishS",
					"TraceyA.",
					"micheal"
				],
				"customerProfilePictures": [
					"https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif"
				],
				"customerRatings": [
					"5.0 out of 5 stars",
					"5.0 out of 5 stars",
					"5.0 out of 5 stars",
					"4.0 out of 5 stars",
					"5.0 out of 5 stars",
					"5.0 out of 5 stars",
					"5.0 out of 5 stars",
					"1.0 out of 5 stars"
				],
				"customerReviewTitles": [
					"Microsoft 365 Family | Premium Office Apps | Up to 6 users | 3 Months Free, Plus 12-Month Subscription\nMicrosoft 365 Family | Premium Offic…",
					"Microsoft 365 Personal | Premium Office Apps | 1 User, Up to 5 Devices | 3 Months Free, Plus 12-Month Subscription\nMicrosoft 365 Personal | Premium Offic…",
					"Save $30 at checkout | Adobe Acrobat Pro DC subscription with auto-renewal\nSave $30 at checkout | Adobe Acroba…",
					"Norton 360 Deluxe 2022 - Antivirus\nNorton 360 Deluxe 2022 - Antivirus",
					"Good for a first gaming laptop!",
					"Busted",
					"Alienware has gotten better admit it biggest bang for your buck thats not talked about enough",
					"Great laptop - No thermal issues",
					"Its a Hardcore Gaming Laptop",
					"Great for playing bff 2042",
					"Very good quality laptop !",
					"This laptop is complete garbage"
				],
				"customerReviewBodies": [
					"This is the first proper gaming laptop I've bought, and it is a major upgrade! Everything feels so fast, especially games. I've had it for up to a month now and it's doing great.\n\nOnly downside was a hole in the shipping box it came in, but otherwise everything else was undamaged.",
					"Bussing",
					"Runs 60fps on most games if not more only problem is the laptop overheats and gets pretty hot when using on any game maybe thats due to the cooling fans in the description idk its just gets loud performs better than i would ever expect from a gaming laptop GOOD JOB ALIENWARE keep in mind i got the 3070 model which runs great there is a 3080 model.",
					"I have several gaming systems and this is my second Alienware laptop. The thermals are good on this machine. It does get loud just like any other gaming system and is actually quieter and tamer than my MSI Stealth. Be careful when buying/upgrading the RAM. The new bios update does not like 1.35volt ram that you would get with Corsair Vengence etc. XMP profile didn't help and actually wouldn't boot when enabled. Dell support was not familiar with the new bios update and was no help and wouldn't assist since the RAM wasn't purchased from Dell. It will downgrade from 3200mhz to 2666. If you want native 3200mhz, get 1.20 volt ram modules. I have the basic Crucial 3200 and they are no issue. There is an extra NVMe slot. I installed a 2TB module with no issues. (idk why some specs say 1TB supported). I have mine connected to a 34\" 4k MSI monitor.",
					"Its a hardcore gaming laptop so battery life is pretty much non existent, but you good aslong as you have a plug in nearby.",
					"Battery life some what ok not the best. Cam quality somewhat ok and the screen quality is bad ass.",
					"Very good quality and fast shipment",
					"Where do I start? From day one after going through the typical BS updating setting things to the way I like things all the jazz. This pc has froze on me over a dozen times in 6 days. Literally can be anything looking through photos? Crash force shut down. Trying to edit videos? Crash force shut down. Trying to watch YouTube? Crash force shut down. Alienware command center updating? Crash force shut down. This thing is louder then a fighter jet taking off on the run way. This is the worse experience I have ever had with a 2000 dollar paper weight. Alienware claims they are the top in the industry what a joke of a claim that is. I wouldn’t recommend to is laptop to my worse enemy my iPhone 12 can process faster then this thing and it DOES NOT CRASH this thing is going back first thing tomorrow morning. Do your self a favor and get the newest iPad which can do everything this thing does but better absolutely unacceptable\n\nEDIT******\nAlthough everything I said previous was true but I believe I found the issue. After hours of research I noticed a reoccurring theme the alien ware command center I believe is what was causing all the issues I was having. I did a fresh reinstall of windows and did NOT reinstall the AWCC and since then I have not had any issues knock on wood. Honestly it’s a shame because the AWCC actually has very many cool features but if it’s going cause the rest of the applications I use to malfunction I will delete it 10/10 times. For such an expensive laptop by a company who claims to be the best In the industry the fact they can’t make an app that works as it’s suppose to is enough to make me not buy Alienware again. I will say this if you buy this laptop getting a cooling pad is essential. ALSO I will say I have downloaded WOW and it runs it flawlessly and it looks amazing. My only complaint is with the AWCC but this is a solid gaming laptop IMO for the price."
				]
			}
		},
		{
			"id": "xSJxhLe",
			"title": "GIGABYTE G5 KD - 15.6\" FHD 144Hz, Intel Core i5-11400H, NVIDIA GeForce RTX 3060 Laptop GPU 6GB GDDR6, 16GB Memory, 512GB SSD, Win11 Home, Gaming Laptop (G5 KD-52US123SO)",
			"price": "$899.00",
			"image": "https://m.media-amazon.com/images/I/71dwPztbmGS._AC_SX355_.jpg",
			"description": "NVIDIA GeForce RTX 3060 Laptop GPU 6GB GDDR6 , Boost Clock 1485 Mhz & Max Graphics Power of 75W, NVIDIA DLSS for groundbreaking AI rendering, 11th Gen Intel Core i5-11400H Processor (2.7GHz~4.5GHz), 16GB RAM (64GB Max), Gen4 512GB SSD, 15.6\" Thin Bezel FHD 1920x1080 IPS-level ​Anti-glare Display LCD (144Hz), Windows 11 Home, 14.21 (W) x 10.15 (D) x 1.09(H) inch.",
			"reviews": {
				"customerProfileNames": [
					"IgnacioAndrésCerpaAraya",
					"Hala",
					"ShaynaMorrison",
					"JacoboGonzalez",
					"dubdee",
					"Ricky"
				],
				"customerProfilePictures": [
					"https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif"
				],
				"customerRatings": [
					"5.0 out of 5 stars",
					"5.0 out of 5 stars",
					"4.0 out of 5 stars",
					"4.0 out of 5 stars",
					"4.0 out of 5 stars",
					"2.0 out of 5 stars"
				],
				"customerReviewTitles": [
					"Microsoft 365 Family | Premium Office Apps | Up to 6 users | 3 Months Free, Plus 12-Month Subscription\nMicrosoft 365 Family | Premium Office Apps | Up…",
					"Microsoft 365 Personal | Premium Office Apps | 1 User, Up to 5 Devices | 3 Months Free, Plus 12-Month Subscription\nMicrosoft 365 Personal | Premium Office…",
					"Save $30 at checkout | Adobe Acrobat Pro DC subscription with auto-renewal\nSave $30 at checkout | Adobe Acrobat Pro DC…",
					"Save 68% on McAfee Total Protection 3 Device\nSave 68% on McAfee Total Protection 3 Devi…",
					"Excelent Laptop",
					"Best budget friendly laptop!",
					"Crashes & Game Performance",
					"Great budget gaming laptop",
					"good specs for the price, downside is fan noise.",
					"Overheating"
				],
				"customerReviewBodies": [
					"If you need a gaming laptop that is at a decent price and incredible performance for video games, this is yours and don't think twice.\n\nConcretely:\n\n- Expansion capacity up to 6tb\n- 144 refresh rate\n- The gpu is 105 Watts.\nI have had it for 1 month now and its incredible, I think you can even stream with it. I have seen the temperatures and everything is in order. Perhaps the only but (for me) are the fans that sound a lot, but they fulfill their function of cooling, be careful with that. In any case, you put on your headphones to play and you no longer hear anything.\n\namazing laptop.",
					"Best budget friendly laptop. Doesn’t over heat at all I have over clocked everything and it’s still give me 50-40 and 60-55\nI really recommend this laptop",
					"So, I had this laptop for exactly a week at the time of writing this. Everything about the laptop is good for the price and it's undisputable. I've seen some people say theirs came with windows 10 and others with 11. Mine came with Windows 11 and it seems pretty good. Games run fine of course but do not expect RTX 3070 - 3090+ levels of performance. I've been playing Apex Legends just fine without turning any settings down and maintain over 100 fps at 1080p. The laptop screen itself is pretty nice but I would recommend using an external monitor for better game performance and of course better screen real estate but it is 100% not needed. I have not tested battery life outside of it being plugged but given the fact that it's a gaming laptop I would advise to keep the included charger around. Now my ONE and only issue so far is that I've had two major crashes on the laptop while playing a game and I've only had it for 7 days. The screen will glitch out and make this annoying static sound for maybe 7 seconds and go black, then get a blue screen indicating something went wrong with the PC, then restart itself. Now, I'm not sure what causes these specifically I just know that it can happen for more than one reason. Nevertheless, it shouldn't be happening AT ALL given it's a brand new laptop. So that's something maybe to keep in mind when it comes to extensive use in a program that you could lose a lot of progress in. I will be returning this Laptop if it continues to crash for no reason. Overall, this laptop is good and better than my previous one, and would have received a 5 star rating from me if I wasn't experiencing these huge crashes so early on into my use of this laptop.",
					"Great budget laptop for someone who doesn't need to use it away from home, I use it with a second monitor and it runs great in videogames like RDR2, Elden ring, etc. and in design software (Altium designer, photoshop, AutoCAD). The only complaint I have about the computer is the battery, I haven't tried it in games yet but when I'm using Altium designer it goes from 100% to 10% in about an hour and a half (and no dual monitor connected).\nThe screen is nice, you don't really notice the lack of RGBs fidelity unless you work with photo or video editing.\nI recommend using an external speaker as this one is VERY bad (I don't complain because I never use it, but someone might).\nSo in conclussion, I recommend this laptop if you're going to use it almost as a desktop PC, with the benefits of being able to transport it easily.",
					"J",
					"It overheats very easily even on the startup screen it was around 87c",
					" No me puedo quejar por el precio, obtuve oferta por tiempo limitado a 20k pesos por una la laptop con 3060... Fue una muy buena oferta sin embargo soy sincero y aquí van pros y contras:\n\nPantalla a 144 con Marcos muy pequeños.\nCapaz de mover juegos triple AAA.\nOpción para 2 m.2 y un 2.5\" (por cierto el puerto 4.0 que tiene es el que va ocupado por el m.2 de fabrica, mismo que tiene velocidad lectura de 5300 y escritura dió 3800, básicamente es un hiper x).\nEl sonido es muy decente para el laptop sin embargo si es mejor tener unas bocinas.\nYa tiene dos módulos de 8gb corriendo a 3200 por lo que es muy suficiente.\nTiene opción de colocar Audífonos con micrófono en un 3.5 o si lo prefieres audífonos y micrófono por separado así no se necesitan adaptadores .\nNo es tan grande como otros equipos gamer.\nSí aprovechan la oferta no hay mejor calidad precio.\n\nContras:\nBatería de muy corta duración sin embargo por si quieres que sea portable es a tener en cuenta.\nDemasiado ruidosa, no tiene altas temperaturas por qué lo compensa subiendo los ventiladores a velocidades mas altas por lo que con tareas sencillas como instalar, descargar, o el estar en menú de un juego el sonido incrementa muchísimo pero tolerable.\nSolo tiene 3 rejillas de ventilación, al desarmar me percató que la ventilación simulada es la que se encuentra atrás a al derecha por qué va ocupada por la batería.\nEn Internet mostraba que era compatible con nahimic audio, sin embargo al descargar dice que el equipo no es compatible, posteriormente su página actualizo y mostró que tiene DTS.\nTiene puerto USB tipo C en la parte trasera, para mí hubiese sido mejor que se colocará en los laterales.",
					"",
					"Es una excelente laptop, no es perfecta pero por el precio no se puede pedir más.\n\nLa tarjeta de video junto al procesador hace un buen trabajo en videojuegos. La probé con Elden Ring y puedo jugar a 2k a 60 fps con todo al máximo.\n\nSi tiene sus contras como el audio de la bocina es bajo y malo.\nTambién tiene mucho ruido de los abanicos pero para mí es algo normal.\n\nEn resumen si estas buscando una laptop con buen rendimiento y buenas prestaciones, no vas a encontrar otra más barata por lo menos a la fecha de hoy.",
					"",
					"funciona bastante bien para juegos, lo único malo que tiene y por eso 3 estrellas, son las fugas de luz en pantallas negras, pero vi muchos review y leí sobre el asunto y parece ser que todos los equipos sale con ese \"defecto\" de ahí a mas funciona excelente con colores se ve muy bien la imagen y no hay ninguna queja del material se siente calidad decente, no premium pero decente, otro detalle que también le encontré, es el botón de encendido no es muy sensible y le debes oprimir con algo de fuerza, creo que durara poco pero espero que funcione bien unos cuantos años sin dar problema, se puede expandir hasta 64 gb la ram, tiene 2 slot para m.2 uno de 3 y 4ta generación, y tiene un slot para un disco 2.5 a 7mm, de momento la update la ram de los 16 originales que vienen en 2 modulos lo cambie por 2 de 16 para 32gb funciona muy bien, ahora que salga de gasto ire por un hdd de 2tb y un m.2 de 1tb, la quiero para respaldos del trabajo y para jugar en mis tiempos libres :)",
					"",
					"Gran equipo con excelente relación costo/beneficio.\nPros:\n1. Tiene todos los componentes de hardware anunciados que corresponden a una computadora de gama media/alta por un precio bastante bajo.\n2. No hay problemas de compatibilidad entre windows 11 y el drivers de la GPU RTX3060\n3. Buena disipación térmica, usando el panel de NVIDIA se muestra que la temperatura de la GPU nunca ha rebasado los 85°C con juego de nueva generación.\n4. Soporta juegos de nueva generación con calidad ULTRA a 1080p con más de 60 fps.\n\nContras:\n1. El audio es de calidad baja, se arregla conectando altavoces externos o audifonos.\n2. El sonido de los ventiladores enfriadores es muy alto.\n3. El plástico de cubiera superior es muy endeble, no se ve resistente como para apilar cosas encima de la laptop cerrada.\n4. El material de las cubiertas es muy suceptible a la grasa de las manos.\n5. La bateria es muy pequeña, dura máximo 3 horas usando office y 1:30 hrs jugando.\n\nNota: windows bloquea algunos juegos a 30 fps, pero eso se arregla facilmente en el panel de control de NVIDIA.",
					"",
					"No hay queja alguna con esta computadora, yo la compre en oferta por $21,128 MXN\n(ya incluido el precio de aduana) y en México yo no he visto una laptop con una RTX 3060 por ese precio, las he visto arriba de los $30,000. Llegó en perfectas condiciones. Se puede expandir su memoria hasta 6 TB, 2 ranuras para ssd m.2 y una de sata 2.5¨. Muy fácil de hacer la expansión de la memoria. Además, a comparación de otras el cambio de la pasta térmica en CPU y GPU es muy sencillo, pueden buscar videos de como hacerlo en este modelo. Considero que esto de la pasta térmica es un gran punto a favor porque generalmente hacer eso en una laptop implica desarmar muchas cosas previamente, en este modelo no. Además, la velocidad del ssd m.2 que trae no esta nada mal, anexo la imagen. Otro punto a favor es que trae un software que permite ajustar la velocidad de los ventiladores, cosa que no podía hacer en mi anterior laptop gamer de dell. Trae windows 11 ya instalado y la versión de la BIOS es la FB01, para actualizar a la versión más reciente la FB05 no trae un software que permita hacerlo de manera automatizada, como suele ocurrir en las laptop, hay que descargar en la página de la compañia la versión más reciente de la BIOS y al descomprimir el archivo, dentro de lo que trae, está un launcher que permite actualizar. No hay una opción en el teclado de FnLock para no tener que estar apretando Fn+F1-12 por ejemplo para subir el volumen o cambiar el brillo, tampoco en la bios está la opción de cambiar esto, pero eso se arregla fácil con un programa llamado \"fnlock\", el cual ya permite utilizar las teclas F1-12 para volumen, brillo sin tener que estar apretando también \"Fn\".",
					""
				]
			}
		},
		{
			"id": "0MbbhVB",
			"title": "ASUS TUF Gaming F15 Gaming Laptop, 15.6” 144Hz FHD IPS-Type Display, Intel Core i5-10300H Processor, GeForce GTX 1650, 8GB DDR4 RAM, 512GB PCIe SSD, Wi-Fi 6, Windows 11 Home, FX506LH-AS51",
			"price": "$769.99",
			"image": "https://m.media-amazon.com/images/I/81OiT2-NoeL._AC_SY355_.jpg",
			"description": "ASUS TUF Gaming F15 is a powerful Windows 10 gaming laptop that combines gaming performance with up to a narrow bezel IPS-type panel and an extended lifespan, thanks to its patented Anti-Dust Cooling (ADC) system. Equipped with NVIDIA GeForce graphics, 11th Generation Intel Core processor, and solid-state storage, the F15 is able to play the latest games and multitask with ease. To top it all off, it’s backlit gaming keyboard is rated at 20-million keystroke durability.",
			"reviews": {
				"customerProfileNames": [
					"RobertaTaylor",
					"Brent",
					"ClientedeAmazon",
					"Pedro",
					"JuanLesPablo",
					"Aperson:/",
					"HopeDonnellan",
					"Alex"
				],
				"customerProfilePictures": [
					"https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif"
				],
				"customerRatings": [
					"5.0 out of 5 stars",
					"5.0 out of 5 stars",
					"5.0 out of 5 stars",
					"5.0 out of 5 stars",
					"5.0 out of 5 stars",
					"1.0 out of 5 stars",
					"1.0 out of 5 stars",
					"3.0 out of 5 stars"
				],
				"customerReviewTitles": [
					"Microsoft 365 Family | Premium Office Apps | Up to 6 users | 3 Months Free, Plus 12-Month Subscription\nMicrosoft 365 Family | Premium Offic…",
					"Microsoft 365 Personal | Premium Office Apps | 1 User, Up to 5 Devices | 3 Months Free, Plus 12-Month Subscription\nMicrosoft 365 Personal | Premium Offic…",
					"Save $30 at checkout | Adobe Acrobat Pro DC subscription with auto-renewal\nSave $30 at checkout | Adobe Acroba…",
					"Norton 360 Deluxe 2022 - Antivirus\nNorton 360 Deluxe 2022 - Antivirus",
					"Perfect for me!",
					"BEST BUDGET LAPTOP",
					"Nice",
					"Exelente calidad precio.. queremos Amazon en ecuador 🥲",
					"",
					"Excelente pc",
					"",
					"Poor quality laptop. Not happy",
					"Would be a decent computer if not for a faulty Wi-fi 6 adapter",
					"Worth it, for entry but could use more ram"
				],
				"customerReviewBodies": [
					"Item will come repackaged.",
					"For clarity, this review is for the 15.6\" GTX 1650 version, not the 17.3\" GTX 1650Ti version.\n\nPositives!\n\nThis laptop is perfect for me and what I need right now. I am currently in between homes, over the road a lot for work and have all of my stuff in storage, including my main PC, so I bought a laptop so I could continue doing work and gaming while on the go.\nThis laptop is not top of the line by any means, it's no $2,000 laptop with an RTX 3080 or anything like that, but if you want a good mid-range laptop that can get 60FPS on some everyday gaming, this is as good as mid-range laptops get in my opinion.\nEven on my main, much beefier PC, I've never been one to crank up the settings and enable raytracing, 4k etc. I'm more of a framerate type of person and this laptop does a great job getting high frame rates if you're willing to adjust the settings accordingly. The screen is a clean 1920x1080, lovely quality (though the brightness isn't that great), comes with an NVME 512GB hard drive which is not a bad start if you're not trying to install a Call of Duty game with 100gb patches, but that leads into another glowing positive - this thing is upgradeable and I love it! One of the hardest things about picking a laptop for me is the eventual obsolescence, so in the few times I've bought a laptop in my life, I prefer ones you can upgrade which will allow you to skirt by the expected lifespan for a bit longer.\nOverall, my complaints a few, but I will point them out.\n\nNegatives!\nHonestly, 8GB of RAM is... well, it's not enough for any modern PC that you want to do more than browse the internet, but this negative hardly counts against it because once again, it is upgradeable! I added 32GB to mine and it runs like a dream now. The fact it ships with such low RAM is forgivable because that's probably why the price of entry is as low as it is.\nI also had a few problems with the Wi-Fi antenna at first, which I know is not unique to my laptop, but after a few online searches, troubleshooting and settings adjustments, it hasn't dropped the connection for a couple of days, so I think I'm over that hump.\nMy last complaint and honestly maybe the only one that could be considered \"major\" is the screen brightness. To be clear, I'm talking about BRIGHTNESS, not QUALITY. The resolution is wonderful and the screen is a clear HD experience, but keep this thing away from the sunlight if you want to see it easily... I took it to the park one day and while I could see the screen, I felt like I was squinting, and I had to change my preferred dark mode to light mode just to see the Windows UI better. Once again, I consider this a minor gripe and won't take a star off, because if you're using this thing indoors or in appropriate shade, the screen is beautiful.\n\nOverall, if you're looking for an affordable, upgradeable, laptop suited for everyday gaming (as long as you're not trying to push max settings, 4k or raytracing), you won't be disappointed!",
					"PROs:\nI honestly play old school RuneScape and now a days the game has been upgraded to High def. The cpu does get hot running it but I also did buy a cooler for the laptop other than that I normally play using GPU plug-in on RUNELITE. Runs perfectly fine. Quiet too. But once you tweak with the asus armory you can play any game how you like. IMO FPS is best.\n\nCONs:\nEh, nothing really it’s a budget gaming laptop that you can upgrade…\n\nBUT SURE WORTH It",
					"Good",
					"Moderna y práctica",
					"",
					"Buena calidad y excelentes gráficos aunque la batería se agota rápido sin el cargador",
					"",
					"I bought this laptop for work and when it came in, the volume buttons didnt work, the brightness buttons didnt work, i couldnt acess the settings panel through the windows tab. I couldnt even change the rbg lights on the keyboard which are are supposed to be able to with a REAL one. It's a waste of your time to get one of these. They deleted my old review because they said it went against community guidelines but it didnt at all.",
					"There are a lot of things that are pretty decent with this computer. It's relatively fast, it's a little bulkier and feels more durable than my last laptop (and as a person prone to knocking their laptop into the desk whenever I take it out of its bag, this is wonderful), and the keyboard feels really nice to type on. The screen is easier on the eyes when I have long days at work than my previous laptop, since it seems to emit more red light. The fan makes the computer sound like it's taking off when it comes on, but it doesn't last long and it's very quiet when doing normal work or college tasks - typically only comes on when loading a game or downloading.\n\nHowever, the Wi-Fi adapter has been a pain since I got it. Unable to play any games without being disconnected shortly after the loading screen. Google docs is continuously \"reconnecting.\" I couldn't stream a live event (that I had to take notes on for work) without buffering every 3-10 seconds, however other devices worked perfectly fine with the same internet connection. I tried the internet at my work, my house, and at my father's house, same results. I have spent a long while trying to figure out how to troubleshoot, update the driver, etc. for the adapter (MediaTek Wi-Fi 6 MT7921) on my own (granted, I have very little computer knowledge), stumbled across multiple forums that had the same issue with it, and now I'm getting help from my second IT support, and still have yet to resolve the problem.\n\nIt seems that you may get lucky and not have this issue if you buy this laptop based on other reviews, but if I was able to go back I wouldn't have purchased this one. I would avoid this laptop just in case you end up with the same problem I and some others have had. Hopefully I can get this issue fixed, since I don't have the money to purchase another at the moment, and I very much need it for my job and college (and games on the weekends).",
					"I like it, Only issue is due to low ram amount it may crash during overload. Also MAKE SURE TO UPDATE EVERYTHING! It may be obvious but if you don't it will constantly crash and freeze"
				]
			}
		},
		{
			"id": "fuN6H3j",
			"title": "ASUS TUF Dash 15 (2021) Ultra Slim Gaming Laptop, 15.6” 144Hz FHD, GeForce RTX 3050 Ti, Intel Core i7-11370H, 8GB DDR4, 512GB PCIe NVMe SSD, Wi-Fi 6, Windows 10, Eclipse Grey Color, TUF516PE-AB73",
			"price": "$949.82",
			"image": "https://m.media-amazon.com/images/I/81Tx3MJBkSL._AC_SY355_.jpg",
			"description": "The all-new TUF Dash F15 puts powerful Windows 10 gaming in a super slim chassis. Up to the latest 11th Gen Intel Core CPU and GeForce RTX GPU make gaming smooth on up to a blazing fast 240Hz display. Even at 19.9mm thin, this TUF chassis meets rigorous MIL-STD durability standards, resisting everyday knocks and bumps. Up to 16.6 hours of battery lets you multitask more in a laptop light enough to carry into action anywhere. Free Windows 11 upgrade eligible devices, visit ASUS Windows 11 website for more information.",
			"reviews": {
				"customerProfileNames": [
					"TimothyMcLaughlin",
					"SeanL.",
					"Customer",
					"Customer",
					"Akshar",
					"ShawnB.",
					"Reeds"
				],
				"customerProfilePictures": [
					"https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif",
					"https://images-na.ssl-images-amazon.com/images/S/amazon-avatars-global/7d0ee382-4069-4931-bf0b-3521b2a84e7f._CR0,0,500,500_SX48_.jpg",
					"https://images-na.ssl-images-amazon.com/images/S/amazon-avatars-global/b738a917-cc24-4c26-9e66-1d31b6a67108._CR0,0,375,375_SX48_.jpg"
				],
				"customerRatings": [
					"5.0 out of 5 stars",
					"5.0 out of 5 stars",
					"1.0 out of 5 stars",
					"5.0 out of 5 stars",
					"5.0 out of 5 stars",
					"5.0 out of 5 stars",
					"5.0 out of 5 stars"
				],
				"customerReviewTitles": [
					"Microsoft 365 Family | Premium Office Apps | Up to 6 users | 3 Months Free, Plus 12-Month Subscription\nMicrosoft 365 Family | Premium Offic…",
					"Microsoft 365 Personal | Premium Office Apps | 1 User, Up to 5 Devices | 3 Months Free, Plus 12-Month Subscription\nMicrosoft 365 Personal | Premium Offic…",
					"Save $30 at checkout | Adobe Acrobat Pro DC subscription with auto-renewal\nSave $30 at checkout | Adobe Acroba…",
					"Norton 360 Deluxe 2022 - Antivirus\nNorton 360 Deluxe 2022 - Antivirus",
					"Excellent choice for music recording or production!",
					"Fantastic deal",
					"May contain chemicals that cause cancer. Wash hands after handling.",
					"Great budget friendly labtop.",
					"Great budget laptop",
					"I am blown away with how awesome this laptop is.",
					"High Quality product. For the passionates"
				],
				"customerReviewBodies": [
					"Missing battery charger. Item will come in original packaging. Packaging will be damaged.",
					"I've only had it a day but so far this machine is flawless. Very easy set up even if your not very computer literate. I've had the best performance/longevity with Asus computers throughout my lifetime more than other brands so I do not doubt its performance. I record music and this can definitely handle most of what I need. I do plan upgrading ram just for better plug in performance.\nOverall I do recommend this seller as well, item came two days earlier and perfectly boxed. i will buy from again most definitely.\n****\nThis is an updated review, I’ve had this laptop for almost a year and it’s still a beast. I’ve been using this for music recording, I’m running a Yamaha Modx7, A Native Maschine and an Allen & Heath Zedi10fx through the USB and I can run more than one software synth and the recording software with no problems or memory issues or most importantly, Latency. It runs ASIO drivers a millisecond faster than my MSI GT72 Dominator pro, which is a noticeable difference.\nYes this is a gaming laptop but if you’re a musician looking for a powerful, reliable platform, this laptop is an excellent choice.",
					"I'll make this simple.\n\nPros: Modern, very capable CPU/GPU as of Q3 2021. NVMe included with a second slot for another, boots up in barely five seconds when plugged in. Screen quality and battery life top-notch. USBC charging via Thunderbolt 4 port (among other things). Armoury Crate button on keyboard. Extremely fair price, too.\n\nCons: No 2.5\" drive port that I could see (will correct this review if there is one). Case and NVMe slot bolts on mine were screwed so tightly that I almost stripped them, had to get creative getting some of them off.\n\nNotes: has a second RAM slot, too. Mine came with a single 8GB stick and not two 4GB sticks. Also, this is the first PC I've owned that didn't immediately recognize the second NVMe drive I put in, but it just needed to be manually formatted. Works like a charm with two 512gb drives and 24GB RAM.",
					"This is a quote from the manual. I can understand if there are chemicals inside the device but if I have to wash my hands every time I even \"handle\" it, it is probably not safe. I returned it and wish this warning would have been included in its description as I would not have purchased it. This whole process caused a great inconvenience.",
					"I totally love this labtop I've owned Asus laptops before never ever let me down looks amazing love the lights on the keyboard it does get a little hot but thats normal for gameing labtops and desktop.gameing in general I feel for its price it should last a really long time best part asus offers a product protection plan 1yr free with this new purchase just have to register it online. Highly recommend for budget gaming. Only downs no Webcam no option to upgrade the hard drive so if you want more space you have to get a external hard drive also no optical drive but not to worry about that since I use it primary for games. Things I can work with.",
					"I might update this at a later date if I find something to be good or bad, and please note I am not a professional reviewer, I'm just basing this on how it fits my needs.\nPros:\n-Great deal for the price\n-Extremely portable\n-Great battery\n-Great build quality\n-Great Design\n-Great upgradability for storage and RAM\n-relatively small charger\n\nCons:\n-No Camera\n-Fans can get somewhat loud\n-Only 4GB of vram which might be enough for future games\n-The charging port is in the middle left side of the laptop instead of the top left",
					"Just a few things that I don't like, but I am okay with it. First off, this laptop is that the initial 8 gigs of ram are soldered onto the motherboard. But with that, you still have a empty ram socket that you can use to upgrade your memory size. The 2nd issue is that this laptop only supports NVME SSD drives. I tried to install a M.2 2880 ssd drive and the computer didn't even recognize it at all.\n\nBut now for all the awesome things about this Laptop. 1st off, the price, how can they sell this laptpp for just under 1k. This monster is loaded with all kinds of goodies. The screen is beautiful and also runs at 144hz, making your gaming experience very smooth. The GPU is also a power house for being in a laptop, a 3050 ti with its own dedicated ram. The CPU is blazing fast as well. It loads windows 10 faster then my i9-7900x computer. Everything that I have thrown at it has been very smooth. With this baby, you won't be disappointed at all. If you are needing more memory initially, they also have this same laptop, but with 16gigs of ram for just a little higher price.",
					"I've always been a big fan of Asus. When i dived in to the market for a gaming laptop and looked at other Asus products found out that their pricing is pretty high (probably justified but still high). Weeks of searching later found this and even though i was a little skeptical cause of the 4 core cpu i decided to get this and let me tell you I don't regret. The nvdia 3050i should indeed pair with 6 or 8 core cpu's but for the price it still Ed oes a great job. It may not be super future proof but it's still giving me great performance on most games that came up until 2021. Paired with the Xbox game pass for PC this machine is a solid purchase. Fan is not crazy loud and battery life is excellent. Screen and Trackpad are just fine but you're getting more than you paid for. Recommended.",
					"Me parece que es un producto excelente por la relacion calidad-precio. Me gusta que se puede expandir la memoria RAM y el SSD. Compre una RAM Crucial de 32GB a 3200 Mhz para que sumados den 40 Gb. Con el tiempo pienso expandir el SSD.\nLLego sin problema a MX en solo 3 dias (enviado el lunes y recibido el miercoles por la tarde-noche).",
					"",
					"Después de 3 semanas de uso, definitivamente es la mejor laptop que se puede obtener con respecto a calidad-precio cuando el precio se encontraba a $22,000 o menos. Por los $30,999 actuales estoy casi seguro que se puede encontrar algo mejor.\n\nSiendo una lap gamer, les puedo dar como referencia que corre Warzone, con gráficos bajos (pero sin perder esa sensación de juego de penúltima generación), a 50/60 fps. Probablemente agregando más RAM mejore un poco, pero no gran cosa.\nEl resto de los juegos los corre sin ningún esfuerzo ya que son menos demandantes.\n\nPros:\n- El audio es bueno.\n- La tarjeta gráfica es un gran salto desde las GTX hasta las RTX serie 3000.\n- Contiene 1 slot para agregar más memoria RAM y otro para agregar más almacenamiento (SSD).\n- La pantalla tiene muy buen brillo y es de 144 Hz de refresco.\n- La estética es modesta, pero muy agradable a la vista.\n- Muy buena ventilación para las tarjetas y no tan ruidosa como otras laptops gamer.\n- Tiene WiFi 6 que es un gran boost y plus en México debido a que los modem de los proveedores de internet son malísimos. (Si tienes un router gamer, no notarás mucho la diferencia).\n\nContras:\n- El procesador, a pesar de ser 11a generación, se queda algo corto por ser de sólo 4 núcleos. Hay procesadores de 10a y hasta 9a generación que lo superan.\n- No tiene cámara web (esto es algo más de decisión de cada uno).\n- Es difícil esquivar una de las salidas de aire caliente con el cable de alimentación de corriente, lo que provoca que el cable se caliente por el aire y, a la larga, pudiera dañarlo.",
					"",
					"La laptop funciona excelente!\nFuncionamiento increíble, rtx 3050ti tiene muy buen rendimiento\nLamentablemente la tuve que devolver por qué me llegó con fugas de luz grandes en el lado izquierdo de la pantalla, pero fuera de eso funciona increíble",
					"",
					"el equipo muy bien bastante cumplidor lo recomiendo",
					"",
					"P"
				]
			}
		},
		{
			"id": "HKH0Bjx",
			"title": "MSI Katana GF66 15.6\" 144Hz FHD Gaming Laptop: Intel Core i7-12650H RTX 3050 Ti 16GB 512GB NVMe SSD, Type-C USB 3.2 Gen 1, High-Resolution Audio, Cooler Boost 5, Win11 Home: Black 12UD-436",
			"price": "$999.00",
			"image": "https://m.media-amazon.com/images/I/71oqKpNjHtL._AC_SY355_.jpg",
			"description": "MSI Katana GF66 15.6\" 144Hz FHD Gaming Laptop Intel Core i7-12650H RTX3050TI 16GB 512GBNVMe SSD Win11",
			"reviews": {
				"customerProfileNames": [
					"CarlosAldana",
					"Ramiro",
					"Los",
					"AnaHernández",
					"Robertedwards",
					"Kat3",
					"Enrique",
					"Kassandra"
				],
				"customerProfilePictures": [
					"https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif",
					"https://images-na.ssl-images-amazon.com/images/S/amazon-avatars-global/d6dcf749-b77f-4962-8037-e01dabae7036._CR0,0,500,500_SX48_.jpg",
					"https://images-na.ssl-images-amazon.com/images/S/amazon-avatars-global/54bd0f40-adcb-4f42-be0c-ef0ba6fdf71d._CR0,0,1124,1124_SX48_.jpg"
				],
				"customerRatings": [
					"5.0 out of 5 stars",
					"5.0 out of 5 stars",
					"5.0 out of 5 stars",
					"5.0 out of 5 stars",
					"5.0 out of 5 stars",
					"4.0 out of 5 stars",
					"4.0 out of 5 stars",
					"4.0 out of 5 stars"
				],
				"customerReviewTitles": [
					"Microsoft 365 Family | Premium Office Apps | Up to 6 users | 3 Months Free, Plus 12-Month Subscription\nMicrosoft 365 Family | Premium Office Apps | Up…",
					"Microsoft 365 Personal | Premium Office Apps | 1 User, Up to 5 Devices | 3 Months Free, Plus 12-Month Subscription\nMicrosoft 365 Personal | Premium Office…",
					"Save $30 at checkout | Adobe Acrobat Pro DC subscription with auto-renewal\nSave $30 at checkout | Adobe Acrobat Pro DC…",
					"Save 68% on McAfee Total Protection 3 Device\nSave 68% on McAfee Total Protection 3 Devi…",
					"MSI is quality and performance",
					"Its really good",
					"Great laptop",
					"Excelente precio!",
					"",
					"Amazing",
					"Technical Issue I Figured Out Pretty Quick",
					"MSI LAPTOP GAMER",
					"",
					"faster"
				],
				"customerReviewBodies": [
					"It's my first time to buy MSI, I'm amazed with its build quality and performance is unique.",
					"Its good enough, i mean the battery could be better but the performance is excelent",
					"Fast and just what I need",
					"Excelente precio",
					"",
					"Love it. More than I imagined.",
					"It has a dedicated GPU but it goes through the Intel CPUs built-in gpu. It doesn’t have a mux switch so you can’t get it to directly use the dedicated GPU which is leagues above the Intel GPU. It essentially uses the dedicated GPU to process most of the graphics and sends it to the Intels GPU to let it do the rest. Couldn’t figure out how to get it to really perform that well though at first but after some googling I figured it out. You have to go through several settings in various places and set it to maximum performance. If it’s your first PC it’ll probably be confusing. It’s not the best of the best but it’s pretty good for it’s price.",
					"Muy buena máquina creo que pudo mejorar el chasis anti rayadura y más puertos USB 3.0",
					"",
					"i had a similar one , i think this had the rgb keyboard but no , had a red keyboard once , faster delivery",
					"Muy buen producto llego en excelentes condiciones y funciona muy bien, el unico detalle de mi parte es que cuanto mas angulo abras la pantalla esta pegar con la base donde la tengas puesta.",
					"",
					"Funciona muy bien, uso android estudio y sin problemas, solo para que mejore compren una memoria ram extra y sin problemas tienes una computadora para bastante tiempo, lo único malo es que no dura la batería pero eso es por todo lo que tiene integrado.",
					"",
					"Tal cual como viene en la descripcion. Muy buena marca!",
					"",
					"Me gusto mucho para jugar videojuegos",
					""
				]
			}
		},
		{
			"id": "bElfyD7",
			"title": "ASUS TUF Dash 15 (2022) Gaming Laptop, 15.6” 144Hz FHD Display, Intel Core i7-12650H, GeForce RTX 3060, 16GB DDR5, 512GB SSD, Thunderbolt 4, Thunderbolt 4, Windows 11 Home, Off Black, FX517ZM-AS73",
			"price": "$1,269.97",
			"image": "https://m.media-amazon.com/images/I/71AGOX9MORL._AC_SY355_.jpg",
			"description": "Jump right into the action with the TUF Dash 15 gaming laptop. Stream and multitask with ease thanks to a 12th Gen Intel Core i7-12650 CPU and blisteringly fast 4800MHz DDR5 RAM on Windows 11. Leverage the full gaming performance of the GeForce RTX 3060 GPU with a dedicated MUX Switch.",
			"reviews": {
				"customerProfileNames": [
					"ElonMusk",
					"Abe",
					"Edilio",
					"Akash",
					"Customer",
					"JorgeMauricioRaudalesGaleas",
					"Justin",
					"YamiShayan"
				],
				"customerProfilePictures": [
					"https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif"
				],
				"customerRatings": [
					"5.0 out of 5 stars",
					"5.0 out of 5 stars",
					"5.0 out of 5 stars",
					"5.0 out of 5 stars",
					"5.0 out of 5 stars",
					"5.0 out of 5 stars",
					"2.0 out of 5 stars",
					"2.0 out of 5 stars"
				],
				"customerReviewTitles": [
					"Microsoft 365 Family | Premium Office Apps | Up to 6 users | 3 Months Free, Plus 12-Month Subscription\nMicrosoft 365 Family | Premium Offic…",
					"Microsoft 365 Personal | Premium Office Apps | 1 User, Up to 5 Devices | 3 Months Free, Plus 12-Month Subscription\nMicrosoft 365 Personal | Premium Offic…",
					"Save $30 at checkout | Adobe Acrobat Pro DC subscription with auto-renewal\nSave $30 at checkout | Adobe Acroba…",
					"Norton 360 Deluxe 2022 - Antivirus\nNorton 360 Deluxe 2022 - Antivirus",
					"Good buy",
					"It can rival the Rtx 2080 Super Max Q",
					"Good purchase",
					"Overall great value for the money",
					"16g ram rtx 3060",
					"No le tiembla a nada",
					"",
					"Decent laptop but overheats",
					"Scratchy / noise sound !!!"
				],
				"customerReviewBodies": [
					"Minor cosmetic imperfection on bottom or back of item. Item will come in original packaging. Packaging will be damaged.",
					" Coming from a Asus fx505DT I can say this laptop blows it away especially with the new I7 12th gen compared to RYZEN.\nThe boot time to windows was legitimately 2 seconds the fastest computer I’ve had (with video).\nTriple A games you can run on all ultra settings\nI would highly recommend this laptop it’s a great price for what you’re getting, and I’d highly recommend to buy the upper trim model with the I7-12gen and the 16GB of ram it really helps in gaming instead of having just the 4 cores in the other model you get 6 cores plus 4 e cores",
					"Small but powerful, the screen is easy on the eyes till you get into gaming. After playing with the intel graphics command and playing the games again, and changing the colors, contrast, saturations, I was able to get some nice colors with brightness nothing perfect mind it. These are the settings for me, but nothing is the same.\n\nBrightness Enhancement (38 default) +6 All Colors\n\nContrast Enhancement (17 default) +1 All Colors\n\nSaturation (50 default) +27 Vividness of colors on your screen\n\nHopefully it helps with 144hz looking better. 👍",
					"I am satisfied qith this purchase. This computer is powerfull and run all aplications very fast. The quality of materials is excelente it seems to be a durable laptop. The only I would like to be better is about the camera. The video calls looks noisy, but it is ok",
					"Other laptops with same specs cost more. Although this is a little heavier than those, the lower price is a great tradeoff. Charges incredibly fast, but do wish it came with a USB C charging cable instead of a barrel plug since it has thunderbolt 4 port.",
					"This laptop came perfect, no keys missing and no blue screen. It does have a camera. 5 stars.",
					"Bateria durable, y excelente procesador",
					"",
					"Decent computer, I had the i7-12650H with GTX 3060 model. Computer overheats so much even just idling. It got to the point where any sort of heavy load made it inoperable. I had to buy a separate cooling pad just to use the laptop so now I have to carry that thing along as well. Also only have has 500 GB of storage which filled up after 4 games but it’s to be expected (upgradable though).",
					" The left speaker are making scratchy sound. Sound crackling and popping problems, which make me confusing either the issue is from the sound card has an internal fault or it’s required to update the speaker drive !!!. Other than that, it seems to be so good."
				]
			}
		},
		{
			"id": "gBJ9bpg",
			"title": "CHUWI CoreBook Xpro Laptop Computers 15.6'', 8GB RMA 512GB ROM, Windows 10 Laptop, Intel Core i5-8259U, 1920x1080 FHD Display, Webcam | Backlit Keyboard | 2.4G/5G Wi-Fi | BT4.2 | HDMI",
			"price": "$499.89",
			"image": "https://m.media-amazon.com/images/I/71-d3Jwjm-L._AC_SX355_.jpg",
			"description": "About this item\n【Powerful Core i5 Laptop】 CHUWI CoreBook XPro features Intel Core i5-8259U processor which turbo frequency up to 3.8GHz ,powerful operation without lagging make your device runs smoothly . Equipped with 8GB DDR4, 512GB SSD, CoreBook XPro windows 10 laptop can load more tasks in the background.What's more, Lris 655GPU makes it superior in graphics processing.\n【15.6 Inch Accurate Display 】This windows computer come with a 15.6inch FHD Widescreen display, 1920x1080 Resolution, offers you a amazing visual experience.ultra-narrow bezels on 3 sides giving you a unbounded visuals. 16:9 aspect ratio which especially suitable for your daily entertainment.\n【Premium Design】 CoreBook XPro i5 gaming laptop equipped with a full size backlit keyboard , ensuring visibility even in the dark and reduces the possibility of accidental touch which giving you a faster and more convenient typing experience. weighs at only 1.5kg,compactness and portable makes it a preferred computer laptop for business office.\n【Full-featured USB-C Interface】Equipped with a full function USB-C interface to facilitate audio or video data transmission which also supports USB-PD 2.0 fast charging .In addition, CoreBook Xpro core i5 gaming laptop also features many interfaces such as USB-A 3.0*1/ 3.5mm headphone jack/M.2 SSD extension/ Micro- SD, flexible for user to connect peripherals.\n【Longer Battery Life】：CoreBook Xpro windows computer adopts 69.9WH high capacity lithium-ion battery which supports 65W fast charging,excellent system- level power management makes the battery life up to 9 hours enhance your productivity and entertainment(This product comes with 12 months warranty after purchase. If you have any problems about this laptop, please contact seller via amazon )\n› See more product details",
			"reviews": {
				"customerProfileNames": [
					"CarolBurnett",
					"MikeOxLong",
					"@@@Bruins@@@",
					"Jessica"
				],
				"customerProfilePictures": [
					"https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif",
					"https://images-na.ssl-images-amazon.com/images/S/amazon-avatars-global/04856f68-ea7b-46c7-9611-43d9238da5ff._CR62,0,375,375_SX48_.jpg",
					"https://images-na.ssl-images-amazon.com/images/S/amazon-avatars-global/b7fbf249-a6bb-4406-9728-4426202a8ba2._CR83,0,333,333_SX48_.jpg"
				],
				"customerRatings": [
					"5.0 out of 5 stars",
					"5.0 out of 5 stars",
					"5.0 out of 5 stars",
					"5.0 out of 5 stars"
				],
				"customerReviewTitles": [
					"Microsoft 365 Family | Premium Office Apps | Up to 6 users | 3 Months Free, Plus 12-Month Subscription\nMicrosoft 365 Family | Premium Office Apps | Up…",
					"Microsoft 365 Personal | Premium Office Apps | 1 User, Up to 5 Devices | 3 Months Free, Plus 12-Month Subscription\nMicrosoft 365 Personal | Premium Office…",
					"Save $30 at checkout | Adobe Acrobat Pro DC subscription with auto-renewal\nSave $30 at checkout | Adobe Acrobat Pro DC…",
					"Norton 360 Deluxe 2022 - Antivirus\nNorton 360 Deluxe 2022 - Antivirus",
					"A Well-balanced Ultrabook",
					"Super power house",
					"excellent laptop",
					"I am beyond impressed with this laptop"
				],
				"customerReviewBodies": [
					"When I got the book, I was surprised by the IPS screen. I never saw suck a 2K beautiful screen at this price level. Neither HP, Dell, nor Lenovo can provide suck an excellent screen. It is very comfortable to read the news or watch videos on it even under sunlight in the afternoon.\nThe CPU is as same as the one used in the old MacBook (2018), but it can provide enough power for daily use as an Ultrabook. I did not see any lag when I use it for internet surfing and office work.\n8 GB memory is also good enough for office work. But sometimes when I run large data set for analysis, I can feel a bit of RAM shortage. But thanks to the high-speed SSD drive, the virtual memory helps a lot. And there are two RAM slots in the motherboard. It will help the ram expansion if it is necessary for the future.\nThe SSD hard drive is 512GB. Its capacity is twice times bigger than other laptops at this price level. There is enough space for me.\nThe keyboard is also excellent. I almost have the same feeling on it as on my old MacBook. The keys can light up in the dark. I love this keyboard after one month of typing on it.\nHere is what I like\n1. Excellent screen and keyboard,\n2. Fast and large SSD drive,\n3. Lightweight.\nWhat I do not like\n1. Not PD charging.\n2. Only 5-6 hours battery power.\n3. Not for gaming, not for large data analysis.",
					" Do not under estimate this machine because of the photoshopped images. It looks better in person and feels like premium plastic. It really come close to Razer machines because I’ve owned them before. And I won’t forget that premium plastic feelings.\nThis laptop is super light and has the power to handle almost anything. When it comes to processor, The Intel Core i5-8259U processor in the CoreBook XPro provides robust performance without lagging, ensuring that your device functions smoothly. The CoreBook XPro windows 10 laptop has 8GB DDR4 and 512GB SSD, allowing it to run more tasks in the background. Furthermore, the Lris 655GPU improves graphics processing. With this powerhouse, you can do some light gaming without any hiccups.\nAlso with a 15.6-inch Full HD Widescreen display and a 1920x1080 resolution, you'll get an incredible visual experience. Ultra-narrow bezels on three sides provide unrestricted visuals. The 16:9 aspect ratio is ideal for your everyday entertainment. The full-size backlit keyboard on the CoreBook XPro i5 gaming laptop ensures visibility even in the dark and decreases the potential of inadvertent touch, making typing faster and more convenient.\nHow about inputs with such a small and thin laptop? A full-function USB-C interface is included to permit audio or video data transmission, as well as USB-PD 2.0 rapid charging. Furthermore, the CoreBook Xpro core i5 gaming laptop has a variety of ports, including USB-A 3.0*1/3.5mm headphone jack/M.2 SSD extension/ Micro- SD, allowing users to attach accessories with ease.\nWith a 69.9WH lithium-ion battery that supports 65W rapid charging and superior system-level power management, you can get up to 9 hours of battery life, boosting your productivity and entertainment.\nThis laptop does not have any issues storing in any thin laptop case because how thin it is. I have been using it and upgraded to windows 11 without any issues. All the drivers worked. Highly recommended from me!",
					"I am impressed with this laptop. The screen is incredibly bright and crisp, with brilliant colors. I received the 15.6-inch laptop and was pleasantly delighted to see that the refresh rate of the screen can reach 144Hz. This is a significant benefit since 144Hz makes things seem smoother and nicer on the screen. It not only helps with gaming, but it also helps with eye strain if I have to look at a screen all day for work. I'd give it a 10 out of 10 for this excellent screen. Because of the Core i-5 processor, everything on this laptop works almost instantly. I'm shocked there are concerns regarding CPUs built in 2018. When it comes to performance, this laptop is a beast. I even ran a machine learning model on this laptop with a huge dataset, and it finished faster than my Core i-7 PC. It is ideal for multitasking, particularly office work. It arrived with regular 8GB ram, but because to the easy-access additional memory port, upgrading to 24GB didn't cost me an arm and a leg.\nCoreBook XPro is powered by an Intel Core i5-8259U CPU with a turbo frequency of up to 3.8GHz. Powerful operation without latency ensures that your laptop functions smoothly. With 8GB DDR4, 512GB SSD storage, the CoreBook XPro Windows 10 laptop can do more work in the background. Furthermore, the Lris 655GPU makes it outstanding in terms of graphics processing. This Windows PC has a 15.6inch FHD Widescreen display with a 1920x1080 resolution, which provides an excellent visual experience. Ultra-narrow bezels on three sides provide unrestricted vision. The 16:9 aspect ratio is ideal for your daily amusement. The XPro i5 gaming laptop comes with a full-size backlit keyboard, which ensures visibility even in the dark and decreases the potential of accidental touch, allowing for faster and more convenient typing. Its light weight of 1.5kg, compactness, and portability make it a popular computer laptop for commercial offices. It has a full-function USB-C interface for audio or video data transfer and enables USB-PD 2.0 rapid charging. Furthermore, the CoreBook Xpro core i5 gaming laptop includes a variety of ports, including USB-A 3.0*1/3.5mm headphone jack/M.2 SSD extension/ Micro- SD, making it easy for users to attach accessories. The Xpro Windows computer has a 69.9WH large capacity lithium-ion battery that supports 65W rapid charging and has superior system-level power management, which extends the battery life to 9 hours, increasing your productivity.\nThe CoreBook XPro has two fans for automated gear speed adjustment as well as a huge heat dissipation surface to quadruple heat dissipation efficiency.\nFront 100W HD pixel cameras allow you to capture as many great moments as you want. Convenient for daily video calls with family, online business calls, ZOOM meetings, online teaching, and live broadcasts.\nThe Core i5-8259u CPU with lris Plus Graphics 655 delivers agile and rapid computing, network and graphics performance, and enterprise-grade management.\nFull-screen 15.6-inch IPS display with FHD I 920x 1080 resolution and 16:9 classic aspect ratio for clear and brilliant films and photos.\n\n2 x USB 3.0 /1 *USB 2.0 /1 x USB-C ports\n1 x Micro HD2.0 output\n1 x Fast charging DC port\n1 x 3.5mm Headphone Jack\nMicroSD card slot and high-speed M.2",
					"M",
					"Muy buena compra, se siente de calidad al tacto, la pantalla se ve fenomenal ideal para ver series, además de que el sonido es muy bueno y tiene buen volumen, ideal para hacer tarea/trabajo en la noche gracias a su teclado retroiluminado, muy buena movilidad gracias a que el touchpad acepta gestos, la recomiendo ampliamente",
					"",
					"Excelente desempeño, buena calidad\nde los materiales, Windows Activado, teclado con iluminación variable, buena cámara, touch pad con excelente reacción y espacio, carga rápida, excelente antena wifi soporta 5 Ghz, Recomendable total por el precio es una excelente relación costo/beneficio... Saludos..",
					"",
					"Muy buen producto para el precio, único inconveniente: muy mala cámara. Compré esta laptop para usarla en mis clases en línea ya que necesitaba algo más rápido, en ese sentido me funcionó muy bien sin embargo la cámara es bastante mala por lo que prefiero no utilizarla para videollamadas.",
					"",
					"Excelente compra, buen producto y económico, además llego antes de lo previsto 😁😁",
					"",
					"Me gusta demasiado está laptop, realmente funciona super bien, es rápida, la recomiendo ampliamente",
					""
				]
			}
		},
		{
			"id": "sMiShGI",
			"title": "MSI GF63 15.6\" 144 Hz Gaming Laptop Intel Core i5-11400H RTX 3050 TI 16GB 512GB NVMe SSD Win11 (11UC-263)",
			"price": "$804.00",
			"image": "https://m.media-amazon.com/images/I/71wxevJhO4L._AC_SY355_.jpg",
			"description": "MSI GF63 15.6\" 144 HzGaming Laptop Intel Core i5-11400H RTX3050TI 16GB 512GB NVMe SSD Win11 (11UC-263)",
			"reviews": {
				"customerProfileNames": [
					"DrewMerten",
					"Christian",
					"AnthonyLe",
					"Luís",
					"KristenSmith",
					"Kianna",
					"FreddieWinters",
					"evan"
				],
				"customerProfilePictures": [
					"https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif"
				],
				"customerRatings": [
					"5.0 out of 5 stars",
					"5.0 out of 5 stars",
					"5.0 out of 5 stars",
					"5.0 out of 5 stars",
					"2.0 out of 5 stars",
					"3.0 out of 5 stars",
					"4.0 out of 5 stars",
					"3.0 out of 5 stars"
				],
				"customerReviewTitles": [
					"Microsoft 365 Family | Premium Office Apps | Up to 6 users | 3 Months Free, Plus 12-Month Subscription\nMicrosoft 365 Family | Premium Office Apps | Up…",
					"Microsoft 365 Personal | Premium Office Apps | 1 User, Up to 5 Devices | 3 Months Free, Plus 12-Month Subscription\nMicrosoft 365 Personal | Premium Office…",
					"Save $30 at checkout | Adobe Acrobat Pro DC subscription with auto-renewal\nSave $30 at checkout | Adobe Acrobat Pro DC…",
					"Save 68% on McAfee Total Protection 3 Device\nSave 68% on McAfee Total Protection 3 Devi…",
					"No backlighting on certain models, but great laptop",
					"does what I need",
					"Nice",
					"great. Great quality for price",
					"Triple check configuration before ordering an MSI laptop",
					"Definitely Disappointed",
					"Impressive!",
					"Whatever"
				],
				"customerReviewBodies": [
					"This review is for the MSI GF63 Thin 95SCX-005 . If you are buying this model it is NOT BACKLIT. The description here says it is, but the MSI website says it's not. I just want to stick this out there in case anyone else bought and wanted the backlit keyboard.\n\nThay out of the way, this laptop (sans backlit keyboard) is amazing. It has played every game I've thrown at it so far on at least high settings. Final Fantasy 14, Sims 4, Dragon Age Inquisition, a bunch of others. The great thing about this series of laptop from MSI is they didn't skimp on the graphics chip. The whole series of laptops has the same one in it, the variations come with different hard drives sizes, more ram etc(and the more expensive versions have backlighting).\n\nI plan to update this review with more games soon, but FF14 plays on max settings at about 60fps unless I'm in pvp with 150 other players. Even then I still get 40s. I'm very happy with this machine.",
					"I knew what I bought so I am satisfied. Plays planetside 2 just fine",
					"Pretty solid laptop. If you are gaming you should probably plug it in, otherwise its pretty good. Not a fan of the glowing keyboards so this laptop fits my needs. I can run GTA V on high settings and play pretty fine. I also added another 8 gb of ram and a 2tb drive to the laptop. You can probably find a youtube video of someone testing out the laptop if you aren't sure.",
					"So good for modding basic games like skyrim",
					"O",
					"I got this laptop for my younger brother last month and he does love it. He plays his games on it with no problem (I'll definitely need to get him more storage soon!). The two problems I have with this product is that:\n\n1. It is advertised with a keyboard that lights up red, but this laptop does not have any backlit keyboard. I am not sure if it is just the specific model I got, but even under the pictures of my specific model it shows a backlit keyboard. I contacted the seller about this problem and they said, \"Unfortunately when MSI announced that model, they listed it as having the backlit keyboard, but when they launched it, it was launched without the function.\" So I am not too happy about advertising something false.\n2. It has only been less than two months and there is some light bleeding through the middle of the screen.",
					"I like how how it lets me play my games on it. Other than having no disc drive, it'll work. Thank you Chief. As it now stands, i can't seem to stream the gameplay on my twitch channel, but that's something i have to figure out myself",
					"Under the impression that this was a 120hz screen because that's what the description said but now I look and it says 60hz.",
					" La laptop es un monstruo delgado, tiene muy buen rendimiento, hasta ahora la he probado en 3 juegos, Doom Eternal (lo corre de maravilla en gráficos altos) Just Cause (unos 40 a 60 fps en altos, pero eso ya es cosa de la optimización) y Control (30 fps a gráficos medios), quizás los corra mucho mejor haciendo Overclock. El teclado no es iluminado, pero en lo personal la prefiero así, le da un toque más discreto a la hora de trabajar con ella, aún así durante la noche si se logran distinguir bien cada tecla (adjunté foto), ya que el brillo de la pantalla refleja en la letra blanca que tiene cada tecla. No es tan ruidosa comparándolas con otras, en el video parece que es ruidosa, pero en persona muy apenas la escuchas, vengo de una asus, esa parecía avión a punto de despegar... Sin duda alguna Vale la pena cada centavo.\n\nObs: no tiene la tecla ñ, pero funciona, poniendo tu mapeado del teclado en español, así podrás escribir sin ningún problema (siempre y cuando te sepas el teclado de memoria)\n\nEdito: después de actualizar los drivers de nvidia y Windows, el juego control lo corre a. 60fps en medios\n\nGears of war lo corre a 60fps en ultra y starwars JFO lo corre a. 60fps en altos",
					"",
					"No he sido un gamer desde hace varios años, pero compré esta para retomarlo. La recibí el de ayer.\n\nMe ha gustado que es bastante liviana, aprox 2KG, tiene un excelente monitor, mouse, materiales, todo es genial. La vida de bateria he visto muchos videos donde mencionan que dura de 3 a 4 horas. Sin embargo, si vas a jugar es mejor usarla conectada a la corriente.\nPor el precio que la obtuve fue una buena compra.\n\nConsidera que el teclado no es retro iluminado (backlight).\nAlgunas fotografias muestran como que si lo es. Inclusivé llamé al support de MSI, y me dijeron que la devolviera para que me la cambiaran, sin embargo buscando en comentarios de esta publicación en inglés muchos dicen que este modelo no lo trae. No afecta en nada el funcionamiento, pero es para tenerlo en cuenta al momento de comprar.",
					"",
					"en particular este modelo MSI GF63 Thin 9SCX-005 no tiene teclado retroiluminado y esta en ingles (revisar modelos q no tengan la X al final). Solo trae 8gb de ram ddr4 2666mhz en un solo slot (puedes poner otro dimm igual para hacer dual chanel). Solo trae 256gb de ssd nvme m.2 y una bahia para un disco de 2.5\" si quieres mas espacio. Tiene una tarjeta grafica nvidia gtx 1650 max-q con 4gb ddr5. Basicamente es un gran equipo pra jugar lo he probado en graficos al maximo en juegos como Call of Duty Advanced Warfare, World of Tanks version HD y al maximo, GTA V, DOOM 2016, Quake Champions, World War Z, Division 2 y otros.\n\nEsta buena para salir de viaje y puedas trabajar sin problema.\n\nP.D. Si vas a hacer uso de la tarjeta de video gtx 1650 la bateria no rinde mucho...simpre tendra q estar conectada.\n\nEnjoy it.",
					"",
					"desde el punto de youtubers el equipo esta muy básico, pero hay que pensar que esos vividores tienen equipos de mejores prestaciones. si va ha ser tu primer equipo gamer, lo veo excelente. vas a ver un cambio en la pantalla que te parecerá increíble con 1080, y esto se ve reflejado en la calidad de pantalla no en la resolución o en los hz. el teclado se siente muy bien, y el touchpad tiene un tacto suave que en lo personal lo hace parecer frágil en cuanto a su respuesta es increíble con el movimiento suave este no necesita ser presionado como con otros touchpad. esto es lo que rescataría de las partes física ya que carece de sentido hablar de los puertos y no puedo mencionar nada del cargador ya que no lo he visto trabajar por mucho tiempo.\n\nahora voy a mencionar un punto muy importante y tiene que ver con la gráfica, es suficiente como para disfrutar una buena experiencia en los títulos de nueva generación. la respuesta es si; ya que como comente anteriormente es para usuarios que piensa comprar su primer equipo gamer. así que jugar a mas 30 fps es una nueva experiencia si es que no cuentas con consolas de nueva generación y has jugado hasta ahora con 30 fps. recuerda que los juegos mas demandantes tal vez llegues a máximo 30-40 fps en alto pero creo que con medios en juego que exigen mucho podrías disfrutar de entre 50 a 60 fps, aunque hay sus excepciones como red dead redemption 2 ya que en su mayoría los de mundo abierto de nueva generación podrían llegar a los 27-30fps pero esto se puede arreglar configurándolo obviamente si quieres jugar en calidades mayores. pero para poder disfrutarlo mejor, les recomiendo desactivar los programas que trabajan en segundo plano. de esto hay muchos tutoriales hechos por microsoft para windows 10 de como hacerlo. en youtube no saben lo que hacen en algunos casos solo copean lo que ven y no pueden ni explicar el funcionamiento de las herramientas.",
					"",
					"Esta super ligera y esteticamente es una chulada, una laptop sencilla pero potente, muy liegera y de buen diseño.\nSu potencia es suficiente para programas de foto como PSD, Affinity Photo, Premiere pro(solo 1080), Capture One. y corro Call Of Duty Cold War a 60fps en gráficos mínimos.\nPor lo que me costo esta super bien, y llego bien tiempo.\nSolo me quiero quejar que las fotografía hace pensar que es el modelo con teclado iluminado y no lo es, la lap no tiene teclado iluminado, eso decepciona un poco, pero por el precio no podía pedir mas!",
					""
				]
			}
		},
		{
			"id": "j76y3h3",
			"title": "MSI Stealth 15M Gaming Laptop: 15.6\" 144Hz FHD 1080p Display, Intel Core i7-11375H, NVIDIA GeForce RTX 3060, 16GB, 512GB SSD, Thunderbolt 4, WiFi 6, Win10, Carbon Gray (A11UEK-009)",
			"price": "$1,159.00",
			"image": "https://m.media-amazon.com/images/I/71p3Ygm14wL._AC_SY355_.jpg",
			"description": "MSI Stealth 15M: 15.6\" FHD 144Hz Thin Bezel Gaming Laptop Intel Core i7-11375H RTX3060 16GB 512GB NVMe SSD Win10.",
			"reviews": {
				"customerProfileNames": [
					"Chris",
					"YebinKim",
					"Jayce",
					"ClaytonWenzel",
					"brandanpratt",
					"Anthony",
					"PhilRezanow"
				],
				"customerProfilePictures": [
					"https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif"
				],
				"customerRatings": [
					"5.0 out of 5 stars",
					"5.0 out of 5 stars",
					"5.0 out of 5 stars",
					"3.0 out of 5 stars",
					"5.0 out of 5 stars",
					"1.0 out of 5 stars",
					"4.0 out of 5 stars"
				],
				"customerReviewTitles": [
					"Microsoft 365 Family | Premium Office Apps | Up to 6 users | 3 Months Free, Plus 12-Month Subscription\nMicrosoft 365 Family | Premium Offic…",
					"Microsoft 365 Personal | Premium Office Apps | 1 User, Up to 5 Devices | 3 Months Free, Plus 12-Month Subscription\nMicrosoft 365 Personal | Premium Offic…",
					"Save $30 at checkout | Adobe Acrobat Pro DC subscription with auto-renewal\nSave $30 at checkout | Adobe Acroba…",
					"Norton 360 Deluxe 2022 - Antivirus\nNorton 360 Deluxe 2022 - Antivirus",
					"Gorgeous screen",
					"Light, Fast, Sturdy built and the best bang for the buck.",
					"Very solid laptop",
					"GOOD LAPTOP, BAD SOFTWARE MSI M15 Stealth *SCREEN FLICKERING*",
					"Worth the money!!!",
					"I Felt I Purchased a Used Laptop!",
					"Quality gaming in a lightweight chassis -- headphones required"
				],
				"customerReviewBodies": [
					"I",
					"PROs\n\nFAST. I searched and compared hundreds of laptops at the price range of 1k~1.6K and this one came on\ntop 10% using cpu/gpu benchmark results.\nLIGHT. This is the ONLY laptop with such specs under 4 pounds that I could find.\nSTURDY. Well, it's my personal opinion but it feels sturdy and well built.\nI like the way keyboard feels its click makes almost no sound and feels soft to touch.\n\nCONs\n\nIt gets hot when gaming but is very well expected.\nScreen could be a bit brighter.\nTouchpad is placed a bit to the right. If you have big hands/palms, it might be tricky typing without touching it.\n\nTo sum it all, I like this laptop and would suggest buying it.",
					"Pros:\nLaptop has a very fast start time due to solid state drive\n\nRuns every game I play on the highest settings\n\nWell lit and comfortable keyboard\n\nBeautiful screen\n\nFor a gaming laptop the battery life is acceptable, around 4-5 hours when doing schoolwork.\n\nAble to change keyboard color\n\nFeels sturdy with an aluminum body.\n\nLightweight.\n\nCons:\nI have read that, though the video card is capable of running VR; their are some complications in running VR. I have not tried this myself, but it is something you might want to research before buying.\n\nThe speakers are a bit more quiet than I would prefer them to be. I use a headset when gaming so it is hardly an issue.\n\nThe fans are pretty loud on the highest setting, however I rarely need to have them on this setting.\n\nOverall I am very pleased with the laptop. It arrived in perfect condition and protected by 2 boxes. It was easy to set up and has not caused me any issues.",
					"Bought the MSI M15 Stealth and was impressed by the presentation, after booting up the laptop for the first time the screen started flickering, no matter how many restarts, shutdowns, and updating / reinstalling drivers, the problem was still there. I did find a solution however, by full wiping the laptop then removing all MSI programs and features (Bloatware) the flickering stopped. I contacted MSI support and they had no idea what planet they were on, so if you have this issue please follow the steps above to actually fix the issue and don't waste your time with MSI support. The laptop is really good but the fact you have to do this is quite annoying, hopefully, they will fix this for future production runs of this laptop.",
					"I am in love, this gaming laptop is one of the best purchases I have ever made, the screen quality is great, it's very fluid, and runs smoothly. As for all gaming laptops, they do tend to get warm so secure yourself a cooling pad and update your drivers. Dragon Center is amazing, MSI really puts out quality work, I highly recommend this product to anyone. Battery life can be adjusted but unplugged and depending on what you're doing you'll have a decent amount of gaming time or if you're doing work, school assignments, etc. Overall this is still a great buy, I definitely need to buy my PC after this.",
					"Note: I never played games on it\n\nCons:\n*Right out of the box, there was dusts on the laptop; a couples of tiny chipped paint; the bottom rubber legs were dusty as if the laptop had been sitting & pushed around on a desk for a while!; plastic package of the AC cable was wrung and had tears(did you really ran out of new plastics!)\n*The battery meter wrong readings; battery really struggled to charge over 95%\n*The display flickered randomly\n*Overheating and loud fan noise (which I guess is typical for gaming laptops), but it happened w/ basic work like checking emails\n\nPro:\nThin for a gaming laptop\n\n*I returned it and won't recommend it to anyone",
					"Screen is nice. 144Hz, 1080p. Viewing angles are nice. Not much glare.\n\nGraphics card is powerful. Runs all my games well at max settings. CPU is the highlight of the show.\n\nIf I had to find something to be bothered with, there's two things...\n\n1. No Ethernet port. It's wifi only unless you have a dongle.\n2. The speakers (located under the laptop), while nice sounding, aren't loud at all. Unless you're in a silent room, you'll struggle to hear basic things -- don't even try to use them for gaming.\n\nThe battery is not bad, but you're not gaming while using battery -- and if you are, you know better than to expect peak performance.",
					"La laptop es una bestialidad a un excelente precio sin embargo la pedi y nunca llego debido a unos problemas que tuvieron en aduana una pena ya que realmente queria la laptop",
					"",
					"La vdd que lei que iba tardar en llegar, que la retendria aduana,que muchos dias etc…. Me llego dos dias antes de los estimado estuvo 4 horas en aduanas quizas menos, y la vdd estoy muy satisfecho un lap minimalista ligera rapida gaming hermosa como siempre MSI de calidad",
					"",
					"Nonostante il deisgn del Pc si presenti in maneira molto elegante e pesa davvero molto poco, si rinunciano a troppe cose che messe insieme ti fanno venire voglia di rispedirlo indietro… Innazitutto partiamo dalle porte d’ingresso che sono veramente poche a mio avviso, solo due porte usb e per di più non ha la porta ethernet e per essere un pc da gaming la cosa fa un po ridere.\nL’audio delle casse è molto buono quanto TROPPO BASSO il volume, deve stare la maggior parte del tempo al massimo ma nonstane cio non si sente bene in certi video. La tastiera non ha a sua volta il tastierino numerico che poi va beh questo a parere mio va in base a se uno lo trova utile o meno.\nDetto tutti questi dettagli minimi arriva la parte peggiore, il sistema di raffreddamento e la scheda video: ho provato a giocarci durante la prima settimana, e un giorno è capitato di giocarci per 4/5 ore, è normale che il pc si surriscalda e le prestazioni della scheda video diminuiscano… ma da allora la scheda non ha più funzionato, qualsiasi gioco andava lento (parliamo di 30 fps) eppure il pc non era sotto sforzo. Mi sembra scontato che il pc l’abbia poi rimandato indietro. In tutto ciò il processore, per quello che si paga ci si aspetterebbe un po di più, purtroppo ha solo 4 core. Invito a cercare pc più prestanti e a non prendere pc dal design ultra sottili se si deve rinunciare alle prestazioni.",
					"",
					"Tenia el pendiente con aduana pero llego un día antes de lo estimado y sin ningún inconveniente.\nEs una laptop genial, la utilizo para trabajar con programas de edición y efectos de video e imagen, para la escuela y de vez en cuando para jugar. Muy contenta con la compra!!",
					"",
					"Es una maravilla de laptop, estilo minimalista, excelente material de construcción, los altavoces suenan muy bien y el brillo de la pantalla supera a varias de la competencia. La mayoría de los juegos correrán en gráficos altos sin ningún problema, no se arrepentirán",
					""
				]
			}
		},
		{
			"id": "HTKDrKv",
			"title": "ASUS ROG Strix G15 Gaming Laptop, 15.6” 300Hz 3ms IPS Type FHD Display, NVIDIA GeForce RTX 3050 Ti, AMD Ryzen 7 4800H, 16GB DDR4, 512GB PCIe SSD, RGB Keyboard, Windows 11, G513IE-PH74",
			"price": "$1,049.99",
			"image": "https://m.media-amazon.com/images/I/81fZmxBbQgL._AC_SX355_.jpg",
			"description": "Focused firepower streamlines and elevates the core Windows 11 Home gaming experience in the ROG Strix G15. With up to a powerful AMD Ryzen™ CPU and GeForce RTX GPU, everything from gaming to multitasking is fast and fluid. Go full-throttle on esports speed with a competition-grade 300Hz/3ms display. Adaptive-Sync makes gameplay ultrasmooth, while advanced thermal upgrades help you stay cool under pressure. No matter what your game is, you can achieve your perfect play.",
			"reviews": {
				"customerProfileNames": [
					"AvinashJ.",
					"ChristopherJackson",
					"Queen",
					"Kayla",
					"OscarAndresCossioAcevedo",
					"Customer",
					"Customer",
					"Andre",
					"Iselle"
				],
				"customerProfilePictures": [
					"https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif",
					"https://images-na.ssl-images-amazon.com/images/S/amazon-avatars-global/996ab172-ce7c-48a5-9555-15f8114eddd6._CR109,0,281,281_SX48_.jpg"
				],
				"customerRatings": [
					"5.0 out of 5 stars",
					"5.0 out of 5 stars",
					"5.0 out of 5 stars",
					"5.0 out of 5 stars",
					"5.0 out of 5 stars",
					"5.0 out of 5 stars",
					"5.0 out of 5 stars",
					"2.0 out of 5 stars"
				],
				"customerReviewTitles": [
					"Microsoft 365 Family | Premium Office Apps | Up to 6 users | 3 Months Free, Plus 12-Month Subscription\nMicrosoft 365 Family | Premium Office Apps | Up…",
					"Microsoft 365 Personal | Premium Office Apps | 1 User, Up to 5 Devices | 3 Months Free, Plus 12-Month Subscription\nMicrosoft 365 Personal | Premium Office…",
					"Save $30 at checkout | Adobe Acrobat Pro DC subscription with auto-renewal\nSave $30 at checkout | Adobe Acrobat Pro DC…",
					"Norton 360 Deluxe 2022 - Antivirus\nNorton 360 Deluxe 2022 - Antivirus",
					"No Webcam, but still Excellent",
					"Excellent Laptop 2021 model",
					"Fast Delivery",
					"great laptop",
					"La pantalla es genial y el material del chasis muy suave y resistente",
					"",
					"It’s a beauty",
					"Stuck on reset loop.",
					"False advertisement."
				],
				"customerReviewBodies": [
					" Ok, so I was unaware that Asus removed webcams from their RoG series, but that's on me for not checking. This means that I can't use this laptop for my kid's classes, for my discord calls or zoom meetings. Aside from that, I had a few minor issues, eg. Bluetooth not turning on, WiFi dropping, that were solved with updates.\nOk, now on to gaming; it works amazingly!\nIn DotA2, I can see the grass moving in the wind as I get ganked.\nIn Civilization 6 I can see the fish and crabs on the coast as Barbarians pillage my fishing boats.\nIn Halo 4 I can see the expression on that Elite's face as he bitch slaps the life out of me.\nOverall, once you don't mind the webcam being absent, this laptop is perfect.\nThe battery life so far is perfect and it does not get hot, even after 3 days consecutively of being on; updates and installing so many Gigs of games.",
					"I purchased this laptop to upgrade to a laptop that can run most 64bit operating systems. I recently bought the 2021 model for my wife. One of the reasons I got this Laptop for her was, I presently own a 2019 ASUS ROG gaming laptop myself. I stuck a second NVME 1TB drive and a 16GB stick of RAM into this laptop.\n\nIf you get tired of Windows, you can always install your favorite flavor of Linux on these ASUS laptops as they offer the Linux Community, excellent support for drivers.\n\nI gave one star for the camera as this laptop doesn't have a camera. It DOES have a built-in microphone however. I saw two memory slots underneath when I installed my wifes memory upgrade. So as far as I can tell, there are two slots for ram, so 16GB x 2 = the full supported 32GB of RAM. I set her up with 24GB as that should be more than sufficient.",
					"Brought the lap top for my son for Christmas he a happy camper fast Delivery so for so good.",
					"the laptop is a great one for gaming, could use a update on ram but i guess that depends on what you're using it for... i do use this for online school however the battery life isn't great it's not really meant for school obviously. other than that it's a really good computer!\nalso for anyone wondering it is not touch screen.",
					" Hasta el momento me ha parecido excelente producto. El modo silencioso es muy bueno y solo cuando juego a mas de 120 FPS se nota consume entre 30% y 50% de la GPU dedicada. Muy buena refrigeración, en cuantos la batería aún es muy temprano para dar mi opinión, pero se ha comportado muy bien.",
					"",
					"I was pretty skeptical of buying this at first due to some reviews saying they encountered black screen and the packing had no support in the box for transit purposes. I purchased this as a gift but opened it to make sure everything was working so no comment on battery life and performance just yet. Although there was no bubble wrap in the box, everything arrived in perfect condition. Just from the initial start up setup everything was very sharp and seem extremely good for graphics when it comes to the actual gaming. I’m very happy with this laptop and know it will exceed my expectations. :)",
					"Was playing a game on my laptop when it randomly crashed to a blue screen (blue screen of death). I’m not sure if something is corrupted or if there’s a problem with windows but after the crash it performed an auto reset. Now the laptop is stuck in a reset loop, installs to 63% resets, rinse and repeat. Tried safe boot/startup, can’t. Tried shift F10 method. Nothing. Don’t know what to do.\n\nEdit: my friend who is very computer savvy fixed my laptop back to its out of the box state. Turns out Windows 11 had crashed and caused the reboot loop. I am changing my review to 5 stars after realizing it was a windows error not the laptop hardware itself. After reinstalling all the proper drivers, it is back up to standard.\n\nThe laptop itself runs very nice, I can play 95% of my steam library on max/high graphics and I don’t feel the laptop overheating or slowing down. I always play plugged in. Forza Horizon 4, Tarkov and Elden Ring are the only three games at the moment that I have to lower the resolution on to play at a smooth 60+ fps. But once I hit 60fps the games feel great and play well.\n\nThe keyboard feels nice. Occasionally it will not pickup a key that I press while typing, but it doesn’t happen often enough to warrant a low rating.\nScreen brightness is nice and vibrant, RGB keys look great and can be customized.\n\nSpeakers are little bit on the quiet side, but with 3 USB ports and a headphone jack this problem is easily solved.\n\nWould definitely recommend Asus as a brand. My only regret with this laptop is not spending the extra money to get a better model. 9/10",
					"I bought this computer because it was supposed to be \"ASUS ROG Strix G15 (2021) Gaming Laptop\", but instead I'm met with \"ASUS Vivobook Pro 15 OLED\".\nComputer works just fine and runs smoothly, but its not what is advertised at all and JUST for that, it loses all credibility."
				]
			}
		},
		{
			"id": "CXhXE53",
			"title": "2021 MSI GF65 Gaming Laptop, 15.6\" FHD 144Hz IPS Display, Intel Six-Core i5-10500H Processor, NVIDIA GeForce RTX 3060 GDDR6, 16GB RAM, 1TB PCIe NVMe SSD, WiFi 6, Backlit KB, HDMI, Windows 10, Black",
			"price": "$1,050.99",
			"image": "https://m.media-amazon.com/images/I/71yVl5qII3L._AC_SX355_.jpg",
			"description": "We sells computers with professional upgrade and customization. The manufacturer box will be opened by our engineers for customizing and testing. Defects & blemishes are significantly reduced by our in depth inspection & testing.\n\n \n\nProcessor: 10th Gen Intel Core i5-10500H Six-Core 2.50GHz Processor (12MB Intel Smart Cache, up to 4.50GHz)\n\nDisplay: 15.6\" FHD, IPS-Level 144Hz 45%NTSC\n\nVideo Card: NVIDIA® GeForce RTX™ 3060 Laptop GPU Up to 1485MHz Boost Clock 6G GDDR6\n\nScreen Resolution: 1920 x 1080\n\nMemory: Up to 32GB DDR4 SDRAM \n\nHard drive Size: Up to 2TB PCIe NVMe M.2 Solid State Drive\n\nOptical drive: None\n\nOperating system: Windows 10 Home 64-bit English\n\nAudio: Dual speakers\n\nPorts: 2x USB3.2 Gen 1, 2x USB 3.2 Gen1 Type C, 1x HDMI (supports 4K @ 60Hz), 1x Headset AMP + Gold Flash jacks\n\nWireless: Intel Wi-Fi 6 AX201(2*2 ax) and Bluetooth® 5.1 combo\n\nPrimary Battery: 3 cell (51Whr)\n\nDimensions: 14.13\"x9.99\"x0.85\"inches\n\nWeight: Starting 4.1 lbs \n\nColor: Black",
			"reviews": {
				"customerProfileNames": [],
				"customerProfilePictures": [],
				"customerRatings": [],
				"customerReviewTitles": [
					"Microsoft 365 Family | Premium Office Apps | Up to 6 users | 3 Months Free, Plus 12-Month Subscription\nMicrosoft 365 Family | Premium Office Apps | Up…",
					"Microsoft 365 Personal | Premium Office Apps | 1 User, Up to 5 Devices | 3 Months Free, Plus 12-Month Subscription\nMicrosoft 365 Personal | Premium Office…",
					"Save $30 at checkout | Adobe Acrobat Pro DC subscription with auto-renewal\nSave $30 at checkout | Adobe Acrobat Pro DC…",
					"Save 68% on McAfee Total Protection 3 Device\nSave 68% on McAfee Total Protection 3 Devi…"
				],
				"customerReviewBodies": []
			}
		}
	]
}
