{
	"gamingHeadsets": [
		{
			"id": "9eI771l",
			"title": "BENGOO G9000 Stereo Gaming Headset for PS4 PC Xbox One PS5 Controller, Noise Cancelling Over Ear Headphones with Mic, LED Light, Bass Surround, Soft Memory Earmuffs for Laptop Mac Nintendo NES Games",
			"price": "$22.99",
			"image": "https://m.media-amazon.com/images/I/61CGHv6kmWL._AC_SY355_.jpg",
			"description": "About this item\n【Multi-Platform Compatible】Support PlayStation 4, New Xbox One, PC, Nintendo 3DS, Laptop, PSP, Tablet, iPad, Computer, Mobile Phone. Please note you need an extra Microsoft Adapter (Not Included) when connect with an old version Xbox One controller.\n【Surrounding Stereo Subwoofer】Clear sound operating strong brass, splendid ambient noise isolation and high precision 40mm magnetic neodymium driver, acoustic positioning precision enhance the sensitivity of the speaker unit, bringing you vivid sound field, sound clarity, shock feeling sound. Perfect for various games like Halo 5 Guardians, Metal Gear Solid, Call of Duty, Star Wars Battlefront, Overwatch, World of Warcraft Legion, etc.\n【Noise Isolating Microphone】Headset integrated onmi-directional microphone can transmits high quality communication with its premium noise-concellng feature, can pick up sounds with great sensitivity and remove the noise, which enables you clearly deliver or receive messages while you are in a game. Long flexible mic design very convenient to adjust angle of the microphone.\n【Great Humanized Design】Superior comfortable and good air permeability protein over-ear pads, muti-points headbeam, acord with human body engineering specification can reduce hearing impairment and heat sweat.Skin friendly leather material for a longer period of wearing. Glaring LED lights desigend on the earcups to highlight game atmosphere.\n【Effortlessly Volume Control】High tensile strength, anti-winding braided USB cable with rotary volume controller and key microphone mute effectively prevents the 49-inches long cable from twining and allows you to control the volume easily and mute the mic as effortless volume control one key mute.",
			"reviews": {
				"customerProfileNames": [
					"Joshua",
					"Customer",
					"JoannMiele",
					"ChristinaHernandez",
					"WilliamGrimes",
					"David",
					"Riz",
					"BrittanyR."
				],
				"customerProfilePictures": [
					"https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif",
					"https://images-na.ssl-images-amazon.com/images/S/amazon-avatars/3b1b2d82-7c79-4b89-84b7-deffb5e66e2f._CR0,0,150,150_SX48_.jpg",
					"https://images-na.ssl-images-amazon.com/images/S/amazon-avatars/default._CR0,0,1024,1024_SX48_.png",
					"https://images-fe.ssl-images-amazon.com/images/S/amazon-avatars-global/default._CR0,0,1024,1024_SX48_.png",
					"https://images-eu.ssl-images-amazon.com/images/S/amazon-avatars-global/a1892ca9-c24c-4d72-95ca-6fbd62cce1ad._CR0,0,500,500_SX48_.jpg"
				],
				"customerRatings": [
					"5.0 out of 5 stars",
					"5.0 out of 5 stars",
					"5.0 out of 5 stars",
					"5.0 out of 5 stars",
					"5.0 out of 5 stars",
					"5.0 out of 5 stars",
					"5.0 out of 5 stars",
					"5.0 out of 5 stars"
				],
				"customerReviewTitles": [
					"Fiodio 61 Keys RGB Wired Mechanical Gaming Keyboard with Audible Click Sound Blue Switches, Compact Mini Portable Computer Keyboard for Windows Gaming PC,F-DB21\nFiodio 61 Keys RGB Wired Mechanical G…",
					"TALK WORKS PS4 Controller Charging Cable for Playstation 4 - Long 10' Heavy Duty Braided Micro USB Cord Charger Cord for Sony - (Black, Pack of 2)\nTALK WORKS PS4 Controller Charging Cabl…",
					"TALK WORKS Micro USB Cable 6ft Long Android Cell Phone Charger Braided Heavy Duty Fast Charging Cord for Samsung Galaxy S6 / S7, Tablet, Bluetooth Speaker, Wireless Earbuds Headphones - Gold\nTALK WORKS Micro USB Cable 6ft Lon…",
					"Absolutely worth the buy for anyone looking for a starter gaming headset.",
					"Very good product!",
					"Better Than Some $100 Sets!",
					"5th Pair",
					"Headset splitter for PC comes with product",
					"Good bang for your buck.",
					"One of the most DECENT (sound wise/quality) and most AWESOME LOOKING headset out there...",
					"Nice."
				],
				"customerReviewBodies": [
					"I got this in a rush when I needed a new headset. In hindsight a bit more research would have had me getting something else. As a precursor to the review I feel that it is worth noting that I am very rough on audio peripherals. I don't know why, but they usually last me about 6 months regardless of the quality and price. This is why I choose to buy at a cheaper price point more frequently rather than high-end less frequently.\n\nPros:\nPrice for the quality is great\nDecent speaker/mic sound\nGood quality cable that is at least 6' long\nSits comfortably on the head\nStereo/mic to separate stereo and mic connector included\nIn-line mic mute switch and audio volume adjustment\n\nCons:\nThe USB is only a power source for the blue lights on the headset (it is a bit misleading in its uses, but if I had researched it a bit more I would have found this out before purchase)\nThe in-line mute and volume knob would be better with a mic gain knob as well\nIt tends to make my head a bit sweaty (I have long hair and live in South Texas, US. So it is hard to find headsets that don't do that, but still something to keep in mind)\nThe headset only goes on one way (The traditional right and left side is enforced by the mic only being usable one way. I know I am in the minority, but I like the mic being on the right side of my head)\n\nSo this is absolutely worth the money, but if you are looking for a high-end headset this is not it. I know my cons were a bit nit picky, and I don't want anyone to think that I regret this purchase. I knew I was getting a quick solution to needing a headset, and I honestly got more than I was looking for. The USB lighting, while completely useless, is a cool addition. The only reason it didn't make it into the pros section is because unless you want to look cool on stream it is wasted resources.\n\nSo, yea. If you want a good quality headset for a good price this is great for you.",
					"This headset is light weight and has very good quality sound for the price and is very comfortable. Microphone works good as well. Lights on the sides of the headset make it look nice.\nOnly complaint is that this headset is meant for PC users given the fact that both the USB cable and microphone plug in are connected very close together to the cable. Meaning, that if you are playing on PS4 you plug the microphone cable into the controller but can't plug the USB cable into the system for the lights. I ended up buying a 3 foot USB extension cable in order to be able to use the lights. So if you are using anything other than a PC and want the lights on the headset while you play, then you'll need an USB extension cable.\nThis product is very good though. Very happy with the purchase",
					"Great quality headset and sound. Lights are not too bright whatsoever.\n\nPros:\nGreat Sound\nDim Lights\nDecent Microphone\nHeavy, High Quality Volume Adjust/Mic Mute\nComfortable for Most People\n\nCons:\nUSB Plug for lights that just dangles next to main plug when using, for example, Xbox Controller or Mobile Device. Works fine for PC, however.\nCan get uncomfortable after many hours.\n\nOther Notes:\nThese cheap and reliable headphones compare wonderfully to more expensive headsets like ASUS.\n\nGreat Headset!",
					" I have been through at least 5 gaming headphones(other brands) for my teenager. These are really great quality. Sound, wire, and sound canceling features make this product a great buy.",
					"I just purchased 2 of these headsets and the headset splitters since the \"notes\" section copied below :\nNotes:\n1.Extra Microsoft adapter (Not Included) is needed when connect with old version Xbox One controller.\n2.1-to-2 3.5mm jack splitter cable (Not Included) is needed when you connect with PC if you want to use headphone and microphone at the same time.\n3.The USB interface is only used for power supply to LED light to highlight the atmosphere of the game.\n\nWell .... BOTH headsets came with a PC Headset splitter in the box..\nI don't know who added the #2 in the notes but with this version of headset they DO come with a splitter .. :)",
					"Works great for the given price. Good bang for your buck",
					"First of all, the customer support is AWESOME! - I got my headset a few days after I ordered it and it turned out that one side is not working so I notified them and right then and there they replaced it with a Red one(as I requested because it just goes along with my computer so good , lol), no questions asked. The first one was Blue and they both look AWESOME! I love the lights.\n\nAnyway, besides the awesome lights, this has got to be one of the most decent(sound wise/quality) and most awesome looking headsets out there and for a very sweet price. I mean a price like that for a headset like this is very cheap. I repeat...the price is very cheap for what this headphone's worth.\n\nIf you're a gamer and do not want to spend a crap ton of money for a decent headset, you might want to try this. I wear it more often now rather than my $200 dollar one. I'm telling you guys, great sound quality and the looks just makes it perfect!",
					"I ordered these for my son who is 8. He has went through 2 expensive sets of headphones that he had gotten for his birthday in march. so I didn't order anything expensive until he can take better care of things. So far they have lasted. He uses them on xbox 1. It has a long cord that you can make shorter with a velcro strap. Only problem is the led lights don't work unless plugged into a USB port. He still loves them. He likes that the mic is rigid and his friends can hear him well. He's happy. I'm happy.",
					"P",
					"",
					"小4息子のswitchでのフォートナイト用に買いました。耳穴が小さくイヤホンマイクの最小でもだめでしたので、このヘッドホンタイプが息子にぴったりでした\n3時間くらいプレイしても痛くなる箇所もなし。\nこんなに安く、頭頂部分もスポンジもあり凄くいいです。\n小1、2くらいか間違われる位、小柄な息子です。参考までに。",
					"",
					"If you are looking for a gaming headset with a bit of everything.\n- The light frame(cushion on top) without access to clamping force.\n- Comfortable ear cushions with proper internal padding and am really happy with that because I don’t like when my ears are smashed.\n- Multiplatform compatibility with extra dongle available. The sound quality will be satisfied with, even I can write that for the game like call of duty(warzone), I can hear 3D sound what I mean is easy I can notice from which direction the steps coming, or glass is breaking all that kind of things that gamers find useful when they play their favourite games.\n- The headset has also USB but I think is only to light them up, you cannot use it for USB sound.\n- The mic is not removable but you have a mute button which is better because I always lose things like that.\n- The cable is really long I think is about 2 meters(even more).\nI can recommend the headset because for this price you get a headset that can compare with the expensive budget headset that cost a fortune.",
					"My 12 year old daughter’s review:\nI really love this headset!\nThis is probably the best headset I've had so far because every single feature on it is great!\nThe audio is impeccable, the sound stays within the headset and not all over the place (which usually happens in most headphones).\nThe volume wheel is very easy to use and is great to move up and down smoothly.\nThe cable that connects from your device to the headset is amazing - although a little long for me.\nI can't express though how strong and durable the cable is. I have had headsets that have a very weak wire that always breaks after a little while but the wire on this devices looks like it will last a very long time.\nLast but not least, the microphone. According to my friends, I sounded much clearer when talking than my previous headsets.\nOverall, I really love this headset and I would definetly recommend it!",
					"These headphones have excellent aesthetics, outstanding sound quality, estimable ergonomics and a good microphone. Everything was as advertised, and exceeded my expectations. The only downside would be that the materials are not the highest of quality in terms of durability, but that is not a problem if you care about your headphones.\nI was just using standard Apple earphones for everything, and I would say that these were a definite upgrade. My friends could immediately tell that I had a better quality microphone.\nThe sound quality is also excellent. I listen to a lot of classical music, so it had to play many different elements, but it has certainly pulled through with its crisp sound.\nFor anyone out there who may be wondering if you can use this on Apple products without the traditional headphone jack, you can, as long as you have the adapter that can convert from the lightning cable to the 3.5mm plug.\nOverall, I’d say it is worth more than what you pay for, and as long as you know how to handle things with care (though it would still be able to take a few good hits). I would recommend to anyone looking for good quality but affordable headphones for not only gaming, but even general purpose. I hope this was helpful."
				]
			}
		},
		{
			"id": "oK8BJXq",
			"title": "Gaming Headset with Microphone, Gaming Headphones Stereo 7.1 Surround Sound PS4 Headset 50mm Drivers, 3.5mm Audio Jack Over Ear Headphones Wired for PC Switch Playstation Xbox PS5 Laptop",
			"price": "$21.68",
			"image": "https://m.media-amazon.com/images/I/71+jTaVbHxL._AC_SY355_.jpg",
			"description": "About this item\nImmersive Stereo - Gaming headset with microphone is 7.1 Surround Sound from our professional gaming headsets, outfitted with 50mm neodymium magnet driver, gives vivid and clear sound field, deep bass. Accurate positional audio across any game environment, our gaming headphones with microphone help you get better performance in game, .ps4 games, ps5 games, xbox one games, wii games, etc.\nAll-day Comfort - Extremely light design for all-day wearing, gaming headset are padded with breathable and durable protein soft memory foam cushions, preventing overheating and pressure build-up and pc gaming headset is built with adjustable headband. A must-have PC headsets, xbox headset, ps4 headset, every gamer will enjoy with this wired headphones.\n360° Noise Cancelling Mic - 160° retractable, 360° omnidirectionally rotatable sensitive microphone, premium noise cancellation, sound localisation, this gaming headset pc helps pick up sound quickly, eliminate unwanted noise from environment, deliver messages clearly during gameplay. Adjustable microphone can be swivelled to the right position at any time.\nIn-line Audio Controls - This PC game headsets have an volume control wheel and mic mute switch on the gaming headset ps4 with microphone for quick and convenient adjustments. High tensile strength, anti-entanglement braided USB cable prevents the ps4 headset with mic cable from chaos, and help easily control the volume or one-key microphone mute.\nUniversally Compatible - xbox headphones wired Support PlayStation 4, New Xbox One, PC, Nintendo 3DS, Laptop, PSP, Tablet, iPad, Computer, Mobile Phone. Please note you need an extra Microsoft Adapter (Not Included) when xbox gaming headset connect with an old version Xbox One controller.",
			"reviews": {
				"customerProfileNames": [
					"Zane",
					"Cobrakaifan",
					"@THEONLYONE💕",
					"Nina",
					"SonyaDawnRichardson",
					"KindleCustomer-Brodie",
					"BarbieSmoot",
					"Meghan"
				],
				"customerProfilePictures": [
					"https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif",
					"https://images-na.ssl-images-amazon.com/images/S/amazon-avatars-global/c870a45d-7dda-4fc6-8258-1ceb9c3c90cc._CR0,0,1125,1125_SX48_.jpg",
					"https://images-na.ssl-images-amazon.com/images/S/amazon-avatars-global/f334f989-0e38-4496-97b1-96528b9a1a58._CR0,0,375,375_SX48_.jpg",
					"https://images-na.ssl-images-amazon.com/images/S/amazon-avatars-global/a5df6e16-31d6-485f-b250-d7667e9c5119._CR0,0,246,246_SX48_.jpg"
				],
				"customerRatings": [
					"5.0 out of 5 stars",
					"5.0 out of 5 stars",
					"5.0 out of 5 stars",
					"5.0 out of 5 stars",
					"5.0 out of 5 stars",
					"5.0 out of 5 stars",
					"5.0 out of 5 stars",
					"5.0 out of 5 stars"
				],
				"customerReviewTitles": [
					"Very Nice Gaming Headset with Microphone",
					"Amazing",
					"They really thought of everything",
					"Super great deal for these headphones very happy",
					"Best investment",
					"Quality Gaming Headset ... Camo",
					"SUPER NICE HEADSET",
					"This is an AMAZING headset!..... Did you hear me?"
				],
				"customerReviewBodies": [
					"Item will come in original packaging.",
					"Don't want to pay more than $100 to buy a expensive headset since I have lots of headset already. I am really happy to choose this camo style gaming headsets with microphone\nPROS:\n1. The headset provides good sound for gaming purposes and are comfortable to wear. Don't worry the fybric earcup because they are compartable than you think. The mic boom seems to be solid and rotates up and down well.\n2. There's a lot going on here with a long 3.5mm audio cable, a usb cable to power the lights and a plastic housing to control volume. Mic switch and headphone volume controls are cord mounted a convenient length down from the headset.\n3.People used to complain that I sounded like I was in a tin can and they could hear the HVAC blower with my laptop mic, now all they hear is me! I tested it with a voice recorder app, and I sound like me again rather than me on a crappy speakerphone on a freight train. The bass response of the headphones is great too, makes music and games alike come alive\n4. This headset is the most comfortable I’ve ever had. I work 10-12 hours a day and it’s hard finding comfortable headsets to last that long. My ears usually ache by the end of the day but not with these, I can’t even tell I’ve had them on.\n5. Finally the Camo style is really speical and cool. I like the understated elegance\n6. A Y-style spliiter adapter is included to split a plug to one voice jack and one mic jack.\n7. The cord is super long, very convenient for me.\nCONS:\n1. As the product page said, the USB plug is only for light, note it.\nPretty gaming headset for me. Recommanded to buy it.",
					"Just everything is amazing got a great deal when I bought it its comfortable its everything you want in a gaming headset",
					" this gaming headset was purchased for my son and is quite the upgrade from the one he was using. First impressions out of the box are that this set is rather stylish in its black and white sort of futuristic camo deco. Feels like quality and durable in hand as well. This device can be used on multiple gaming platforms as well. The sound quality is just superb to say the least and I want one now just for my music if that's possible! These are also considered noise canceling so he can hear his squad clearly and know exactly where everyone is including the enemy enabling you eliminate them quicker. The 7.1 surround sound provides that deep bass thump and optimal sound quality for movies and games! It's overall comfort is owed to the soft memory foam around the headband . A great headset at a budget price!",
					"Super great deal for these headphones very happy with them and their functionality. They feel quality have multiple connection options including USB port and 3.5mm jack. Also came with a split/duo 3.5mm jack cord which was a huge plus.",
					"Love it",
					"I purchased this headset after extensive research. It replaced another that was poorly made, ear cups disintegrated after a year's use.\n\nThis headset is constructed for use, solid quality materials. Areas of wear are solid and made to last. Wearing is comfortable with a good fit. Although I don't use the microphone or lighting, the work and add to superb function.\n\nI use it with my PS4 and sound quality is very good. Hours of play in wonderful comfort. I RECOMMEND this headset for quality, price and comfort.",
					"I was pleasantly surprised when I opened the box. The headset looks like it was very expensive. It's cushioned and comfortable on the head and around my the ears. Get yourself one of these while they are still available....you will be sorry if you don't. OH and let me say, the customer service is top notch. Quick to respond and very helpful. Wish everyone could be like this.",
					" Hurry hurry read all about it! Make sure to purchase one today!! Affordable, great quality, weightless, and sound that is crisp and clear what more could you ask for? These headphones work for both Xbox/Playstation lovers. Memory foam ear protectors not olny block out sound but are very comfortable.The wire to connect to the headset is extremely long so its easy to be mobile. Microphone works great which is important for when I'm yelling at people for klilling me on Fortnite! So what more could you ask for?\n\nExcellent product.Highly Recommend!!!\nAll in all this product is amazing and I would buy again!"
				]
			}
		},
		{
			"id": "FVdcbZ7",
			"title": "Razer Kraken Gaming Headset: Lightweight Aluminum Frame, Retractable Noise Isolating Microphone, For PC, PS4, PS5, Switch, Xbox One, Xbox Series X & S, Mobile, 3.5 mm Audio Jack – Green",
			"price": "$39.99",
			"image": "https://m.media-amazon.com/images/I/71BKQhFzDmL._AC_SY355_.jpg",
			"description": "The 3rd generation Razer Kraken is the wired headset for competitive gamers. Its large 50 mm drivers deliver powerful and clear sound. It’s engineered for long-lasting comfort with cooling-gel cushions. A retractable microphone ensures your shotcalls are always delivered in absolute clarity.",
			"reviews": {
				"customerProfileNames": [
					"AlexRobinson",
					"Jacob&NichellePolicht",
					"Ayla",
					"EliasJUehlein",
					"SeanK.",
					"buyerofthings",
					"evan22"
				],
				"customerProfilePictures": [
					"https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif",
					"https://images-na.ssl-images-amazon.com/images/S/amazon-avatars-global/1675af53-ff8f-4907-bf64-b2397ea3591f._CR0,0,499,499_SX48_.jpg",
					"https://images-na.ssl-images-amazon.com/images/S/amazon-avatars-global/717e9478-10e3-4474-a556-c94695541c57._CR0,0,375,375_SX48_.jpg"
				],
				"customerRatings": [
					"5.0 out of 5 stars",
					"5.0 out of 5 stars",
					"4.0 out of 5 stars",
					"2.0 out of 5 stars",
					"5.0 out of 5 stars",
					"4.0 out of 5 stars",
					"1.0 out of 5 stars"
				],
				"customerReviewTitles": [
					"Save $30 at checkout | Adobe Acrobat Pro DC subscription with auto-renewal\nSave $30 at checkout | Adobe Acroba…",
					"PC Game Pass: 3 Month Membership [Digital Code]\nPC Game Pass: 3 Month Membership […",
					"Razer Kitty Ears for Kraken Headsets: Compatible with Kraken 2019, Kraken TE Headsets - Adjustable Strraps - Water Resistant Construction - Green\nRazer Kitty Ears for Kraken Headsets: Co…",
					"Razer Wolverine V2 Wired Gaming Controller for Xbox Series X|S, Xbox One, PC: Remappable Front-Facing Buttons - Mecha-Tactile Action Buttons and D-Pad - Trigger Stop-Switches - Black\nRazer Wolverine V2 Wired Gaming Contr…",
					"Razer Seiren Mini USB Streaming Microphone: Precise Supercardioid Pickup Pattern - Professional Recording Quality - Ultra-Compact Build - Heavy-Duty Tilting Stand - Shock Resistant - Classic BlackRazer Seiren Mini USB Streaming Microphone: Precise Supercardioid Pickup Pattern - Professional Recording Quality - Ultra-Compact Build - Heavy-Duty Tilting Stand - Shock Resistant - Classic Black",
					"Razer Laptop Stand Chroma: Customizable Chroma RGB Lighting - Ergonomic Design - Anodized Aluminum Construction - 3x Port USB 3.0 Hub - Matte BlackRazer Laptop Stand Chroma: Customizable Chroma RGB Lighting - Ergonomic Design - Anodized Aluminum Construction - 3x Port USB 3.0 Hub - Matte Black",
					"Comfortable, functional, stylish, and inexpensive.",
					"Don't hesitate, BUY THEM!",
					"Super cute and great quality!",
					"No dont do it, go get turtles",
					"Comfort and great audio",
					"Great but the volume dial is poorly designed",
					"poor quality,short lifetime only 2 months"
				],
				"customerReviewBodies": [
					"Small cosmetic imperfection on top, front or sides of item. Small cosmetic imperfection on bottom or back of item. Missing bonus material. Item will come in original packaging. Packaging will be damaged.",
					"I",
					"These headphones are amazing. They're super cute, girly, and cancel out all background noise. My husband keeps trying to talk to me while I have them on and I can't hear a word he is saying, haha. If you're super girly or just want to make your gaming/computer station girly, I suggest getting the kitten ears that attach to the top of the headphones. I love these headphones and will be buying all the matching Razer products :D",
					"My first headset and i love it! got the attachable kitty ears to go with it. Had some problems at first figuring out some audio issues cuz at first only the left side was working but i think it was a combination of drivers and making sure all my settings were right and make sure to plug it in the back. Had them for a few months now and still holding up well! Not the most comfortable but overall great quality! Would recommend ^^",
					"Mic is to short, also low quality. You have to turn mic monitoring up all the way to hear yourself which creates buzzing sound. No wind sock so you here wind feedback. Headphones work good though. Returning",
					"My last pair of headphones were a pair of Hyper X cloud 2's. The Hyper X Cloud 2's were a great, comfortable headset don't get me wrong. The problem I had was that the cord split and the mic stopped working. I can honestly say that the 2019 Razer Kraken is not only 20.00 cheaper than my old set, they're also more comfortable. I was pleasantly surprised that they even sounded better. I like the fact that the mic is retractable, and there is a volume adjuster on the cord. For me, this headset is a no-brainer, best for the buck buy.",
					"I use these with a PS4 and am happy with them, though I must confess these are the only \"gaming\" headphones I've ever used, so I really have no idea whether they are better or worse than the competition. I do have a Razer Blade Pro laptop which is the best laptop I've ever owned (including MacBook Pros) and therefore chose these almost exclusively based on my very positive past experience with Razer products.\n\nAs far as comfort, I definitely would give them 5 stars. They are very lightweight and \"cool\" in the sense that they don't start to feel warm after a while. No matter how many consecutive hours I use them, they are always totally comfortable and it never feels like my ears start to sweat or like i need to take them off for a break. I actually forget I'm even wearing headphones.\n\nWhat I do hate is the volume control. It's a dial on the cable just like almost every other headphone, but the problem is it's a very free-wheeling, almost spinning dial. It's not a \"tight\" dial where it doesn't move unless you actually put your fingers on it and turn it up or down, or the type where it makes a little click as you turn it up or down a notch. Consequently, everytime you move (eg change positions or reach for a drink of water), it rubs against your clothes and the volume turns up or down. You can't just set the volume and forget it. It seems like every 15-30 minutes I have to check to make sure it's still at the volume I want. Eventually you get used to the constant checking, but they definitely could have done a better job designing it. It makes no sense to me. I've used many different types of headphones (for music, etc) that have a similar volume controls but none where the slightest touch changes the volume.\n\nI don't use the microphone so I have no opinion on that. I can say that it retracts nicely into the headphones so that you don't even know it's there.\n\nIf the headphones weren't so comfortable and if I wasn't already a fan of Razer products, I'd definitely drop my rating down to three stars due to the volume control issues, might have even returned them. As a matter of fact, after reading my own review, I think I should contact them to find out whether this is really the way they intended it to work or whether I got a defective pair.",
					"Not durable. The cord came apart from the audio adjuster. The saddest part is that happens only two months after it was purchased, and no force was applied. Definitely, I will not purchase and I do not recommend the item.",
					"Kitty version:\nPurchased this for my Xbox and PS4 as it was supposed to be compatible with both. (several customer answers stated it was) but it has a USB plug not an audio jack.\nINCREDIBLY disappointed.\nReviews said it came with an adapter but is apparently not accurate for the kitty version.\nDoes NOT work with an adapter (I tried).\n\nWould suggest the seller keeps the diffent versions of this headset on separate listings so the questions and answers don't get muddled in together.",
					"A",
					"The headset is comparable to that of a $40 headset without the surround sound softeare active. When you order this headset you're supposed to receive an activation code with it to activate the surround sound software on your PC. I did not receive this code. I registered my product at Razer.com because I was told by Razer support that their system would generate a could and would email it to me within 24 hours. I waited 48 hours and did not receive the code. I contacted support again and they told me that I would ve contacted by a special support team within 24 hours that would give me a code to activate the software. It's been 48 hours and I still have not been contacted by anyone. The only good thing about this headset for me right now is that it's comfortable. That's it. Without the surround sound software it's not good at all.\n\nUPDATE: I finally after many attempts with their support was able to get the code for the surround sound software. The headset is noticeably better and is a much more enjoyable experience overall. The retractable mic is also a nice option so that it doesn't get in the way when I'm not using it. The headsets are comfortable even after long gaming sessions. For the price they are good headsets. The surround sound software makes a difference and is a must in my opinion.",
					"Overall these headphones are good for gaming. The sound quality is perfectly fine for video games and good for music, however I prefer my AirPods or computer speakers way more. The only reason I bought these is because you can't use AirPods mic on Windows 10 and I wanted to be able to talk in game. So for using them for gaming it's perfectly fine, but if you're an audiophile or just want some really good headphones with a mic I would suggest maybe spending a bit more, or getting a nice pair of headphones and separate mic for your PC. I find that some songs sound really good with this headset, while others sound a little off. Also the 7.1 surround sound is a cool feature, but the difference between the simulated/virtual surround sound in this headset and true surround sound is night and day, so I wouldn't get your hopes up too high for the virtual 7.1 feature, I used it for a bit in Modern Warfare and didn't really like it so I turned it off. That being said, for the price it's not bad and I wouldn't expect much more than what I got. Overall I'm okay with them.\n\nPros:\n- Long cable\n- They're comfortable (On my old Beats Solo's that are on-ear they start to get uncomfortable/hurt after a couple hours, but these are over-ear and I've worn them for multiple hours without getting uncomfortable.)\n- Comes with a cable splitter/adapter (Turns the single 3.5 jack into two separate mic and headphone jacks)\n- Retractable and flexible microphone\n- In-line controls on the cable (It has a mute switch and a volume knob)\n- Virtual 7.1 surround sound\n\nCons:\n- Sound quality (Like I said, it sounds perfectly fine for games, but I find some songs and videos/movies sound a little off, but I guess it's all personal preference and depends what you're watching/listening to. I find in some songs the bass is good but the highs are muddy, and other songs the highs and mids are fine but the bass isn't all there while the same songs sound fine on my PC speakers. But that's not all songs, most songs sound perfectly fine to me.)\n- Virtual 7.1 surround sound (I put this in pros and cons because it's a cool feature and I'm glad they added it, but like I said sometimes it doesn't sound great and I personally never use it, but some people will enjoy it.)\n\nOverall I'd say they're worth it if you're using them for gaming, and they're not bad for watching YouTube, Netflix, or listening to music.\n\nAlso, I learned this the hard way. If you're on Windows 10 and the mic isn't working go into Settings>Privacy>Microphone and make sure the \"Allow apps to access your microphone\" setting is enabled. I had it disabled and the mic wasn't working. I reinstalled drivers, restarted my PC, plugged the headphone into different jacks, searched Google for answers, watched YouTube videos. I was getting so mad I thought I got a pair with a broken microphone. Took me 2 hours to realize all I had to do was enable that one setting lol.",
					" Los agarre en oferta y junto al deathadder V.2 SON GENIALES lo mejor para mi calidad precio, el audio, lo cómodos que están, no lastiman si tienes lentes, son durables, el micrófono está bien, hasta los disfruto en mi switch y en valorant , ooooo puedo subirle el volumen a tope cuando no me dan ganas de ponérmelos y no se distorsiona el sonido, muy buenos",
					""
				]
			}
		},
		{
			"id": "c4Dzk6T",
			"title": "Razer BlackShark V2 X Gaming Headset: 7.1 Surround Sound - 50mm Drivers - Memory Foam Cushion - for PC, PS4, PS5, Switch, Xbox One, Xbox Series X|S, Mobile - 3.5mm Audio Jack - Black",
			"price": "$43.99",
			"image": "https://m.media-amazon.com/images/I/71waplSVO7L._AC_SY355_.jpg",
			"description": "Embrace the sound of esports with the Razer BlackShark V2 X—a triple threat of amazing audio, superior mic clarity and supreme sound isolation. With our best headset mic and audio drivers packed into a unique aviation-style headset, your competitive play is destined to turn pro.",
			"reviews": {
				"customerProfileNames": ["JustinO", "Alex", "nightshade"],
				"customerProfilePictures": [
					"https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif",
					"https://images-na.ssl-images-amazon.com/images/S/amazon-avatars-global/a97ae77f-d35e-41c5-b4f2-4617d81f796a._CR8,0,483,483_SX48_.jpg",
					"https://images-na.ssl-images-amazon.com/images/S/amazon-avatars-global/e2232f3a-f002-4322-9a62-c235715231f3._CR0,0,500,500_SX48_.jpg"
				],
				"customerRatings": [
					"5.0 out of 5 stars",
					"5.0 out of 5 stars",
					"5.0 out of 5 stars"
				],
				"customerReviewTitles": [
					"Save $30 at checkout | Adobe Acrobat Pro DC subscription with auto-renewal\nSave $30 at checkout | Adobe Acroba…",
					"PC Game Pass: 3 Month Membership [Digital Code]\nPC Game Pass: 3 Month Membership […",
					"Razer Wolverine V2 Wired Gaming Controller for Xbox Series X|S, Xbox One, PC: Remappable Front-Facing Buttons - Mecha-Tactile Action Buttons and D-Pad - Trigger Stop-Switches - Black\nRazer Wolverine V2 Wired Gaming Contr…",
					"Razer Viper Mini Ultralight Gaming Mouse: Fastest Gaming Switches - 8500 DPI Optical Sensor - Chroma RGB Underglow Lighting - 6 Programmable Buttons - Drag-Free Cord - Classic Black\nRazer Viper Mini Ultralight Gaming Mous…",
					"Razer Seiren Mini USB Streaming Microphone: Precise Supercardioid Pickup Pattern - Professional Recording Quality - Ultra-Compact Build - Heavy-Duty Tilting Stand - Shock Resistant - Classic BlackRazer Seiren Mini USB Streaming Microphone: Precise Supercardioid Pickup Pattern - Professional Recording Quality - Ultra-Compact Build - Heavy-Duty Tilting Stand - Shock Resistant - Classic Black",
					"Razer Laptop Stand Chroma: Customizable Chroma RGB Lighting - Ergonomic Design - Anodized Aluminum Construction - 3x Port USB 3.0 Hub - Matte BlackRazer Laptop Stand Chroma: Customizable Chroma RGB Lighting - Ergonomic Design - Anodized Aluminum Construction - 3x Port USB 3.0 Hub - Matte Black",
					"A (Really) Great Entry Level Wired Headset",
					"eSports Grade",
					"First Razor headset and it's a winner!"
				],
				"customerReviewBodies": [
					"Minor cosmetic imperfection on top, front or sides of item. Item will come in original packaging. Packaging will be damaged.",
					"For what it costs, I had relatively low expectations of this headset. I came from a Corsair Virtuoso SE wireless headset that had a great mic and very good sound, but the connection with my PS4 was never very solid and I would notice relatively frequent dropouts in audio. Friends with PS4s swore by using the 3.5mm jack on the controller and I decided to use this to test.\n\nBuild Quality\n\nWhen you pick up the headset the first thing you notice is just how light it is. It feels somewhat solid, but also it's clear that this is not a headset that prioritized premium materials. It's also extremely comfortable because of how light it is. Although I've never had issues with heavier headsets and neck pain, if that is a consideration the light materials should be great for long term sessions.\n\nThe pads are faux leather on the interior ring and exterior ring. The part that rests against your head feels like something a little more breathable. I don't think I will have any issues wearing these for long sessions. The clamping force is a good moderate level where they won't fall off accidentally, but I don't feel like I am in a death grip.\n\nMic Quality\n\nI made some calls using the mic and, I believe this to be a great compliment to the quality of the mic, no one thought I was on a headset. \"It's like you were actually talking through your phone.\" Although they have a gamer vibe, I could definitely see using these on conference calls (as long as the video was off.) Basically, the mic is great.\n\nAudio Quality\n\nHere's where I was expecting things to fall apart, but they really didn't. I decided to make a completely unfair comparison between these and my pair of Sennheiser HD600s run off of an AudioQuest DragonFly Black DAC/AMP. There was clearly no contest between the two headphones in terms of vocals or detail retrieval, but the Razer wasn't a bad headphone by any means. It had a clear and present bass, without being muddy. I do feel like the Corsair Virtuoso had a more full sound, but the spotty connection ruined it.\n\nGaming tends to be, I think, more forgiving than listening to music ... so I ran through a couple of games as a test. I tried a game that I feel focuses on background music (Unravel), which sounded great. I also tried something with more exploding (Borderlands 3) and the headset felt equally competent.\n\nFlaws (But Not Deal Breakers)\n\nThe volume knob goes the opposite of the way my mind treats every other volume knob in my life. Clockwise turns the sound down?! WHY?!\n\nI would have loved an LED to remind me that I'm muted. My first attempted call failed because the mute was engaged.\n\nConclusion\n\nThe Razer Blackshark V2 X might have a terrible name, but it's an amazing product at the price point. I don't play as many games online as I used to and I listen to a lot more music. For me, it makes sense to have a great pair of headphones for music and solo play as well as a cheap headset for online play with friends and conference calls. This works for me.",
					"I'm a former semi-pro Overwatch player, and these headphones are almost better than the studio-grade sound-canceling ones we used for tournaments. 4 stars for sound quality since the ANC isn't as good, but it still allows me to focus on the game and tune out everything else. The Surround is amazing on these, allowing for distinct and accurate noises even in a chaotic battlefield. Everything from music to movies to games is crisp and clear, and the cable is the perfect length. It's lightweight and fits snugly on my head, and doesn't put pressure on my glasses. I would pay 4x the price for headphones as good as these, highly recommended.",
					"First I want to preface by saying I just tested this for an hour at time of writing, but I will update after 30 days. This is my first Razor headset ever as I steered clear because of build quality, but this headset won me over...\n\nPros:\n-Best sound I have had on a wireless (gaming) headset and I have plenty, this is right under the steelseries arctis pro wireless which I did have for a test.\n-Good build quality and the metal hinges are super tight, some have had loose fitting ones, mine did not have those.\n-comfort, this is comparable to my arctis 7 2019 with brainwavz. I am going to mod some brainwavz on these too. The earpads are fine for most people stock though.\n-mic quality is very good, maybe the best I have heard on a wireless set, but this also leads to a small con as well which I will cover below.\n-razor synapse is good, I jumped in and set a v eq and then tested the gaming preset which was good also. Very good customizing here, gotta have an adjustable eq for me before I'm buying it.\n-battery life, TBD but it is very loud and advertises 20+ hours. No problems with it being quiet on pc and Ps5.\n-clarity is superb and thx is very good for my purposes.\nCons\n-it did not clip sound (distort) until I pre-amped it, but it really isn't needed. It did clip sound on ps5 if I maxed the USB up, but leave it at 90% and you should be good.\n-mic is a huge one, it's a cardioid style mic and it is pretty big, but it does have very good quality once dialed in with Synapse.\n-no THX on ps5, but 3d sound works just fine. On PC this is very high end sound imo as this can hit some really good kHz 28k and is near Hifi.\n-no USB C and is only micro USB, just a small gripe, not deducting from what this headset does.\n-will work on Xbox only if wired, but the 3.5mm cable Razor supplied is a nice braided L cable.\n-volume knob is huge, but that's aesthitics which is fine for most.\n\nOverall: If you have the money to spend a little more than 100 I would get this if your primary use is Pc/Ps5. This headset stomps the pulse 3d wireless and is better than my Arctis 7 2019 for my purposes of use. This will work wired as well, but I have not tested on Xbox. I will update after 30 days of use. Razor has made an exceptional headset here and this is going to be between Arctis 7 and this being my daily driver. Btw, I have large ears and this is still over the ear for me and is super comfy.\n\nUpdate Feb 4th: battery life, sound and comfort is still great. It sounds great wired on my series X using DTS sound unbound. The drivers have broke in a little bit and battery life is around 24 to 25 hours at about 65% volume. These get as loud as my gen3 A50's. Build quality should be fine as I don't see any failure points for my use and I baby these and keep them on a headset holder. These are still 5 star for me.\nUpdate 03/09/2021:\nThe Blackshark V2 Pro is still working fine and I have used this on my Series X (wired), PS5 (wired and wireless), and pc (wired and wireless). Battery life has been around 23 to 24 hours as the volume is kept around 70%. Mic has been fine when used on all platforms and the comfort after these have broken in is second only to my Arctis 7, which both are close in comfort. Nothing faulty and build has held up very well. I will say that it is a pain to change earpads, but other than that it's still a very good headset.",
					"Tuve la oportunidad de comparar este producto con otros headset gama de entrada como:\nHyperX Cloud Stinger (no los core)\nHyperX Clod X\nCorsair HS50 pro\nAstro A10\nRazer Kraken X\n\nDebo decir que estos Blackshark y los Astro A10 son los que tienen mejor calidad de audio, que de hecho realmente es lo que vale la pena pagar para una experiencia gaming, a mi gusto ganan por poco los drivers y el microfono de los Astro A10 pero en la comodidad, aislamiento y cancelación de ruido los Blackshark no tienen comparación aparte en PC se compensa bastante el audio, ya que te incluyen un ecualizador con el que podras configurar varios aspectos de musica peliculas y juegos.\nSi estas buscando unos headset de menos de $1200 te recomiendo estos son los mejores tanto para consolas como PC y la verdad desde que haces el unboxing te das cuenta la superioridad que tienen a los demas, si bien tiene sus desventajas como no poder quitarle el microfono o el cable del jack 3.5mm no por eso son malos, ya que son para jugar y estan muy bien balanceados en sonido y materiales. Ver una película con estos headset es una delicia.\nSi solo los vas a ocupar para consolas no te recomiendo ninguno de los dos hyperX ya que sus frecuencias bajas son muy pobres y su altos son muy chillones a mi parecer se les puede sacar mas provecho ecualizando en PC.\nLos corsair y los kraken no estan mal pero en volumen alto si se llegan a embarrar los sonidos pero son mejores opciones a los hyperx en consolas.\nEn resumen si lo que buscas es un headset completo en cuastion de audio y comodidad estos son los adecuados los materiales se ven y se sienten adecuados a lo que pagas, pero si no te importa sacrificar la comodidad para obtener un mejor microfono para streming ve por los Astro A10.\nEspero que esto te ayude en gran medida para elegir tus primeros headset.",
					"",
					"Primero que nada, me gustaría aclarar que los audífonos llegaron antes de lo esperado aun con la pandemia actual y llegaron bien sellados, bien protegidos y en excelentes condiciones. Yo he comprado con Razer en repetidas ocasiones en otras paginas y a diferencia de muchos, jamas me han decepcionado y siempre he quedado satisfecho con sus productos, lo digo en serio. Ya he usado estos audífonos anteriormente por aproximadamente una semana (prestados) y me decidí a comprarlos así que llego el momento de revisar mis propios audífonos.\nLos pros:\n-Empezaré por decir que la calidad es estupenda y son muy estéticos a mi gusto\n-El tacto y acabado de los audífonos los hace sentir de calidad premium a un precio relativamente barato\n-El software para darlos de alta en computadora es automático, funciona muy bien, rápidamente la computadora los detecto e instalo el controlador de tarjeta de sonido para su uso y así ha sido ya en dos dispositivos diferentes, sin problema alguno para compatibilizarlos.\n-Sabes cuando están prendidos porque se ilumina un led de color verde en la tarjeta de sonido que contiene el empaque por defecto (no integrada dentro de los propios audífonos, si no que es un dispositivo independiente con entrada jack de 3.5 mm) que no molesta en lo absoluto y ni estorba para nada pero sirve para que sepas cuando los dejas conectados.\n-No pesan mucho y son muy muy cómodos, cubren todo el oído y no apachurran o lastiman la oreja por lo que los puedes tener mucho tiempo puestos sin problema, yo los uso alrededor de 8 horas diarias para mis clases virtuales.\n-Son amortiguados eso ayuda a la comodidad.\n-Se oyen increíblemente bien tanto en recepción como el micrófono, que de hecho no detecta para nada la estática de fondo como hacían otros de mis audífonos al charlar por videoconferencias o en simples juegos, literalmente te los pones y te olvidas de ruidos exteriores molestos y que distraigan, claro que si lo que quieres es estar pendiente de tu entorno solo tienes que usar el regulador de volumen incluido en los audífonos así como su silenciador de micrófono manual en la parte trasera inferior del mismo sin tener que hacerlo pro medio de software.\n-Una cosa similar a la anterior es que tienen sobre el auricular un control de volumen independiente al de la computadora en su mezclador de volumen, por lo que, si hay alguien no tiene bien ajustado el audio o el sonido es muy estridente para diversos programas , puedes bajar el volumen fácilmente sin mover el de la computadora.\nCostaron unos 500 pesos mexicanos mas que los demás de la red con especificaciones similares, pero de verdad que estos audífonos merecen la inversión.\nLos contras:\n-El cable es un poco largo para mi y el hecho de tener que enrollarlo a veces me molesta ya que no se cuando necesitare un cable tan grande o tan pequeño.\n-Son demasiado llamativos para los gatos (lo digo por experiencia), así que si tienes alguno en casa, es mejor dejarlos fuera de su alcance\nSi soy sincero, para un usuario promedio como yo, que disfruta de escuchar música, jugar FPS tanto en Xbox como en PC y necesita de vez en cuando asistir a alguna videoconferencia, los considero unos audífonos perfectos para su PRECIO y en comparación a la competencia que se encuentran rondando los 2500 a 3500 pesos mexicanos, mas que nada por el nivel de software que manejan. Si alguien sabe donde puedo encontrar el codigo de activación de Razer 7.1 surround sound o si siquiera viene incluido con este modelo de audífonos, hagamelo saber comentando aquí mismo, por favor.",
					"",
					"They have way too much scooped mids, overwhelming bass, & severely lacking in the highs.\nThey are nice and low profiled, feel good on the ears even with glasses, have decent sound isolation, and no cord noise however they just sound cheap and bassy IMO.\nI went off Hardware Canucks review of them and I am shocked Demitry, after usually wearing high end open backed Sens for his gaming rig, said these sounded great.\nI had high hopes for an all in one headset to use on and off when I don't feel like using my Sens and boom mic but even after a break in there is no way these are going to develop more highs.\nIt's mostly mids and bass and for music and games they are just bland and lifeless.",
					"Great for gaming, mic quality is good - does a good job capturing only my voice and not my household. Though can be a bit quiet so your friends will have to increase your volume in discord or you'll have to boost it yourself somehow via software.\n\nSound quality when it comes to gaming is really good. I don't think you'll be missing anything here. (except maybe if you play DOOM a lot and have the OST cranked up past everything else)\n\nFor listening to music I guess it's fine, it's certainly not great but it's not bad either. Won't be winning your heart over on that side. Not going to replace a decent pair of headphones anytime soon.\n\nI'd recommend it for gaming especially, really light on the head and not uncomfortable after long periods of time. Ear pads are nice and cable feels decently sturdy.",
					"I've recently been looking for reviews of numerous computer bits and bobs.. and it seems that Razer has a LOT of influence with the reviewers.\n\nThese headphones are \"average\", and the 7.1 isn't in hardware, it's software emulation (i.e. you can get a stereo headphones and get the exact same experience with the right software)\n\nThe 7.1 experience is .. \"meh\". I *certainly* wouldnt say that playing games thru these is awful by any stretch of imagination, but not NEARLY as good as the reviews make out.\n\nAnd THEN (And to be honest, this is my biggest thing), in order to get all the sounds/etc it expects you to run all their (quite memory hogging) software in the background.. And the software is, IMHO, not great.. took me ages to get working, took me ages to make sure headphones were recognized, etc.\n\nThis is 2021, it shouldnt be this awful to just plug headphones in."
				]
			}
		},
		{
			"id": "wkXTeVR",
			"title": "HyperX Cloud Stinger – Gaming Headset, Lightweight, Comfortable Memory Foam, Swivel to Mute Noise-Cancellation Mic, Works on PC, PS4, PS5, Xbox One, Xbox Series X|S, Nintendo Switch and Mobile ,Black",
			"price": "$29.99",
			"image": "https://m.media-amazon.com/images/I/51kxIEmO+ZL._AC_SX355_.jpg",
			"description": "HyperX Cloud Stinger is the ideal headset for gamers looking for lightweight comfort, superior sound quality and added convenience. At just 275 grams, it’s comfortable on your neck and its ear cups rotate in a 90-degree angle for a better fit. HyperX signature memory foam also provides ultimate comfort around the ears for prolonged gaming sessions. To provide optimal audio performance, the Cloud Stinger’s 50-millimeter directional drivers position sound directly into the ear for audio precision and gaming-grade sound quality. Its swivel-to-mute noise-cancellation microphone reduces background noise for clearer voice quality. You can also mute the microphone by flipping it vertically. Get a great headset that is compatible with just about any gaming system, including PC, Xbox One, PS4, Nintendo Switch and other mobile devices. Specifications: Headphone: - Driver: Dynamic, 50-millimeter with neodymium magnets- Type: Closed back- Frequency response: 18Hz-23, 000Hz- Impedance: 30 ohms- Sound pressure level: 102 3dBSPL/mW at 1kHz- THD: ≦2%- Input power: Rated 30mW, Maximum 500mW- Weight: 275 grams- Cable length and type: Headset (1.3m) + Extension Y-cable (1. 7m)- Connection: Headset - 3. 5mm plug (4 pole) + extension cable - 3. 5mm stereo and mic plugs Microphone: - Element: Electret condenser microphone- Polar pattern: Unit-directional, Noise-canceling- Frequency response: 50Hz-18, 000Hz- Sensitivity: -40 (0dB=1V/Pa, 1kHz)Tips and Tricks: How to use your HyperX Cloud Stinger for an optimal gaming experience: Audio and Mic Controls: - Volume slider located on bottom of right ear cup- Conveniently mute the microphone by flipping it vertically against its head Package Contents: 1 HyperX Cloud Stinger1 Extension Y-cable.",
			"reviews": {
				"customerProfileNames": [
					"Mastercard",
					"nightshade",
					"Kimberly(Kyber3000)",
					"MichaelFuson",
					"Colombiana"
				],
				"customerProfilePictures": [
					"https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif",
					"https://images-na.ssl-images-amazon.com/images/S/amazon-avatars/default._CR0,0,1024,1024_SX48_.png",
					"https://images-na.ssl-images-amazon.com/images/S/amazon-avatars-global/665cf13f-0173-483e-957d-fc893355cc98._CR0,0,375,375_SX48_.jpg"
				],
				"customerRatings": [
					"5.0 out of 5 stars",
					"5.0 out of 5 stars",
					"5.0 out of 5 stars",
					"1.0 out of 5 stars",
					"1.0 out of 5 stars"
				],
				"customerReviewTitles": [
					"Microsoft 365 Family | Premium Office Apps | Up to 6 users | 3 Months Free, Plus 12-Month Subscription\nMicrosoft 365 Family | Premium Office Apps | Up…",
					"Microsoft 365 Personal | Premium Office Apps | 1 User, Up to 5 Devices | 3 Months Free, Plus 12-Month Subscription\nMicrosoft 365 Personal | Premium Office…",
					"Save $30 at checkout | Adobe Acrobat Pro DC subscription with auto-renewal\nSave $30 at checkout | Adobe Acrobat Pro DC…",
					"Save 68% on McAfee Total Protection 3 Device\nSave 68% on McAfee Total Protection 3 Devi…",
					"I can hear a crack of a gunshot on the ...",
					"Great value for the 50 dollar range headsets",
					"Comfortable, Great Sound and Quality + Great Price!!",
					"Bad quality, dying after 4 months..very well stored when not in use.",
					"Didnt last 3 weeks"
				],
				"customerReviewBodies": [
					"I can hear a crack of a gunshot on the other side of the map but I can't hear my wife screaming 3 feet from me. 10/10 will buy again if the wife breaks them.",
					"FIrst off, this is a great value for the money, its hands-down a very solid headset. I have some audiophile headsets and high end wired and wireless headsets, so I have been running the Stinger's through some gaming and music to compare. I purchased these because we have the Cloud I's and the Cloud II's in our home and I have had them for several years and they still look like new, so I knew that it would be comfortable and the sound signature would be tuned fairly well. These are a little more bass heavy in a standard gaming setup w/o a amp or Astro mixamp. The lows are very good, mids are decent, and the highs are good. Basically, the 53mm drives from the Clouds have been placed in these as 50 mm drivers because the only thing i can tell on audible testing is that the mids are clearer on my Cloud II's for gaming and music. If you use a mixamp then that is when you will not be able to tell the difference between Cloud I's or II's. I use these with a mixamp TR and they are very comfortable. I have large ears and these completely cover them while also providing decent noise cancellation. Something of note here regarding the noise cancellation, it is passive and is not as good as the Cloud II's, but I feel that the Cloud I and the II clamp down a little hard on my head and the Stingers do not clamp down. The memory foam ear pads and the lightweight frame make this a headset you will hardly notice. The build quality seems very good and as for the mic, it works fine and I have had no issues for this week of use. I would sum it up as 50 bucks well spent if you are on a budget or just looking for a comfortable headset because the Stinger's are both of those.\n\nNow a few drawbacks I see about the headset from my perspective. The mic stays attached the entire time, so that may be a negative to some. Also no built in mic monitoring that I can tell in my mic testing I have done so far. On XB1 you can setup mic monitoring within the accesories app with a newer controller model with a 3.5 mm jack and place it to an acceptable range. On PS4 testing it is pretty much no mic monitoring, but for 50 bucks I will say that everything all works with no glaring issues and again it is mixamp friendly which is super attractive. I would definitely take these over my A40 TR's just on the fact of comfort alone, not to mention the price. I hope that Kingston ultimately takes this exact Stinger build and makes it into a Stinger II with some higher level build quality and even wireless, that would be the best gaming headset around.\n\nTLDR; The Stinger is a super comfy, mixamp friendly headset that sounds really close to its big brother the Cloud I and II's. Your going to be hard pressed to spend 50 bucks and find a better headset. I have compared many more expensive headsets to these and sound and comfort wise, these are right there with those headsets.\n\nIf my review of the Kingston HyperX Cloud Stinger has helped you make a decision about purchasing please give me a postive rating.",
					"Updated to 5 stars all in all this headset is great and once I got used to it, it was very comfortable. I have decided this headset does everything I need for now so I’m going to wait to order one with a mixer and more features. I’ve gotten used to the mic mute flip feature with more time and now it’s not so strange muting and adjusting volume (note: I normally adjust volume from Xbox mixer settings instead of the volume adjuster on the headset).\n\nSUMMARY: I bought the Hyperx Cloud Stinger and at this time I’m giving 4 stars, however it is most likely a 5 Star Headset I just want some time to make sure. So far I I can honestly say this headset is well worth it just keep in mind I’ve only had it for about a week! It’s very comfortable, has great sound, a great price, seems to be working great with Xbox One, and is made with quality! I don’t think you find a headset in this price range that’s better than this one and many say this headset is better than very expensive ones from what I’ve read. I may wind up getting another Hyperx Cloud headset with a Audio mixer and mute button since I’m not sure I’ll get used to moving the mic up and down to mute it as you have to do with the Stinger (I’m used to a mute button by the controller which makes it fast and simple to mute) and I would like to control volume settings without going into my Xbox audio settings or hopefully Xbox makes a simplier option to this and muting. (You don’t need the adapter with this headset for Xbox one if you have the controller with a 3.5mm jack)\n\nLong Review (Still updating and pending final product rating):\n\nCOMFORT: They are very comfortable to me (I am a female and most aren’t comfortable to me and are too big but without this headset adjusted at all it fits pretty comfortably). When it’s adjusted to be larger it fits my boyfriend as well so this is a great headset for either female or male.\n\nSOUND:\nI’m not audio/sound wizard or professional but the sound so far is very good. I’ve mainly played Fortnite br and Destiny 2 with this headset. I’m still messing around with different games to see the difference between different noises and using the volume mixer settings on Xbox One to see what sounds best. On Xbox One I’m able to press the home button, go over to System, and then to Audio to control the headset volume, adjust headset chat mixer, or mic montitoring. This headset does have the slider on the right ear so you are able on XB1 to get all your volume levels setup and then just use the volume slider on the headset ear if it’s to loud or quiet. Now that I have messed around with it a bit more I don’t find the need to go back into the audio settings on Xbox to adjust them, I have left them at a certain level that seems to be working great. However, for me I liked having all those volume control settings next to the controller but again maybe I can get used to it. Last thing is I’m messing around with trying Windows Sonic and Dolby Atmos for headphones since I read you can use these features with headphones that don’t have surround sound or do have it and as some say it makes a world of a difference... I’m still testing this out on Xbox One to see if they do make a difference with sound.\n\nMIC/PARTY CHAT: Using Xbox party chat is huge and a must for me. I use it to talk to my boyfriend who I play games with from different rooms as well as friends. The first day I got these, I connected to a party chat and instantly he stated it was making a humming or some sort of low pitched noise. He isn’t into tech issues or troubleshooting so this was very hard for me to fix or understand since only he heard this noise. The next day he said he doesn’t hear it at all but I’m still a bit concerned so I’ll be trying to join other people in a party to see if they hear anything not right. Update: it looks like this issue may have went away and was either related to being new, my boyfriends headset, and/or me being in the Xbox insider alpha program.\n\nMUTE FEATURE: The other thing that may just be something I have to get used to is the mic mute method on this headset, having to pull the mic up or down is something I feel takes more time than just pressing a mute button like I’m used to but like I said maybe I’ll get used to it. My boyfriend likes the mute method that the Stinger has more than me since he has a habit of putting up his mic even with his mic not having this feature. I think this is just a preference and dependent on if you can get used to it.\n\nOVERALL RATING: 9/10 I would recommend this headset to someone. For the price and the quality you get I don’t feel there’s a better headset you’ll find!! I hope my review helps you and if you have any questions leave a comment to this review and I’ll reply ASAP.\n\nNote: I would also greatly appreciate it if my review was helpful for you, if you could please click the “was helpful” button below. Thank you :)",
					"So I bought this headset at the end of September, and I loved it. It worked phenomenally and I was very happy with my purchase. I take impeccable care of the things I purchase, especially when they involve my gaming rig and the things that go with it..Pretty much anything electronic. Sadly, it:s been a few months, and it:s already run into issues..The mute feature when you turn the mic up, has already stopped working. This is absurd. I probably wont be buying anymore Kingston products if this is the lifespan of some of the key features I purchased for. Today is a sad day, I hardly ever write anything negative or go out of my way to leave a review, typically I just stop supporting that company, but for a headset that has been revered as one of the best for the price point and quality, I am extremely dissatisfied I have to deal with these issues this early..I could understand if it was a few years old, but no, we are talking a whole 4 months..",
					"Okay first off I just wanna say that the headset is good. The audio is great and you sound fine. However, not 3 weeks have passed since I got it and it has already broken. I have been using this for my PS4 and plugging it in to my Dualshock 4 controller. When I was unplugging it, for no reason the audio jack thing that enters the hole snapped off. Now that is stuck in my controller and my headset is rendered useless. Also know that this was only the 4th or 5th time I have used it.",
					"U",
					"",
					"Let's face it, I'm old. I'm probably one of the oldest gamers you know. I still hear really well but my reaction speed is a little slow so I need to know when you little jerks are sneaking up on me with your knife thinking you'll just melee the old man and teabag him for some sweet screenshots. That ain't gonna happen. With this headset and the patience that comes with age I will turn the tables and pad my kill ratio. Thanks Zoomer. Sure, I can afford the most expensive gaming headset out there, but man I'd rather retire to the beach with my pina colada a little earlier so why waste money? In fact I bet you could flip a few less burgers and play a few more hours if you bought this headset over some pricey RabbitRiver brand or whatever you kids call them. My head's kind of big and my skin is a little thin but still I find these muffs to be super comfortable for long hours of gaming. I don't even take them off for my 4 times an hour bathroom breaks.",
					"Adquirí los casos hace una semana y probándolos me di cuenta que fue una de las mejores inversiones para mi consola. La calidad del sonido es impresionante y además mis amigos mencionan que me escuchan más nítido y claro. Tiene un control de volumen que ayuda a regular entre el juego y el chat del grupo. La calidad es suficiente para saber que durarán un buen rato. No cansan el oído y el micrófono aísla el sonido con tan solo levantarlo. Fue una buena compra y los recomiendo para aquellos que juegan especialmente en consolas.",
					"",
					"I had this headset for 3 months at the most before it died. The headset stopped producing sound one night with no warning. I tried it on several different devices, but it was completely dead. Once I realised that my computer was not at fault I reached out to Kingston, but never received a reply. Very disappointing.\n\nWhen the headset did work the sound was very quiet and I often had to turn my computer volume up to ridiculous levels just to hear things properly.\n\nThe only good thing about this device was that it was comfortable to wear, and the mic was easy to turn on and off. These are of course pointless attributes as the entire thing died in a VERY short amount of time.",
					" Estos audífonos son bastante cómodos el control de volumen me gusto por lo regular siempre lo tengo muy bajo hice escucha bastante bien en mi caso lo utilizó con una Xbox One icon una prestación cuatro y funciona perfectamente bien me tengo que subir un poco a la hora de utilizar los con la computadora en lo que vienen siendo mis clases en online.\nPero se escucha perfectamente muy claro. En cuestión de escuchar música con ellos la verdad es que se escucha bien pero no se escucha tan fuerte como otros audífonos más económicos o inclusive si los conectas a la pc y escuchas música no es de lo mejor.\n\nPodrás escuchar tu música pero a un volumen éste yo creo que está razonable bastante bien para mi gusto la verdad de funcionan bien Pero cabe mencionar que unos audífonos de trescientos pesos puede que se escuchan más fuertes.\n\nSin embargo los de trescientos peso no van a estar tan cómodos como estos sí funcionan si estás relajado no te va a sudar la oreja.\n\nDe igual forma si te mueves mucho o estás jugando ya estás con la adrenalina encima pues si te va a sudar la oreja.\n\nPero estando tranquilo la verdad es que ni los dientes están muy cómodos, He visto comentario de que no más duraron un mi y puedes es muy probable que en alguna caída si se descompongan pero cuiden los mucho y estoy seguro que les van a durar bastante.",
					""
				]
			}
		},
		{
			"id": "8gPqqiO",
			"title": "ASTRO Gaming A40 TR Wired Headset with Astro Audio V2 for Xbox Series X | S, Xbox One, PC & Mac",
			"price": "$149.99",
			"image": "https://m.media-amazon.com/images/I/61DvTIEPk0S._SX342_.jpg",
			"description": "Play like a Pro! The ASTRO A40 TR Headset is the premier gaming headset for professional gamers, including esports athletes’, content creators and live steamers. It was developed with esports athletes’ to meet their rigorous standards for audio fidelity, comfort, and durability. Mod Kit Ready, the A40 TR adapts to any gaming environment. The A40 TR arrives as an open-back headset featuring a swappable precision mic and customizable Speaker Tags. For loud tournament environments, one can transform the A40 TR into a closed-back noise-isolating headset by adding a Mod Kit (sold separately) with sealed Speaker Tags, synthetic leather ear cushions, and a voice-isolating microphone.",
			"reviews": {
				"customerProfileNames": [
					"TPM985",
					"clc251",
					"Customer",
					"AustinVail",
					"Aaron",
					"Iggy",
					"Eric",
					"Shen1517"
				],
				"customerProfilePictures": [
					"https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif"
				],
				"customerRatings": [
					"5.0 out of 5 stars",
					"5.0 out of 5 stars",
					"1.0 out of 5 stars",
					"5.0 out of 5 stars",
					"5.0 out of 5 stars",
					"5.0 out of 5 stars",
					"5.0 out of 5 stars",
					"5.0 out of 5 stars"
				],
				"customerReviewTitles": [
					"Pricey but work great",
					"Don't listen to the negative reviews! This is a solid headset!",
					"Complete disappointment",
					"Highly recommend",
					"Solid Headphones",
					"Found my last headset",
					"Best head set I’ve ever had to tell the truth",
					"My son loves these Headphones!"
				],
				"customerReviewBodies": [
					"I've owned a pair of a40's for a couple of years now (my first pair died after about 2 years of frequent use and the mic just decided to stop working). This will be my second pair. They work great for Call of Duty games because of the surround sound and clarity of sound. I'd recommend these if you don't mind the price tag of $100+.\n\nOne thing I'll say as a side note is that the first time I bought a pair of these, I bought it along with the Mixamp, which I don't think is a necessary item at all. In fact, I never could figure out what the point of the mixamp even was because whether I plugged it in directly through the controller without the mixamp, or if I did connect through optical cable and mixamp, it produced the same sound quality and volume level for me, and so I don't think you really need one. Someone else might have a different take on this, so you might want to research it further, but that's what I'd say about the mixamp.",
					"This headset is exponential! The sound is clear and the highs and base are well balanced. It also has great comfort for long usage. The customization is tops, with you being able to swap out the ear muffs with new ones if you feel the need to. You can also switch the mic to be on the left or right side, and you can switch the headband and tags on the earmuffs to customize the headset your way! This headset is MEANT TO LAST, as if you were to for some reason break the mic or the ear muffs were damaged or the cord was cut, you can go on Astros website and get brand new replacement parts so that the headset is good to go again! If you're looking for a mid-priced headset, go for this one, cause it's very reliable and a very excellent pick!",
					"Why did you guys put a mute toggle on the “mic to controller” cable instead of a volume control? I didn’t know about this and in order to change my volume I have to open up freaking settings and adjust chat and game volume inside the Xbox itself. I get it, they want us to by the mic amp... Another annoying thing is where they put the head phone jack on the same side as the mic, on the back of the left ear and the wire is constantly rubbing on my neck. This stuff is just unacceptable for a 150 dollar headset. My audio quality is the same as my 40 dollar turtle beaches, and I have an echo issue when my friends are talking to me they hear their voice echoing. really disappointed, have to buy Dolby(monthly subscription) audio the exact same as the Microsoft audio option. Please don’t waste your money on this I am so let down by this purchase",
					"I was on the fence about these because of the price. But I am glad I decided to go with them. Makes hearing footsteps in warzone and halo a lot easier. Has definitely saved my life a few times.",
					"When I walk quickly while wearing these you can hear the airflow through the headphones and it makes me feel fast. (Has nothing to do with the quality of the headphones lol) but on a serious not I would highly recommend these to gamers that are trying to take their equipment to the next level.\n\nI had the $150 turtle beach’s and they were great too but the headphones snapped in half to to bad design. These Astros are much more sturdy and I’ve noticed a big difference in the quality in the sound for these… these aren’t louder than my last headphones but they pick up on very quite sounds that I feel I wouldn’t have noticed if I was wearing Turtle Beaches.",
					"I love this headset! Besides the sound being awesome, especially with the tags removed (open back), this is the only headset you will ever need. Everything that could wear out over time could very easily be replaced (ear cushions, top head piece, tags, microphone, etc). Everything else is plastic and won’t wear out. You can also customize it however you with with several kits available. I love this thing!",
					"Great sound and quality though the microphone can be sensitive but not terribly so but do not worry it is quite manageable over all and if you want complete sound cancellation capability you could order some Astro leather ear pieces to help keep the surround sound but if you kids if pet the cloth would be better to be able to hear them better.",
					"My son use the headphones for his Xbox and for his laptop. He wanted me to listen to the sound when watching a music video; the sound quality was sound to none!!!",
					"This headset is meh. Had the A10s and upgraded to these as the A10s really hurt the top of my head. These aren't much better. They still hurt the top of my head after about an hour or so. (The foam pad that rests on the top of your head has already collapsed, making it feel like there's barely any padding at all. They also fit really loose. If I lean forward to pick something up off the ground, they try to slide off.\n\nSound quality is really good, but thats really the only good thing about these.\n\nIn the end im finding it really hard to justify the $200+ plus price tag.",
					"I got these along with the EPOS (Sennheiser) 302 and the EPOS (Sennheiser) 602 to compare side by side on an XBOX One X console. Overall, these headphones are good, but they would not be my first recommendation to anyone who is looking to game on a console. Here are some points:\n\nAstro A40 TR (no amp)\nPros\n- balanced mids and highs\n- inline mute\n- very light clamping force\n- mic is flexible and flips up\n\nCons\n- no inline volume adjustment or on the headset itself\n- bass is boosted and overpowers other ranges of sound\n- uncomfortably heavy\n\nEPOS (Sennheiser) GSP 600\nPros:\n- flip to mute mic\n- volume adjustment knob feels sturdy and well built\n- comfortable on head\n- cable is braided and has a short connection to controller\n- comes with a longer PC cable\n- very balanced lows, mids, and highs\n\nCons\n- can't swivel cups\n- medium clamping force compared to the other headsets\n\nEPOS (Sennheiser) GSP 300\nPros\n- flip to mute mic\n- volume adjustment knob\n- comfortable on head\n- very light clamping force compared to the other headsets\n\nCons\n- can't swivel cups\n- cable is too long for a gaming controller and can get twisted easily (i.e. not braided)\n- sound is \"tiny\" and lacks any real bass (and I am not a basshead)\n\nComparably, the EPOS GSP 602 are a better headset in this price range. The Astro A40s are just hyped up in my opinion and are not worth the money given that there is no external volume control. If you're willing to spend more money to get the amp for the Astro A40s, they should be worth it, but from a gaming perspective where volume might change from time to time, it is a showstopper for me not to have a handy volume knob.",
					"Let's start with the good. The only big A I will give these headphones is for comfort and breathability.\n\nThe ear cushions covered with fabric are very comfy and even those the headphone feel a bit heavy, I think it would be comfy for hours, I did not keep them for hours, I just put them back in the box and returned them once I heard the sound quality.\n\nThe bads: the sound quality is not nearly close to acceptable for an headphone at that price point. To be honest, I don't think it would be acceptable for half the price. I don't know what they thought when they designed such a nice headset and fitted low quality speakers into it.\n\nNoise insulation: none. Headphones on or not makes no difference, they do not have any insulation, but this may not be a problem, many people prefer that.",
					"Title says it all alone. I unboxed these after waiting a week and boy was I disappointed. Some people on here are very picky and i will say the quality did not seem poor! But if you’re gonna label something as “compatible” it needs to come with all the parts in order to do so. Without an amp or cable splitter (tried 1 cable splitter and it didn’t even work) you will not be able to use the mic and headset at the same time!",
					"Great headset but it has many drawbacks. For the price, I'd expect some sort of volume knob built into the chord if people do not choose to purchase mix amp. I'm forever going into the Xbox menu to lower volume which is a huge headache. Headset slides around alot but is very comfortable. Mic quality is nice but I'm always having to reset the mic as my friends hear alot of wind feedback through it. It also squeaks alot when adjusting as the build is plastic which again is disappointing given the price tag. Never buying an astro but glad I tried it out."
				]
			}
		},
		{
			"id": "9hlhmKV",
			"title": "Gaming Headset for PS4 PS5 Xbox One Switch PC with Noise Canceling Mic, Deep Bass Stereo Sound",
			"price": "$19.99",
			"image": "https://m.media-amazon.com/images/I/71wXQyxCENL._AC_SY355_.jpg",
			"description": "About this item\nCrystal Surround Sound: High precision 50mm magnetic neodymium drivers, immersive gaming experience with incredibly realistic sound. What you play, where you are. Great gaming headset for football games, shooting games, race games, switch games and so on.\nProfessional Comfort: Ultra light weight design. Our gaming headphone is less than 8 oz with high quality memory protein earmuffs and elastic head pad, which is customized designed for long time wearing. No worry and no complains for ears hurts from several hours gaming.\nFlexible Noise Cancellation Mic: With 120° flexible design, easily one mute control, and clear chatting sound picked up made you or your kids not only a good gamer, but also a great teamer.\nTrusted Durability: Braided cord, aluminum headband, triple fixed welding request and professional structure design allow you needn't to pay for any carelessness such as falling down, dragging, twisting.\nAlmost suit for all game console which with 3.5mm jack, it's a good ps4 headset, a wonderful ps5 headset, also a great xbox one headset, used on pc, and same could on the switch.\nLightweight frame, cool design and shinning led light, it's a wonderful gifts for Christmas and birthday, for boys and girls, for families and friends\nNote 1: This xbox headset is not suit for xbox 360.\nShow more",
			"reviews": {
				"customerProfileNames": [
					"Sarah",
					"Simmons",
					"T_C",
					"Charles",
					"AndrewS.Waldron",
					"Grado",
					"scwhid38",
					"Jandron"
				],
				"customerProfilePictures": [
					"https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif",
					"https://images-na.ssl-images-amazon.com/images/S/amazon-avatars-global/14314e27-0422-4bd5-9911-5f3602aafa34._CR0,0,500,500_SX48_.jpg",
					"https://images-na.ssl-images-amazon.com/images/S/amazon-avatars-global/79bd35b8-70cd-4017-8faa-78550a9cb745._CR4,0,420,420_SX48_.jpg",
					"https://images-na.ssl-images-amazon.com/images/S/amazon-avatars-global/e01f86e9-934f-4533-b049-9cb1af0bb1c8._CR0,0,445,445_SX48_.jpg",
					"https://images-na.ssl-images-amazon.com/images/S/amazon-avatars-global/6ecaea45-b547-4847-843a-4c5cc6d9d4cc._CR0,0,500,500_SX48_.jpg"
				],
				"customerRatings": [
					"5.0 out of 5 stars",
					"5.0 out of 5 stars",
					"5.0 out of 5 stars",
					"5.0 out of 5 stars",
					"5.0 out of 5 stars",
					"5.0 out of 5 stars",
					"5.0 out of 5 stars",
					"5.0 out of 5 stars"
				],
				"customerReviewTitles": [
					"Durable, Noise Cancelling Headset",
					"Essential headphones for players",
					"Awesome for the price",
					"Just as good as the more expensive brands.",
					"Solid Headset of Console or PC Gaming",
					"Build quality on point & Very comfortable",
					"Awesome gaming experience",
					"Well worth it and will last a long time."
				],
				"customerReviewBodies": [
					"Item will come repackaged.",
					"Purchased this headsetfor my 9 yr old for Christmas (after much debate as he had broken his last one). Well let me tell you, this headset is sturdy enough to tolerate the standard wear and tear 9 year olds put on things, but also a neuro-divergant 9 year old who tends to toss his headset off his head when he gets frustrated. It has enough sound cancellation for him not to be able to hear myself or my husband when we ask him questions or try to talk to him. The sound is clear, he is able to hear and be heard by others with no issue. He loves the look of it, \"very cool\". It transitions from gaming to movies effortlessly and he can use it both with his XBOX and his tablet with no issue. Highly recommend if you are looking for great quality at a great price. 10/10.",
					"For each players, a good gaming headset is essential. What kind of headset we choose depends on what game we play.\nFor example, if we are playing a game of PUBG type that we need enough surround sound to know where the enemy is at all times, and this gaming headset can well meet our needs.\nJust like I play many horror/zombie games, sound is the basic part of the gaming experience. And this headset can well meet my needs. It has a wide sound field and stereo bass surround sound, which greatly provide thriller effects and makes me better immersed in the game.\nIn online games, I often need to communicate with my teammates, and the microphone of this headset can work very well. And the LED light and appearance of this headset are very cool.\nAll in all, this headset can meet most expectations and requirements of each players.",
					"I have struggled to find a decent over the ear headset that works well. This one has exceeded my expectations. I purchased for work calls on the computer, but have recently used on my cell phone in the headphone jack. Never any complaints that people couldn't hear me and sounds is good on the headphones. I don't use the blue lights that can be turned on by using the USB plug also. Would be cool when gaming, but not as much on work calls when people can see you. As for seeing no one can tell it is a gaming headset on work calls. Glad I bought these and stopped struggling with other higher prices options that didn't work as well.",
					"My son's last gaming headset microphone broke. So I chose to buy this headset after reading the reviews. I waited about a month to make this review, so that I can give an accurate and honest one.\nMy son is a game player and a live streamer. He said this headset are equivalent to or even better than the more expensive nearly $100 headset he used before. This headset is relatively light, and there will be no falling feeling when it is hung on the ear. The filler inside the earmuffs is relatively elastic, and the material is also very soft and comfortable. The telescopic design of the skeleton suits him well and won't pinch his ears. He can wear this headset for live stream for a long time without feeling uncomfortable.\nIn a word, this headset definitely value for money and worth buying.",
					"I've purchased three pairs of this same headphone over the last 5 years. Two for use by us and the third as a gift for an Angle Tree gift. These are a solid option for a gaming headset at an affordable price. The audio quality has been good enough for both music and gaming where direction sound is important (think shooters). The durability is solid and the do a good job blocking external noise (one pair gets used near a loud HVAC system with no issues). They are also comfortable and relatively stylish. You won't go wrong picking these up for yourself or as a gift for another.",
					"I'm very happy with these. Lightweight, comfortable and sound is very good for gaming.\n\nBuild quality:\nGood at this price point - A lot of metals in the build quality- they seem sturdy enough.\n\nSound:\nSpeakers are ridiculously decent, not the best but far above average. Clear highs and lows with punchy bass. Mic is clean and my teammates can hear me well.\n\nComfort:\nI wear glasses and the cushions are very comfortable over ears and don't feel like they would be uncomfortable after long gaming sessions.\n\nValue for money 11/10\nDurability 10/10\nQuality 10/10\n\nOverall for the price, I think you'll struggle to find a headset that gives that sound depth, comfortability and ease of use as these.",
					"Sound quality is superb. I feel like these headphoneshave made me a better player.\nOther player don't complain anymore about how I sound when talking to them. so I know the microphone does not alter the way people hear my voice. The noise cancellation is just ok I can control the volume in the game and on the headset. Overall, I'm very pleased.\nThey are very light and covers the ears in full making it all the more comfortable. I have no issue wearing this headset for 8 hours without any issues or discomfort.",
					"Buying this headset is my most satisfied shopping! The sound quality of the headset is very good, clear and pleasant, and the surround sound is well. The sound quality well counteracts the sound around me, and the filler makes them comfortable with and without glasses. Its appearance is also my favorite. It's black shell with blue purple light. The sign lights on both sides of the earmuff will change color. It's very cool. I haven't received any complaints from others about the quality of the microphone, so I guess this microphone is also good! It's all worth it."
				]
			}
		},
		{
			"id": "Gffhch9",
			"title": "HyperX Cloud II - Gaming Headset, 7.1 Surround Sound, Memory Foam Ear Pads, Durable Aluminum Frame, Detachable Microphone, Works with PC, PS5, PS4, Xbox Series X|S, Xbox One – Red",
			"price": "$69.99",
			"image": "https://m.media-amazon.com/images/I/71MJ3OaVqBL._AC_SY355_.jpg",
			"description": "HyperX Cloud II features a newly designed USB sound card audio control box that amplifies audio and voice for an optimal Hi-Fi, gaming experience, so you can hear what you’ve been missing. Open up a world of detail other gamers will never know — the rustle of a camper’s boot, the scuttle in a distant vent. This next generation headset generates virtual 7.1 surround sound with distance and depth to enhance your gaming, movie or music experience. USB surround sound card works only on PC, Mac, and PS4\n\nThis headset will work with the Xbox One with headset adapter from Microsoft.\n\nIt is not supported with the Xbox 360 or PS3.",
			"reviews": {
				"customerProfileNames": [
					"BnDWilliams",
					"ErnieThor",
					"MatthewR",
					"Customer"
				],
				"customerProfilePictures": [
					"https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif"
				],
				"customerRatings": [
					"5.0 out of 5 stars",
					"5.0 out of 5 stars",
					"5.0 out of 5 stars",
					"1.0 out of 5 stars",
					"1.0 out of 5 stars"
				],
				"customerReviewTitles": [
					"Great Headset, but VERY IMPORTANT NOTE",
					"Fit and quality They are extremely comfortable: they fit snugly",
					"HyperX just earned a new life customer",
					"Warning to Xbox Users",
					"They were amazing headphones until they developed a short near the jack"
				],
				"customerReviewBodies": [
					"Small cosmetic imperfection on top, front or sides of item. Small cosmetic imperfection on bottom or back of item. Small cosmetic imperfections on the corner of the item. Item will come in original packaging. Packaging will be damaged.",
					"First of all, this headset is the best I've ever owned, by far. The sound is high quality, the microphone works perfectly and comes with a free windscreen, and it has very comfortable ear pads with an extra set of velvet ones included. BUT, the microphone WILL BE DEFECTIVE upon arrival, and you need to do something to solve the problem and restore the headset to functionality. By default, the headset comes with firmware version 0030, which contains a microphone-breaking glitch. To use the microphone on this headset, you will need to go to the official HyperX download page for the Cloud II headset and get the latest version, 0010. I'm not sure why the number is lower, or why they don't ship them with this preinstalled, but this was an IMMEDIATE solution for me, so make sure to keep that in mind before buying these.",
					"HyperX Cloud II Gaming Headset for PC & PS4 - Red (KHX-HSCP-RD)\n\nI’ve had these about a week, and have used them for about 16 hours for gaming and a couple hours of music listening. If something significant worth noting comes up later I will add to this review.\n\nBackground\nI am an audiophile, I am old, and so my hearing is not what it used to be. However, I have always had a very high-end stereo system and generally the highest quality headphones. I am also A PC gamer.\nFit and quality\nThey are extremely comfortable: they fit snugly, but are not tight. If you wear glasses, you will barely notice the temple pieces, if at all. The leather pads are soft and conform around your ears well including isolating you from any ambient sounds in your home. There is also an extra set of foam pads to replace the leather pads. You can install these if you want something even softer.\nI have a slightly larger head. I wear a 7-1/4 hat size, and with a baseball cap I am usually in the last one or two adjustment holes. The phones will not fall off when you tip your head back or forward. Generally, they (feel) very light on your head, and after three or four hours of gaming, your ears are not all sweaty and hot. They breathe well, so moisture doesn’t collect. I live in Hawaii, so I am a good test case for that.\nThe material used is high quality stuff. Anodized steel, leather pads for ears and headband, and a hard plastic shell form the ear cups. Attachment points are solid to the ear cups. The only thing I might ding the design for is the wiring to the ear cups. While it is solidly fastened, it is possible to accidently hook one of the wires and perhaps damage the connection. Of course this would be a remote circumstance. My wife likes them as well, because the oval shape of the cups allows room for her earrings. For you dudes that have large ears or wear earrings, especially those big suckers, you may be out of luck.\n\nSound\nThey sound great, and with the isolation you can hear everything the soundtrack has to offer. There is a simple instruction you should follow for set up for a PC. Go into control panel into your sound app and set up for 7.1 that is included in the box. As far as “Virtual Sound” I can’t tell the difference between that and what stereo offers. During gaming I can hear things to the left, right, and center. For music, stereo placement is good and music with a good mix will place instruments where they might be on stage. Classical music: of course violins are on the left and brass on the right.\n\nMiscellaneous\nThis company offers a 2 year warranty, and this by itself show that the company is pretty confident about the quality. If there were a lot of problems with this product they’d lose money on a two year warranty.\nPackaging is top notch, beautiful, well designed and is another clue that you are getting something pretty good. The box is built like Fort Knox and all the doo-dads are packed firmly away in foam. You get a ditty bag for traveling, and adaptors for PC, Mac, and gaming consoles, including controllers.\nThe wire is cloth covered and avoids tangling. I used ear-buds previously and those things always got tangled and fell out of my ears, or loosened. The cord is plenty long enough and the volume control for the mic and headphones is handy. The in-line control also has a Mic-mute switch, too.\n\nAll things considered, this is a 5 star piece of equipment in all respects. I did NOT get any perks or incentives to write this review.",
					"I bought these as a replacement for my old Logitech G430s. They were getting old and they were hurting my head to wear for longer than 2 hours at a time. These Cloud IIs have been amazing so far. They are super comfortable and the sound quality is great for what I use it for (gaming, discord chat with friends).\n\nPros:\n- Comfortable foam sits well on my head\n- Can wear for extended periods without headache\n- Sound is clear and perfect for hearing 360 degrees\n- Mic is very well made and crystal clear (from what my friends tell me) and it WILL NOT pick up stray sounds in the room. If I try to talk through it from further than foot or 2 away, it will not pick up.\n- Maybe a con, but I cannot hear much else with these on. They immerse me fully in whatever I'm doing, sometimes to the frustration of my SO.\n\nCons:\n- Cable sometimes gets in my way when I'm trying to move my desk chair around\n- Nothing else really that I've had happen so far.\n\nI will be buying another set of these if/when these ever give out on me. Best headset I've ever had.",
					"First off, the headsets are very comfortable. I could wear them all day. They sound good and all, but there’s a catch for Xbox users: you can’t use the 7.1 Surround Sound USB card. After a brief talk with the customer service (who was very nice), I found out that this piece is “incompatible” with the Xbox. It would have been nice to know that beforehand! The description says, “Compatible with PC, PS4, Xbox One, etc...” No! It does not work the same at all! The headphones will still function, but not at the same level as expected.",
					"They were amazing headphones until they developed a short near the jack. I had to hold the wire at just the right angle for them to work. I am very disappointed with the durability of the wire given these are $100 headphones. I've had tougher $5 usb cables. I won't be buying HyperX products again as this is a huge oversight in design.",
					"Erst einmal vorweg: Ich habe jetzt über 15 Jahre Erfahrung was Headsets angeht (Privat) und war lange Zeit in einem Computer-Fachhandel tätig.\nIch habe verschiedenste Produkte aus den verschiedensten Häusern (Logitech, Roccat, Teufel, Sennheiser oder günstigere Marken wie Hama, Trust, ASUS, Speedlink etc. getestet).\nNun bin ich kein Experte was Musik angeht, da ich selber nur höre anstatt zu produzieren, doch ich denke, dass ich mit meiner Erfahrung und meinem Wissen einiges berichten kann.\nMein vorheriges Headset war das Logitech G230, welches einige Mängel hatte. Vor diesem hatte ich das Logitech G930, welches mein persönliches Highlight war.\n\nKurzfassung:\n\nWer ein Headset sucht, welches möglichst lange angenehm auf dem Kopf liegt und zudem eine gute Mikrofon- und Klangqualität bietet, ist mit dem Kingston HyperX Cloud II BESTENS beraten!\nHinzu kommt ein klasse Lieferumfang und eine überzeugende Verarbeitung sowie Haptik.\nWas nicht 100%ig überzeugt, ist das 7.1 System... Warum? Weil es eine günstige und einfache Lösung ist, welche nicht in allen Bereichen überzeugt. Dazu weiter unten mehr.\n\nWarum habe ich mir ausgerechnet dieses Headset zugelegt?\n\nDas Headset hat tolle Bewertungen bekommen, sowohl von Nutzern als auch von Experten. Es bot genau das, was ich suche und brauche - nicht mehr und nicht weniger! Ich brauche aufgrund meiner Arbeit sowie Freizeitbeschäftigungen ein Headset, welches ich stundenlang auf dem Kopf tragen kann, ohne dass es lästig wird. Außerdem sollte es ein vernünftiges Mikrofon besitzen, welches nicht starr ist, sondern sich bewegen lässt und zudem unabhängig von den Windows-Einstellungen Geräusche wie Wind, Atmen, leichtes räuspern etc. filtert.\nDas klappt wunderbar! Sollte man dennoch nicht zufrieden sein, lassen sich in den Windows-Soundeinstellungen weitere Einstellungen vornehmen - in meinem Fall brauchte ich das gar nicht!\n7.1 war kein Muss, jedoch ein brauchbares Feature in Videospielen.\nAnsonsten sollte die Verarbeitung vernünftig sein und nicht alles aus Kunststoff.\n\nVerarbeitung, Optik & Haptik:\n\nAnders als man vielleicht auf den ersten Blick vermutet, ist das Headset nicht vollständig aus Metall. Nur die Halter und das ovale Emblem an den Seiten der Hörer sind aus Metall, der Rest ist auf Stoff, Kunststoff oder Kunstleder. Das bedeutet, dass auch der Bügel aus Kunststoff ist, das sieht man zwar nicht, aber man hört / fühlt es, wenn man den Hügel leicht biegt - da besteht also Bruchgefahr!\nAbgesehen davon fühlt sich das Headset extrem hochwertig an, liegt gut an und sieht gut aus! Die Ohrmuscheln sind aus Leder, es liegt aber auch ein Paar aus Stoff bei - sehr angenehm. Man kann es locker mehrere Stunden am Stück tragen.\nDer Kunststoff ist nicht minderwertig, fühlt sich auch gut an. Es ist diese \"samtige\" Art von Kunststoff, wie man ihn auch unter anderem von Computer-Mäusen kennt. Nichts knackt, nichts knarzt, nichts wackelt - so wie es sein muss!\nDas Mikrofon ist optional und muss nicht zwingen angeschlossen sein, lässt sich einfach in die gewünschte Position biegen und ist mit Stoff ummantelt. Das Kabel ist extrem lang, ebenfalls mit Stoff ummantelt und ziemlich dick, dadurch robust.\n\nFeatures, Tasten etc.\n\nDas Headset hat am Kabel wie nahezu jedes Headset ein kleines Bedienelement. In diesem Fall ist es gar nicht so klein und bietet praktische Möglichkeiten. So lassen sich Lautstärke sowie Mikrofon-Pegel lauter oder leiser stellen, an der Seite ist ein kleiner Schalter zum muten (Mikrofon aus) und auch das bereits erwähnte 7.1 lässt sich hier an und ausschalten - das funktioniert schnell und ohne Probleme. Natürlich ist auch eine kleine Klemme an dem Bedienelement z.B. für das T-Shirt.\nDas Headset selbst hat weder Tasten noch Beleuchtung, lässt sich aber beliebig in der Größe einstellen.\nMikrofon lässt sich wie schon geschrieben abnehmen. Ohrmuscheln ebenfalls zum Reinigen oder Austauschen.\n\nSound- und Mikrofonqualität:\n\nDer wohl wichtigste Punkt für die Meisten.\nMan muss bei diesem Headset zwischen Stereo und 7.1 unterscheiden. Da 7.1 hier nur simuliert wird, kann man natürlich keine unglaublichen Tonerlebnisse wie im Studio erwarten. Allerdings war ich doch überrascht... 7.1 kommt besonders in Videospielen (wofür es in diesem Falle ja auch gedacht ist) zur Geltung und verleiht bestimmten Musik-Richtungen wie Electro, House, Techno etc. und in vielen Fällen auch Rock & Metal einen neuen, positiven Klang! Manche Lieder klingen mit eingeschaltetem 7.1 tatsächlich besser. Andere Songs, besonders ältere oder von minderer Qualität (Aufnahme) klingen hingegen schlecht, kratzig oder der Gesang ist einfach zu leise und nahezu unhörbar.\nDa man 7.1 einfach hin- und herschalten kann, hat man aber viele Möglichkeiten zu variieren.\nInsgesamt ist der Sound sowohl bei Musik als auch in Videospielen sehr gut, Bass ist sehr angenehm und die Höhen und Tiefen sind meinen Ohren nach optimal. Natürlich kann man auch hier wieder in den Einstellungen rumspielen.\nDas Mikrofon filtert wie erhofft alle unerwünschten Geräusche, sitze gerade im Sommer neben einem Ventilator - davon bekommen die Gesprächspartner nichts mit. Die Qualität ist überdurchschnittlich gut. Wer z.B. ein RØDE Mikrofon besitzt, kann dank des abnehmbaren Mikrofons dieses benutzen.\n\nLieferumfang & Verpackung:\n\nÜber den Lieferumfang hatte ich mich nicht informiert, einfach weil es mir nicht wichtig war. Doch auch hier wurde ich abermals positiv überrascht!\nDie Verpackung ist unglaublich hochwertig, besonders wenn man die dünne Umverpackung abmacht. Kann man sich sogar ins Regal stellen! ;-)\nNeben dem Headset bekommen wir außerdem 1 Paar Ohrpolster, 1 Tasche, ein Adapter (siehe Bilder) und den üblichen Papierkram.\nViel Inhalt für dieses Budget! Zudem sind alle Teile, besonders die Tasche extrem hochwertig und stinken nicht chemisch.\n\nFazit:\n\nEin für 60-70€ unglaublich gutes und hochwertiges Headset aus dem Hause Kingston. Ja, Kingston. Nicht Logitech und Co.\nMit viel Lieferumfang und toller Qualität. Kleinen Mängeln, über die man hinwegsehen kann oder für die man eine Lösung findet!",
					"",
					"Je sors de 6 mois d'achats à gauche à droite de casques de différentes marques et je n'ai pas trouvé mieux dans cette gamme de prix. Sennheiser, KLIM, Logitech ne m'ont pas du tout convaincu à côté du Cloud II. Je trouve même l'HyperX Cloud Alpha moins bien et surtout moins confortable que le Cloud II.. Ne faites pas comme moi et prenez directement celui-là, vous gagnerez du temps.\n\nJ'ai été vraiment surpris par la qualité du son. Il est clair, propre et immersif. J'arrive enfin à surprendre un ennemi dans un FPS grâce aux informations données par l'environnement sonore ! J'avais trois casques différents pour la télé, le portable et le pc. Je ne me sers maintenant plus que du Cloud II pour vous dire. Je ne me sers cependant pas du 7.1 Virtuel que je trouve inutile et de mauvaise qualité.\n\nQue le micro soit amovible c'est vraiment le top, et il est parfaitement ajustable lorsqu'il est branché. Le design est sobre et élégant et les finitions sont remarquables. Coussinets en velours ou cuir au choix et pochette de rangement en plus, sympathique.\n\nSi je devais lui reprocher quelque chose ce serait qu'il n'y a pas d'interfaces de commandes (muet, volume) sur les écouteurs mais que le hub est sur le casque. C'est un choix du constructeur, j'étais habitué à l'inverse. Au final ce n'est pas plus mal d'un point de vue design de manière à ce que l'on peut le porter plus facilement pour écouter simplement de la musique sans qu'il ne crie \"gaming\".\n\nJe finirais par quelques mots sur le confort. C'est le seul casque que j'ai trouvé jusqu'à maintenant avec lequel après plusieurs heures de sessions de gaming ou de film je le trouve encore vraiment confortable (portant des lunettes pendant ces sessions).\n\nJ'en ai fais déjà acheté deux à des amis qui sont tout autant satisfait que moi. Pour moi, il n'y a vraiment pas mieux.\n\nJ'espère vous avoir convaincu ;)",
					"",
					"Preface to say, this 4 star rating is only because I have a massive head, like literally. Not fat or anything, I just cannot find a hat that fits me. I'm absolutely sure this will not affect you, unless you knowingly have a head that does not fit any hat you've ever tried.\n\nThe issue for this product arose that i'd feel my head being squished by the headset, which led to initial discomfort. I'd often swap back to just using my speakers because my head was aching from wearing it for so long. However, as continued use got on, either it turned my head into an meat accordion to make itself fit, or i just stretched it out with my immensely obtuse cranium use. Either way, the discomfort went away after about a week or two.\n\nSound quality is absolutely stellar. I've almost overdosed on heavy bass at least 5 times since I got it.\n\nOutgoing verbal quality is also amazing, so my friends have said- although, there was a brief period where my outgoing audio was not good. I figure it was just a loose connection, so i took apart and reconnected everything and i've not had a single issue since- (In retrospect, my friends discovered it's entirely possible audio was going through my webcam mic instead).\n\nI ordered this headset about two months ago, and the quality that it has so far bestowed me with is probably the best i've ever experienced, then again, i've never shelled out this much for a headset/mic in the past, so it was to be expected.\n\nUnsure? thinking of checking many a forum to find the right answer? Just buy this. I've extensively asked many different people/communities what they think the best for the money is, and they're all pointing to this. It's probably definitely worth the money.",
					"とにかく注意してほしい。バーチャル7.1chサラウンドではない。\nプロパティで設定したときに不思議だった。2chしか選択肢が出てこない。\n恐る恐るPUBGで使ってみたら全く定位がつかめない\nUSBサウンドカード？の7.1ボタンを押すともっと場所がぼやけて聞こえる。\n耳がおかしいのかと思ってロジクールg430で聞き直してみた。\n確信した。このキングストンの製品はバーチャル7.1chサラウンドではない。\nこれと同じレビューをしている人もいたのだからレビューをよく読むべきだった。\nFPSゲームをしたい人には勧められない。\n着け心地はいいので映画を観たり音楽を聴くだけならいいのかもしれない。\nすぐに\"7.1サラウンドサウンド\"という表記を改めるべき。騙そうとしてるとしか思えない。\n現にビッグカメラのゲーミング用品コーナーでもバーチャル7.1chと表記されていた。\n取扱量販店ですら勘違いする表現だということだ。\nFPSゲーム用に買ったのでもちろん返品する。\n（2021.02.21追記）公式ホームページを見たら薄い色で小さい字で下の方に「1．バーチャル7.1サラウンドサウンド効果は、ステレオヘッドホンで使用すると2チャンネルステレオ信号として出力されます」と書いてある。PCがそのように認識する仕様ならそれ以上の詳細なデータの送受信はしてないってことでは？高評価のレビューを見るとPS4プレイヤーばかり？PS4ってあまり定位は関係ないのかな？公式が推してるプロも定位が関係あるゲームのプレイヤーではないようだし、キングストン的には「FPS向けとは一言も言ってませんしｗｗｗバーチャル7.1chとは書いてませんしｗｗ勘違いする方が悪いｗ」って感じなんですかね？ほんとのらりくらりとズルい言い方をしてる。",
					"",
					"Queste cuffie mi stanno regalando delle emozioni incredibili.\nPartiamo col fatto della completa modularità: Le cuffie possono essere usate tranquillamente da pc, smartphone, console e anche tostapani (se volete sentire meglio il \"tiiin\") mediante il plug/unplug di varie periferiche. Possiamo tranquillamente andare a fare un giro all'aperto staccando il microfono e la scheda audio usb, e ci rimarrà il jack 3.5, Per gaming su pc basta riattaccare il tutto, su console basta staccare solo la scheda audio e così via.\nVERSATILITÀ 10/10\nOra parliamo di Confort e Design. Le cuffie sono tra le più leggere che abbia mai provato e anche tra le più leggere cuffie gaming in assoluto. Il loro design è sobrio e senza troppi sfarzi, rendendole adatte sia ad una postazione tamarra che ad una minimal.\nDESIGN/CONFORT 10/10\nOra il microfono è un piccolo neo, ma nemmeno troppo grosso. Il volume è leggermente basso, ma basterà avvicinarlo a un paio di centimetri dalla bocca ed il suono catturato sarà davvero cristallino. Simpatico l'antipop anche se non svolge egregiamente il suo lavoro. Se non vogliamo o non ci serve il microfono in un preciso momento, taac si stacca.\nMICROFONO 7/10\nIl packaging è davvero qualcosa di fenomenale, non mi sarei mai e poi mai aspettato di ricevere così tanto: cuffie, microfono, scheda audio 7.1 usb, adattatore per aereo, custodia da viaggio, padiglioni di ricambio e tantissimi sali di silicia.\nUNBOXING 10/10\nOra passiamo al succo dell'headset: l'audio. Si presenta davvero in maniera cristallina su tutte le tonalità, è molto bilanciato e mai intrusivo, non fa sembrare di avere la testa dentro un acquario come il 70% delle normali cuffie gaming. Il 7.1 poi è qualcosa di favolosamente preciso e maestoso.\nAUDIO 10/10\n***\nIN CONCLUSIONE\nUno tra i migliori headset in commercio per qualità prezzo, i materiali, il design e tutti i fattori di queste cuffie mi suggeriscono affidabilità e qualità.\nVOTO GENERALE 9.5/10 (il microfono potrebbe avere un volume un po' più alto).\nSe vi è stata utile questa recensione, segnalatelo con l'apposito bottone! ;)",
					""
				]
			}
		},
		{
			"id": "sh5XnBp",
			"title": "SteelSeries Arctis Pro + GameDAC Wired Gaming Headset - Certified Hi-Res Audio - Dedicated DAC and Amp - for PS5/PS4 and PC - Black",
			"price": "$189.00",
			"image": "https://m.media-amazon.com/images/I/818eAQB3NyL._AC_SY450_.jpg",
			"description": "Arctis Pro + GameDAC delivers gaming's first certified Hi-Res Audio system, ensuring you hear high-fidelity 96 kHz / 24 bit, full resolution audio at its purest, with no down-sampling. The gaming audio system includes the legendary ESS Sabre DAC and amp. Plus, Arctis Pro + GameDAC is designed with luxury materials like polished steel and aluminum alloy, and the exclusive Arctis ski goggle headband and Airwave performance fabric ear cushions. The Arctis Pro headset features a studio-quality Clearcast microphone for unparalleled voice clarity and background noise cancellation. Headphone impedance 32 Ohm. *While not designed for Xbox, you can still use these headsets on the Xbox Series X|S by connecting to the controller via included 3.5mm wire.",
			"reviews": {
				"customerProfileNames": ["AnthonyC.", "chrisc", "Woody", "Trinidude"],
				"customerProfilePictures": [
					"https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif"
				],
				"customerRatings": [
					"5.0 out of 5 stars",
					"5.0 out of 5 stars",
					"1.0 out of 5 stars",
					"5.0 out of 5 stars"
				],
				"customerReviewTitles": [
					"Excellent Wireless Headset Choice for both PS4/PS5 and Nintendo Switch",
					"These > Astro A50 (for ps4)",
					"product broken and Steelseries has refused to replace",
					"Solid audio and no connectivity issues (Tested with PS4 Pro)"
				],
				"customerReviewBodies": [
					"I’ve gone through exactly 3 headsets (The official Microsoft Xbox One headset, PlayStation Gold Wireless headset 2018, and a Razor headset) looking for a viable option that had both DECENT audio and mic quality, as all the headsets I’ve purchased have had build quality issues and terrible mic quality. I’ve given up on picking up a wireless headset as from what I’ve seen, are incredibly expensive. I saw the ad for the SteelSeries Arctic 1 headset and it seemed too good to be true (very cheap price for a wireless headset, and interchange between 3 consoles) and to my surprise, it lived up to pretty much all its claims.\n\nWireless connectivity works seamlessly with its included dongle, and I have had zero dropouts or latency issues with it on both PS4 and Nintendo Switch. I originally purchased this headset primarily for the PS4, as I imagined wireless headsets were completely incompatible with the Nintendo Switch, but the headset does in-fact work effortlessly and all the buttons on the headset (Mic Mute On/Off, Volume Dial) work on both systems. Mic quality is excellent as well as audio quality, it’s perfectly balanced and not ridiculously skewed towards bass, and the volume can be raised very high on both consoles if you want. Battery life so far has also been great, it’s something I haven’t had to worry about when using and I only had to charge them once every week out of habit. The headset itself doesn’t feel flimsy and seems decently built, It’s pretty light and is surprisingly comfortable to wear, so much I use it also when I’m on my laptop. The only thing that slightly annoys me is that when I switch playing consoles and want to use the headset on it, I have to get up and unplug the headset dongle and connect it to the console I’m using (say, from the PS4 to the Nintendo Switch). This is pretty much a first world problem, but it’s something I’ve come across every once in a while.\n\nOverall I have to say I’m really loving this headset, if you were on the fence for this thing I really recommend you give it a try.\n\nUPDATE June 2020: It’s been 8 months since I’ve bought this headset, and I just wanted to report back that it has held up ROCK SOLID. This thing is by all means not flimsy, and the battery life has held up incredibly well. I’ve been gaming really long sessions, roughly 5-6 hours long each with friends online, and this thing just keeps going with no issues whatsoever. One of the few purchases I’ve made that I can say was absolutely worth it.\n\nFINAL UPDATE April 2021: Managed to get myself a PS5 and happy to say the headset works flawlessly with it. The new thing I love about the headset now is that the PS5 has a USB-C port in the front, which means you don’t have to use the included cable that comes with the headset dongle for USB-A, you can plug it directly to the PS5 and it sits flush and is almost unnoticeable.",
					"I had the astro a50s before this. I used both for ps4 and this is by far the best headset (wireless) i had for my ps4. I also had the razer thresher 7.1. Both with the thresher and a50 I would get feedback which was apparently caused by sidetones, which neither headsets allow to be adjusted. The arctis pro wireless does allow to adjust for sidetones so if youre constantly getting feedback cause of sidetones, that shouldnt be an issue with these. The sound is superb although I heard the sound on the wired and gamedac version is better but wireless is important for me as I have a toddler running around. The battery swap function is also a plus as you never have to worry if you forgot to charge as long as you keep one in the transmitter. They are also really comfortable. For the price range, it really comes down to these or the astros and speaking as someone who has both, go with these.\n\nThe astros are trash, the headsets never lasted me more than two or three months before i had to send back for repairs and it was also a headache dealing with their customer service.\n\nUpdate: I have had these almost a yr now and have yet to have any issue with them. On rare occassions I may turn the headset on and get feedback but I just turn them off and back on again and problem solved. If you are thinking of these or the astro a50's, I would go with these. The astro a50 will work for about a month before you have to send them in for repairs and you better get the extended warranty.",
					"The headphones and gamedac broke after less than a year and Steelseries has not honored the warranty. Steelseries told me to destroy the product and prove that I destroyed it in order to have my warranty claim approved. Then, after I did so, I was given a code to use on the Steelseries web store, but the code only provided sufficient funds to replace the gamedac -- not the headphones. I have received no response from Steelseries after following up multiple times regarding the claim.",
					"T",
					"First a bit of history:\n\nI've owned and loved many SteelSeries products in the past, from the Senei to the Xai and arguably my favourite PC gaming headset ever, the Siberia V2. So when it came time to replace my aging Astro A40s on the PC I did the usual YouTube review rabbit hole of research into headsets and these consistently came up as \"the best gaming headset ever\" or \"A true contender to the Astro A50\" (In the case of the wireless version).\n\nSo, I pulled the trigger. There were a few things I was looking for in a headset:\n1. Comfort\n2. Spatial audio\n3. Sound quality\n\nComfort:\n\nAlthough the ski goggle and \"airweave\" fabric design seems to be, on paper, like a good idea, in practice it falls short. Side clamping force on these is actually greater than my old A40s and that bothers me as a glasses wearer. Also, the headset makes a the kind of rubberized deep \"creaking\" noise when you flex yor jaw or move your head as the material slips against the arms of your glasses. On the contrary, the \"fuzzy\" material on the A40s never did this, also the headband, despite not being made of this goggle material, is more comfortable.\n\nNot only were the Arctis pro less comfortable, but the suspension headband isn't as adjustable as it seems. I had to have it near the end of its adjustement for my head and the velcro fastener was alreay hanging half-off its mount just to try and get that extra 2-3cm of reach.\n\nBack to the clamping force, these headsets tend to \"pull up\" on your skull rather than rest on them. The elastic goggle band works as a spring, pulling the earcups back upwards creating a rather unsettling feeling on the side of your face.\n\nSpatial Audio:\n\nDTS Headphone X 2.0 is billed as the holy grail of positional audio for this headset, it's also the first to support it. The problem is, there is literally ZERO mention about how it's implemented. Do games have to explicitly support it? Does it magically enhance existing stereo and surround streams? No answer, and no information is given about this other than a rather silly info-article on Steelseries' website disguised as an \"interview\" with the lead DTS engineer for Headphone X.\n\nAlso, theoretically, Headphone X seems misguided. It bills itself as able to \"reproduce the original mixing room\" audio of the source material without actually questioning whether the creator wants that to happen to begin with.\n\nTake the excellent sound design of Battlefield 1, for example: When DTS is enabled, (tested with every in-game setting) the audio tends to be hollowed out, and the soundstage widens but precision as actually lessend for it. I really tried to give it some time for my brain to adjust to it but a few things finally made me give up. First, the \"room simulation\" tech in DTS was so aggressive that the orchastral score played during BF1 matches was absolutely ruined by the effect, and second the female voice announing key milestones during the match became so echoed that i had to double check my settings again and again.\n\nIt seems to me, at least for game audio, that Dolby has had the upper hand for years on DTS and that trend doesn't seem to be reversing anytime soon.\n\nSound Quality:\n\nSpatial audio aside, i have to give it to the Arctis pro's here. The drivers are deep, crisp and clean after adjusting the EQ to my taste (slight bass boost and tiny drop in mids / tiny increase in treble) i found the stereo presentation quite nice, full bodied, albeit rather \"closed\" in terms of sound compared to the semi-open A40s and A50s.\n\nI played some tracks in iTunes and A/B tested my Steelseries with my old A40s and the Steelseries generally come out ahead, slightly. They sound \"brighter.\"\n\nConclusion:\n\nThe GameDac is nice, the menus are really quick and snappy and turning on/off DTS Headphone X is a single push of a button. I tested the Hi-Res mode but have no content (and little to zero game actually support 24bit/96Khz) to prove its worth. I simply used my iTunes store tracks to experience the Hi-Res mode and heard only the tiniest of differences in the \"smoothness\" of the presentation of tracks, something i might have actually been cognitively biased towards so a blind test might have been better for me.\n\nFor the price I paid, and for what I wanted (something to absolutely blow away my old A40s) I didn't get the real deal from Steelseries. There are two things needed for this product to succeed and it falls short there: 1. Ditch DTS for Dolby as the spatial signature of Headphone X is awful whenever I experienced it. 2. Re-do the comfort and fit of these headphones, the \"ski goggle\" idea is cute but ski goggles aren't supposed to be the holy grail of comfort, they're designed to stay on your skull as you rip down a mountain, comfort is secondary. Why take inspiration from a product that isn't even aiming to achieve your paramount goal?\n\nAlthough my old A40s don't sound as nice, their spatial Dolby audio setting is rock solid without much distortion or muddy room-effects added to the game sound. I'll wait for another offering from Steelseries or simply see what Astro has in store next.",
					"I've had these now for about 6 months. So this isn't an initial first impressions kind of review. I've read what a lot of people have said and it seems like a few people think they understand things that the clearly do not and blame the headphones for it. So let's go.\n\nComfort: Honestly, this is going to come down to your ear shape and size probably more than anything. If you have little ears, or ears that sit tight to your head - then in terms of comfort I can sum it up best by saying you'll probably forget you have them on at times. They're comfy, lightweight, and they sit well with the ski band system. I'm a 6'6 adult male. I do not have a little head - yet these headphones stay on me all day whether im in a gaming marathon or working and listening to spotify. The only pain you'll probably get is if you have ears that jut out from your head because the earcups are rather shallow - so your ears will be pressed against the unit and that can become painful over long periods of play; I had that for the first few days of wearing these but I haven't felt it since.\n\nBuild Quality: I'm someone who will pay a lot of money for quality. Build Quality is a factor in me keeping or returning items. I haven't in 6 months gotten bored of picking the headset up and putting it on. It feels great. It feels like it costs. Nothing has worn down, come loose, etc. They just keep looking and performing good.\n\nWireless and Battery: I'm comboing this section because they're directly related. You get 2 batteries, so one is always charging while the other is in use. Swapping takes 5 seconds and I've got that down to a 1-handed science. It's laughably easy to swap and charge the batteries, anyone who complains about this likely failed grade school recess. The battery life varies on usage scenario I have found - but I was say on average you're looking at MINIMUM 6 hours with constant music at full volume with bass boosting (more on that next) and as much as a full day if you just leave them turned on and only use the actual speakers sparingly.\n\nIn terms of wireless range, I can broadcast from my upstairs computer (using the wireless dac) all the way into the basement (3 levels) and from the front of my property to the corners of my backyard (large lot). The only time I seem to have ANY issues with range is when I'm within 5 ft of the microwave and it's running. Def interference there - do not recommend warming up pizza pops while wearing these headphones.\n\nSOUND QUALITY: I left this for last, and my opening comments were mainly about this section. People complaining about the sound quality and putting that on the headphones do not know how audio works. These speakers are absolutely able to output incredible fidelity and the simulated surround sound is also top notch for headphones on the market. The issue isn't the hardware here. It's the limitations of the source and what the dac is able to do with that sound. Likely, you're planning on using these headphones on PC. Windows default audio is dog ____ quality. To really get the most out of your hardware, you need a third party audio manager to unlock the capabilities of even the headset your using when reading this.\n\nDon't believe me, well let me show you. open up google and look for \"boom 3d\" (pro-tip, it's also on steam). It will have a 100% complete free trial. Download it, and set it up. when it running, turn on it's surround sound and pick an equalizer you like, I typically leave it on \"windows\". I bet your cheap walmart headphones suddenly sound a lot better. If you want crazy good music in the arctis headset, turn surround off and instead put it to max fidelity (same row as surround button, to the right) and increase the slider controlling the equalizer. I will bet money you can't handle the sound coming out at full volume without developing tinnitus.\n\nSee, it has nothing to do with the headset itself. The headset is money. People just don't realize that their computers, phones, and consoles have all kinds of factory limits or settings that really gimp the audio. You can spend like crazy and never figure out why it still feels empty. There are other way to unlock that sound, but Boom 3D is the cheapest and easiest way to manage it all. Best of all, your $10 license can be used on 2 computers, so you can give one to a friend and look like a hero.\n\nAll told, this headset is amazing. I had HyperX Cloud II before this so I was coming from a very good headset with high expectations - and the Arctis has been everything I had hoped it would be.",
					"I",
					"I bought these to use with a Windows 11 laptop, Nvidia Shield, and mobile phone. They just weren't up to the job. Installed on the laptop, downloaded and installed the latest software - it doesn't do anything, any adjustments in the software are ignored by the device;\nEvery time the laptop is rebooted the headphones are re-detected and reinstalled - 9 times so far, so it's nearly impossible to work out which device to connect to.\nThe sound quality, and bass response is very poor for a headset of this price, and the build quality is not great, from the first time I put them on I could feel and hear the hinges cracking. Impossible to stay connected - they randomly disconnect from bluetooth or their own transmitter.\nHad them a week and returned.",
					"I had left a 5-star review because everything about this headset was amazing. I used it every day. But it's been 16 months and for the past month, I can't get the battery to charge properly. I'm getting maybe 4 hours of battery before the light goes red, and no matter how long I charge it for, it never goes above yellow."
				]
			}
		},
		{
			"id": "p1Aj6ol",
			"title": "Turtle Beach Recon 200 Gen 2 Powered Gaming Headset for Xbox Series X, Xbox Series S, & Xbox One, PlayStation 5, PS4, Nintendo Switch, Mobile, & PC with 3.5mm connection - Black",
			"price": "$44.95",
			"image": "https://m.media-amazon.com/images/I/71HLVO3K5OS._SX342_.jpg",
			"description": "Hear Big. Win Big. with the Turtle Beach Recon 200 Gen 2 powered gaming headset. The Recon 200 Gen 2 delivers powerful, amplified audio that supports spatial sound technologies like Windows Sonic, Dolby Atmos, DTS Headphone: X and Sony 3D Audio for PS5. Plus, it’s equipped with an on-board rechargeable 12-hour battery to unleash even more immersive audio features like bass boost and variable mic monitoring so you can hear the volume of your voice in the headset. But we get it, 12-hours can go by quickly, so the Recon 200 Gen 2 gaming headset was built to keep going without power in passive mode for game audio*. Whether you’re chatting with teammates or trash-talking the enemy, the high-sensitivity, flip-to-mute mic picks up your comms loud and clear. Feel next generation comfort with redesigned, ultra-soft memory foam ear cushions with ProSpecs glasses-friendly technology, wrapped in athletic fabric to keep you cool over hours of gaming. The reinforced metal headband returns for the Gen 2, with enhanced styling and added rigidity, while maintaining its lightweight and flexible structure. With a simple flip of a switch, the Recon 200 Gen 2 works with Xbox Series X, Xbox Series S, PS5 & PS4, Nintendo Switch and more.\n\n \n\nAmplified Audio – Amplified 40mm speakers deliver immersive, detailed gaming audio and supports spatial surround sound & 3D audio technologies, plus always on bass boost & variable mic monitoring.\nNext-Gen Comfort – New for the Gen 2, ultra-soft memory foam ear cushions wrapped in athletic fabric keep you cool and comfortable over hours of gaming.\nGlasses-Friendly Comfort – Patented ProSpecs dual-foam ear cushions alleviate pressure so gamers with glasses can play in comfort.\nFlip-to-Mute Mic – Turtle Beach’s renowned, high-sensitivity mic picks up your voice loud and clear and flips up to mute.\n12-Hour Power – A 12-hour battery delivers amazing, amplified audio features including always-on bass boost and variable mic monitoring.\nBass Boost – Powered by the rechargeable battery, feel the earth-quaking rumble of always-on Bass Boost.\nVariable Mic Monitoring – Hear and adjust the volume of your voice inside the headset so you never have to shout.\nDurable Design – An adjustable metal-reinforced headband is redesigned for added rigidity, while maintaining its lightweight and flexible structure for long-lasting durability.\nMultiplatform Compatibility – Works perfectly with your favorite game consoles, controllers, mobile devices, or anything with a standard 3.5mm jack.",
			"reviews": {
				"customerProfileNames": [
					"Stephanie",
					"Joanjag",
					"Max1242",
					"AR",
					"KarlaC.",
					"HondoKelly",
					"Chaser69",
					"AngelaMattil"
				],
				"customerProfilePictures": [
					"https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif"
				],
				"customerRatings": [
					"5.0 out of 5 stars",
					"5.0 out of 5 stars",
					"5.0 out of 5 stars",
					"5.0 out of 5 stars",
					"5.0 out of 5 stars",
					"5.0 out of 5 stars",
					"5.0 out of 5 stars",
					"5.0 out of 5 stars"
				],
				"customerReviewTitles": [
					"Good set",
					"Works great",
					"Great sound and very comfortable",
					"Great headset for the price",
					"Great Quality",
					"Love them",
					"Headphones",
					"Love it"
				],
				"customerReviewBodies": [
					"Sound is good and fit is comfortable. Wish the cost was less, but good product!",
					"Opened the box. Plugged it in. It worked beautifully.",
					"Can be used once charge has depleted. Fits around glasses perfectly.",
					"I enjoy the quality for the price point really sounds good and I can hear everything here the rumble when am playing a first person shooter the only con I have is that it does need charge when you use it a lot but can’t really ask for much for the price great item !",
					"Great quality, exactly as described.",
					"It’s comfortable, has a pretty long lasting battery; it lasted three days without charging\nThe mic quality is super good according to my friends and the sound quality is beautiful I love these things",
					"Great product!!",
					"Good quality I use it in party chats to talk to my friends when we're playing games together.",
					"I order 2 all ready . They don’t want to change it and they second one don’t even last a week working",
					"Muy buenos graves y cómodos",
					"",
					"Cumple con las expectativas",
					"",
					"nd"
				]
			}
		},
		{
			"id": "YvAmcxU",
			"title": "HyperX Cloud II - Gaming Headset, 7.1 Surround Sound, Memory Foam Ear Pads, Durable Aluminum Frame, Detachable Microphone, Works with PC, PS5, PS4, Xbox Series X|S, Xbox One – Gun Metal",
			"price": "$69.99",
			"image": "https://m.media-amazon.com/images/I/71M5l+O4OFL._AC_SY355_.jpg",
			"description": "HyperX Cloud II features a newly designed USB sound card audio control box that amplifies audio and voice for an optimal Hi Fi gaming experience, so you can hear what you’ve been missing. Open up a world of detail other gamers will never know — the rustle of a camper’s boot, the scuttle in a distant vent. This next generation headset generates virtual 7.1 surround sound with distance and depth to enhance your gaming, movie or music experience. The headset must be selected as the default audio device in your sound settings. For Windows: 1. Open up Control Panel and select Hardware and Sound and then select Sound. 2. If the “HyperX 7.1 Audio” is not currently the default audio device, right click on the option and select “Set as Default Device.” 3. This should place a green check mark next to the default audio device. Repeat the same steps for the microphone portion of the headset, located under the “Recording” tab (also found in the Sound program in Control Panel.) For Mac: 1. Click the Apple menu and select “System Preferences” from the drop down menu. 2. In “System Preferences”, click on the ‘Sound’ icon. 3. Click on the Input tab and select “HyperX 7.1 Audio” for default sound input. 4. Click on the Output tab and select “HyperX 7.1 Audio” for default sound output. Note: The headset may appear as \"USB audio\" instead of \"HyperX 7.1 Audio\". Hear the rich, impactful sounds of your games with clarity and precision.",
			"reviews": {
				"customerProfileNames": [
					"BnDWilliams",
					"ErnieThor",
					"MatthewR",
					"Customer"
				],
				"customerProfilePictures": [
					"https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif"
				],
				"customerRatings": [
					"5.0 out of 5 stars",
					"5.0 out of 5 stars",
					"5.0 out of 5 stars",
					"1.0 out of 5 stars",
					"1.0 out of 5 stars"
				],
				"customerReviewTitles": [
					"Microsoft 365 Family | Premium Office Apps | Up to 6 users | 3 Months Free, Plus 12-Month Subscription\nMicrosoft 365 Family | Premium Offic…",
					"Save $30 at checkout | Adobe Acrobat Pro DC subscription with auto-renewal\nSave $30 at checkout | Adobe Acroba…",
					"Save 68% on McAfee Total Protection 3 Device\nSave 68% on McAfee Total Protection 3 D…",
					"PC Game Pass: 3 Month Membership [Digital Code]\nPC Game Pass: 3 Month Membership […",
					"Great Headset, but VERY IMPORTANT NOTE",
					"Fit and quality They are extremely comfortable: they fit snugly",
					"HyperX just earned a new life customer",
					"Warning to Xbox Users",
					"They were amazing headphones until they developed a short near the jack"
				],
				"customerReviewBodies": [
					"Small cosmetic imperfection on bottom or back of item. Item will come in original packaging. Packaging will be damaged.",
					"First of all, this headset is the best I've ever owned, by far. The sound is high quality, the microphone works perfectly and comes with a free windscreen, and it has very comfortable ear pads with an extra set of velvet ones included. BUT, the microphone WILL BE DEFECTIVE upon arrival, and you need to do something to solve the problem and restore the headset to functionality. By default, the headset comes with firmware version 0030, which contains a microphone-breaking glitch. To use the microphone on this headset, you will need to go to the official HyperX download page for the Cloud II headset and get the latest version, 0010. I'm not sure why the number is lower, or why they don't ship them with this preinstalled, but this was an IMMEDIATE solution for me, so make sure to keep that in mind before buying these.",
					"HyperX Cloud II Gaming Headset for PC & PS4 - Red (KHX-HSCP-RD)\n\nI’ve had these about a week, and have used them for about 16 hours for gaming and a couple hours of music listening. If something significant worth noting comes up later I will add to this review.\n\nBackground\nI am an audiophile, I am old, and so my hearing is not what it used to be. However, I have always had a very high-end stereo system and generally the highest quality headphones. I am also A PC gamer.\nFit and quality\nThey are extremely comfortable: they fit snugly, but are not tight. If you wear glasses, you will barely notice the temple pieces, if at all. The leather pads are soft and conform around your ears well including isolating you from any ambient sounds in your home. There is also an extra set of foam pads to replace the leather pads. You can install these if you want something even softer.\nI have a slightly larger head. I wear a 7-1/4 hat size, and with a baseball cap I am usually in the last one or two adjustment holes. The phones will not fall off when you tip your head back or forward. Generally, they (feel) very light on your head, and after three or four hours of gaming, your ears are not all sweaty and hot. They breathe well, so moisture doesn’t collect. I live in Hawaii, so I am a good test case for that.\nThe material used is high quality stuff. Anodized steel, leather pads for ears and headband, and a hard plastic shell form the ear cups. Attachment points are solid to the ear cups. The only thing I might ding the design for is the wiring to the ear cups. While it is solidly fastened, it is possible to accidently hook one of the wires and perhaps damage the connection. Of course this would be a remote circumstance. My wife likes them as well, because the oval shape of the cups allows room for her earrings. For you dudes that have large ears or wear earrings, especially those big suckers, you may be out of luck.\n\nSound\nThey sound great, and with the isolation you can hear everything the soundtrack has to offer. There is a simple instruction you should follow for set up for a PC. Go into control panel into your sound app and set up for 7.1 that is included in the box. As far as “Virtual Sound” I can’t tell the difference between that and what stereo offers. During gaming I can hear things to the left, right, and center. For music, stereo placement is good and music with a good mix will place instruments where they might be on stage. Classical music: of course violins are on the left and brass on the right.\n\nMiscellaneous\nThis company offers a 2 year warranty, and this by itself show that the company is pretty confident about the quality. If there were a lot of problems with this product they’d lose money on a two year warranty.\nPackaging is top notch, beautiful, well designed and is another clue that you are getting something pretty good. The box is built like Fort Knox and all the doo-dads are packed firmly away in foam. You get a ditty bag for traveling, and adaptors for PC, Mac, and gaming consoles, including controllers.\nThe wire is cloth covered and avoids tangling. I used ear-buds previously and those things always got tangled and fell out of my ears, or loosened. The cord is plenty long enough and the volume control for the mic and headphones is handy. The in-line control also has a Mic-mute switch, too.\n\nAll things considered, this is a 5 star piece of equipment in all respects. I did NOT get any perks or incentives to write this review.",
					"I bought these as a replacement for my old Logitech G430s. They were getting old and they were hurting my head to wear for longer than 2 hours at a time. These Cloud IIs have been amazing so far. They are super comfortable and the sound quality is great for what I use it for (gaming, discord chat with friends).\n\nPros:\n- Comfortable foam sits well on my head\n- Can wear for extended periods without headache\n- Sound is clear and perfect for hearing 360 degrees\n- Mic is very well made and crystal clear (from what my friends tell me) and it WILL NOT pick up stray sounds in the room. If I try to talk through it from further than foot or 2 away, it will not pick up.\n- Maybe a con, but I cannot hear much else with these on. They immerse me fully in whatever I'm doing, sometimes to the frustration of my SO.\n\nCons:\n- Cable sometimes gets in my way when I'm trying to move my desk chair around\n- Nothing else really that I've had happen so far.\n\nI will be buying another set of these if/when these ever give out on me. Best headset I've ever had.",
					"First off, the headsets are very comfortable. I could wear them all day. They sound good and all, but there’s a catch for Xbox users: you can’t use the 7.1 Surround Sound USB card. After a brief talk with the customer service (who was very nice), I found out that this piece is “incompatible” with the Xbox. It would have been nice to know that beforehand! The description says, “Compatible with PC, PS4, Xbox One, etc...” No! It does not work the same at all! The headphones will still function, but not at the same level as expected.",
					"They were amazing headphones until they developed a short near the jack. I had to hold the wire at just the right angle for them to work. I am very disappointed with the durability of the wire given these are $100 headphones. I've had tougher $5 usb cables. I won't be buying HyperX products again as this is a huge oversight in design.",
					"Erst einmal vorweg: Ich habe jetzt über 15 Jahre Erfahrung was Headsets angeht (Privat) und war lange Zeit in einem Computer-Fachhandel tätig.\nIch habe verschiedenste Produkte aus den verschiedensten Häusern (Logitech, Roccat, Teufel, Sennheiser oder günstigere Marken wie Hama, Trust, ASUS, Speedlink etc. getestet).\nNun bin ich kein Experte was Musik angeht, da ich selber nur höre anstatt zu produzieren, doch ich denke, dass ich mit meiner Erfahrung und meinem Wissen einiges berichten kann.\nMein vorheriges Headset war das Logitech G230, welches einige Mängel hatte. Vor diesem hatte ich das Logitech G930, welches mein persönliches Highlight war.\n\nKurzfassung:\n\nWer ein Headset sucht, welches möglichst lange angenehm auf dem Kopf liegt und zudem eine gute Mikrofon- und Klangqualität bietet, ist mit dem Kingston HyperX Cloud II BESTENS beraten!\nHinzu kommt ein klasse Lieferumfang und eine überzeugende Verarbeitung sowie Haptik.\nWas nicht 100%ig überzeugt, ist das 7.1 System... Warum? Weil es eine günstige und einfache Lösung ist, welche nicht in allen Bereichen überzeugt. Dazu weiter unten mehr.\n\nWarum habe ich mir ausgerechnet dieses Headset zugelegt?\n\nDas Headset hat tolle Bewertungen bekommen, sowohl von Nutzern als auch von Experten. Es bot genau das, was ich suche und brauche - nicht mehr und nicht weniger! Ich brauche aufgrund meiner Arbeit sowie Freizeitbeschäftigungen ein Headset, welches ich stundenlang auf dem Kopf tragen kann, ohne dass es lästig wird. Außerdem sollte es ein vernünftiges Mikrofon besitzen, welches nicht starr ist, sondern sich bewegen lässt und zudem unabhängig von den Windows-Einstellungen Geräusche wie Wind, Atmen, leichtes räuspern etc. filtert.\nDas klappt wunderbar! Sollte man dennoch nicht zufrieden sein, lassen sich in den Windows-Soundeinstellungen weitere Einstellungen vornehmen - in meinem Fall brauchte ich das gar nicht!\n7.1 war kein Muss, jedoch ein brauchbares Feature in Videospielen.\nAnsonsten sollte die Verarbeitung vernünftig sein und nicht alles aus Kunststoff.\n\nVerarbeitung, Optik & Haptik:\n\nAnders als man vielleicht auf den ersten Blick vermutet, ist das Headset nicht vollständig aus Metall. Nur die Halter und das ovale Emblem an den Seiten der Hörer sind aus Metall, der Rest ist auf Stoff, Kunststoff oder Kunstleder. Das bedeutet, dass auch der Bügel aus Kunststoff ist, das sieht man zwar nicht, aber man hört / fühlt es, wenn man den Hügel leicht biegt - da besteht also Bruchgefahr!\nAbgesehen davon fühlt sich das Headset extrem hochwertig an, liegt gut an und sieht gut aus! Die Ohrmuscheln sind aus Leder, es liegt aber auch ein Paar aus Stoff bei - sehr angenehm. Man kann es locker mehrere Stunden am Stück tragen.\nDer Kunststoff ist nicht minderwertig, fühlt sich auch gut an. Es ist diese \"samtige\" Art von Kunststoff, wie man ihn auch unter anderem von Computer-Mäusen kennt. Nichts knackt, nichts knarzt, nichts wackelt - so wie es sein muss!\nDas Mikrofon ist optional und muss nicht zwingen angeschlossen sein, lässt sich einfach in die gewünschte Position biegen und ist mit Stoff ummantelt. Das Kabel ist extrem lang, ebenfalls mit Stoff ummantelt und ziemlich dick, dadurch robust.\n\nFeatures, Tasten etc.\n\nDas Headset hat am Kabel wie nahezu jedes Headset ein kleines Bedienelement. In diesem Fall ist es gar nicht so klein und bietet praktische Möglichkeiten. So lassen sich Lautstärke sowie Mikrofon-Pegel lauter oder leiser stellen, an der Seite ist ein kleiner Schalter zum muten (Mikrofon aus) und auch das bereits erwähnte 7.1 lässt sich hier an und ausschalten - das funktioniert schnell und ohne Probleme. Natürlich ist auch eine kleine Klemme an dem Bedienelement z.B. für das T-Shirt.\nDas Headset selbst hat weder Tasten noch Beleuchtung, lässt sich aber beliebig in der Größe einstellen.\nMikrofon lässt sich wie schon geschrieben abnehmen. Ohrmuscheln ebenfalls zum Reinigen oder Austauschen.\n\nSound- und Mikrofonqualität:\n\nDer wohl wichtigste Punkt für die Meisten.\nMan muss bei diesem Headset zwischen Stereo und 7.1 unterscheiden. Da 7.1 hier nur simuliert wird, kann man natürlich keine unglaublichen Tonerlebnisse wie im Studio erwarten. Allerdings war ich doch überrascht... 7.1 kommt besonders in Videospielen (wofür es in diesem Falle ja auch gedacht ist) zur Geltung und verleiht bestimmten Musik-Richtungen wie Electro, House, Techno etc. und in vielen Fällen auch Rock & Metal einen neuen, positiven Klang! Manche Lieder klingen mit eingeschaltetem 7.1 tatsächlich besser. Andere Songs, besonders ältere oder von minderer Qualität (Aufnahme) klingen hingegen schlecht, kratzig oder der Gesang ist einfach zu leise und nahezu unhörbar.\nDa man 7.1 einfach hin- und herschalten kann, hat man aber viele Möglichkeiten zu variieren.\nInsgesamt ist der Sound sowohl bei Musik als auch in Videospielen sehr gut, Bass ist sehr angenehm und die Höhen und Tiefen sind meinen Ohren nach optimal. Natürlich kann man auch hier wieder in den Einstellungen rumspielen.\nDas Mikrofon filtert wie erhofft alle unerwünschten Geräusche, sitze gerade im Sommer neben einem Ventilator - davon bekommen die Gesprächspartner nichts mit. Die Qualität ist überdurchschnittlich gut. Wer z.B. ein RØDE Mikrofon besitzt, kann dank des abnehmbaren Mikrofons dieses benutzen.\n\nLieferumfang & Verpackung:\n\nÜber den Lieferumfang hatte ich mich nicht informiert, einfach weil es mir nicht wichtig war. Doch auch hier wurde ich abermals positiv überrascht!\nDie Verpackung ist unglaublich hochwertig, besonders wenn man die dünne Umverpackung abmacht. Kann man sich sogar ins Regal stellen! ;-)\nNeben dem Headset bekommen wir außerdem 1 Paar Ohrpolster, 1 Tasche, ein Adapter (siehe Bilder) und den üblichen Papierkram.\nViel Inhalt für dieses Budget! Zudem sind alle Teile, besonders die Tasche extrem hochwertig und stinken nicht chemisch.\n\nFazit:\n\nEin für 60-70€ unglaublich gutes und hochwertiges Headset aus dem Hause Kingston. Ja, Kingston. Nicht Logitech und Co.\nMit viel Lieferumfang und toller Qualität. Kleinen Mängeln, über die man hinwegsehen kann oder für die man eine Lösung findet!",
					"",
					"Je sors de 6 mois d'achats à gauche à droite de casques de différentes marques et je n'ai pas trouvé mieux dans cette gamme de prix. Sennheiser, KLIM, Logitech ne m'ont pas du tout convaincu à côté du Cloud II. Je trouve même l'HyperX Cloud Alpha moins bien et surtout moins confortable que le Cloud II.. Ne faites pas comme moi et prenez directement celui-là, vous gagnerez du temps.\n\nJ'ai été vraiment surpris par la qualité du son. Il est clair, propre et immersif. J'arrive enfin à surprendre un ennemi dans un FPS grâce aux informations données par l'environnement sonore ! J'avais trois casques différents pour la télé, le portable et le pc. Je ne me sers maintenant plus que du Cloud II pour vous dire. Je ne me sers cependant pas du 7.1 Virtuel que je trouve inutile et de mauvaise qualité.\n\nQue le micro soit amovible c'est vraiment le top, et il est parfaitement ajustable lorsqu'il est branché. Le design est sobre et élégant et les finitions sont remarquables. Coussinets en velours ou cuir au choix et pochette de rangement en plus, sympathique.\n\nSi je devais lui reprocher quelque chose ce serait qu'il n'y a pas d'interfaces de commandes (muet, volume) sur les écouteurs mais que le hub est sur le casque. C'est un choix du constructeur, j'étais habitué à l'inverse. Au final ce n'est pas plus mal d'un point de vue design de manière à ce que l'on peut le porter plus facilement pour écouter simplement de la musique sans qu'il ne crie \"gaming\".\n\nJe finirais par quelques mots sur le confort. C'est le seul casque que j'ai trouvé jusqu'à maintenant avec lequel après plusieurs heures de sessions de gaming ou de film je le trouve encore vraiment confortable (portant des lunettes pendant ces sessions).\n\nJ'en ai fais déjà acheté deux à des amis qui sont tout autant satisfait que moi. Pour moi, il n'y a vraiment pas mieux.\n\nJ'espère vous avoir convaincu ;)",
					"",
					"Preface to say, this 4 star rating is only because I have a massive head, like literally. Not fat or anything, I just cannot find a hat that fits me. I'm absolutely sure this will not affect you, unless you knowingly have a head that does not fit any hat you've ever tried.\n\nThe issue for this product arose that i'd feel my head being squished by the headset, which led to initial discomfort. I'd often swap back to just using my speakers because my head was aching from wearing it for so long. However, as continued use got on, either it turned my head into an meat accordion to make itself fit, or i just stretched it out with my immensely obtuse cranium use. Either way, the discomfort went away after about a week or two.\n\nSound quality is absolutely stellar. I've almost overdosed on heavy bass at least 5 times since I got it.\n\nOutgoing verbal quality is also amazing, so my friends have said- although, there was a brief period where my outgoing audio was not good. I figure it was just a loose connection, so i took apart and reconnected everything and i've not had a single issue since- (In retrospect, my friends discovered it's entirely possible audio was going through my webcam mic instead).\n\nI ordered this headset about two months ago, and the quality that it has so far bestowed me with is probably the best i've ever experienced, then again, i've never shelled out this much for a headset/mic in the past, so it was to be expected.\n\nUnsure? thinking of checking many a forum to find the right answer? Just buy this. I've extensively asked many different people/communities what they think the best for the money is, and they're all pointing to this. It's probably definitely worth the money.",
					"とにかく注意してほしい。バーチャル7.1chサラウンドではない。\nプロパティで設定したときに不思議だった。2chしか選択肢が出てこない。\n恐る恐るPUBGで使ってみたら全く定位がつかめない\nUSBサウンドカード？の7.1ボタンを押すともっと場所がぼやけて聞こえる。\n耳がおかしいのかと思ってロジクールg430で聞き直してみた。\n確信した。このキングストンの製品はバーチャル7.1chサラウンドではない。\nこれと同じレビューをしている人もいたのだからレビューをよく読むべきだった。\nFPSゲームをしたい人には勧められない。\n着け心地はいいので映画を観たり音楽を聴くだけならいいのかもしれない。\nすぐに\"7.1サラウンドサウンド\"という表記を改めるべき。騙そうとしてるとしか思えない。\n現にビッグカメラのゲーミング用品コーナーでもバーチャル7.1chと表記されていた。\n取扱量販店ですら勘違いする表現だということだ。\nFPSゲーム用に買ったのでもちろん返品する。\n（2021.02.21追記）公式ホームページを見たら薄い色で小さい字で下の方に「1．バーチャル7.1サラウンドサウンド効果は、ステレオヘッドホンで使用すると2チャンネルステレオ信号として出力されます」と書いてある。PCがそのように認識する仕様ならそれ以上の詳細なデータの送受信はしてないってことでは？高評価のレビューを見るとPS4プレイヤーばかり？PS4ってあまり定位は関係ないのかな？公式が推してるプロも定位が関係あるゲームのプレイヤーではないようだし、キングストン的には「FPS向けとは一言も言ってませんしｗｗｗバーチャル7.1chとは書いてませんしｗｗ勘違いする方が悪いｗ」って感じなんですかね？ほんとのらりくらりとズルい言い方をしてる。",
					"",
					"Queste cuffie mi stanno regalando delle emozioni incredibili.\nPartiamo col fatto della completa modularità: Le cuffie possono essere usate tranquillamente da pc, smartphone, console e anche tostapani (se volete sentire meglio il \"tiiin\") mediante il plug/unplug di varie periferiche. Possiamo tranquillamente andare a fare un giro all'aperto staccando il microfono e la scheda audio usb, e ci rimarrà il jack 3.5, Per gaming su pc basta riattaccare il tutto, su console basta staccare solo la scheda audio e così via.\nVERSATILITÀ 10/10\nOra parliamo di Confort e Design. Le cuffie sono tra le più leggere che abbia mai provato e anche tra le più leggere cuffie gaming in assoluto. Il loro design è sobrio e senza troppi sfarzi, rendendole adatte sia ad una postazione tamarra che ad una minimal.\nDESIGN/CONFORT 10/10\nOra il microfono è un piccolo neo, ma nemmeno troppo grosso. Il volume è leggermente basso, ma basterà avvicinarlo a un paio di centimetri dalla bocca ed il suono catturato sarà davvero cristallino. Simpatico l'antipop anche se non svolge egregiamente il suo lavoro. Se non vogliamo o non ci serve il microfono in un preciso momento, taac si stacca.\nMICROFONO 7/10\nIl packaging è davvero qualcosa di fenomenale, non mi sarei mai e poi mai aspettato di ricevere così tanto: cuffie, microfono, scheda audio 7.1 usb, adattatore per aereo, custodia da viaggio, padiglioni di ricambio e tantissimi sali di silicia.\nUNBOXING 10/10\nOra passiamo al succo dell'headset: l'audio. Si presenta davvero in maniera cristallina su tutte le tonalità, è molto bilanciato e mai intrusivo, non fa sembrare di avere la testa dentro un acquario come il 70% delle normali cuffie gaming. Il 7.1 poi è qualcosa di favolosamente preciso e maestoso.\nAUDIO 10/10\n***\nIN CONCLUSIONE\nUno tra i migliori headset in commercio per qualità prezzo, i materiali, il design e tutti i fattori di queste cuffie mi suggeriscono affidabilità e qualità.\nVOTO GENERALE 9.5/10 (il microfono potrebbe avere un volume un po' più alto).\nSe vi è stata utile questa recensione, segnalatelo con l'apposito bottone! ;)",
					""
				]
			}
		},
		{
			"id": "wHHecgH",
			"title": "ASTRO Gaming A50 Wireless Headset + Base Station Gen 4 - Compatible with Xbox Series X|S, Xbox One, PC, Mac - Black/Gold",
			"price": "$299.99",
			"image": "https://m.media-amazon.com/images/I/71Pfow1d1-L._SX342_.jpg",
			"description": "Experience legendary performance and sound of astro audio V2, with the convenience and freedom that comes without wires. The A50 wireless + base station for Xbox Series X|S, Xbox one & PC delivers premium acoustics (Dolby Atmos), ergonomics, comfort and durability that gamers demand. The all-new base station provides clear, low-latency voice communication, while making headset pairing and charging simple. The astro command center software allows pros and streamers to tune every input and output parameter of the A50 precisely for their specific setup. For even more flexibility, The optional A50 mod kit allows users to add synthetic leather headband ear cushions for improved noise isolation. Experience absolute audio immersion with the A50 wireless + base station.",
			"reviews": {
				"customerProfileNames": ["Daniel", "Royce", "Sam", "ReneVazquez"],
				"customerProfilePictures": [
					"https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif"
				],
				"customerRatings": [
					"5.0 out of 5 stars",
					"1.0 out of 5 stars",
					"5.0 out of 5 stars",
					"4.0 out of 5 stars"
				],
				"customerReviewTitles": [
					"Great Headset",
					"Important read for a prospective customer",
					"Works great! When it works...",
					"A great headset with some flaws...but what headset doesnt? :)"
				],
				"customerReviewBodies": [
					"I bought this headset to replace my Turtle Beach Elite 800x headset mostly hoping it wouldn’t make my ears hurt so much after a long gaming session. I’m happy to say these are extremely comfortable headsets and I’m very pleased with them overall. They sound good. I think they get plenty loud - I usually have them set about halfway. They were easy to setup. I love the look and the customization with the command center. They get excellent battery life, I've never dropped below 50% charge even after gaming most of the day away. And again, I can’t stress how comfortable these things are.\n\n-- Below is the original story --\n\nThis is a great headset and I will give it 5 stars once a very simple problem is fixed.\n\nThe headset will not be recognized by Xbox after the Xbox is turned on. To get the headset to be recognized you have to either unplug and re-plugin the base station or switch the mode switch to PC and back to Xbox. Unfortunately I see forum posts about this going all the way back to the gen3 version in 2016 so I decided to leave a 1-star review in the hopes it might actually motivate ASTRO to finally fix it.\n\nUpdate 8/21/19:\nI reached out to customer support. They said that they are currently working on a fix for the connection issue but there is no estimate when the update would be released. They at least seemed to know exactly what problem I was referring to so hopefully it’s resolves in not too long.\n\nUpdate 11/23/19\nCustomer support ended in a dead end. The Xbox connection issue still persists. I've been trying every so often to check if there's a firmware update but there never is. It seems that support for this brand new product is already discontinued.\n\nFinal Update 12/7/19\nI reached out to customer support again and was given a version of firmware to install manually on my headset. I did as instructed and the problem is now resolved. I have not had any more issues with needing to reset the headset to get it to connect to Xbox. It's unclear if this update is published publicly yet (I never got any prompt to update through the command center) so if you're having this issue reach out to their customer support.",
					"I want my money back immediately. 30 years of gaming and have seen the evolution of headsets over the years.\n\nThis headset knocked Astro back 5 years.\n\nBecause of this release, I will never buy from this brand ever again.\n\nWant your headphones to randomly work?\n\nWant to troubleshoot your headset more than you play the games you bought it for?\n\nLook no further, you've found the headset of your dreams.\n\nThis is the biggest disappointment in a product I've ever experienced in a long time.",
					"S",
					"About 3 hours into using and i noticed No more loss/drop of sound like previous gen 3! Very comfortable. The large soundstage is incredible on xbox. Earcup material is not as comfortable as steel series but thats a small thing. The astro sound is now beyond and more immersive than what previous gens produced. Netrual color is bad ass. Not as mid range punchy as the arctis 9x or pro but more bass punch. Sound stage is bigger but the arctis 9x and pro have better directional pin point.\n\nUpdate: Tuesday aug 13\n\nA few days later i updated the firmware and i am now experiencing not sound drop but a sound hiccup for a split second every 8-15 minutes or sometimes once an hour. A immersion killer for sure. Going to try to sort this out. I will update soon.\n\nUpdate weds aug 14\nThe hiccups are few and far in between. The xbox doesnt recognized the base station. I have to turn on the xbox, unplug and re plug the headset in before sound comes out. :( hope these issues get handled soon. Sound and comfort is still a 5 but the problems after the firmware update have brought this down to a 4 star over all.\n\nUpdate aug 16\n\n1 week later the sound drop hiccups are brief(split second)but frequent and bring you out of immersion. I experience the similar thing with the arctis 9x but much much less frequent(is this an xbox x bug?). I prefer the arctis 9x sound, fit, and directional sound pin point for most shooters.\n\nFor adventure games the astro takes the win. For edge in competitive the arctis.. I have both and spent waaayy too much on headsets. Choose one they both kick ass hahha",
					"Nice quality, nice sound. If you follow the instructions using two hands to place headset on the base, no trouble getting to to charge first time every time. Dolby digital atmos option.... they give you 2 years free... like I'm paying $450 for headphones, with a pay to play option like all the video game systems out there these days. When does this pay to play b.s. end? When do we get to \"own\" what we pay for? Why should there be a subscription to get the full use of your headphones?",
					"Update Mi-Avril: Après avoir contacté la compagnie j'ai été aidé pour réparer l'issue que j'avais. Tout simplement supprimer Astro Command Center et le télécharger à nouveau en mettant le fichier à jour manuellement ! C'est dommage de devoir le faire, mais le casque fonctionne tout de même très bien et je n'aurais probablement pas eu ce problème si j'utilisais ce casque que pour mes consoles.\n\nUpdate avril 2021. Le casque ne fonctionne plus pour aucune raison apparente. 1 an de durée de vie pour un casque de 400$ peu utilisé et en bon état c'est juste impardonnable.\n\nAprès longue hésitation, j'ai décidé d'acheter ce casque malgré le prix.\n\n*Comparatif avec Astro A40 Tr+ et Sennheiser Pro Gamer Zero avec empli.\n\nDéfinitivement mon casque préféré niveau sonore et esthétique. J'hésitais à opter pour un casque sans fil, mais je ne regrette aucunement mon choix. La qualité sonore est parfaite.\nLe son est du même niveau que mon \"kit\" Sennheiser d'une valeur de 800$.\nLa qualité du micro est impeccable.\nLe casque est confortable et bien construit. La connexion et les branchements étaient simples. J'ai eu la chance d'essayer le casque sur PC et sur Xbox One X avec Dolby Atmos (un essai de 2 ans gratuit vient avec le casque).\n\nÀ recommander pour ceux qui peuvent y mettre le prix !",
					"",
					"Let me start by saying I will never buy another Astro product ever again. Please Read! I bought these Nov 2019 and a year later the base station won't even turn on. I've contacted support dozens of times each of which there was no reply or compassion to purchasing a $500 gaming headphones. My first gripe came when I contacted them regarding the headphones not working with the new Xbox Series X. After 4 emails they gave me some hurting generic apology about the delay being cover related. After doing my own research I discovered a firmware update to the base station would work. After the update I noticed the base would stay on 24/7. I thought this was odd because it would over overheat when charging the headphones. Fast forward 3 months the base station is now fried. No power. Wont turn on. Cant charge the headphones and no audio. Contacted support. No reply and warranty is expired. Wow!!! Im appalled by this company. Therefore I will never buy anything Astro again.",
					"This headset with the Dolby Atmos license makes you feel like you're in a full surround sound speaker setup. It has made gaming that much more enjoyable with immersive sound and spatial awareness. Solid wireless performance, extremely pleased with the range too. It is so comfortable, the cloth ear cups breath well and let in just enough external sound so you can hear someone trying to get your attention. Mic clarity is bar none, all of my friend have commented how crisp and clear my voice is now. The noise cancellation and mic monitoring are awesome. Lastly, the built-in audio/voice mixer is superb allowing you to blend conversations with game music easily on the fly. This is my 3rd wireless headset for XBOX, I've always been a huge fan of Turtle Beach but the quality, product finish and longevity isn't what it used to be years ago so will likely be sticking with Astro in the future.",
					"All was well for the first few months. Eventually charging started becoming an issue. Both when they are mounted or plugged in the light will turn white instead of orange and the headphones will stay on but not charge. So once they are disconnected from their power source they will shut off moments later. It’s gotten worse and more frequent to the point that this is constantly the case and they no longer can be considered a “wireless” headset. For $450 I expected better. The mic quality is okay but not fantastic. The mic monitoring(side tone) is great and headphone sound quality is satisfactory. The comfort level is fine and I like the mute feature activated simply by raising the mic. Overall some good features but not enough to make up for the headphones failing to function properly in less than a year."
				]
			}
		},
		{
			"id": "0TaWJPU",
			"title": "Razer Kraken Ultimate RGB USB Gaming Headset: THX 7.1 Spatial Surround Sound - Chroma RGB Lighting - Retractable Active Noise Cancelling Mic - Aluminum & Steel Frame - for PC & Mac - Classic Black",
			"price": "$79.99",
			"image": "https://m.media-amazon.com/images/I/71Wuv0p6UfL._AC_SY355_.jpg",
			"description": "The Kraken Ultimate comes equipped with THX game profiles that provides battle Royale fans with the definitive audio experience. Hear the unfair advantage firsthand and be the last man standing with the Razer Kraken Ultimate. Armed with THX Spatial Audio, a highly tuned noise-canceling mic, and long-lasting comfort to provide the ultimate competitive gaming audio experience.",
			"reviews": {
				"customerProfileNames": [
					"KennethMoultonJr.",
					"S.Shogrin",
					"Customer",
					"JackF"
				],
				"customerProfilePictures": [
					"https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif",
					"https://images-na.ssl-images-amazon.com/images/S/amazon-avatars-global/f5fdc94e-029e-40f4-aa9d-246f50e65513._CR109,0,281,281_SX48_.jpg"
				],
				"customerRatings": [
					"4.0 out of 5 stars",
					"5.0 out of 5 stars",
					"5.0 out of 5 stars",
					"5.0 out of 5 stars"
				],
				"customerReviewTitles": [
					"Save $30 at checkout | Adobe Acrobat Pro DC subscription with auto-renewal\nSave $30 at checkout | Adobe Acroba…",
					"PC Game Pass: 3 Month Membership [Digital Code]\nPC Game Pass: 3 Month Membership […",
					"Razer Kitty Ears for Kraken Headsets: Compatible with Kraken 2019, Kraken TE Headsets - Adjustable Strraps - Water Resistant Construction - Green\nRazer Kitty Ears for Kraken Headsets: Co…",
					"Razer Wolverine V2 Wired Gaming Controller for Xbox Series X|S, Xbox One, PC: Remappable Front-Facing Buttons - Mecha-Tactile Action Buttons and D-Pad - Trigger Stop-Switches - Black\nRazer Wolverine V2 Wired Gaming Contr…",
					"Razer Seiren Mini USB Streaming Microphone: Precise Supercardioid Pickup Pattern - Professional Recording Quality - Ultra-Compact Build - Heavy-Duty Tilting Stand - Shock Resistant - Classic BlackRazer Seiren Mini USB Streaming Microphone: Precise Supercardioid Pickup Pattern - Professional Recording Quality - Ultra-Compact Build - Heavy-Duty Tilting Stand - Shock Resistant - Classic Black",
					"Razer Laptop Stand Chroma: Customizable Chroma RGB Lighting - Ergonomic Design - Anodized Aluminum Construction - 3x Port USB 3.0 Hub - Matte BlackRazer Laptop Stand Chroma: Customizable Chroma RGB Lighting - Ergonomic Design - Anodized Aluminum Construction - 3x Port USB 3.0 Hub - Matte Black",
					"Over-complicated and Convoluted... 7.1... Pffft",
					"Unleash the Kraken Ultimate!",
					"Amazing! Great for my ears, no pain.",
					"Wonderful headset"
				],
				"customerReviewBodies": [
					" My reviews are detailed. If you want the short and thin, it's a good product, but buckle up for a wild ride to get what you think you paid for. 7.1 surround is not easily obtainable.\n\nNow, I should start by explaining that I am very technical. I am a software developer who for ten years ran a custom to order computer company that catered to enthusiasts with hefty hardware and software needs to target specific gaming goals.\n\nThe device is gorgeous, durable, sounds awesome, super comfy, has a very nice feel to the cord, and my favorite feature: the physical mute button when you squeeze the extendable, flexible microphone is super satisfying... and glows red when you're on mute. The style and look is absolutely inspiring, and all this other stuff is awesome...yet I still can't run this thing in 7.1.\n\nThey say there's a code to enter in the Synapse app. They say after you register the product you'll get the code (your serial number is under one of your ear pads, BTW... You're welcome). They also say that this is virtual 7.1 based off 5.1 technology, and most games only support 5.1 anyway. They ALSO say that if you want to you can pay for a new code to subscribe to the ability to use 7.1 features. I would sooner sell it than to pay a subscriber fee to use my own headphones.\n\nSo after three days of messing with this thing I've totally given up on some email they claim to have sent, some code to enter into another software suite they want me to download, and expected software letdowns from the games I play that don't support 7.1 anyway.\n\nI don't see a need for all this hubbub... just pack the ability with the product and make the software run it... there's no reason for this \"enter a code to get another code to download a new bit of software to enter another code\" crap. That may have been exciting for 12 yearolds in the 90's but we just want it to work. For the love of all that is holy... for the prices we pay, just make it work!",
					"I've been using a Kraken headset I got in a holiday Cynosa bundle. It's a good headset, but nothing like the Kraken Ultimate.\nSound is so much better, much \"fuller\" sound. These also feel higher quality construction, but much more comfortable to wear. Being USB, I was worried about sound volume...there is no need, these get louder than you need. I have other Razer Chroma devices, so this just adds to the Chroma LED effects, and integrates well with the Synapse 3 software.\nSo far, my only negative would be the mic mute switch doesn't work with different apps, like Discord. It's a mute switch for the mic, so if you have it on, the system doesn't see a microphone.\nOther than that one negative, these headphones are awesome! Are they worth the $130 asking price? Probably not, but with inflation and other headphones of this level...maybe price point is spot on.\nThis doesn't work with XBox or PS4, Razer has special headphones for consoles, search for those.",
					"TLDR: I wear glasses and headsets dig into my head causing me pain and leaving marks into my skull from pressing my glasses into my head etc. These have not (at least not yet).. and I am so excited. They feel roomy and nice, I was wearing them when I didn't even need to cause I just don't mind them all day long. (SO NICE!)\n\nI had to write this, I only had them like 2 days now. Wore them all day today and I cannot believe I'm not in pain like I have been from my hyper x cloud 2. My other headset broke. The mic just doesn't work. So I needed a new one. I didn't put much thought into this, It was a good price and kind of impulse bought it after making sure it was in fact a USB connection because I can't deal with finding the right port for the circle ones/jacks. (I am very tired).\nI wear glasses, my headsets tend to dig and cause pain into my head. These are not... very roomy feeling. My only gripe as my other headset mic could come out. I could move the headset any way and put the cord on either side of me. These I have to wear them one way only. But that's not a big deal tbh. I like the cord to dangle on my RIGHT side. But it is on the left and has to cross over me. But whatever. I can work on solving that some other time.\nI totally didn't realize the RGB colors changing on the sides, pretty neat. Mic and sound are nice. People are not complaining about not hearing me etc. Very nice. I've had issues with discord in the past but no issues atm. (Not sure if it was headset related at all).\n\nI may want to get a stand for them or something just because. Very happy with my purchase so far! (Also thanks to the company for shipping it so fast! )",
					"Amazing quality audio. It has great noise canceling qualities. It also has the ability to turn off the microphone if you don’t want it on. Remember, the red light means it’s off. The lighting is high quality and you can choose the patterns of light displayed on them. The headset comes with “Surround sound” meaning the audio can be made to sound more realistic.\n\nThe microphone is retractible so you can slide it out of the way if you’re not using it. The parts that go on your ears are comfortable, and will not cause discomfort after long periods of use. I would highly recommend these headphones.\n\nThey are USB so you need a spare USB port to use them.",
					" Siempre he pensado que los productos Razer estan sobrevalorados, sin embargo esteticamente suelen ser muy atractivos y fue asi como decidi pasar de unos modestos HyperX Cloud Stinger a estos Kraken Chroma y debo decir que me lleve una sorpresa para bien, la calidad del audio es muchisimo mejor en los Razer, la forma en la que se acomodan y cubren las orejas y el sonido que ofrecen son algo digno de mencionar, al menos en cuanto a mi experiencia.\n\nUn plus son el RGB para mas FPS, la calidad de los materiales es muy buena, las almohadas, el cable y todo el producto en general es muy bueno, eso si, me gustaria decir que los compre a muy buen precio, poco mas de 2500 pesos y aun asi me parecen caros pero debo confesar que me gustan mucho y si tienes la posibilidad economica para adquirirlos creo que no te van a decepcionar.",
					"",
					"Para ser sinceros no escucho gran diferencia de mis antiguos headsets que me costaron 1200 a estos que costaron mucho mas, es decir auditivamente suenan mas fuerte pero nada mas, no capto mas texturas en el sonido ni nada por el estilo, el THX se me hace la cosa mas inútil que se pudo haber inventado, solo degrada la calidad del sonido procesandola de más para, según ellos, obtener la experiencia 7.1, su punto fuerte la comodidad a mi parecer ya que lucen enormes y son ligerisimos y cómodos al usar, el mute en la punta de el micro es visualmente agradable pero prefería mis anteriores headsets que simplemente tenían un botón de mute donde estos tiene la activación de el innecesario thx 7.1 lo que si es sumamente cómodo es el que el micro sea retractil, le daré 3 de 5 poniéndome exigente dado el precio.",
					"",
					"S",
					"I bought these thinking, since they said ultimate edition, that they would work well with my xbox as well as PC since the tournament edition which was the lower model worked with Xbox as well. They do not work with Xbox One, they are USB only and for some daft reason an Xbox One doesn't take USB headsets. I also didn't notice any \"Cooling\" effect as advertised on the box when wearing them. My head still got uncomfortably warm while wearing them, my glasses were still pressed to my face instead of the advertised \"Glasses wearing comfort\" all in all.. not worth the price.",
					"La verdad estaba indeciso de comprarlos por el precio y me encontraba entre estos headsets y la opción de otros con marca china, pero concluí que si quería tener algo de calidad pues tenía que invertir. No me arrepiento. Estos Kraken RGB son excelentes. Empaque impecable, buena calidad de materiales, cable reforzado y con buena longitud. Micrófono retractable (que era algo que buscaba porque casi no lo iba a utilizar) con buena calidad que saca de apuro sino tienes otro externo. Software Synapse que permite ajustar tanto la configuración del audio, del micrófono y de la luz RGB. Las almohadillas de gel cubren completamente las orejas y por lo menos no permiten que suden. Sonido magnífico. Ni siquiera subo todo el volumen. La música la escucho en modo estéreo pero los juegos suenan sublimes en modo espacial. Y estéticamente son otra cosa.",
					""
				]
			}
		},
		{
			"id": "K7HYI-o",
			"title": "Logitech G432 Wired Gaming Headset, 7.1 Surround Sound, DTS Headphone:X 2.0, Flip-to-Mute Mic, PC (Leatherette) Black/Blue",
			"price": "$36.09",
			"image": "https://m.media-amazon.com/images/I/61j6ey6mBpL._AC_SY355_.jpg",
			"description": "Logitech G G432 7. 1 surround sound gaming headset is enhanced with advanced Soundscape technology. Hear more of the game with huge 50 mm drivers that deliver a big sound. For maximum immersion, DTS Headphone: X 2. 0 surround sound creates precise in-game positional awareness. Hear enemies sneaking up behind you, Sense Air attacks or special-ability cues, and enjoy the full cinematic experience of your favorite games. It’s slim and lightweight, with rotating sports-performance ear cups, a large 6 mm, flip-to-mute Mic, and convenient multi-platform compatibility.",
			"reviews": {
				"customerProfileNames": [
					"JakePletscher",
					"Dion",
					"BrianMoakley",
					"Matt",
					"Jesse"
				],
				"customerProfilePictures": [
					"https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif"
				],
				"customerRatings": [
					"5.0 out of 5 stars",
					"1.0 out of 5 stars",
					"3.0 out of 5 stars",
					"5.0 out of 5 stars",
					"2.0 out of 5 stars"
				],
				"customerReviewTitles": [
					"Logitech G305 LIGHTSPEED Wireless Gaming Mouse, Hero 12K Sensor, 12,000 DPI, Lightweight, 6 Programmable Buttons, 250h Battery Life, On-Board Memory, PC/Mac - White\nLogitech G305 LIGHTSPEED Wireless Gaming…",
					"Logitech G305 LIGHTSPEED Wireless Gaming Mouse, Hero 12K Sensor, 12,000 DPI, Lightweight, 6 Programmable Buttons, 250h Battery Life, On-Board Memory, PC/Mac - Mint\nLogitech G305 LIGHTSPEED Wireless Gaming…",
					"Logitech G703 Lightspeed Wireless Gaming Mouse W/Hero 25K Sensor, PowerPlay Compatible, Lightsync RGB, Lightweight 95G+10G Optional, 100-25, 600 DPI, Rubber Side Grips - Black\nLogitech G703 Lightspeed Wireless Gaming…",
					"Logitech G413 TKL SE Mechanical Gaming Keyboard - Compact Backlit Keyboard with Tactile Mechanical Switches, Anti-Ghosting, Compatible with Windows, macOS - Black Aluminum\nLogitech G413 TKL SE Mechanical Gaming Keyboar…",
					"Great Choice for Gamers!",
					"DO NOT BUY! WORST HEADSET EVER!",
					"Great Headset, Cheaply Made",
					"Non-Bias Honest Review",
					"Not what I expected"
				],
				"customerReviewBodies": [
					"I've seen a few reviews that say stuff like \"my older headphones sound better\" etc. I owned a pair of g430's for the past few years and served me well! They were solid SURROUND SOUND gaming headphones for $50 almost 4 years ago. They finally gave out a few days ago and I bought these since I own quite a few logitech devices and all have been good.\n\nOne Disclaimer is that you NEED to download G-Hub which is the new version of Logitech Gaming Software that these devices use so you can easily manage their features. Once you install that (it's lightweight just like LGS) you can enable the surround sound, which sounds just as good if not better than my G430's.\n\nFor $50 I would strongly recommend these to any gamer. These are the best Price to Performance pair of surround sound headphones you can get. I guarantee the HyperX Cloud 2's (which are 4 years old btw) are a good choice too, but for $99, they aren't twice as good!",
					"Don't buy these absolute trash can of a headset. I bought these during black Friday to replace and old headset and they were listed at 70 dollars but j got em for 40. I'm thinking ok, I've heard of Logitech, and that's a good amount to spend on a headset. They should be pretty good. But I'm telling you within 5 mins I'm back to my old headset despite it having a messed up mic. These are SOOOOO bad. The sound quality is horrible! It's like trying to listen to your game through a pinhole in the wall. It boasts about drivers and yadayada but with the headset volume maxed and with the audio turned all the way up on the console for the headset you can still BARELY hear the game!!! To top it off it's so inconsistent. One moment I can hear my party and the next I am straining to hear them. Hell, the game audio is like that as well. You can't tell direction with these either. At least not in the game I'm playing, which let me be clear. I am playing Pubg. Another fatal flaw is my party complained I my TV was too loud as soon as I joined. Except my TV audio was not on. It's once again these trash freaking headphones. For some odd reason my party could hear every single in game thing I did through my headset as if I had a TV blasting in the background and the mic was picking it up. I had the party chat mixer set all the way to the party (vs. the game audio). I then turned down the headset audio so it wouldn't detect it's own Audio (the idea that a headset would do this in the first place is absolutely stupidity!) But oh wait...turning down the headset audio is a bad idea when you can already just barely hear the game when the volume is maxed out. You see where I'm getting here?! There is no viable option to use this headset whatsoever!! DO NOT BUY THESE. IM TELLING YOU NOW. DO YOURSELF A SOLID. I'm about to return this crap now.",
					"I bought this headset and really loved the quality of the audio and the noise cancellation. It does press tight, but overall, it feels good and snug.\n\nUnfortunately, the headset doesn't last. I bought two and they both lasted me six months each. For me, the culprit is the plastic connecting the earpiece. They just snap. I put mine on yesterday and heard a telltale crack. I'm guessing that I stretch the headset horizontally when putting them on and that weakens the plastic over time.\n\nI would buy again if it were better quality, but honestly, I find most gaming headsets don't last these days.",
					"I’ve been using this headset for almost one year now and here’s what I think about it. I’ll cover general information first, then get more specific from a PC gamers perspective, then console, as I’ve used these on both.\n\nIN GENRAL:\n- This headset has very good audio quality for under $50, so good it’s shocking honestly. I’m use to using headsets that cost $200+ and the G432’s have better sound quality than those, so it’s definitely worth buying!\n- The ear cups swivel and that’s a very convenient option to have which some pricer headsets don’t even have!\n- There’s only one volume control option which can get a bit annoying. Meaning it will turn up/down chat and game volume at the same time so you’ll have to get use to adjusting in-game audio options.\n\nFOR PC GAMING:\n- There’s instructions in the box to register your headset on the Logitech site and download the dashboard so you can have full control of your headset.\n- The surround sound will work for PC.\n- The mic has a playback option which will allow you to hear yourself speak with the headset on so you’re not screaming to talk. Some might not like this, you can turn it off on the dashboard, but it is very useful when you’re trying to be quite but also enjoy your games.\n- The headset is very light and very comfortable. It can be a bit tight at first, but just keep wearing it and it’ll eventually loosen up a bit.\n- The mic is extremely good quality and picks up everything and I mean EVERYTHING. Some might find this to be great, some might find it to be annoying.\n\nFOR CONSOLES:\n- For console users, it will be a stereo headset, not surround sound.\n- Regardless of not having surround sound, the stereo audio is surprisingly really good.\n- The mic remains very clear for your voice but will also remain sensitive; it will pickup everything.\n\nIN CONCLUSION:\nIf you’re expecting a top tier performing headset for under $50? You won’t find it, regardless of what you read here. The G432 is a great headset (FOR ITS PRICE), not to say it’s bad at all. Like I’ve mentioned, the surround sound for PC gaming performs better than some $200+ headset I’ve used. There are just some features I wish this headset had and it would be absolutely perfect IMO. All in all, I’d recommend this headset for anyone who’s not looking to break the bank, but would also like a quality headset for gaming.",
					"Returned right away. I personally did not like them. They're not bad, but not good enough for me. Sound just wasn't as good as I'm used to. And I'm used to budget headsets. I thought since these are newly released and have better drivers that they would better than what I've used, but I was wrong. My 4 year old headset sound better than these.",
					"The cups barely fit on my ears, the plastic is very cheap, constantly feels as it was about to break when I put them on, creaks at the slightest movement of your head, making a loud noise right in your ear due to the cheap plastic, the sound quality leaves much to be desired, for the exception of the surround sound, which isn't *that* bad. The wire is one of those cheap wires that tend to break after a month and get bent all over. The general fit of the headset is horrible, even on it's highest size setting it squeezes on my head leaving me very uncomfortable for long gaming sessions.\n\nGave it one star because I can't give it zero. Seen headsets that were much cheaper and had much much better quality. If I had a printer I'd be requesting a refund real quick.",
					"Headset arrived on time. Packaging was good. Plug-and-Play worked and was quick. Love that the volume control is integrated into the ear. Unfortunately, the bass is a bit of a problem. It dominates the sound and seems to actually lower the volume to make itself heard. I read reviews that warned about the bass issues and figured I could handle it, and for the most part I can, but if these ever break I will be looking for a different set. The reviews that complain about the bass can be trusted.",
					"5 meses da compra o plástico quebrou. O plástico junto com o metal trinca fácil.\nA assistência de garantia da Logitech é excepcional. Nota 10.",
					"",
					"is extremely comfortable for the most part, did cause a little discomfort for me after about 4 hours of use ( the headset clamps down on my head a little too hard, and is noticeable at the 4-hour mark), but taking it off and taking a 10-minute break solved that problem. Sound quality is excellent, is a true 7.1 surround sound headset when using the USB DAC (USB adapter that comes with headset). I would highly recommend using the adapter rather than plugging it in directly to your PC.",
					"Excellent casque, confortable et très pratique.\nLe réglage de son sur le casque est très pratique quand la source sonore est faible.\nLe micro est très sensible, il faut faire attention car les gens entendent très bien les chuchotements et les gens qui parlent autour de nous. La fonction qui permet de couper le micro en le basculant vers le haut est très utile. J'espère que le casque durera longtemps car je m'en sers extrêmement souvent.\nLe seul reproche est qu'il n'est pas sans fil, mais je le savais, donc pas si grave.",
					""
				]
			}
		},
		{
			"id": "nE2R8ou",
			"title": "Razer Kraken V3 HyperSense Wired USB Gaming Headset w/Haptic Technology: Triforce Titanium 50mm Drivers - THX Spatial Audio - Hybrid Fabric & Leatherette Memory Foam Cushions - Detachable Mic",
			"price": "$99.99",
			"image": "https://m.media-amazon.com/images/I/71e89sFEBRL._AC_SY355_.jpg",
			"description": "Dive into a new dimension of immersion with the Razer Kraken V3 HyperSense—a PC gaming headset powered by haptic technology. From rumbling explosions to whizzing bullets, with the ability to feel what you hear, the time has come to embrace true multi-sensory gaming.",
			"reviews": {
				"customerProfileNames": ["ChristianCepeda", "Alex", "chad"],
				"customerProfilePictures": [
					"https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif"
				],
				"customerRatings": [
					"3.0 out of 5 stars",
					"5.0 out of 5 stars",
					"5.0 out of 5 stars"
				],
				"customerReviewTitles": [
					"Awful static that happens at random times, please read all edits",
					"Worth every penny! Only one little annoyance that I explain to fix! Enjoy!",
					"THE HYPE IS REAL !!!"
				],
				"customerReviewBodies": [
					"90 days free return.",
					"Thought I'd let you guys before you read my review. Make sure to leave the format at 16 bit, 48000Hz. If you set it to 16 bit, 96000Hz you will hear a ton of crackling and static noises. I tried multiple of the same headsets and they all had the same issue.\n\nPros\n\n• Great sounding\n• Very comfortable. I wore them for 8 hours straight and felt no discomfort the entire time\n• HyperSense is awesome (high settings is too much for me, low-medium is best)\n• Nice RGB lighting on the sides\n• Long USB cable\n• Actually decent mic\n\nCons\n\n• HyperSense might cause tension headaches if set to high\n• Replacing ear cups seems like a pain. Hard to take off and harder to put on new ones. The V2 headset earcups were very easy to take off and replace. They had a snap in mechanic.\n\nOverall, very solid headsets with a decent mic. Also, HyperSense technology to make gaming and listening to music more immersive.\n\nEDIT: I am changing my 5 star review to a 1 start review until Razer fixes this issue\n\nI power off my computer every night for bedtime. When I power on my PC , the headphones are not powered on at all. I have to disconnect and reconnect everyday. Why don't they power on with the rest of the PC? I've tried this on 4 different machines and same issue.\n\nThis is annoying. I do a lot of work on my PC that requires at least 30 reboots throughout the day and to get up and unplug and plug back in for these headsets to work, makes me upset. Please fix this.\n\nEDIT # 2 - Got new ones and they worked great. Seems mine was defective. Changing back to 5 star. Issue was resolved in 1 day.\n\nEDIT #3 - After some time with these headsets, there has been this annoying issue of just random static crackling noise. It happens at the most random times and it's really annoying. As of January 20, 2022 - Razer released a huge Synapse 3 update. I was hoping they'd do some work on the headsets, but nothing. Here are the patch notes I had to ask an agent for.\n\nProduction upload on January 20, 2022\nVersion: 3.7.131.11810\n\nFor PC Only\n\nNew Razer Blade 14 (Early 2022)\nNew Razer Blade 15 (Early 2022)\nNew Razer Blade 17 (Early 2022)\nSynapse Enhancement\nAdded specific mats support for other mice\nAdded new mappings inside Windows Shortcut\nShow Sync button for Ripple in quick effects\nAdded option to control frame rate preview in Chroma Studio\nAdded new games for Synapse Game Profile\nSupports daisy chain fans for Razer Chroma Addressable RGB Controller, Asrock B550 Taichi Razer Edition and Asrock X570 Taichi Razer Edition\nSynapse Bug Fixes\nFixed lighting issue for Razer Tartarus V2 and Razer BlackWidow V3\nFixed media keys not working issue for Razer BlackWidow Elite\nFixed key spamming issue for Razer Naga X and Razer Naga Pro\nFixed games’ frame rates issue when running Razer Synapse 3\nFixed detection issue when Core Isolation is enabled for Asrock 570 Taichi Razer Edition\nFixed key spamming and drifting issues for Razer Tartarus Pro\nFixed launching issue for Razer Synapse 3\nFixed THX Spatial audio low volume issue for Razer BlackShark V2 Pro\nFixed UI issue for Razer BlackShark V2\nFixed THX modes issue for Apex Legends\nFixed side buttons not working when running Macro group for Razer Naga Trinity\nFixed keys spamming and incorrect keys output issues for Razer Huntsman V2 Analog\nFixed Taskbar/Synapse Freezes issue for Razer Huntsman Mini\nFixed # key lighting issue in Chroma Studio for Razer Blade Pro 17\nFixed Chroma SDK light issue for Razer Mouse Dock Chroma\nFixed incorrect full volume cases for audio devices\nFixed volume issue for New Razer product\nImpacted PC Product/Users : All New Razer ProductSynapse 3 PC Users",
					"These headphones are everything they were hyped up to be and more! The haptics, after a little play time and getting use to it, can actually can pick up enemy movement and start vibrating, that normally just the audio wouldn’t pick up. Plus, pairing it with Razers THX 7.1 Spatial Surround Sound Software and with the new audio settings on the latest Version 3 of the Razer Synapses software makes it almost unfair when playing FPSs. You can hear exactly where players are and can even control the sound and haptic levels at different distances to your personal preference. On top of all of that. The new haptics Razer introduced is like being able to have permanent extra perks or kill streaks in games like COD Warzone or Vanguard for example, Because it will start vibrating and pick up the enemy’s movement and positioning before they can hear you! Lastly the mic! First time I logged into discord people immediately started asking if I got a new head set or a stand alone microphone due to how clear my mic was with the noice cancellation and all the other settings. This is the best pair of headphones I’ve ever bought and that’s saying a lot since I was previously using the Razer Blackshark V2 pros… so in summary, get yourself a pair before it’s too late. I promise you won’t regret it!\n\nNow to be unbiased. The only downside with using these headphones is if you also plan to use Razers THX 7.1 Spatial Surround Sound Software with the headphones (which even with everything your about to read, some would consider it a con, but below I explain how to easily fix it, if it should ever happen to you.) still are 100% the best gaming headphones ever!!!\nSo here we go. It can sometimes be a little confusing to fix if you don’t know how to, but occasionally, when turning on the headphones. You won’t get any sound because to use the 7.1 spatial surround sound with these you have to do three things and sometimes when windows 11 OS is feeling stupid. You’ll get no audio output to your headphones.\n\nSo to fix it. #1, make sure that you have the Razer Synapse 3 software open and you turn on the 7.1 spatial surround sound on the Krakens V3 Pro audio settings in Synapse 3 before you turn on the headphones.\n#2, make sure that you have Razers THX 7.1 surround sound software opened and turned on and that you have your windows default audio input settings on the extra device that the Razer THX 7.1 Spatial surround sound software will make in your windows Device settings which will be named “THX Spatial Surround Sound”. Next, you have to put your default audio output in windows settings on the normal Razer krakens V3 Pro device in your windows settings.\nLastly #3, on the Razers 7.1 spatial audio software you’ll see a link under the on/of switch which will bring you to your Control Panels audio settings, click on the link then do the same thing. Make the “THX Spatial Surround Sound” device your default audio input and the regular Razer Kraken V3 Pro device the default audio communications output. Then click apply, and your good to go!\n\nI’ve had these for a few weeks and I’ve only had to redo all of that over twice because windows 11 OS decides to change my settings by itself lol…\n\nSo honestly, now that you know how to easily fix it, if you ever turn on the headphones and your not hearing any sound. There really are no cons to theses headphones because it’s not something programmed into the headphones, it’s just an annoying thing you have to do ever now and then, which only takes a couple minutes to fix. Which you now know how to easily do!\n\nLastly, just as an after thought. Ever since I’ve change the setting on Razers Synapse 3 and Razers THX 7.1 Spatial Surround Sound software to automatically turn on whenever I boot up my PC, it hasn’t happened since. So make sure you do that on both of the programs!\n\nNow all you have to do is buy these headphones and Enjoy the amazing Haptics and the best Spatial audio ever!!",
					"My main headphone are having issue ...So i decided to see what the gaming headphone market has got going on .... After seeing many videos and reviews on this .i decided to try them out i have never bought or own anything razor has, So this was my first time so far im impress ...hypersense aka haptic technology... what is it?? how does it work??? Best way i can describe it is this way .... its a small motor or a device that works on sound frequency... Best example is a car stereo sound system ... the headset is a 6x9 speaker they sound great rich and full ,... then u add a subwoofer with a crossover with a EQ.. These headphones the lowest they go is 20HZ human hearing can not hear below that .. So Razor who owns THX .. came up with this device that when the sound goes below 20HZ ... it vibrates.. u have switch on the right that u can cut it off and on . and increase the intensity of the vibration .... It sounds AMAZING TOGETHER ... I have mine set to low setting for everything ...HUGHY RECOMMEND THEM TO ANYONE JUST BUY THEM AND EXPERIENCE IT ....",
					"Pros\n- Great battery life (insanely good if you don't use haptics or lighting.)\n- Great mic (Friends don't complain in discord.)\n- Comfortable (Can wear all day with 0 issues.)\n- The audio sounds so good and I can easily make out little details in games (footsteps far away, enemy reloading, etc.)\n\nCons\n- Haptics sound rough. There is this annoying buzzing noise or almost like a ring when something has bass but not enough bass to make the headset haptics vibrate. Makes it unbearable to use if I'm not listening to something that has punchy enough bass. Putting them past level 1 (3 levels of haptics) is just horrible. They add an extra level of detail but it rarely works to be overall enjoyable.\n- Little to no swivel on the ear cups for adjusting on your head.\n- Synapse 3 is a terrible program (at least in my experience.) It took my headphones multiple tries of unplugging the usb adapter and plugging back in along with restarting my computer until my headset showed up in Razer's program.\n- Headset is reading as speakers on my PC. Truly don't know if this causes any issues but it's kinda annoying.\n- The THX spatial audio option that it says should be default sounds awful. Don't use it.\n\nOverall would recommend but there is some issues here that shouldn't be present in such an expensive headset. I think these are better than the Blackshark V2 Pros in terms of sound and the fact that its USB-C charging, but I wouldn't buy this headset if your in it for the haptics.",
					"I love these headphones. They're so comfy and I wear glasses. They sound awesome, after you tweak the settings, they sound so much better. The mic quality lacks, they're worse than my arctis series 5 from 2018, but it is what it is. The synapse software works great for me, although I know many people have issues with it. I do love the haptic feedback feature, works great, although I use the low setting as the medium and high start to give my a headache. Overall they're a great pair of headphones, I wish they were less expensive though, maybe $50 less.",
					"This is a wonderful product that allows me to forget the voices talking to me inside of my head.\nLet me elaborate, I have been suffering from these voices talking to me in my head since I was young. It would drive me insane sometimes but now that I have this headset, the volume is louder than the voices!!! As such, I would recommend this to any gamer that has the same issue as I.",
					"I had high hopes for this headset as I mostly play World Of Tanks and thought the Haptic Technology would add to the realism of the game ( sound and vibration inside a tank ) but the effect is very vague and random and really has nothing to do with what is actually happening in and to my tank...it activates in a general way to anything going on in the game so really it adds nothing and in fact becomes distracting. In addition the sound range seems very flat for me even after trying different equalizer settings...I never could get the low frequency sounds that I expect in this game. So I am returning them and am going to try the Hyper X Cloud II headset that also has good reviews. I understand \" good \" sound is a very subjective thing as is finding a mouse that works well for you. I just found this headset was disappointing to me.\nI just received my HYPERX CLOUD II headset and I have to say the sound quality compared to the Razer Kraken V3 HyperSense is like night and day! Totally in another realm. The range, the clarity is in a different class altogether. I have listened to the same music videos I listened to with the Razer set and there is no comparison. These are just as comfortable ( maybe more so ) and with no equalizer software sound SOOOOOOOOOOOO superior to the Razer set. I am not so sure the 7.1 surround is as good as other offerings out there but the THX feature with the Razer set was no better. I play mostly World of Tanks so the positional aspect of the sound is not as critical as say Call of Duty type games. I am 100% happy with this HYPERX headset and would encourage anyone out there to give these a try!",
					"I"
				]
			}
		},
		{
			"id": "6MFdKx4",
			"title": "Logitech G435 LIGHTSPEED and Bluetooth Wireless Gaming Headset - Lightweight over-ear headphones, built-in mics, 18h battery, compatible with Dolby Atmos, PC, PS4, PS5, Nintendo Switch, Mobile - Black",
			"price": "$55.82",
			"image": "https://m.media-amazon.com/images/I/81STRBKrXjL._AC_SY355_.jpg",
			"description": "LIGHTSPEED wireless and low-lag Bluetooth connectivity let you play and talk on PC, Mac, PS5/PS4, smartphones and other Bluetooth audio-enabled devices. Gaming-grade sound, carefully balanced high-fidelity audio, 40 mm audio drivers and compatibility with Dolby Atmos and Windows Sonic provide ultimate surround sound for all of your gaming adventures. With dual beamforming mics to reduce background noise without a mic arm. Plus, G435 is available in multiple colorways so you can match your favorite style to your gaming setup.",
			"reviews": {
				"customerProfileNames": ["JohnDesautels", "James", "proximo"],
				"customerProfilePictures": [
					"https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif",
					"https://images-na.ssl-images-amazon.com/images/S/amazon-avatars-global/b83a6fab-a21e-4b2e-9a2e-ee1ec5ded6ba._CR0,0,500,500_SX48_.jpg",
					"https://images-na.ssl-images-amazon.com/images/S/amazon-avatars-global/3621f4b8-3d80-47c7-99e2-7ac9dbe921eb._CR0,0,746,746_SX48_.jpg"
				],
				"customerRatings": [
					"4.0 out of 5 stars",
					"4.0 out of 5 stars",
					"5.0 out of 5 stars"
				],
				"customerReviewTitles": [
					"Update: Logitech made it right. Initial update: Avoid. Initial review: A very good value choice!",
					"Day one impressions",
					"Truck driver daily headset"
				],
				"customerReviewBodies": [
					"U",
					"I",
					"This thing is lighter than my phone! I'm told by people I call that my voice is just as clear as the $300 Rand McNally one. It has fantastic lows and highs.\n\nBut most importantly it's EXTREMELY COMFORTABLE. My truck's radio sucks, so I listen to Spotify and Youtube with my phone for about 10-12 hours a day. I need something comfy. Earbuds cause ear hole fatigue and the sweat causes them to slip out and extra earwax to form, not to mention my earhole even starts to itch. All other \"over ear\" headsets I've tried have NOT been over ear but instead compress my ears and cause pain. I have to adjust them every few minutes to alleviate pain. But not these babies!\n\nI have large ears that stand out from my head, yet my ears barely graze the cups. No fatigue on my ears. They're so light that my hair barely even notices I'm wearing them. They're snug enough they don't move while I look around or climb in and out of the truck. I can clearly hear and talk with them on. Icing on the cake: they have subtle style so I don't stick out at the truck stop. Also the battery lasts ridiculously long and charges by usb-c so shares cable with my phone.\n\nOk sadly they're not perfect: no button to pause, skip songs, or hang up the phone.\n\nAll in all: MUST BUY. Absolutely worth way more than $80.",
					"O",
					"",
					"Headphone bastante leve e confortável. Funcionou no momento em que conectei o adaptador wireless no notebook (Linux) sem necessitar de qualquer configuração ou driver adicional, inclusive foi setado como default pelo discord sem nem mexer. Não perde a conexão com facilidade. Andei pela casa com o mesmo e ele permaneceu conectado. O microfone é razoável, participo de diversas reuniões durante o dia e nenhum colega achou que minha voz estava com qualidade ruim. O som tem um volume razóavel com boa distribuição de graves, porém se você está atrás de algo para escutar músicas com mais fidelidade de áudio ele vai deixar a desejar. Não jogo jogos online para avaliar se o som é bom para a jogatina.",
					"",
					"Gostei bastante, realmente bom para quem quer se livrar dos fios. E sem muita enrolação vou para os pros e contras.\nPros:\n- Confortável (não cansa e nem machuca a orelha);\n- Leve;\n- 2 modos sem fio para uso (Buetooth e Wireless com sticker usb);\n- Carregar não impede o uso (ele só funciona no modo sem fio, o cabo é só para carregar mesmo);\n- Qualidade de áudio muito boa;\n- Volume alto e claro (Linux fica baixo mas dá para contornar);\n- Microfone ok para um headset;\n- Bom ajuste a cabeça;\n- Espumas são de fácil remoção caso necessite trocar ou lavar.\nContras:\n- Construção maior pate em plástico ABS e deixando a impressão de fragilidade;\n- O que segura as conças parece que é muito frágil.\n\nNão acho que é um dos melhores custo beneficio pois achei que a fragilidade dele deixou a desejar, mas creio que com bom cuidado esse headset dura muito tempo e se paga por sua boa qualidade e os demais pontos positivos.\nNão me arrependo da compra e indico para todos que querem algo bom e leve que não necessita de fio.",
					"",
					"Comprei o headset em fevereiro, e decidi avaliar depois de ter alguma experiência com ele. Não há o que reclamar, ele é muito confortável, leve acima de tudo, as vezes esqueço que estou com ele, por ser feito utilizando tecido em vez do courino ele não puxa o cabelo e o revestimento da parte da orelha sai pra lavar, o som reproduzido e transmitido por ele são excelentes, bateria tem uma duração relativamente longa (2 dias de duração e mais ou menos uma hora pra carga total). Não utilizo a função bluetooth dele, apenas a lightspeed, no pc, pra jogos principalmente gostei muito, em resumo o headset supriu todas as minhas expectativas.",
					"",
					"Really nice to have the cordless earphones - the sound quality is very good for what it's worth. Low latency on them as well. The drawback is that the microphone has poor sound quality. The sound of voices is \"tinny\" and staticky (is that a word?). I do not believe this has anything to do with the position of the microphone - if this were a boom-style it would probably still have this issue."
				]
			}
		},
		{
			"id": "ySrJgVh",
			"title": "Corsair Virtuoso RGB Wireless Gaming Headset - High-Fidelity 7.1 Surround Sound w/Broadcast Quality Microphone - Memory Foam Earcups - 20 Hour Battery Life - Works with PC, PS5, PS4 - Pearl",
			"price": "$179.54",
			"image": "https://m.media-amazon.com/images/I/716vTg39ddL._AC_SY355_.jpg",
			"description": "The CORSAIR Virtuoso RGB Wireless delivers a high-fidelity audio experience for the most discerning players, combining uncompromising sound quality with all-day, all-night comfort from its premium memory foam earpads and headband. Connect to virtually any device with ultra-low latency SLIPSTREAM CORSAIR WIRELESS TECHNOLOGY, 3.5mm wired, or 24bit/96KHz USB wired. Make yourself heard with a broadcast-grade, omni-directional detachable microphone with exceptional dynamic range.",
			"reviews": {
				"customerProfileNames": ["rt", "Hydrotonic", "AdamC.Johnson"],
				"customerProfilePictures": [
					"https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif",
					"https://images-na.ssl-images-amazon.com/images/S/amazon-avatars-global/7919b301-e8c7-4792-b256-cadf2fa79564._CR0,0,168,168_SX48_.jpg"
				],
				"customerRatings": [
					"3.0 out of 5 stars",
					"5.0 out of 5 stars",
					"5.0 out of 5 stars"
				],
				"customerReviewTitles": [
					"Use case driven review",
					"Awesome headset!",
					"5 Stars? How about 50? 500? This headset is near perfection."
				],
				"customerReviewBodies": [
					"I don't usually write reviews but I have some time to burn and am hoping my input will help someone decide whether or not the Corsair Virtuoso are a good choice for their application. BTW I got the Premium and NOT the Special Edition/SE version. (more on why I chose this below and it was not the $30 price difference)\n\nSOLID build quality. There is some satisfaction with the way these feel. Sturdy, no creaking or flexing that shouldn't exist. Good weight, not too heavy. I'm sure the SE version is also very nice with the machined aluminum. Protein leather headband and pads are comfy that I'm sure would be comfortable for many people for several hours. (would be nice if they included some variations at this price point.. maybe perforated lambskin or suede or cloth mesh, etc... changing the sound profile is half the fun of having a good set of cans)\n\nCrazy sound isolation. Put these on your head and you likely will not be able to hear much around you. Depending on your preference this could be great, these are in every way shape and form VERY closed headphones.\n\nI feel most people are right handed so the fact that the volume is on the right hand side is kind of annoying. The right hand is the primary mouse hand an should not be needed to adjust the volume.\n\nWireless sound is adequate, very clean for the most part. As you will see I also attached an image of my EQ settings as I personally like a V curve with elevated lows/highs and a bit recessed mids. With a flat EQ \"Pure Direct\" they sound pretty bland IMHO, not only for games but also music and general use. Not sure how this would work for console users who may not be able to easily configure sound profiles...\n\nMicrophone quality is excellent! I'm not sure if this is a known fact but the mic on the Premium is much better than the Special Edition. This is a good selling point if you like reproducing your voice to others accurately.\n\nSoftware is ok. iCUE has a very limited subset of options for this set of cans and only a few preset EQ settings that I would personally never use. Not to say Logitech software or other people are better but this is really not great.\n\nBiggest issue is clarity at times. Even when using the default \"Pure Direct\" EQ settings or my tweaked EQ settings there is sometimes a crack/pop/distortion in both certain games/music which occurs that is very unpleasant. Yes I may have received a defective pair of cans but I cannot unhear the distorted audio.\n\n2nd biggest issue from my perspective. Pads are a bit shallow for me personally and my ears touch the inside near the driver. As per my attached image I WISH pad rolling would be easier. These pads have a ring/twist mount system (clockwise to unlock which is bass ackwards) and they would require you to destroy the original pads to get the rings out to mount a new set properly (or you could get an adhesive set of pads which meh, or even 3D print some new rings but that is too much effort for a simple pad swap) So wow, yes I like being able to swap pads for comfort/sound adjustment and these don't easily allow it.\n\nSoooooooo this may have been a long winded review that doesn't provide much insight but in short I'll be sending these back and I will continue to use my Logitech G935's (with swapped lambskin headband and lambskin angled pads) Even stock I would say they are much better in terms of value/performance/customization/etc.",
					"Needed a new gaming headset and these came out just at the right time. Having had 5 different pairs over the past 3 years, I am extremely picky about my headset and customization options for any headset I have bought. These beat out every one of my gaming headset by far for . USB type C THANK YOU JESUS! and they are extremely comfortable and have a good bit of eq options I can choice from. have amazing Audio and the MIC is probably they best out of all I have every tried on a headset. Worth the price and worth the wait!",
					"Pros:\n* Top Tier sound quality AND mic quality, even on wireless.\n* Price is reasonable compared to other upper end gaming headsets.\n* Noise reduction is significant (and it's NOT a noise cancelling set, crazy).\n* Range on the wireless is surprisingly good (I can listen to music downstairs in my kitchen from my PC upstairs).\n* Self Shut-off and motion Turn-On work great and I didn't even know it did the turn-on part.\n* Lots of other details...\n\nCons:\n* Only one I could think of - the headband is mostly comfy, but it does sit a little heavy, so it gets uncomfortable if you don't move it around a little occasionally. If you want ultra-comfy, I recommend the Steel series headsets that have the 'strap' headband.\n\nOverall, I can't say enough good things about this headset. I did a lot of research before buying, and I've had a corsair headset previously (VOID 7.1 older model) that held up very well (I still use it with my XBox) and sounds great, so I figured at worst, this one would sound great and have wireless, plus some other stuff. I charged it before using, it got to full pretty quickly running off my 3.0 output off the back of my PC, and once connected the slipstream connection become immediately noticeable - if there is any latency, it's so little that I can't detect it, and the quality of sound from both the speakers and the mic are unbelievably good for a headset under $200. I've had the opportunity to test out some $500-$700 headsets that were similar quality, but at this price, there's no comparison that I'm aware of.\n\nAfter using for a bit, I set it down, and it shut itself off after a few seconds - that seemed odd to me, usually 'idle' takes a minute or two, so I picked it back up and watched as it turned itself on again immediately. I laughed out loud because I hadn't realized it had some kind of motion detection built in (probably a little gyro inside), which is great. Most of the other features are similar to other upper end headsets (multiple connection types available, etc.), but worth noting that the RGB, while subtle, is a very nice addition especially if you're using other Corsair peripherals (I've got a K95 and M65), so the 'flow of color' is really consistent and fun to play with. Also worth noting is that while this is not a noise cancelling headset, I'd say it reduces outside noise just from the quality of the ear covers and such.\n\nOnly thing worth mentioning that is negative I noted above, but I figured I'd go into more detail. I have a 'slightly' sensitive scalp, so for me, when I wear this for 2+ hours, I have to make sure and adjust it an inch forward or back or it starts getting a little uncomfortable right at the top. The ears never get uncomfortable, as a combination of being circumaural and having very nice padding takes care of that - I will say though that my ears get a tad sweaty though, this thing seals really well.",
					"Créanme cuando les digo que pasé medio día viendo top 5 y reviews de MUCHOS audífonos gamer, pero no me ayudó a decidir bien cuál escoger, porque las opiniones estaban muy parejas y por muy pequeños detalles ganaban unos.\nDe repente me encontré con una review de estos Audífonos, quedé impresionado (No soy fan de corsair, es mi primer producto de ellos). Tiene todo lo que los demás audífonos tenían y lo que les faltaba! aparte llegaron mucho antes de lo esperado. Aquí el resumen para que no tengan que perder tiempo viendo videos.\n-Sonido 7.1\n-Tienen esponja con memoria en los oídos\n-Tienen Luces RGB personalizable en el micro y en los costados (le añade algo en el estilo)\n-Su micrófono suena profesional (Mucho más con el modo alámbrico), claro y con tonos bien ajustados\n-Tiene modo inalámbrico y alámbrico (con cables) Y ES LO MEJOR, inalámbrico suena perfecto todo, pude ir al baño sin que se corte la señal, buena calidad de microfono, repito, muy buena (en comparación a microfonos de audifonos el mismo precio, o incluso más caros)\n-El modo alámbrico mejora el audio en más del doble (40000 hertz a 96000, aunque es poca la diferencia cuando lo escuchas), también mejora el microfono, tiene cable para celular también (aunque no tienen bluetooth)\n-MUY cómodos y estables (no se te caen)\n-Se puede quitar el micrófono\n-Botones útiles en los costados\n-Ecualizador (en el software iCue)\n-Batería de 20 horas (en lo que lo he usado no se me ha descargado usándolos, los dejo cargando en la noche)\nEl sistema no es lo mejor, y tiene algunos bugs con windows y el software, pero eso se resuelve fácilmente (al menos yo si lo resolví)\nValen mucho, pero sinceramente valen cada maldito centavo, es el mejor headset que puedes comprar al mismo o ligeramente mayor precio. Las únicas quejas que he visto son de software, fuera de eso, no te vas a quejar.\nEs una reseña personal pero basado en MUCHAS opiniones, así que yo creo que vale la pena comprarlos",
					"",
					"Audio and mic quality are really good but the headset suffers awfully for not being comfortable to wear over long period of time. Take my word for it. I wear a headset everyday for 12 to 14 hours and after only 3 hours on my head, the headset begins to be very irritating on the ears. After 8h it's almost unbearable and I have to take it off. I didn't have this issue with my Hyper X Cloud II and i wore it every single day for more than 12h per day.\n\nIf I pay almost 300$ CAD for a headset I'm expecting some excellent quality. Unfortunately, this wasn't the case with this headset. Don't take your chances like I did and save your bucks for something else. You'll thank me later.\n\nOh, and don't trust Youtube reviewers when they say this particular headset is comfortable to wear because they probably didn't use it that much or they've been paid to say otherwise. I made the mistake of listening to them and now I must return it.",
					"TLDR: Great sounding headset with poor battery life and comfort issues. I would cautiously recommend this to others. It can have issues if used close to an XBox 360 controller receiver.\n\nI bought this to replace my older Logitech G933 that had its head strap break. I needed something to replace this for both conference calls at work, gaming and Dungeons and Dragons via discord.\n\nBuild Construction, Looks and Feel:\n===========================\nVery good, materials seem to be of a high quality and gives the headset a high quality feel. I really like how understated the looks are as it is used for work calls as well as calls (gaming and D&D) with friends.\n\nOverall use\n=========\nVery good button placement for mute, volume and power. I'm used to a mic that you flip up to mute, but the button is easy to access and the light on the tip of the microphone is \"just\" inside my peripheral vision so I can see if I'm muted without having to look too far down.\n\nSound Quality (Headphones and Mic)\n=============================\nVery impressed with this. I really like how they sound with games and especially on a call. A definite step up in quality over my older Logitech G933 in my opinion. Only made a minor tweak to the EQ in the software, but its not really necessary to be honest.\n\nThis is very subject though as everyone has a different opinion on this.\n\nMicrophone quality appears to be the best of the headsets I've used. Pretty happy with this as well as its side tone feature which is very good.\n\nConnection Quality and Range\n========================\nRange is good enough compared to my previous headset (about 1 meter farther) but it does suffer from really bad audio dropouts and periodically mutes audio going to the headset. This seems to be related to interference caused by my XBox 360 controller so it seems that the unit is much more susceptible to interference than my previous headset.\n\nI was using the XBox360 controller with the PC dongle to when these issues were observed. The receiver puck was 2 feet away from the USB when the issues occurred. To fix this, I needed to ensure that the Virutoso dongle was plugged into a different USB port / hub than the controller receiver. Location of the receiver puck did not make any difference.\n\nAlthough I solved this by moving the usb dongle for the virtuoso 3 feet away from where the XBox 360 cable plugs in, others may have more of an issue with this. So if you are operating in an area with other wireless devices (like wireless gaming controllers) you may or may not have an issue. This does not occur with my previous headset which used the same USB port that I now plug the Virtuoso into\n\nHeadset Comfort\n=============\nThis is a pretty big mark against the headset. If this could be resolved I would be more inclined to recommend this headset to others.\n\nClamping force is firm but not uncomfortable. The top strap however does get uncomfortable on top of my head where I need to move it around. I have yet to find a setup that is comfortable all day. The headphones are heavier than my previous ones and this may be related.\n\nMy ears touch the inside of the ear cups, and although I know some people don't like this, for me they just touch and this is not a comfort issue for me.\n\nA typical day for me includes about 4-6 hours of conference calls at work normally followed up by playing music while I cook and on D&D nights, D&D so a more comfortable headset would be appreciated for this.\n\nBattery Life\n==========\nDoesn't last as long as I would like, but it can be used while plugged into USB power. I don't know if its actually charges when plugged in and being used, if it does it seems to take a really long time to charge when plugged in.\n\nLonger Term Update\n================\nBattery life is acceptable if you turn off all the LEDs. So I run it with the LED off.\n\nI solved my problems bad audio by repeatedly installing and uninstalling iCue until the audio was clear.\n\nOccasionally the mute button doesn't work with the software and can show the red mute button while still recording audio. Often mute issues can be resolved by unplugging and replugging the boo mic.\n\nYou do eventually get used to the comfort (or lack thereof) of the headset. When its working audio quality is good.",
					"Yeah it does look cool. That’s it. The rest : It’s expensive, it sounds ass flat with jack, the charge last for about an hour and even plugged in usb-c with bass preset in the iCue software, it sounds flat. Oh, and i didnt mention that the headset is a bit heavy for a headset, so about 2-3 hours in, the weight gives you a headache, PLUS the cussion isn’t really soft, a bit crusty. BUT WAIT, THERE IS MORE : the cussion isnt really big, so my ear would touch inside, the mic was saturated when connected wireless, the headset sometime would randomly do weird sound artefacts while connected wirelessly, same with usb-c.\n\nBut yeah bro, it does look cool\n\nBEFORE YOU ASK ME, yes im running the latest firmware for it",
					"Some downsides for me:\n* If you have glasses like me, this headset will definitely dig into your head after long periods of use. I just got the headset though, so I might get used to it over time, I'll update this if I remember in time.\n* I wish the cushion was larger, as my ear touches the inner cup, but this will vary from person to person.\n* The headband is okay, my head does definitely need a break after awhile of using it.\n* In my opinion, the mic hangs a bit high on your face, but you might get used to it.\n* Mic uses micro USB.\n\nAlso, if you decide to get this, get iCUE, and make sure to enable Surround Sound, and I recommend setting your sound preset to Bass Boost as it makes the audio so much better, in my opinion.\n\nBesides that, this headset is amazing.\n\nSome pros:\n* Instant setup. Windows does it all.\n* Headset charges with USB-C\n* Mic is removable.\n* Can be used wired, wireless\n* Has optional RGB (can be configured/disable in iCUE)\n* Has optional adjustable sidetone (allows you to hear yourself, if you want)\n* Has surround sound\n* Very light\n* Earcups can fold.\n* Over-Ear headset.\n* Supposedly has 20 hours of battery life, haven't used it enough to know if that's true.\n\nDon't forget to update your drivers using iCUE as well (must be in USB mode, and plugged in)\n\nAlso Corsair, if this headset didn't push my glasses into my brain, I would give this five stars. Please do work on that for your future headsets."
				]
			}
		},
		{
			"id": "4cQ8eGQ",
			"title": "Corsair VOID RGB Elite Wireless Premium Gaming Headset with 7.1 Surround Sound - Discord Certified - Works with PC, PS5 and PS4 - White (CA-9011202-NA)",
			"price": "$69.99",
			"image": "https://m.media-amazon.com/images/I/61nnZlMLDpL._AC_SY355_.jpg",
			"description": "Immerse yourself in the action with the Corsair void RGB Elite wireless with custom-tuned 50mm neodymium audio drivers delivering 7.1 surround sound on PC Microfiber mesh fabric and memory foam ear pads provide lasting comfort Connect to your PC or PS4 with a low-latency 2.4GHz wireless connection with a range of up to 40ft and all-day battery life up to 16 hours An omnidirectional microphone with LED mute indicator ensures that you're heard with exceptional vocal clarity The void RGB Elite's distinctive design and durable construction are complemented by fully customizable RGB lighting on each ear cup Powerful Corsair iCUE software ties everything together enabling full control over equalizer settings 7.1 surround sound RGB lighting.",
			"reviews": {
				"customerProfileNames": ["A.Bagley", "NadhirELADA", "Fable"],
				"customerProfilePictures": [
					"https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif"
				],
				"customerRatings": [
					"2.0 out of 5 stars",
					"3.0 out of 5 stars",
					"3.0 out of 5 stars"
				],
				"customerReviewTitles": [
					"Microsoft 365 Family | Premium Office Apps | Up to 6 users | 3 Months Free, Plus 12-Month Subscription\nMicrosoft 365 Family | Premium Office Apps | Up…",
					"Save $30 at checkout | Adobe Acrobat Pro DC subscription with auto-renewal\nSave $30 at checkout | Adobe Acrobat Pro DC…",
					"Save 68% on McAfee Total Protection 3 Device\nSave 68% on McAfee Total Protection 3 Devi…",
					"PC Game Pass: 3 Month Membership [Digital Code]\nPC Game Pass: 3 Month Membership [Digital Code]",
					"Could be a great product, but it's just mediocre",
					"A decent headset held back in the most crucial areas.",
					"Not adjustable enough for smaller heads!"
				],
				"customerReviewBodies": [
					"Overall this is a pretty good headset for the money. The industry has come a long way in the past 5 years. Wireless headsets (especially ones that had 5.1 or -gasp- 7.1 sound) used to be two or three hundred dollars for the nice stuff. Mass production and the popularity of pc gaming these days benefits us all with cheap products.\n\nPROS:\n- decent sound. Unless supported by your system and soundcard these will operate as normal stereo headphones (i.e. you're not getting surround sound, and certainly not 7.1). For me stereo (2.1) sound is fine.\n- build quality seems pretty high. They feel good in the hands. There appears to be a metal frame inside the band, unlike some other plastic-only headsets. Good build quality. I like the feel of them.\n- design aesthetic is appealing. People love colored lights on gaming hardware, and these have colored lights. They are made of black plastic. Again, fairly appealing.\n- software generally supports the hardware well. Installation was quick and I was able to get them working in just a few minutes. volume control, mic settings, etc. are readily available.\n\nNow to the cons\n- top heavy (the headband will rest on the top of your skull). I've owned higher end wireless gaming headsets in the past, and also owned decent OTE (over the ear) headphones, and the weight of the headset should be distributed around your entire head. These just kind of hang, there's no 'clamping' tension keeping them pressed to the sides of your head. For this reason, after about 20-30 minutes they are mildly uncomfortable. This also affects the next issue:\n- physically does not cover the ear completely as designed. Because they have zero \"clamping\" tension or force, and they just kind of hang off the top of your head, the lower portion of each earcup isn't physically touching my head below the ear. So there's a gap. Thus, sound quality suffers because it lets in outside noise.\n- Out of the box, the default configuration is to commence auto-shutdown after......5 minutes. Yes I'm serious. So during the first day or two gaming with these things, I'm gaming and then suddenly I'm frantically trying to click any button with my finger after the voice tells me they're shutting down....like Aaarrgh wtf trying not to die in a game and my headset is trying it's best to turn off. How does that make any sense? So I hunted through the settings and there is the ability to turn this feature off or extend the time. But 5 minutes guys, by default. It's crazy.\n- Corsair's iCue software will do things you don't ask it to do. For example, I have a H80i liquid CPU cooler. I've had it for like three years. Never had a complaint, operated well. The minute I installed the iCue software and started to game, my H80 fans start blowing like jet engines. I checked the device settings within the iCue software, and wouldn't you just know it \"H80i has no settings\". So am I stuck with jet-engine cpu fans now? I guess only time will tell.\n\nGiven there are plenty of manufacturers out there, I'd probably not buy these if I could go back in time. I don't recommend this headset.",
					"Okay, these SHOULD be pretty nice headphones for $150, BUT there are quite a few caveats that put me off of these. I noticed a few other reviews mention these issues. These issues bothered me so much I returned them. Simply NOT worth the price!\n\nFirst off, I wear headphones 12-18 hours a day, 7 days a week. For work, recreation, and to help me fall asleep. I know headphones, and have a decent collection of a dozen or so.\n\n1) HOLY DISTORTION, BATMAN! Listening to music at volumes any of my other headphones can handle (including the cheap-o $30 bluetooth units), these units produce massive amounts of distortion. I cannot believe how bad these are at volumes over 50%! Give it one tonal range to cover, and it seems to do okay, but toss in two or three (like bass guitar and a high-hat at the same time.... or, ya know, almost all music) and suddenly you can't make out what you're listening to anymore.\n\n2) The volume roller is EXTREMELY easy to accidentally adjust. I mean, unbelievably easy. I am CONSTANTLY messing with the volume when adjusting the headphones or mic, and since it's so loose it's almost impossible to dial in \"just the right\" volume. Very very annoying!\n\n3) There's no media controls on these. Why? A push-button volume button combination would easily solve the \"too easy to adjust\" volume, and allow media controls through long presses.\n\n4) The ear pieces are EXTREMELY hot. I wear headphones quite a bit, but these burn my ears up in a matter of minutes, which makes me adjust or remove them temporarily. This also reiterates point #2 in that the volume knob is ALWAYS being adjusted by accident.\n\n5) These block absolutely no out-side sound, and people often can hear what I am listening to or playing. This doesn't make sense since the ear-pads don't seem to allow ANY airflow.\n\n6) The mic disable button turns ON a light........ What? So when your mic is on, there's no light. When you mic is OFF, such as when listening to music, hanging out, whatever, there's BRIGHT RED LED on 100% of the time....... Huh???? How does this make sense?\n\n7) the audio volume is easily 1/3 of every other headphone I own. I crank every setting up to 100% just to be equal to 30% on any other headset... Why?\n\n8) mic is garbage!!!! I can't imagine anyone with any sense of intelligence thinking this mic is anything other than painfully sub par. Everything either sounds tinny, or incredibly digital (like using one of those $5 voice oscillators that make you sound like a robot.\n\n9) while the ear pads do go around your ears, the speaker mesh is too shallow and will contact your ears. This makes it unbearable by itself, but combined with every other issue.....\n\n10) FINALLY the surround sound effect is negligable. Playing the same surround sound tests, I cannot tell a difference between regular 2.0 phones and these. At all. There's also a VERY VERY VERY specific place you HAVE to position these, or you'll only hear about 70% of what it's putting out. Unfortunately the VERY SPECIFIC spot these must be placed is absolutely HORRIBLE. You must bend and fold your ears to position them even remotely correctly.\n\n11) I know I said 10 was the final number, but it brings me to another point. These are so uncomfortable in almost every way. After a short session your jaw will hurt, as the bottoms press right into the hinge of your jaw, your ears will hurt and be sweaty from the complete lack of ventilation (it's like putting your ears in a wool coat in July in Florida -- a swamp!)\n\nFrom a company that specializes in headphones, these are full of awfully poor design choices! One of the worst overall headsets I've ever owned.\n\nDo not recommend to anyone for any purpose!",
					"I really wish these were more adjustable.\nThey're huge on me, to the point that if I lean my head forward they start slipping off.\nThey also sit on top of my ears and push my ears down a bit, because I can't adjust the head piece tight enough. They're also made of aluminum, so they're way heavier than I'm used to.\n\nThe mic is also made of rubber, not hard plastic, and is bendable (to a point I'm guessing, I only bent mine a little) so that's awesome.\nBut it's also kinda finicky. I have to put it down and then back up again at least twice to get it to work properly. I'm guessing this is because I can't put it all the way down, because the headset is too big for me. But it makes the mic on noise, so I'm really not sure what the issue is.\n\nIf the sound, and voice quality wasn't so amazing, I would return them.\nBut as it is, I've never had headphones that blocked out that much noise, or sounded this good. The surround sound is spot on. And from what I'm told my audio output is crystal clear when I'm talking to my team mates on discord. It also doesn't seem to pick up ambient noise, like if I have the TV on. It does pick up my dog barking though, but he's big and loud lol.\n\nThese were definitely made more for larger guys, because they fit my husband just fine. But that can also be said for a lot of gaming stuff...\n\nI'm giving it 3 stars because there are a few issues with the design of the headset. Specifically the size, and the mic.\n\nSo if you have a bigger head, and don't want to spend $200-300 on a similar quality bigger name brand, absolutely buy them.\nIf you have a smaller head, be prepared for issues.",
					"As a portly man, I understand the importance of a quality gaming headset. This chicken and rice inspired omelette of closeted questionable camaraderie arrived via decommissioned XRT ChristStrike military drone directly onto my favourite doorstep within the agreed upon delivery terms. Once I plugged these muffs in, they transported me to another galaxy of wonder and bliss. I found myself questioning some of the very foundations of life itself. After using these, I began to question the quality of the sound that surrounds us in it’s most unrestrained, rawest and freest form. Everybody knows I love my George Foreman grill, and now that I have my head phones, I won’t have to hear my wife tell me to stop playing Assassins Creed 2 because I “haven’t slept in three days” or whatever. This lamp gets my seal of approval",
					"Let's get the ugly out of the way first. This headset is possibly the WORSE I've ever owned in respect to connect-ability. For it to connect and stay connected you constantly have to go to sound settings and select it as default & default communication device...not a problem usually, but for some reason. When I try to connect to steam chat, I'm forever having to do this and unplug and re plug the dongle for it to connect. I was ok with it at first, but NOW it's just annoying the hell out of me. Not to mention whenever I plug the dongle in the USB port, I ALWAYS get a \"searching for device driver\" window pop up and once again search for the driver that's been downloaded at least a dozen times over. VERY VERY FRUSTRATING AND MADDENING. I fail to understand this. My old Logitech wireless NEVER EVER had this issue, I'd simply plug the dongle in and a small headset beep then I was good to go....ALWAYS.\n\nThat being said this headset IS however, very comfortable and the sound / microphone quality is just as nice as my old headset (may she rest in peace). I don't really care for lights on the headset, it's nice and all, but really not necessary IMHO, as I don't like these additional bells and whistles that suck battery life. On that subject, the battery is ok, however my old headset far outlasted this one for battery life longevity. This one will give you about 6 hours, my old logitech was 10. All in all I would cautiously recommend this headset, but hindsight being what it now is, next one will NOT be a Corsair, unless they get their act together and fix these connection issues. OH, by the way, the software kind of sucks for me as well. Too many bells and whistles. JUST KEEP IT SIMPLE!!!\n\nEdit Nov 24, 2019. I've decided to return these. I spent 30 minutes trying to get these to work when in a Steam game, so while my buddy's playing and waiting I'm fiddling around with settings. 30 minutes is too much. It's not just in Steam, for some reason (on occasion), the headset freezes up my windows media player to the point where it just simply won't play music. This whole experience actually made me do a fresh Windows 7 install, and the problem is still there. The frustration of the constant fiddling around to get them to do what I want simply, is too much for me. Therefore I cannot really recommend these, unless of course you don't mind fiddling around with settings 99% of the time. I'm reducing my rating from 3 to 2",
					"Al principio dudaba mucho si comprarlos o no, pero me decidí a pesar de que fueran importados, llegaron muchísimo antes y en serio que mi arrepentimiento se borro en cuanto me los puse, están de woow ya que puedo estar horas con ellos y son comodisimos (anteriormente tenia unos audífonos de PS4 platino y se volvían incómodos a las dos horas), casi ni los sientes, el audio es muy bueno y ayuda mucho que sean inalambricos ya que puedo moverme con libertad sin preocuparme por el cable. La pila es muy duradera, procuren cargarlos totalmente antes de usarlos por primera vez.\n\nEl único \"pero\" que pongo es que el micrófono no se puede quitar, pero se puede mover hacia arriba para que no te estorbe (cuando lo haces se mutea automáticamente) y el hecho de que no se ponen como audífonos normales (El arco no es paralelo a las bocinas, va un poco mas inclinado) pero de ahí en mas, estoy contentísimo, excelente servicio.",
					"",
					"RETURN TO THE PREVIOUS EAR CUPS. THESE CUPS ARE NOT THAT GOOD.\nTurns out i was able to just swap them. Thank goodness. I prefer the old foam as it was more open backed. less seal which is all just preference.\n\nUpgraded from the first edition of these headphones.\n\nPros: Light on the mic is much clearer.\nAutomutes on up/down motion.\nPrice\nSound quality\nSoftware compatible\n\nCons: The foam that they use in this version provides more of a seal.\nThe fabric is very Crinkly when you move your head around.\nThe foam squishes a lot which results in ear slightly touching inside. (previous version didnt have this problem.)\nMic is too flexible/rippable.\n\nmy previous headset had the mic rip off after 1.5 years. lived another 3-4 months with tape/glue. Only reason I upgraded is the battery life sucks.",
					"This has got to be my worst buy of 2020. I unpacked it. Plugged it in. Worked great but I noticed a delay in the mic going on when I bring it in front of my face. Oh well. I can live with the mic being a little slow to turn on.\n\nThen, later in the day once the battery is charged, I plug it in to my actual gaming PC. This is where it gets good. I install the software updates for iCue. Install the firmware updates for the head set. I make sure no more updates are available. I turn on one of my games and start playing (Without touching the mic. The mic is off pointing upwards). As I'm playing my game all I hear every freakin' minute is :\n\"Powering on...\"\n\"Mic on...\"\n\"Mic off...\"\n\"Mic on...\"\n\"Powering off...\"\nRepeat n times.\n\nI thought I might investigate the issue further by looking at the settings that were available to me in iCue. Yup, there's an option to turn of those verbal warnings when something happens with the mic. Good. Let's try that again.\n\nTurn on the game. Start playing.\n\"Boop-beep-beep-beep!\"\n\"Doop-beep!\"\n\"Dee-doop!\"\nRepeat n times.\n\nI can tell by now that this relationship isn't going anywhere...\n\nSo yeah. I hate it. Do they even test this???\n\nNow, to be fair, these issues don't happen all the time. But when they come up, you'd better quit playin' your games because this is not fixing itself with a mere reboot. Soz.\n\nOh and did I mention the battery life? With the RGB on? What the hell... Nuff said.\n\nOh also, you get the old type of micro usb plug to charge the head set. In 2020..."
				]
			}
		},
		{
			"id": "7QogiK5",
			"title": "Logitech G PRO X Wireless Lightspeed Gaming Headset with Blue VO!CE Mic Filter Tech, 50 mm PRO-G Drivers, and DTS Headphone:X 2.0 Surround Sound",
			"price": "$173.99",
			"image": "https://m.media-amazon.com/images/I/51j+X0scmhL._AC_SY355_.jpg",
			"description": "The PRO X Wireless Lightspeed Gaming Headset. Engineered for the extreme performance you expect from PRO X—now with 2.4 GHz Lightspeed wireless. Advanced Blue VO!CE, next-gen 7.1 surround sound, and PRO-G 50 mm drivers for clear sound imaging and professional sound and voice comms. PRO X Wireless delivers crystal-clear game sound and voice chat. Comfortable memory foam, plus durable steel and aluminum construction let you play to win. PRO at Lightspeed.",
			"reviews": {
				"customerProfileNames": ["JaxL.", "Nick"],
				"customerProfilePictures": [
					"https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif"
				],
				"customerRatings": ["5.0 out of 5 stars", "5.0 out of 5 stars"],
				"customerReviewTitles": [
					"Logitech G PRO X SUPERLIGHT Wireless Gaming Mouse, Ultra-Lightweight, HERO 25K Sensor, 25,600 DPI, 5 Programmable Buttons, Long Battery Life, Compatible with PC / Mac - Black\nLogitech G PRO X SUPERLIGHT Wireless Gam…",
					"Logitech G PRO Mechanical Gaming Keyboard, Ultra Portable Tenkeyless Design, Detachable Micro USB Cable, 16.8 Million Color LIGHTSYNC RGB Backlit Keys\nLogitech G PRO Mechanical Gaming Keyb…",
					"Logitech G915 TKL Tenkeyless Lightspeed Wireless RGB Mechanical Gaming Keyboard, Low Profile Switch Options, LIGHTSYNC RGB, Advanced Wireless and Bluetooth Support - Clicky , Black\nLogitech G915 TKL Tenkeyless Lightspeed Wi…",
					"Coming from a long-time Arctis 7/Sennheiser user, hopefully this helps clear up some of the reviews!",
					"Primarily used HyperX, now I use the G Pro X."
				],
				"customerReviewBodies": [
					"Logitech G Pro X Wireless Lightspeed Gaming Headset. In used - Very Good condition meaning very minor to no signs of use. Comes with all original accessories and 30 days no hassle returns/replacement. Will be packaged in Non-retail box. Will normally ship same day unless order is received after 3:30pm PST so please expect delivery between 3-5 business days. (please expect a little delay during peak holidays) Returns must be in original condition. Thank you for your support.",
					"I",
					"This headset is great. I have Astro A50s, HyperX Alphas, and the HyperX Cloud ll. Does this headset blow all these other headsets out? No. I do believe for the price point, they are a good contender. One thing without a doubt, the Blue Vo!ce microphone on this headset is far superior than any other headset/microphone combo. Microphone quality is great, presets modes sound great with a lot of customization to what YOU prefer. First compliment when I joined my friends with this microphone, “You sound so professional”.\n\nSound Quality IMO sounds great. I do believe these are on par with the HyperX sound quality. I did notice however the 7.1 surround feature is not my preference. I currently use the 5.1 and have adjusted my equalizer to my liking. You want more bass? Bump the bass up. Treble? Bump it up. So much customization is what sets this apart from other headphones. Yes, you can buy or use aftermarket equalizer software to adjust other headphones. I’m not audio fanatic, but I do like quality and I feel Logitech has delivered with this headset. I also do like with the original ear pads, there is excellent noise cancellation which gives a better-quality sound and keeps the bass locked into the ear cuffs. I have had no issues with positional gaming with the headphones.\n\nFor me, the Logitech G Hub works perfect as I have a Logitech keyboard and mouse. I did have issues with G Hub at first, but that was user error. Once I took time to learn G Hub and mess around with the settings, I have had no issues. Take time to learn the software and you will be able to get these headphones to the microphone sounds and audio sounds you prefer.\nI have had 5-6 hour gaming sessions and have had zero comfort issues. Build quality feels great, similar build quality as HyperX. Design and looks, IMO look better than the HyperX headphones.\n\nOverall, if you want to go for something cheaper, than HyperX is still a good choice without a doubt. If you want good microphone quality and the ability to really customize a headset to your audio liking on the fly? Then this headset it for you. To me, it was worth spending the extra money for the microphone quality alone. I am no streamer, but communication is key to playing well in a game. If you have a crap microphone and no one can understand you, then what good are you?\n\nI will continue to use the Logitech G Pro X 7.1 Surround as my primary headset as I believe overall is a better preforming product.\n\nDon’t let other reviews discourage you about G Hub. Learn the software. With all the software you use to update drivers, graphics cards, Stream Decks, RGB Lighting and so on… Logitech software works great.\n\nYou won’t be disappointed.",
					"I liked that this headset was very easy and seamless to get it up and running especially if you already have Ghub installed. However, I noticed multiple issues within my first week of use in which I had to just return the product as it was not worth the $262 CAD.\nPros:\nComfortable, and has a decent battery life. The G PRO X has a wide range for adjustment that should fit anyone's noggin, and if you tend to get hot while gaming (sensitive to temperature around the ears) you can swap the pads out with the included velour like material pads. Easy connection to PC.\n\nFlaws:\nThe biggest flaw for this $262 headset is the microphone. I don't think I've had a microphone sounding this bad since my days in 2012 with a Steelseries Siberia V2 headset. Now it may not matter to yourself since you do not hear yourself while using this mic, but for the people on the other end it is indeed dreadful. The microphone peaks and sounds like there is an abnormal amount of cutoff between frequencies. Since using this microphone I had to repeatedly repeat what I say in voice coms since the microphone straight up does not recognize my voice and cuts off every single damn time. Logitech needs to revisit and tune this microphone or scrap it in general and release a G PRO X V2 with a Blue mic attached. Not acceptable, my airpods mic sounds better than this headset.\n\nHeadset randomly disconnects, halfway through a match or whatever the headset drops connection for like a split moment not even a second but it forces me to my homepage. Big con when gaming, and only really ever noticed this happening while gaming. (gaming headset btw)\n\nIf my headset was faulty with the disconnect then I would give this a 3 star but it seems like other people have had the same exact issues as me....",
					"Al inicio estaba encantado con los audífonos, pues eran mis primeros wireless y en ese sentido no hay ninguna queja, buena duración de batería y fácil de usar. El sonido no es nada del otro mundo pero por el simple hecho de tener Blue Voice te cobran excesivamente. Aún así y a pesar de casi no usar el micrófono incluído les di la oportunidad al precio, pero para mí pesar, Logitech ha caído de mi gracia. De ser una de mis marcas favoritas a tener fallos en todos los dispositivos, desde pulsaciones dobles u omitidas en sus teclados, hasta usar para sus mouses sensores que con el mínimo de polvo dejan de funcionar en poco tiempo, dando como resultado clicks dobles o nula retención del click, que en shooters al apuntar afectan demasiado.\nEn el caso de estos audífonos en menos de seis meses y sin ningún caso en lo absoluto de uso rudo, caídas u otras situaciones que podrían causar esto y a pesar de anunciarse el uso de materiales premium e incluso diadema de acero, de nada va a servir si lo que une a esta con los auriculares en cuestión son unos topes internos de plástico de lo más frágiles, y que como pueden ver en las imágenes, terminan por partirse y así separar las partes laterales, he tenido que usar super pegamentos o incluso ligas para el pelo para poder mantenerlas unidas, puesto que no simplemente se desatornillan, sino que se desprenden por completo. En la primer imagen adjunta se puede ver la ruptura de uno de los ejes en los auriculares, igualmente sin golpes o caídas, simplemente por el movimiento común del auricular. Ojalá y de todo corazón espero solo haya Sido un defecto de fabricación único; puesto que por el precio al que se venden, el cliente debería obtener mucho más",
					"",
					"It is just one month from I get this headset. I never hit it and I never do anything rude to it. But it broke today. It is only 34 days and its quality can not match its price. I never think a headset can break down in the short term.Bad and sad experience.",
					"Sounds amazing, good range for a wireless headset, pretty solid build.\n\ncons:\n- the volume wheel doesn't stop at max and just does an annoying beep sound when it reaches the max\n\n- The ear pads are really thin which makes my ears touche the internal of the headset. I had to buy a 40$CAD ear pad replacement for a 250$CAD headset. A solid build like the logitech g pro x wireless just to cheap out on the ear pad, CMON",
					"Day one: install Logitech Hub on two machines. Both report 'NaN' when recording and testing audio. Great electron job guys.\n\nDay three: volume slider stops working randomly. Solution posted in the forums? Unplug and replug the dongle. Wow, amazing guys.\n\nDay four: on a separate machine the sound is crackling wildly. Solution? Unplug and replug.\n\nIt seems Logitech Hub has a history of breaking or reducing the quality of the headset.\n\nAs for hardware, they feel fantastic. But, they're hot as hell. Leather caps with sweating isn't a good mix. Other reviews speak of tearing in the leather and I imagine that is why.\n\nFind a better headset elsewhere. Returned mine."
				]
			}
		},
		{
			"id": "dRJNaLp",
			"title": "Razer Nari Essential Wireless 7.1 Surround Sound Gaming Headset: THX Spatial Audio - Auto-Adjust Headband & Swivel Cups - Auto-Adjust - Flip Mic - for PC, PS4, PS5 Only - Black",
			"price": "$44.99",
			"image": "https://m.media-amazon.com/images/I/71XbTJ0dytL._AC_SY355_.jpg",
			"description": "The Razer Nari Essential is designed for gamers who seek core features, superior comfort and incredible sound in a wireless gaming headset. An auto-adjusting headband fits the headset onto the unique shape of your head, while its aluminum body makes it lightweight to wear and provides durability. With plush leatherette ear cushions that completely cover your ears, enjoy superior sound isolation without compromising on comfort. THX Spatial Audio delivers next-generation virtual surround sound for a more powerful immersive experience.",
			"reviews": {
				"customerProfileNames": [
					"MichaelE",
					"Kelz",
					"CiciSparkman",
					"StevenC",
					"JGarcia"
				],
				"customerProfilePictures": [
					"https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif",
					"https://images-na.ssl-images-amazon.com/images/S/amazon-avatars-global/60db1eb7-93ca-4ab4-adbc-e035c98ab2e9._CR0,0,480,480_SX48_.jpg"
				],
				"customerRatings": [
					"4.0 out of 5 stars",
					"1.0 out of 5 stars",
					"5.0 out of 5 stars",
					"5.0 out of 5 stars",
					"5.0 out of 5 stars"
				],
				"customerReviewTitles": [
					"Microsoft 365 Family | Premium Office Apps | Up to 6 users | 3 Months Free, Plus 12-Month Subscription\nMicrosoft 365 Family | Premium Office Apps | Up…",
					"Save $30 at checkout | Adobe Acrobat Pro DC subscription with auto-renewal\nSave $30 at checkout | Adobe Acrobat Pro DC…",
					"Save 68% on McAfee Total Protection 3 Device\nSave 68% on McAfee Total Protection 3 Devi…",
					"PC Game Pass: 3 Month Membership [Digital Code]\nPC Game Pass: 3 Month Membership [Digital Code]",
					"Do a little research.",
					"The worst product. Razor should be ashamed.",
					"Happy and unhappy gamer.",
					"Definitely worth the money",
					"Unbelievable bang-for-your-buck Headphones"
				],
				"customerReviewBodies": [
					"I have noticed that most of the 1 star reviews are from kids trying to use the wireless on xbox, which a little bit of reading would have told them from the start that it wouldn't work. That aside, This is a solid headset for the price. It is very comfortable, even while wearing glasses. It can be a bit heavy after a couple hours, but really we shouldn't be sitting at the PC gaming for 4 hours straight anyway, so I can't really gripe there. The battery is good, I literally can't imagine playing for so long in one sitting that the battery dies, and if it does, either YOU forgot to charge it over night, or YOU have some serious life problems and time management skills to work out. Sound quality is standard, nothing amazing but works well, and the virtual 8-speaker THX works exactly as intended from all the games I have tried so far. The ear cups cancel sound well enough, but they aren't true \"noise cancelling\" as far as I am concerned. Probably not a bad thing if you don't still live with Mommy. Gotta answer the doors and pretend to be an adult.\n\nOverall, its a great headset and the price is right, on par with Corsair Void or Logitech G-series. It really is a shame that kids who don't do their research first are allowed to make bad reviews to mask their own negligence to market research.\n\nADVICE: if you plug in the wireless adapter and get very little sound, poor mic quality, or faint recording, PLEASE try a different USB port. There is a difference between USB 1.0, 2.0, and 3.0 and you want to be certain you are at least using 2.0. DO NOT USE the USB ports on the front of your PC, They are not shielded like the rear I/O and they are much more common to give issues with sound from these kind of devices due to interference.",
					"I",
					"I have tried cheaper wireless, too scared to spend for the better ones and hated them all.\nThe price was decent for a wireless headset and it's Razerr so I went for it.\nComes with dongle and once plugged in it started set up, super easy!\nSound is superb for a gaming headset of similar price and cushiony so your ears won't hurt (especially if you wear glasses)\nHowever, I purchase insurance to go with it. I had trouble with a Razer mouse clearly within Razer warranty but I must have emailed these guys 10 plus times in response to the usual \"Did you plug it in\" but it went further as long to update, reinstall and do a little dance for which they expect a response within a day (Reinstall windows, really?) They wanted a video of the problem but the issue is Synapse stop seeing after months of mystery dumps (In mid game usually).\nI am still waiting on response, I did 90% of requested hoop jumping EVEN tho problems with synapse are well known.\nIt is clear to me they try to discourage people from getting their warranty. I even updated as lot of my hardware, updated everything, troubleshoot but no go.\nUPDATE: Razer came through and replace my mouse with a new model since they no longer have my mouse but I am super happy!\nUPDATe: holding strong almost a year later.",
					"Ive always avoided wireless accessories to eliminate connection issues and batery lives but I buy cheap $20-30 headsets that usually only last a year or two. And I dont like to game with headsets anyway because they hurt my ears after a few hours, but with this headset I was still very comfortable after 8 hours of play time out of the box. The sound is pretty good in most games, and the haptic feedback is very immersive and interesting, I love it. At max volume over the last couple days, I havent had to charge it over 14 hours of playtime, so I believe the 16 hour charge is legit. Theyre just a little quiet but anything can be adjusted in the Synapse app which is really cool to me. I have all Razer accessories and happy to comlete my set with the Nari Essential. Bass is really good, sound quality is fairly clear for the price, I cant think of anything bad to say about it. They are a bit huge on my head but thays nothing sensible to complain about. I don't understand some peoples negative reviews on this, maybe they got scammed with a fake (its more commom and very lowkey than you might think) but Im very happy with it and if it only last a couple years or so, I will be buying another, but I plan to take very special care of this one, I got a stand for it and would highly recommend if you dont use a stand. It's aestheticly pleasing and will improve the life of your headset.",
					"N",
					"En la descripción señala que son compatibles con Xbox y no es cierto",
					"",
					"Info:My old headset \"Corsair void pro wireless\".\nThere is usualy nothing i can say good about a heavily used gaming headset, either the head band starts losing its grip on my head, the pads start getting dry, parts start coming loose....etc.\n\nThe Nari wireless has been my favorite headset hands down. had everything on market except Astros...and This specific headset has no cut corners that i can point out after 6 months of hard competitive FPS gaming.\n\n8/10 connection Dongle range\n10/10 sound quality & Software\n10/10 Build quality",
					"As usual Razers Synapse software is a pain but the headset is very good.\nPros:\nFast charge time and long battery life- I got over 20 hours on a single charge using for both online comms and without the mic for game play.\nPositional audio is first rate. The EQ helps to get the sound to where you would like it but the presets are good.\nVery comfortable and not too hot for extended use.\nCons\nRobot voice issues with the mic at times so be careful how you position the mic when you lower it.\nYou may have to really crank up the output volume on the mic as it can be very quiet.\nThe software is a pain as always. Took a complete reinstall to get headset to work with Discord.\nOverall I do recommend as it’s price pint is good, sound is great and battery life is off the charts.",
					"It's big but it's not heavy and the audio quality is very good",
					"Unfortunately one of the earphones Started to not work and the Mike decided to stop working also. So now I have a headset with one earphone working and no microphone. I have to say they are very comfortable and I love the gel inside the ear phones. Unfortunately they're built like garbage. This is my second bad pair."
				]
			}
		}
	]
}
