{
	"ramSticks": [
		{
			"id": "r9KfDCG",
			"title": "Corsair Vengeance LPX 16GB (2x8GB) DDR4 DRAM 3200MHz C16 Desktop Memory Kit - Black (CMK16GX4M2B3200C16)",
			"price": "Check fit by model, Find your brand",
			"image": "https://m.media-amazon.com/images/I/41a2jzudKtL._AC_SX450_PIbundle-2,TopRight,0,0_SH20_.jpg",
			"description": "Vengeance LPX memory is designed for high performance Overclocking. The heat spreader is made of pure aluminum for faster heat dissipation, and the eight layer PCB helps manage heat and provides superior Overclocking headroom. Each IC is individually screened for performance potential. The DDR4 form factor is optimized for the latest Intel 100 series motherboards and offers higher frequencies, greater bandwidth, and lower power consumption than DDR3 modules. Vengeance LPX DDR4 modules are compatibility tested across 100 Series motherboards for reliably fast performance. There's XMP 2.0 support for trouble free automatic Overclocking. And, they're available in multiple colors to match your motherboard, your components, or just your style.",
			"reviews": {
				"customerProfileNames": [
					"Dan",
					"BrandonCassata",
					"Matt",
					"Calvin",
					"Tamara",
					"ThomasMockler",
					"KindleCustomer",
					"Calv"
				],
				"customerProfilePictures": [
					"https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif",
					"https://images-na.ssl-images-amazon.com/images/S/amazon-avatars-global/a9fd9558-e4c3-4482-b710-020929f19e2a._CR62,0,375,375_SX48_.jpg",
					"https://images-na.ssl-images-amazon.com/images/S/amazon-avatars-global/f304043e-c9a7-458c-b928-bb95c4ecc2d0._CR0,0,318,318_SX48_.jpg",
					"https://images-eu.ssl-images-amazon.com/images/S/amazon-avatars-global/default._CR0,0,1024,1024_SX48_.png"
				],
				"customerRatings": [
					"5.0 out of 5 stars",
					"4.0 out of 5 stars",
					"5.0 out of 5 stars",
					"5.0 out of 5 stars",
					"5.0 out of 5 stars",
					"5.0 out of 5 stars",
					"5.0 out of 5 stars",
					"5.0 out of 5 stars"
				],
				"customerReviewTitles": [
					"Microsoft 365 Family | Premium Office Apps | Up to 6 users | 3 Months Free, Plus 12-Month Subscription\nMicrosoft 365 Family | Premium Office Apps | Up…",
					"Microsoft 365 Personal | Premium Office Apps | 1 User, Up to 5 Devices | 3 Months Free, Plus 12-Month Subscription\nMicrosoft 365 Personal | Premium Office…",
					"Save $30 at checkout | Adobe Acrobat Pro DC subscription with auto-renewal\nSave $30 at checkout | Adobe Acrobat Pro DC…",
					"Save 68% on McAfee Total Protection 3 Device\nSave 68% on McAfee Total Protection 3 Devi…",
					"Posting this information here for anyone that is struggling like I was",
					"Be sure to check your QVL before purchasing...",
					"Working at 3600 with Ryzen 3000 CPU",
					"16-20-20-38",
					"Micron E Die. Plug & Play 3600Mhz on Threadripper 2950X, X399 platform",
					"Some of the fastest RAM for the price",
					"Works perfectly in Gigabyte X570 Auros Master",
					"Speed"
				],
				"customerReviewBodies": [
					"After a lot of tinkering and playing guys I figured it out with some help. I could not get the memory to run at 3200, it would just default back to something lower. Posting this information here for anyone that is struggling like I was! Enjoy and hope it works for you all.\nFinal numbers:\n16, 18, 18, 18, 36\nVoltage 1.35\nFrequency 3200\n\nMSI B350 Tomahawk + Ryzen 1700x running at 3.9GHZ 1.425V",
					"S",
					"I purchased this set mainly because of price, at the time of purchase I could not find much information in regards to this ram. They come in the standard no frills packaging, install was a breeze like any other ram modules. Set XMP settings in the bios and checked the speed, they are operating at 3600MHz with a Ryzen 3900X processor in a x570 Taichi Motherboard. After checking what type of memory they are, I found that I received Micron E-die memory. This is working fine for my purpose, but your mileage may vary. I have not tried to adjust timings, but they appear to have 18-22-22-42-64 timings. Once again I have not tried to overclock this memory, but it my system is running stable with 32 gigs of this memory installed with XMP 2.0 settings via the bios. Overall I'd recommend this ram on price alone, there are a lot more expensive ram out there, with different memory manufacturers. If you need something that works without much hassle, pick up this ram.",
					"Be mindful that this is the \"E\" version not the \"C\", timings are 16-20-20-38. Seller should have listed it more obviously in the description rather than giving a generic Corsair lpx one, they should have listed the timing too.",
					"Plugged it in, loaded the XMP profile and it booted straight into 3600Mhz no problem. Currently stress testing and will follow up but it all looks good now.\n\nUpdate - Running well after several days and extensive memory stability testing. Used Ryzen DRAM Calculator and set the basic timings a little faster. Now running stable at 3600 CL16.",
					"I got this on sale. I'm glad I did. It's already good RAM at it's base speed, and it's fantastic when you overclock it.\n\nIt's low-profile and doesn't glow or shoot fire out or anything like what some RAM does these days. Consequently, it's easier to install without the CPU fan getting in the way.\n\nJust make sure your BIOS doesn't underclock it. Many will set it to 2100 Mhz by default.",
					"I wanted to be able to upgrade later to 128GB Ram on this motherboard. so used this 64GB kit on the Gigabyte X570 Auros Master MotherBoard with an Ryzen 9 3950X .just using the basic XMP Profile I ran it through Memtest 86 Pro through all 4 test cycles without an issue... then booted into windows. no issues after a week of running now.",
					"Works well with my asus x570 tuf mobo and 3600 cpu. Hits advertized speed.",
					"The top-rated review says it doesn't support 3200. But it does! You just need to enable it in bios under XMP 2.0\nSo please ignore those negative reviews! Vote up positive ones instead!!",
					"Siempre he confiado en Corsair como marca para los componentes de mi equipo por su gran calidad y garantía. Cumple todas las especificaciones y parece funcionar a la perfección, compré la de 3200mhz, es importante fijarse en las ranuras de tu placa base, ¿Cuántas ranuras hay? ¿DDR3 o DDR4? ¿mhz máx que admite? Preguntas que hay que hacerse antes de comprar la memoria ram o antes de comprar también la placa base para tu odenador. Yo tengo la ASUS B450M-A y admite máximo 64GB RAM a 3200mhz, debido al dual channel es mejor tener dos módulos de 8gb ram que un solo módulo de 16GB porque con dos módulos funcionará más rápido. Hay que recordar que si excedemos los mhz que admite nuestra placa puede que no funcione o sin más no aproveche esa velocidad \"extra\". Y es imposible usar una ram DDR4 en una placa DDR3 ya que no es comaptible. Cualquier duda mejor preguntar a un profesional aunque siempre se puede devolver! En resumen yo la compré para un PC de uso habitual y gaming (Fortnite, GTA...) y funciona perfecto todo! Por el precio que tiene me hubiera gustado que hubiera llevado unos LEDS pero no es así.\n\nSi te ha gustado mi opinión, POR FAVOR márcala como ÚTIL. Muchas gracias.",
					"",
					"Bought this with a Ryzen 7 3700.\n\nThere's a few negative reviews here from people expecting this to work without configuring their system.\n\nOut the box a Ryzen CPU does not support 3600 Mhz so you need to overclock your CPU. When I installed the memory it ran at 2133Mhz and this is expected. You need to overclock your Ryzen's infinity fabric with a clock ratio of 1:1 (or more but use a guide) and then set the memory clock to 1800Mhz (Dual channel 1800Mhz x 2 = 3600). Please do some research on overclocking before you buy high speed memory kits because they don't always work out the box and its not (usually) Corsairs fault.\n\nAlso a side note that 3600Mhz advertised is the maximum stable clock speed it will run at. You can clock it to more but you need to know what you're doing.\n\n10/10 Would recommend I'm getting very high benchmarks",
					"J'ai acheté ses deux barrettes de rams pour les performances qu'elles affichaient par rapport à leurs prix (jusqu'à 3200mhz)\n\nCe qui n'est en revanche pas notifié c'est que ce cadencage n'est pas activé par défaut\n\nJe me suis retrouvé à acheter des barrettes de ram en pensant que c'était du 3200mhz ce qui était parfait pour mon processeur\n(Ryzen 5 3600)\n\nMais forte heureusement mon esprit curieux m'a fait aller dans le bios pour regarder le cadencage\nQUI ÉTAIT À 2133mhz !\nJe l'ai donc repasser à 3200mhz, je me suis donc renseigné par la suite et j'ai pris connaissance que le fait d'activer la mémoire XMP (qui permet de passer en 3200) enlève la garantie\n\nSachant que les gens sont censés payer pour des performances sur lesquels ils n'ont pas directement accès et sur lesquels ils perdent leurs garanties si ils l'activent c'est un peu de l'arnaque je trouve.",
					"",
					"i ordered these 3200 mhz rams to upgrade my 2666 mhz rams.when i installed them i checked task manager and i found out the actual speed is 2133 mhz not 3200 mhz. even the label on the box shows 3200 mhz. i do not know if it has happened to someone before or not.not happy and i am getting a full refund."
				]
			}
		},
		{
			"id": "4GcFisp",
			"title": "Corsair Vengeance RGB Pro 32GB (2x16GB) DDR4 3200 (PC4-25600) C16 Desktop memory – Black",
			"price": "$109.99",
			"image": "https://m.media-amazon.com/images/I/51gCXtjJKhL._AC_SX450_.jpg",
			"description": "CORSAIR VENGEANCE RGB PRO Series DDR4 memory lights up your PC with mesmerizing dynamic multi-zone RGB lighting, while delivering the best in DDR4 performance and stability. Every module boasts ten individually controlled RGB LEDs, while wire-free design makes installation simple. Take control with CORSAIR iCUE software and completely customize every module’s lighting to match your system, or easily synchronize lighting across all your CORSAIR products with Light LINK. A custom designed PCB provides the highest signal quality for the best level of performance and stability on the latest AMD and Intel DDR4 motherboards, while specially screened ICs unlock superior overclocking.",
			"reviews": {
				"customerProfileNames": [
					"Gail",
					"onebadcat",
					"Austingasper",
					"TaeKim",
					"dv82u",
					"Tristin",
					"Dreamtheory",
					"JasonLepak"
				],
				"customerProfilePictures": [
					"https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif",
					"https://images-na.ssl-images-amazon.com/images/S/amazon-avatars-global/328d0fe3-6d90-4db5-ae8b-f9a3110219d0._CR62,0,375,375_SX48_.jpg",
					"https://images-na.ssl-images-amazon.com/images/S/amazon-avatars-global/0a693a9d-4107-4ea4-9818-f95a6cdce855._CR83,0,333,333_SX48_.jpg"
				],
				"customerRatings": [
					"5.0 out of 5 stars",
					"1.0 out of 5 stars",
					"5.0 out of 5 stars",
					"5.0 out of 5 stars",
					"5.0 out of 5 stars",
					"5.0 out of 5 stars",
					"5.0 out of 5 stars",
					"5.0 out of 5 stars"
				],
				"customerReviewTitles": [
					"Microsoft 365 Family | Premium Office Apps | Up to 6 users | 3 Months Free, Plus 12-Month Subscription\nMicrosoft 365 Family | Premium Office Apps | Up…",
					"Microsoft 365 Personal | Premium Office Apps | 1 User, Up to 5 Devices | 3 Months Free, Plus 12-Month Subscription\nMicrosoft 365 Personal | Premium Office…",
					"Save $30 at checkout | Adobe Acrobat Pro DC subscription with auto-renewal\nSave $30 at checkout | Adobe Acrobat Pro DC…",
					"Save 68% on McAfee Total Protection 3 Device\nSave 68% on McAfee Total Protection 3 Devi…",
					"Just as advertised!",
					"Couldn't get it to run at rated speed on an MSI X570 MB",
					"INSANE VIDEO EDITING SPEEDS NOW!",
					"great RAM",
					"Colorful, yet powerful",
					"Amazing ram!",
					"5/5 absolutely worth the purchase",
					"You'll like it!"
				],
				"customerReviewBodies": [
					"My first gaming pc in 15 years. I would highly recommend this product. Item came intact with no damage to the actual packaging. My MSI z490 edge motherboard had no issues with the memory. Confirmed by checking the BIOS that the speed and memory type was as advertised and is working flawlessly. RGB is not for everyone but if you are looking for a nice build the colors on the memory is very bright and high quality. You can also adjust the brightness and colors to you liking. Game on.",
					"It will run at 2133 MHz out of the box, but that's not what you're paying for. Perhaps it works fine with Intel chipsets, but it consistently refused to boot with the MSI X570 Prestige motherboard. Not using the XMP profile, not by setting the timings manually, not after increasing the voltage to 1.35 V or above.\n\nThe highest speed I could get it to run at is 2800 MHz. If you're looking for a memory for a Ryzen build, probably look elsewhere.",
					"Upgraded my RAM for video editing and made all my playback in premiere pro and after effects smooth as butter! These were just part of my fix to get my computer to this point to edit on. However I can say these RAM cards are amazing and you’ll save like 70$ Buying this. They sell the SAME exact cards for like $220 and it just has more reviews and 5 stars so everyone is paying more... you DONT have to do tha, these are exactly as described and you won’t be disappointed.",
					"GREAT RAM for your build. people say 16GB is the sweet spot, but for me? It's 32GB. I personally dislike it when my PC slows down even a littlw bit when i multitask or open up more than 5 google chrome taskbar. In the picture, my RAM's RGB is set to white to match my PC. looks amazing and easy to change, just download iCUE\n\n*SET XMP IN BIOS FOR THE LOVE OF GOD",
					"I needed an upgrade since the last time I did a major PC upgrade was nearly 9 years ago. I chose Corsair because it accomplished several criteria off of my checklist. First priority was the RAM, in order to process my photos through photoshop, I needed lots of RAM. For the price I was able to purchase 64Gb to accommodate the process, second was the aesthetics. When I did my PC build, I decided to go with RGB's and this complemented my overall scheme with other Corsair components. Lastly, I want to overclock my PC and have the ability to do it. Great job Corsair! I'm a true and loyal brand follower.",
					"From everything I've seen. These are great ram sticks, they look great while on. I finished building my PC and these run great! 32bg is amazingly for well, any task I throw at it. To get its full clock speed you will need to enable your motherboards version of xmp. For some reason for me it started at 1600 instead of the 3200 it offers, tampering with my settings got it to the desired speed. Overall amazing ram and worthy purchase.",
					"These are RAD! There are so many colors to choose from and you have tons of lighting \"settings\" you can pick from, I also have the corsair H100 RGB CPU Cooler and I have all the lighting sync'd between that and the RAM. Also, if you're not in the mood to have RGB on, or you want it dark while watching a movie, you can easily turn off the RGB as well, its not permanently stuck on.\n\nBesides the RGB, these have great performance! I bought 64 GB worth of these because I play games like Star Citizen that are really hard on the computer. Before I only had 16GB of 2400 MHz ram... playing Star Citizen was almost impossible. Tons of stuttering/freezing and my FPS was between 2-12 at max. Swapped out for 64 GB of this RAM and now I'm running 45-60 fps... with nothing else changed. Just the RAM. 100% worth it and I'll never go below 64 GB ram ever again.",
					"The memory is pretty much everything that you'll read in the description, and the ARGB LED's are way better than I expected. They're nice and bright, fully addressable and it just makes the whole thing look that much cooler.\nSo far I only bought 32GB of these (two sticks) and I will definitely be ordering another set in the near future.",
					"For those who said that run in 2100 MHZ. That's totally true. it run by default on 2100 MHZ to ensure that the RAM will work on any motherboard. You will need to go to the bios and into Ai Overclock Tuner turn D.O.C.P. (if you have a RYZEN CPU ) or XMP if you use INTEL.",
					"i upgraded from 4 x 8gb too 4 x 16gb. i have not noticed any thing out of place so all must be fine. i have not yet played a game yet but i'm sure i will notice a big change in the speed. great buy",
					" Looks amazing, pretty fast 3200mhz speed. Really easy to install and great price!",
					"Had to return for refund, as too tall to give clearance under 280mm AiO cooler in Define 7 case.\nDon’t seem to be any RGB DIMMs that would fit.",
					"Looks fantastic runs well"
				]
			}
		},
		{
			"id": "8oI5gcu",
			"title": "Corsair Vengeance RGB PRO 16GB (2x8GB) DDR4 3200MHz C16 LED Desktop Memory - Black",
			"price": "Check fit by model, Find your brand",
			"image": "https://m.media-amazon.com/images/I/71Kkm5nIRKL._AC_SY450_PIbundle-2,TopRight,0,0_SH20_.jpg",
			"description": "Corsair vengeance RGB PRO series DDR4 memory lights up your PC with mesmerizing dynamic multi zone RGB lighting, while delivering the best in DDR4 performance and stability. Every module boasts ten individually controlled RGB LEDs, while wire free design makes installation simple. Take control with CORSAIR iCUE software and completely customize every module's lighting to match your system, or easily synchronize lighting across all your CORSAIR products with Light LINK. A custom designed PCB provides the highest signal quality for the best level of performance and stability on the latest AMD and Intel DDR4 motherboards, while specially screened ICs unlock superior Overclocking. Heat Spreader Anodized Aluminum. SPD Speed - 2133MHz.",
			"reviews": {
				"customerProfileNames": [
					"bArToS",
					"ChrisG.",
					"ChristianViau",
					"Brandon",
					"Lauren",
					"RJCormack",
					"JamesG."
				],
				"customerProfilePictures": [
					"https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif",
					"https://images-na.ssl-images-amazon.com/images/S/amazon-avatars-global/6ea8b944-325c-45d0-b625-cf5bf45e1fa1._CR0,0,960,960_SX48_.jpg",
					"https://images-na.ssl-images-amazon.com/images/S/amazon-avatars-global/b13e893e-df2b-4d76-8a8a-074ef2956dc0._CR62,0,375,375_SX48_.jpg",
					"https://images-eu.ssl-images-amazon.com/images/S/amazon-avatars-global/default._CR0,0,1024,1024_SX48_.png",
					"https://images-eu.ssl-images-amazon.com/images/S/amazon-avatars-global/a500f012-b52f-4faa-9d86-a5dcfecbbc72._CR0,0,500,500_SX48_.jpg"
				],
				"customerRatings": [
					"5.0 out of 5 stars",
					"5.0 out of 5 stars",
					"5.0 out of 5 stars",
					"5.0 out of 5 stars",
					"5.0 out of 5 stars",
					"5.0 out of 5 stars",
					"5.0 out of 5 stars"
				],
				"customerReviewTitles": [
					"Microsoft 365 Family | Premium Office Apps | Up to 6 users | 3 Months Free, Plus 12-Month Subscription\nMicrosoft 365 Family | Premium Office Apps | Up…",
					"Microsoft 365 Personal | Premium Office Apps | 1 User, Up to 5 Devices | 3 Months Free, Plus 12-Month Subscription\nMicrosoft 365 Personal | Premium Office…",
					"Save $30 at checkout | Adobe Acrobat Pro DC subscription with auto-renewal\nSave $30 at checkout | Adobe Acrobat Pro DC…",
					"Save 68% on McAfee Total Protection 3 Device\nSave 68% on McAfee Total Protection 3 Devi…",
					"Just incase it helps someone",
					"holy these are bright and awesome",
					"Fast, Stable and...pretty.",
					"Simply the Best",
					"Corsair is my go to RAM",
					"Great for Creators!",
					"Expensive, Low Tech, but all Natural."
				],
				"customerReviewBodies": [
					"So I got these for my build and had a little problem that I haven't seen mentioned.\n\nI was using a Ryzen 2700x with a ASROCK x370m Pro4 Motherboard and 32gb of these sticks (3200). They're not on the QVL.\n\nInitially I put all 4 in at once, wouldn't even get to the BIOS, just kept boot looping. Tried several things like only 2 at a time for each pair, same issue. I made sure everything was connected, even doubled checked that the processor was seated correctly. Everything looked good, but it still kept boot looping.\n\nWhat ended up working for me was just putting a single stick in the first slot. For some reason when it only had 1 stick in it recognized it and took me to the BIOS, maybe someone knows why? The weird part about that is that it had to be a particular stick. One stick from the pair worked and the other did not. Then I just added each stick and currently have all 4 running. The RAM was only running at 2133, but that's not a big deal you can change that.\n\nNot sure why mine needed only 1 particular stick to start, but if you're having an issue like this then give it a shot , maybe it will work for you.",
					" If you want to light up your case, get these sticks! These also have a soft rainbow pulsing effect so it’s not just a static light. I will post a video at some point. I mean you put these in and you really don’t need any other lighting in your rig. It will glow.\n\nI am using these in my Asus Maximus Hero XI (wifi) and mention this because there is another review here saying that these sticks can’t be used in that board.\n\n8/26/19 update: ordered 2 more sticks and added a few more pics of 4 lighting up the case.",
					"Worked flawlessly out of the box. Set the XMP 2.0 profile with just a click in BIOS and it was set up and done. Colors are beautiful albeit a bit of the pastel variety, shade wise.\n\nAs far as value for money is concerned I felt that it and pretty much all RAM for PC's as of the date of purchase are still over priced.\n\nExcellent product overall, just took a star off for the cost of this set of RAM sticks.",
					"If you are looking for great RAM with the added benefit of RGB lighting, look no further. This RAM from Corsair is vastly superior in both. It not only performs excellent, but the variation in colors looks fantastic! Very easy to install, and the black looks great when the RGB lighting is flashy its colors. Yes, it is more expensive than other ram, but you are paying for quality - and the quality of Corsair in general gives me extra security in buying their products! 10/10 highly recommend!",
					"I have built several desktop computers at home, and I always use Corsair RAM. It is very dependable and should I need to contact customer service, they are great! This RAM has amazing lighting effects that put on a vivid color light show through my glass window case. The lighting is a really cool addition to an amazing RAM package that fits my needs. I always recommend contacting Corsair to identify your specific RAM version best suited to your motherboard and CPU.",
					"I purchased 2 sets and created my own matching 32GB set (4x8GB) DDR4 3200MHz Corsair Vengeance RGB PRO Desktop Memory. Check your BIOS! They don't always auto detect the right settings, I had to manually select 3200MHz. Nothing I can't do now, scan a 20Gb image resolution on the flatbed scanner, Photoshop anything, edit videos in Premier Pro, I can create anything and it will save or render it quickly. Stock CPU cooler and 3 120mm case fans, no liquid cooling, NO overnight sessions anymore!\n\nCurrent PC build:\n• AMD Ryzen 7 3800XT 8-core/16-Threads.\n• EVGA GeForce RTX-3060.\n• ASUS ROG Strix B450 ATX Motherboard.\n• 32GB (4x8GB) DDR4 3200MHz Corsair Vengeance RGB PRO Desktop Memory.\n• 1TB Western Digital Blue M.2/NVMe Board Mounted SSD, Gen3 PCIe up to 2,400 MB/s.\n• Seasonic FOCUS GX-650, 650W 80+Gold Full-Modular PSU.\n• 3x SilverStone AB120R 120mm PWM Addressable RGB Case Fans.\n• EVGA PowerLink, PCI-e 12volt power adapter, part # 600-PL-2816-LR (EVERYONE should be using this on their GPU, stop the sag).\n• AMD Wraith Prism CPU Cooler; Copper Base & 4 Heat Pipes.\n• Windows 10 Pro.\n• Adobe Creative Suite 5 Master Collection (everything).\n\nThis build benchmarked in the 92nd percentile of current PC's in the world. And I have fun doing my own creating, and editing footage my young son's stories he has filmed.",
					"5",
					"Bin super unzufrieden...\nSpeicher ist schnell angekommen sieht mega gut aus Wertig verarbeitet. Direkt eingebaut hat auch alles gut funktioniert... Naja bis... Ich versucht habe zu synchronisieren..\n\nMainboard Gigabyte Aorus x470\nDazu sind alle Lüfter von Corsair LL120 rgb\nGenau wie Maus und Tastatur auch von corsair nun ja.. Somit brauch ich die icue Software für meine Corsair Produkte und da geht's los..\n\n(hab das auch mit der Gigabyte software versucht der ram wird zwar erkannt kann aber nichts einstellen.\n\nAnscheinend fertragen sich corsair und Aorus doch nicht.. Einmal wurde der RAM erkannt einmal nicht.. Einmal leuchtet ein riegel manchnal keiner dann doch wieder nur einer... Mitten drin gehn dann beide dann doch wieder nicht und sooo weiter...\n\nHab alles versucht ohne Software mit software... Bios update... BIOS downgrade...\n\nHabe auch den Kunden Service von Corsair angeschrieben hab ein Ticket geöffnet.. Naja ich warte heute noch auf eine Antwort bzw Problem Lösung",
					"",
					"I decided to upgrade my RAM and decided I wanted to get something more high end than the plain looking 2400MHz DDR4 RAM I was using previously. I decided on 2 by 8Gb Corsair Vengeance RGB Pro sticks and settled on 3200MHz as the best value option at the time of buying (with an assumption that the performance improvement with frequency is linear).\n\nI don't have benchmarks, so the performance improvement is hard to detect in day to day use, as you can probably imagine. However, the RGB lighting (as ridiculous as the whole RGB thing is getting at this point) is honestly pretty nice and really stands out.\n\nMy only nitpick is that I also have an Asus Aura supporting motherboard and neither Asus nor Corsair support anything other than the lighting in their own products. This isn't a suprise, but it is a little inconvenient that third party software is required to sync up all the lighting in my setup.\n\nThese are a great choice from the point of view of performance and aesthetics and have been working great for me. No real complaints.",
					"I",
					"It's been a while since I built my last PC. I expected to plug these in and get the rated 3200Mhz speed with no further effort. However, you actually have to overclock these from the bios settings to get them up to the 3200MHZ mark. These easiest way to do this to enable the XMP profile (pretty easy on a Gigabyte Aorus Master X570 motherboard) . However, for me plating Battlefield 4 and 5 would result in a crash to desktop after a couple of minutes gaming. After researching a few web pages I found that people had this occur when they overclocked their memory - but surely I was just running at the rated XMP speeds? I decided to run memtest86 and sure enough, the memory would fail tests at the settings provided in the XMP profile! I had to tweak the settings, notably increasing the Trc setting from 54 to 56 to get it to run stable. Bit of a pain.\n\nOtherwise the RAM looks solidly constructed and the lights look pretty!",
					"First off, this RAM seems very stable in my Ryzen 3600 based system - good. RGB is also lovely - bright, good colours and I currently have it synched with my Corsair mouse using the iCue software, rather than the MSI Mystic Light - haven't tried that yet but the motherboard RGB ain't great and that's all I have at present!\n\nBut, my big disappointment is the RAM chips Corsair are now using. Maybe I should have done more research on this beforehand but they have moved from Samsung to Hynix, at least in my sticks anyway. Bummer. I was hoping for some overclocking goodness but I can never seem to get anywhere with the Hynix stuff, even when following the settings in a utility such as the Ryzen RAM Calculator. Got these to 3333 but that's it. I could possibly raise the CAS to up the frequency a bit more but that's bot a great trade-off. I know from past experience that much more can be achieved with Samsung chips and to be honest, that's one of the reasons I went for these. Hey ,ho. Maybe different batches are using different chips? I don't know. But that's my experience with these. It's good, colourful RAM, but I was expecting more from it.\n\nUpdate: I made more of an effort and fully utilised the Ryzen DRAM calculator - now have RAM running at CAS16 and 3600 MHz so am now very happy!"
				]
			}
		},
		{
			"id": "tBE2hD0",
			"title": "Corsair Vengeance RGB PRO 64GB (2x32GB) DDR4 3600 (PC4-28800) C18 Desktop Memory – Black,CMW64GX4M2D3600C18",
			"price": "$289.99",
			"image": "https://m.media-amazon.com/images/I/61GpY38PAWL._AC_SY450_.jpg",
			"description": "",
			"reviews": {
				"customerProfileNames": [
					"Jeffrey",
					"David",
					"JamesGose",
					"A.Aurelius",
					"RICHARDTURNBULL",
					"RK",
					"ИiскР",
					"DaneBrown"
				],
				"customerProfilePictures": [
					"https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif",
					"https://images-eu.ssl-images-amazon.com/images/S/amazon-avatars-global/default._CR0,0,1024,1024_SX48_.png"
				],
				"customerRatings": [
					"5.0 out of 5 stars",
					"5.0 out of 5 stars",
					"5.0 out of 5 stars",
					"4.0 out of 5 stars",
					"5.0 out of 5 stars",
					"5.0 out of 5 stars",
					"5.0 out of 5 stars",
					"5.0 out of 5 stars"
				],
				"customerReviewTitles": [
					"They take up less space",
					"Great RAM",
					"Works great with an AMD 3950X and X570 motherboard",
					"The RGB LEDs may cause unusual errors with iCUE",
					"FANTASTIC RAM !!!!!!!!!",
					"Excellent LEDs",
					"128gb of ram? In only 4 slots? Heck yeah!",
					"Amazing"
				],
				"customerReviewBodies": [
					"Great RAM, I have a previous version of this ram that is a few cm bigger than this one. This one is SLI=Slim so it is smaller and takes up way less space on the motherboard.\nThe bigger version seems to be sold out and more expensive on other websites.\n\nAtta he'd is an image of the SLI ram and the previous version. It might be hard to tell but it is smaller",
					"Works great. Got the 2x32gb. Read review thinking it would be Hynix, but I did not get Hynix, I got B-Die? On my 3900x I was able to get 3600mhz at cl16 stable. 64gb at 3600mh sounds pretty good to me! Now I can finally have 3 chrome tabs open.\n\nThe RGB is pretty good, bright and shiny. Wish the white variant was easier to get though...\n\nRunning on a 3900x/Strix B450 I board and a 2080ti.",
					"Don't be a fool, reset your BIOS/CMOS/UEFI to defaults before installing this kit! Who has two thumbs and installed the RAM without verifying the timings had been updated? This guy! :)\n\nThe RAM runs great paired with an AMD Ryzen 9 3950X and Asus ROG Strix X570-E Gaming motherboard (BIOS version 2407). I ran Memtest86 for ten hours (2 full passes) to verify the RAM was fault-free before booting into Windows 10. Ran a couple of 3DMark benchmarks to make sure the RAM could handle gaming, as well.\n\nThough the default Rainbow RGB pattern makes lovely colors, it gets old fast with how bright they are. iCUE quickly fixed that.\n\nOver the next few weeks I will keep burning them in with gaming, Chrome tabs, virtualization, video editing, photo processing, and more. Should I come across any adverse findings, I will update my review appropriately!",
					"The last item I had with several blinking lights on it was my toy robot, ... when I was 4 years old. The RGB LED craze to put flashing lights on every computer component, for the most part seems absolutely asinine. I only purchased this particular model because I needed two 32GB sticks and I have used Corsair Vengeance in the past with good results. I mounted them properly and they work just fine in my Gigabyte Aorus Master Z390 motherboard. By default, the LEDs are set to a slow \"breath\" cycle that changes to another hue every 5 seconds or so. If you want to take full control of the LEDs, you need to use Corsair's monster bloatware program iCUE that will likely #### up more things than it fixes. I went into iBloat and set the LEDs to map to the dimms temperature sensor, so I could tell if they got too warm. Once I made this adjustment, the voltage regulator on my Corsair HX1200i PSU started clicking. Two days later, and I am still troubleshooting the LEDs (the HX1200i has been rock solid for more than 2 years). If the LEDs are set to off, the clicking disappears. I am still fooling with finding a compromise. Stay tuned ....",
					"This ram is great for the IBUYPOWER Mini computer!!!!!!!! Plus many more that can take the 32GB power.the colors are jjust beautiful and once the software is installed from Corsair youll see what i mean. The a mount is aliitle high but well worth the power. BUY IT!",
					"I am writing this review just to let everyone know that they don't turn off when pc sleeps but if you hibernate the PC.. they do turn off and come back on when you wake up the PC..",
					" Yes this kit of ram is stupid expensive for what your getting... but its 3600mhz of 128gb ram... so far I've notice 2 things. One.. 128gb is alot of ram and secondly, games seem to use less of it the more you use. But anyway this kit is pretty dang cool. It works with ICUE to sync the colors of your whole system!",
					"Perhaps I was lucky but its running stable on AMD x570 at 3600mhz CL16 (hynix chip)",
					"Just built a new gaming pc and these suit the build to a tee. 16GB is plenty of ram and at speeds of 3200mhz, you shouldn't consider anything else. The rgb lighting in this ram is also extremely bright and will add a real aesthetics boost to your rig, there's millions of lighting and colour options to choose from also. Cant recommend this product enough.",
					"I",
					"I was concerned about the difference in timings between the SL and non-SL versions but this performs perfectly for what I need.\nJUST REMEMBER TO ADJUST THE RAM SPEED IN YOUR BIOS. Otherwise you won't be getting the full 3600Hz you pay for, but more like 2700Hz or 3200Hz",
					"Corsair, generally you can’t go wrong with a product from them and that is still true for this product. It’s a new design of the old but still relevant RGB Vengeance. Looks pretty nice, basically just a small refresh of the RGB design and vengeance logo/styling. Bright RGB and fully customisable within ICue (Corsair RGB Software)\n\nBrilliant for gaming generally and you can’t go wrong. Various speeds available and as we all know quite well, RGB means more frames. (That last statement isn’t actually true)\n\nOverall happy with the product, works well and I have no complaints.",
					"PC Parts seem to be getting harder and harder to get hold of... Of course I chose this time to build a new PC.\n\nAnyway the RAM looks stunning and performs brilliantly in my gaming PC.\n\nI pair it with an AMD 5600x and RTX 3070 and it runs like a dream!"
				]
			}
		},
		{
			"id": "Cm5utOg",
			"title": "TEAMGROUP T-Force Delta RGB DDR4 16GB (2x8GB) 3200MHz (PC4-25600) CL16 Desktop Memory Module ram TF4D416G3200HC16CDC01 - White",
			"price": "$68.00",
			"image": "https://m.media-amazon.com/images/I/51No8tnDDpL._AC_SX355_PIbundle-2,TopRight,0,0_SH20_.jpg",
			"description": "About this item\nIn order to cope with the change of manufacturing process of the memory, TEAMGROUP will change the way of RGB lighting effects on DELTA RGB gaming memory from 2021. This is not a faulty or defective lighting, and does not affect the operation of lighting effects and software control\nFull frame 120° ultra wide angle lighting with built-in Force Flow RGB lighting effect, supports software synchronization\nAluminum alloy heat spreader with asymmetric minimalist design\nSupports XMP2.0 one-click overclocking technology; QVL approved by all mainstream motherboard manufacturers\nLifetime warranty",
			"reviews": {
				"customerProfileNames": [
					"Realist",
					"Damon",
					"Steve",
					"Frank-Lee",
					"TMDJCBeatz",
					"GregPincince",
					"BrentonBoone",
					"Lance"
				],
				"customerProfilePictures": [
					"https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif",
					"https://images-na.ssl-images-amazon.com/images/S/amazon-avatars-global/0bdbc4ac-bb42-4609-9d84-7cf92aeb7e38._CR0,0,377,377_SX48_.jpg"
				],
				"customerRatings": [
					"1.0 out of 5 stars",
					"5.0 out of 5 stars",
					"5.0 out of 5 stars",
					"3.0 out of 5 stars",
					"5.0 out of 5 stars",
					"4.0 out of 5 stars",
					"5.0 out of 5 stars",
					"5.0 out of 5 stars"
				],
				"customerReviewTitles": [
					"Pricing on this is horrible",
					"Super easy. Their RGB software",
					"Worked perfectly with my Ryzen 5 1500x",
					"Performs ok, serious hot spots on leds though",
					"Worth every penny",
					"works but....",
					"Great choice for looks and stats.",
					"I put the 32gb 3600 in my ASUS Z590 with i7-11700 and it smokes!"
				],
				"customerReviewBodies": [
					"$1899 for 32GB is obscene.",
					"Worked flawlessly with my Ryzen 1600 build. I'd been fighting trying to get anything more than 2133 on my 3000mhz Trident Z RGB ram since I finished the build about 8 months ago, but no dice. With this, I plugged it in, enabled XMP 2 in the bios, and it instantly was running at 2933. Super easy. Their RGB software, Blitz, works well and is super easy to use. Only downside is the LEDs in the sticks create hotspots in the light strip, but it's not too noticeable and isn't a big deal to me. I highly recommend this RAM.",
					"This RAM worked right out of the box with no issues with my 1500x Ryzen processor I've tried Kingston hyper x ram kinda worked but on stick was bad in the stick same with Corsair LPX RAM modules had to settle for a single stick of 8GB wouldn't boot with a dual channel until i pulled a stick out but then one of the ram sticks was bad from the coarsair kit as well ugh then i tried this set in a clients build i was doing worked flawlessly so got myself a set of these T Group modules as well and worked with no issues in my build too! I would suggest this RAM kit if you're looking for Ryzen compatible memory.",
					"System: Asrock x570 taichi, ryzen 5900x, RTX3080\nPros: Runs smoothly and stable at 3200mhz as advertised (yes, I did have to set the memory speed in the bios)\n\nCons: hot spots on leds - a wee bit annoying\n\nI bought these sticks after matching the brand/model & timing of the original pair which have a smooth grade to their appearance & an even color distribution across the dimm. Clearly, there's something either I missed, or an issue in manufacturing.",
					"Bought these for a recent R2700 build I had gotten, in addition to the already 16 I already had. Also it looks great with all four slots taken up. Noticed some improvement with these added. Though, to be fair, I didn't need them, its just a safety net I'd like to have as I'm constantly multitasking with background programs. Some more intensive than they need to be, but what can you do about poorly optimized games / software?\nMy original build came with 2 black sticks and now I have 2 white sticks to go along with them\nAlso I seem to have bought them at a great time for the price they were at.",
					"I originally bought one pack (2 x 8GB) and put them in slots 2 & 4 as per my motherboard instructions. Everything was fine. RGB was fully lit and synched with my other ARGB lights. I decided to upgrade to 32GB and added two more sticks (same 2 x 8GB). Now the RGB on sticks 2 & 4 only light up half way. I've read on other reviews and various forums that there are RGB issues where they don't sync, don't change colors or stop working all together. I've only had them for 2 weeks and everything works so far except the LED's on the bottom half of those 2 cards. Not sure what to do about it.",
					"I got these bc my mobo didnt support 4 sticks of ram. Not only can I game will using premiere pro. Not to mention the rgb is 'rich' in color very deep colors but also not blinding. Also one of the different ratings category is ease of install, ram is the easiest thing to install on a mobo so if you have trouble, then something is wrong, but it was super easy for me",
					"I",
					"Love the look, performs well, and great RGB. Word of warning, though, it's pretty big. The corner of the RAM actually touches my 3070. It's plastic on metal backplate, though, so no big deal in my case.",
					"I ordered this product for my brother as a birthday present and it came well packaged without any damage. The delivery was fast and easy. Very simple to install and works how it should. Would definitely recommend to anyone who either wants to make their pc look better or anyone who wants extra RAM",
					"These have worked flawlessly, can't recommend them enough. RGB top job",
					"Works well",
					"It’s a good product, faster than most of the rams found the same price as this."
				]
			}
		},
		{
			"id": "sa00RfZ",
			"title": "TEAMGROUP T-Force Vulcan Z DDR4 16GB Kit (2x8GB) 3000MHz (PC4-24000) CL16 Desktop Memory Module Ram (Red) - TLZRD416G3000HC16FDC01",
			"price": "$49.99",
			"image": "https://m.media-amazon.com/images/I/71OXBkymH1L._AC_SY450_PIbundle-2,TopRight,0,0_SH20_.jpg",
			"description": "About this item\nSimple design to perfectly protect the cooling module\nHigh thermal conductive adhesive\nSupports Intel & AMD motherboards\nSelected high-quality IC, Supports XMP2.0\nLifetime warranty",
			"reviews": {
				"customerProfileNames": [
					"CaitMinda",
					"JB",
					"LexM.",
					"RileyS.",
					"MichaelOtero",
					"John"
				],
				"customerProfilePictures": [
					"https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif"
				],
				"customerRatings": [
					"5.0 out of 5 stars",
					"5.0 out of 5 stars",
					"1.0 out of 5 stars",
					"2.0 out of 5 stars",
					"5.0 out of 5 stars",
					"5.0 out of 5 stars"
				],
				"customerReviewTitles": [
					"It's red.",
					"Nice ram for a work PC w/ some 1080p gaming",
					"DON'T BUY THIS RAM - bad modules in two separate sets.",
					"Don’t buy for the speed if you’re on a Ryzen 2700x",
					"Works great with my AMD R7 2700x and GTX 1660 Super",
					"Good especially for the price"
				],
				"customerReviewBodies": [
					"M",
					"Nice price for 16gb ram (in 3000mhz). Got it for $52 which I thought was a great price.\n\nUsed it in a PC build, and while I am not expert AT ALL, research showed that this speed is usually very compatible w/ modern motherboards. Install was a breeze on a MSI b450m pro vdh max. Had to go into BIOS to configure the frequency though (was default set at 2400mhz). If you go into advance setting and search for your ram, just set find the profiles and I think it was #2 (2933mhz w/ timing at 16-18-18-xx can't remember final number) and set voltage to 1.35v. THEN, you also have to set your DDR ram profile to 3000mhz DDR4. Reboot and run a freebie tool (think it was CPU-Z) or use the task manager. You will now see it operating at the advertised speed.\n\nOh, if using CPU Z remember that speed in DDR is doubled, so CPU Z may say your ram is operating at 1500mhz for example, but you have to multiply that by 2 to get the true figure. If you're building your own PC you probably know all of this, but for rookies like me I hope this helps.",
					"S",
					"Only runs at 2400Mhz with Ryzen 7 2700X",
					"RAM works better than advertised on Gigabyte Aorus B450 M motherboard with AMD R7 2700x CPU and GIGABYTE GeForce GTX 1660 Super GPU. RAM is running at 3200Mhz as advertised and I even managed to lower and tighten timings down to CL 14-14-14-30 @1.35 volts which is much better than the advertised CL 16-18-18-38 @1.35 volts. System runs beautifully with this setup. I'm gaming at 1440p res with a mix of high and ultra settings sometimes a mix of medium as well and getting 80+ FPS in all modern titles. Also able to get a smooth 720p60 stream while gaming using CPU encoder at fast preset settings. Could not be any happier with this memory kit!",
					"Nice!!! No issues when installing and these ram are low profile so it will have less clearance issues for itx builds. For those who keep on leaving bad reviews because of ram speed, all ram are defaulted at the base speed, the marketed speed and timing are only enabled through your motherboard bios and that’s only if your motherboard is compatible with the ram speed, check your motherboard manual it tells you if it is and if not go to the manufacturer website.\n\nPros-\n-Low profile\n-32G, smoother experience with background apps while gaming\n-less stuttering when on multiple browsers\n\nCons-\n-No real difference between 3200hz and 3600hz in real world use, only get 3600 if you want those benchmark scores or using some kind of software that requires necessary speeds, if not 3200 is fine for gaming/ save the extra money",
					"I purchased this RAM because it was one of the only affordable 32gb 3200mhz kits I could find that's compatible with the new MSI B550 Tomahawk motherboard & is also low-profile enough to fit under a Dark Rock 4 Pro cpu cooler. The heatspreader on this kit is actually modest enough that it should work with just about any CPU cooler & RAM slot configuration.\n\nTo get this RAM running at the advertised speed of 3200mhz, you will need to enable the XMP profile in the BIOS settings. In my case with 3rd gen Ryzen the XMP works perfectly and so far my RAM has been stable and shown zero errors running Karhu's RAM test.\n\nI don't plan to do any manual overclocking with this RAM, and I don't think this is the best RAM to buy for that purpose, given its small heatspreader design. However if you're looking for RAM that is affordable, low profile and will run at 3200mhz with minimal tweaking, then this is a good choice.",
					"i purchased this 32GB kit of DDR4 RAM for my new AMD RYZEN 5 3600 GAMING PC build. I decided to get 32GB or RAM instead of my initially 16GB due to the fact that this RAM was going for an insanely ridiculous bargain price of £93.16. whereas the 16GB Iwas going to buy was £10 less (£83.00 ).\nI thought I may run into compatibility problems or stability problems with this BRAND NAMED Memory but so far there is nothing to worry about on this score. Another thing that crossed my mind was reliability. This too seemed unfounded. as it seems to be running smoothly along.\nIn My Opinion I think that the TEAMGROUP T-Force Vulcan Z DDR4 32GB Kit (2 x 16GB) 3200MHz was well worth the money I spent on it, as it seems to be very stable with no issues to report of! Strike while the are HOT",
					"1",
					"B",
					"Love the looks, easy setup of XMP profile on AMD motherboard, dimms are not very tall so could fit them with a slim radiator installed on the top (check dimensions though). Overall great product, recommend!"
				]
			}
		},
		{
			"id": "imU8Ng6",
			"title": "XPG DDR4 D50 RGB 16GB (2x8GB) 3200MHz PC4-25600 U-DIMM 288-Pins Desktop Memory CL16 Kit White (AX4U32008G16A-DW50)",
			"price": "$64.99",
			"image": "https://m.media-amazon.com/images/I/61s6Wg7BcqL._AC_SX466_PIbundle-2,TopRight,0,0_SH20_.jpg",
			"description": "SPECIFICATION Speed : 3200MHz CL 16-20-20 3600MHz CL 18-20-20 4133MHz CL 19-23-23 4800MHz CL 19-26-26 (Extreme Version) 5000MHz CL 19-28-28 (Extreme Version) Capacities: 3200MHz to 4133MHz Color: RGB controllable from XPG RGB Sync App (Download required). Compatible with RGB software from major motherboard manufacturers. Voltage: 1.2V – 1.5V Warranty : Limited Lifetime. XMP Setting: To run at advertised speed, please adjust your XMP profile setting in BIOS. A pre-set profile should be available when you enter your XMP menu in BIOS.",
			"reviews": {
				"customerProfileNames": [
					"JustinNelson",
					"RobertJ.Wilson",
					"Customer",
					"MarcAnt",
					"TaniaLudena",
					"CorneliusMc.",
					"MatthewL",
					"Bingo"
				],
				"customerProfilePictures": [
					"https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif"
				],
				"customerRatings": [
					"5.0 out of 5 stars",
					"5.0 out of 5 stars",
					"5.0 out of 5 stars",
					"5.0 out of 5 stars",
					"5.0 out of 5 stars",
					"5.0 out of 5 stars",
					"5.0 out of 5 stars",
					"5.0 out of 5 stars"
				],
				"customerReviewTitles": [
					"looks and performs great; however, read this!",
					"White Night PC Build with Fast White RGB Memory",
					"Another successful XPG product...",
					"Great RAM",
					"Looks and Works Good",
					"Great ram",
					"Great RAM",
					"Great Value"
				],
				"customerReviewBodies": [
					"originally, i bought 2 packs of the 2x8gb kits, thinking that i could combine them to run 32gb. this is not the case. there were stability issues because they were not all made to work with each other. they did run fine if i used one 2x8 kit for a total of 16gb at one time, but they cannot work all combined if you buy two packs of 2x8gb.\n\nthe lighting looks amazing and it is easily controllable by my ASUS motherboard software.",
					"The price on these is great for fast memory that is White as well as RGB for our White Night PC Build. The memory snapped in place without any issues and the memory is able to run at 3200, so we are good to go.",
					"In a product review I wrote for their SSD, I came across this product and felt that since I was already going XPG, I might as well go all out and get the matching RAM. This product gives a sense of purity and beauty to the inside of my MAME Arcade Computer. XPG continues to impress me and I may find myself going XPG across the board. If you are looking for a great value and a pretty upstanding company, I highly recommend XPG for your gaming PC adventures.",
					"Excellent memory. Worked as expected, no issues. I have bought XPG products in the past and have had no problems. Great price and the RGB looks very clean as well. OC the memory in Bios and has been running as expected.",
					"I bought only two sticks and it works as intended and it looks really nice in my PC. The lights work nice and do not look cheap. Looks very well made and lights look beautiful.",
					"Worked out the box. Got it on sale for a good price.",
					"These are very good for the price. They look great in my build and the RGB is very customizable. The process to add these to your motherboard is just like any other DDR4 RAM sticks. They aren't too extreme with the design which is a good thing for me and they aren't bulky. I would definitely recommend these and would buy them again.",
					"Installed these on a Gigabyte B560M DS3H AC MB and they work perfect.",
					"P",
					"Dislike false advertising. If it's CL18 , it should not be advertised as CL16. Bought this mostly based on the CL16. Hopefully it will at least hit 3600. Can't be sure now with the false advertising",
					" Brand new build so not sure if they would be better or worse than other options. They look great in the case and I am happy with the performance 4 weeks after install.",
					"Great ram stick for the money performed like they should .\nGreat visual with the LED on an Asus board with aurasync.",
					"Atendeu as minhas expectativas, muito bom, utilizo diariamente e recomendo a compra, entrega no prazo, em perfeito estado, principalmente com a mesma frequência que é o divisor de águas para ativar o XMP ou D.O.C.P da placa mãe, muito satisfeito com a compra.",
					""
				]
			}
		},
		{
			"id": "teDeMex",
			"title": "Crucial RAM 64GB Kit (2x32GB) DDR5 4800MHz CL40 Desktop Memory CT2K32G48C40U5",
			"price": "$289.99",
			"image": "https://m.media-amazon.com/images/I/61mb0D6P8bL._AC_SX450_PIbundle-2,TopRight,0,0_SH20_.jpg",
			"description": "CT2K32G48C40U5 is the Crucial 64GB kit consisting of (2) 32GB desktop modules that operate at the speed of 4800MHz and has a CAS Latency of 40. It is an UDIMM and conforms to the industry standard DDR5 UDIMM layout of 288 pins. It is compatible with systems that can take DDR5-4800 UDIMM memory.",
			"reviews": {
				"customerProfileNames": [
					"DigitalAddict",
					"JamesC.Reneau",
					"MikeG.",
					"Becky",
					"Alexis",
					"ResulBaggio",
					"eli",
					"Luisgroldanpere"
				],
				"customerProfilePictures": [
					"https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif"
				],
				"customerRatings": [
					"5.0 out of 5 stars",
					"5.0 out of 5 stars",
					"5.0 out of 5 stars",
					"3.0 out of 5 stars",
					"1.0 out of 5 stars",
					"5.0 out of 5 stars",
					"2.0 out of 5 stars",
					"1.0 out of 5 stars"
				],
				"customerReviewTitles": [
					"Most compatible ram I have tried on Gigabyte Aorus z690 Master motheboard",
					"Nice addition to new PC build",
					"Just works",
					"Doesn't work with Dell Precision 3660",
					"Worked but overpriced",
					"Great option for oem prebuilt pcs.",
					"Hold your horses",
					"Overpriced"
				],
				"customerReviewBodies": [
					"It's ram, but with everything I have recently gone through with ram incompatibility, it's nice to finally install some good quality ram I can depend on. This ram just works great with no additional messing around.... I tried 4 different sets of g.skill ram on the Gigabyte Aorus z690 Master motherboard and had nothing but problems. This ram worked first try and passed all memory tests I through at it.... Oh... and I got 64GB for the same price as 32GB of the non-working g.skill ram! Can't wait to by another set and take the system up to the max 128gb!",
					"I love building PCs and I chose this RAM since I needed DDR5 and I have had lots of good luck with Crucial in the past. I don't use the PC for gaming but gave it 5 Stars in that category because I imagine it would be outstanding there as well. It is a bit spendy, but so is all other DDR5 RAM, if you can even find it.\n\nI would definitely recommend this product.",
					"Installed in system with Intel Core i9-12900K to increase memory from 32GB to 64Gb. Works fine alongside original Dell memory, no problems.",
					"You can search Precision 3660 memory upgrade and you will find a post from Dell forum that this model doesn't work on Precision 3660. I think it's DELL's issue as this won't work even as the sole stick on that machine and the cpu shall take it based on specs.",
					"Was overpriced",
					"If you have a prebuilt pc from big brands, you know how most rams don't work at the proper speed, especially if you cant access xmp on the bios. I have a Lenovo 5i tower and lenovo doesn't allow xmp access on their bios, so whatever ram you install, you have to make sure its compatible. Most rams are not compatible as dual channel with their bios. Crucial ram cl22 is the closest match i found for lenovo's oem samsung xl22 ram. Now I have 4 dual channel 8 gb rams that work at exact speeds.",
					"This is server RAM UDIMM may not preform to desktop standards",
					"The memory is good. The asking price is ridiculous and you can get 64gb of it for 600$ if you are willing to wait for back orders.",
					"Price is a bit high but that's mainly because of the shortages. The service made the price seem worth it. They called and checked if a alternative would be better for me. Gave me a serial ID so I could validate the product I was getting. Very very friendly and super customer service.",
					"Great ram i got 64gb for my new dell XPS 8950 works great i'm even thinking about buying another 64gb\nso i have 128gb of ram",
					"Speedily delivered and works perfectly!",
					"I",
					"It has been almost impossible to find DDR5 ram and if you do the price is outrageous. But the Crucial Ram, although basic and only running at 4800 MHz is a steal and does a great job, produces excellent results. I had a few issues getting my new Z690 system to boot and it did turn out to be the memory but there was nothing wrong with the Crucial ram, it just had to be reseated a few times in the MoBo, which was not the fault of the ram. I am very happy I found these UDIMMs, otherwise I don't think my new system would be running today. They turned out be a real steal."
				]
			}
		},
		{
			"id": "M8QkIiZ",
			"title": "Corsair Vengeance RGB Pro 32GB (2x16GB) DDR4 3600 (PC4-28800) C18 AMD Optimized Memory – Black",
			"price": "$164.99",
			"image": "https://m.media-amazon.com/images/I/61GpY38PAWL._AC_SY450_.jpg",
			"description": "CORSAIR VENGEANCE RGB PRO Series DDR4 memory lights up your PC with mesmerizing dynamic multi-zone RGB lighting, while delivering the best in DDR4 performance and stability. Every module boasts ten individually controlled RGB LEDs, while wire-free design makes installation simple. Take control with CORSAIR iCUE software and completely customize every module’s lighting to match your system, or easily synchronize lighting across all your CORSAIR products with Light LINK. A custom designed PCB provides the highest signal quality for the best level of performance and stability on the latest AMD and Intel DDR4 motherboards, while specially screened ICs unlock superior overclocking.",
			"reviews": {
				"customerProfileNames": [
					"Fred",
					"GabeR",
					"Customer",
					"Customer",
					"alphamachina",
					"ChadP.",
					"TVMan",
					"JimLiang",
					"K"
				],
				"customerProfilePictures": [
					"https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif",
					"https://images-na.ssl-images-amazon.com/images/S/amazon-avatars-global/e48c7b07-4b92-4bf2-b5b6-ec7b6d5ae657._CR0,0,300,300_SX48_.jpg",
					"https://images-eu.ssl-images-amazon.com/images/S/amazon-avatars-global/default._CR0,0,1024,1024_SX48_.png",
					"https://images-eu.ssl-images-amazon.com/images/S/amazon-avatars-global/679b0421-5da2-485d-b5d6-e7ba703c3660._CR0,0,496,496_SX48_.jpg",
					"https://images-eu.ssl-images-amazon.com/images/S/amazon-avatars-global/a655eaef-6f84-4d50-83bf-948f3c664446._CR0,0,499,499_SX48_.jpg",
					"https://images-eu.ssl-images-amazon.com/images/S/amazon-avatars-global/a1519a2e-704c-4945-9508-8247c21404be._CR0,0,500,500_SX48_.jpg"
				],
				"customerRatings": [
					"5.0 out of 5 stars",
					"5.0 out of 5 stars",
					"5.0 out of 5 stars",
					"5.0 out of 5 stars",
					"5.0 out of 5 stars",
					"5.0 out of 5 stars",
					"5.0 out of 5 stars",
					"5.0 out of 5 stars"
				],
				"customerReviewTitles": [
					"Microsoft 365 Family | Premium Office Apps | Up to 6 users | 3 Months Free, Plus 12-Month Subscription\nMicrosoft 365 Family | Premium Office Apps | Up…",
					"Microsoft 365 Personal | Premium Office Apps | 1 User, Up to 5 Devices | 3 Months Free, Plus 12-Month Subscription\nMicrosoft 365 Personal | Premium Office…",
					"Save $30 at checkout | Adobe Acrobat Pro DC subscription with auto-renewal\nSave $30 at checkout | Adobe Acrobat Pro DC…",
					"Save 68% on McAfee Total Protection 3 Device\nSave 68% on McAfee Total Protection 3 Devi…",
					"If your looking for 3600MHz+, Look No Further!",
					"Great Overclocking ram",
					"Overall a good stick of ram",
					"Decent RAM, though only Micron E-die",
					"Great RGB memory",
					"So far so good",
					"Intel 8700k with Z370 is still kicking",
					"Fast, Overclockable, and (Relatively) Cheap"
				],
				"customerReviewBodies": [
					"This RAM simply works, as advertised. I returned my Neo Z 3600 which are suppose to designed for X570 Motherboards which have either Samsung or (terrible) SK Hynix Die, I couldn’t clock above 3200mhz. I purchased this instead and out of the box, used the preset XMP Profile and achieved 3800MHz without skipping a beat. I have read that others have achieved past 4100MHZ. All at the same price at the Neo Z 3600. This is an absolute no brainer. Don’t waste your time and just purchase these! Plus the RGB on these are awesome!!!",
					"Good overclocking.. I earlier tried a different kit of 3200c16 dominator platinum RGB ver4.32 which where confirmed via typhoon as being b-die. The only thing those sticks dominated was the toilet. Anything past the default xmp was a no go.\n\nI decided to give these Vengeance pro rgb ver3.32 a shot. These did not disappoint in the least.\nConfirmed via typhoon to be the micron E die.\n\nSo far @ 3800 16/16/19/16 1.37v with a 1:1 fclock no issues using the Ryzen ram Calc!. Still have a lot to keep tuning. I will revisit this review once I have finalized the Ram OC.\n\nSpecs as follows\nR9 3950x. @ 44.5/45/43.5/43.5 1.27v load\nCrosshair VIII Formula\n64gb Vengeance pro rgb (4x16gb)\n2080ti\nFull custom water loop.",
					"I bought this without doing research on what makes ram good, other than people seem to like corsair. The stick I bought was the 2x32 gb ram ending in 18 for the tcl timing. This stick is definitely a micron e-die, not samsung. Although I've read that samsung has made some of their sticks, so it's a bit of a lottery.\n\nI would recommend buying a stick with faster timing in the first place, but too late for me now. [However thats only if you superficially want faster timing, or actually need it. You probably dont]\n\nAfter a month of using it and trying out overclocking for the first time, I got it to oc at 3800 mhz at 1.38 volts with the following timings: 16 tcl 19 trcdrd 16 trcdwr 16 trp 36 tras",
					"Though I didn't luck out and get Samsung B-die, with the help of Thaiphoon Burner and DRAM Calculator, I was able to get my timings tightened to 16-18-18-18-38 @ 3600MHz and my 3900X to 4.3GHz @ 1.3 vcore. The Micron E-die surprised me.\n\nNot to mention, the heatsinks look fantastic.",
					"I installed 4 16GB sticks on my Ryzen 9 system, booted into BIOS, enabled XMP, booted into Windows and they've been operating without issue at 3600 MHz ever since. The RGB color is great, although they're the slowest thing in my system to respond to color changes. But they always end up the correct color after a few seconds. Color is consistent across all 4 sticks (bought as 2 separate 32GB kits). Well, I guess one stick is very slightly darker at the orange color I keep them at.\n\nThey look great in my system, and perform excellently without complaint. I can only say good things about these if you're thinking about buying these.",
					"What I was looking for and couldn't find, someone might find useful, the kit I just received has Micron E-die, which from doing some searching is pretty good memory if you want to OC it. Ryzen calculator states with its safe settings you could bring it down to 16C without issue and for fast settings you could try to bring it down to 14C but voltages look a bit high on that one. At this point all is good but we shall see, with my current ASROCK X570 Extreme 4 it absolutely didn't like Gskill Trident Z Neo sets. Tried 2 sets and had all kinds of booting issues at the 3600mhz speed with those ones.",
					"Installed this in my old Z370 board running an i7 8700k. Immediately detected the 3600 MHz XMP speed, but Windows was buggy and I was getting BSODs during stress test.\n\nAfter manually setting it to 3200 MHz in BIOS, things seem stable. Not a fault of the RAM, just a limitation of my old motherboard/CPU combination. The ram itself looks great and is working fine at 3200.",
					"I picked up a 2x16GB kit of DDR4-3600 to replace an old G.Skill 4x8GB kit of DDR4-3000 after upgrading to a Ryzen 7 5800x. After a bit of forum-hopping, I found out that Corsair tends to bin their RAM for their high-speed kits, and once they have enough to fill out their high-end product stack, they use the remaining stock to fill out their lower-speed SKUs. It seemed like the best choice, since most 3800MT/s kits are in the $250+ range.\n\nIn a nutshell, it was super easy to get a stable overclock to bring this kit up to 3800MT/s to match the FCLK just by manually setting the speed in the UEFI/BIOS. It just didn't like me playing with the timings. CL16 resulted in a hanging or freezing boot into Windows, so I left it at CL18.\n\nI'll definitely consider picking up another one of these kits if I find myself using Blender more often, as it's quite easy to use a cartoonish amount of memory when modeling and animating. It's the best bang-for-the-buck RGB kit for Ryzen 5000 series CPUs on the market right now.",
					"This ram is amazing and the colours are just insane, but I’ve seen other people say they bought the ram and installed it but it only ran at 2666mhz.....WELL what if I told you that to fix that issue all you have to do is go into your motherboard bios and activate XMP (extreme memory profile) and then the ram will run at the advertised speed of 3600mhz :)",
					"S",
					"First of, for anyone who is complaining thinking they are not getting the MHZ they paid for! Do us a favour and go into your BIOS settings and turn on your XMP(intel) or DOCP(AMD) Settings. Then you will get the 3600mhz you bought!\n\nNow for my review, The product is great! I am extremely pleased with the speed and look it gives. I bought the 32GB 2 sticks, so I may place an order for another 2 in the future if I need the extra GB. Delivery was next day with prime.",
					"RAM is complex topic, but basically if you have a Ryzen processor - you want dual rank RAM (this is NOT the same as dual channel - which you ALWAYS want). The problem with Corsair memory is that the memory chips could be from any manufacturer in any configuration as Corsair just buy in the chips from the 3 main manufacturers and stick some lights and a heat sink on them - the only thing you can guarantee is that it will meet the minimum specs Corsair specify (and likely little more). You can tell once you receive the package however - if you look at the version number it will tell you the manufacturer and ranks - e.g. version 3.44 (the one I received, and returned) is made by Micron (Crucial/Ballistix) and has 16 GB per rank. So for a 2 x 16GB kit, ver 3.44 contains 2 SINGLE rank modules which is not what one wants on a Ryzen processor (x570 chipset with Ryzen, optimal is 2 x dual rank modules due to daisy chain topography of the motherboard). There's nothing inherently wrong with Corsair memory, it's just you don't know what you get, whereas if you buy from the manufacturer (e.g. Crucial/Ballistix RAM) you at least know who made your RAM, though still not the rank configuration (same issue with Ballistix RAM - the single/dual rank configuration can only be determined after receiving the modules and looking at the product version printed on the modules). Note that in the version number X.YZ - it's the Y value that determines the size of each rank - 3 = 8GB, 4 = 16GB. So a 32GB kit with 2x16GB modules with a version of X.3Z would be dual channel (2 x 8GB ranks per 16GB module) whereas X.4Y woul be single channel (1 x 16GB ranks per 16GB module).",
					"Before we get started, a few things:\n\n1. 3600MHz is the advertised Overclock speed, so it will not work at this frequency as soon as you plug it in.\n2. As with all computer parts, there is a “silicon lottery”, and your kit might not be the very best of the bunch.\n\nI've bought two of these kits (for a total of 64GB of RAM) and after spending some time setting them up, they work at the advertised speed, BUT you need to enable XMP in your BIOS/UEFI and gradually up the frequency and/or voltage.\n\nOne thing to mention is that on my mobo, having them in XMP2 was unstable, but XMP works well. I managed to get mine up to 3400MHz with XMP. If you’re willing to go the extra mile and do manual OC, you should get 3600+MHz.\n\nNow, the lighting, whilst it's really bright and highly customisable, I have seen better. This is mainly due to the diffusion layer coupled with too few LEDs. This combination means that you will be able to make out the individual LEDs, but if you're not that bothered with this aspect, then these are a solid choice for a DDR4 kit.\n\nThe last thing to mention is that lighting effects are controlled through iCUE, and that’s a take-it-or-leave-it thing. You cannot manage the lighting through any other software."
				]
			}
		},
		{
			"id": "Oyw9Idv",
			"title": "Corsair Vengeance RGB Pro 16GB (2x8GB) DDR4 3600 (PC4-28800) C18 Desktop Memory – Black",
			"price": "Check fit by model, Find your brand",
			"image": "https://m.media-amazon.com/images/I/61GpY38PAWL._AC_SY450_.jpg",
			"description": "",
			"reviews": {
				"customerProfileNames": [
					"InfusedWaffle",
					"EmeryMiller",
					"ChrisWagner",
					"iEdwin00",
					"DuncanMacLeod",
					"Customer",
					"Dah",
					"Gabriel"
				],
				"customerProfilePictures": [
					"https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif",
					"https://images-na.ssl-images-amazon.com/images/S/amazon-avatars-global/c125b171-f3cb-4d12-a180-ce3b1702d944._CR0,0,495,495_SX48_.jpg",
					"https://images-na.ssl-images-amazon.com/images/S/amazon-avatars-global/6b4590bc-dfb6-41fb-9519-6d1aaeabe94c._CR0,0,375,375_SX48_.jpg",
					"https://images-eu.ssl-images-amazon.com/images/S/amazon-avatars-global/490e52d3-7a15-4049-9b18-191702414b41._CR62,0,375,375_SX48_.jpg",
					"https://images-eu.ssl-images-amazon.com/images/S/amazon-avatars-global/011861e1-a29f-4bad-9b06-2615a66c7506._CR62,0,375,375_SX48_.jpg",
					"https://images-eu.ssl-images-amazon.com/images/S/amazon-avatars-global/6ca6ac60-5069-41ab-960a-61ac2267317d._CR0,0,947,947_SX48_.jpg"
				],
				"customerRatings": [
					"5.0 out of 5 stars",
					"3.0 out of 5 stars",
					"5.0 out of 5 stars",
					"5.0 out of 5 stars",
					"5.0 out of 5 stars",
					"5.0 out of 5 stars",
					"5.0 out of 5 stars",
					"5.0 out of 5 stars"
				],
				"customerReviewTitles": [
					"Great looking RAM that works flawlessly at it's rated speed.",
					"Say no if you have an Asus board",
					"It's colorful ram that works.",
					"You can’t go wrong with Corsair",
					"Great! Works fine. Very fast",
					"Good Kit, not necessary for Gaming",
					"Perfect ram",
					"It is fast and beautiful"
				],
				"customerReviewBodies": [
					"I was pretty skeptical on buying this RAM rated at 3600 MHz since a good portion of the reviews mentioned that the RAM was unable to run at it's rated speed and it would have to be toned down to even boot out of the bios and into windows. But, I'm happy to say that at least for myself, I didn't receive any bad sticks and the RAM runs flawlessly with the 3600 MHz XMP profile for it on my Z370 board and even looks amazing too!\n\nEDIT: Just got two more sticks and switched out motherboards due to upgrading from an i7-8700 to a Ryzen 7 5800X. My motherboard of choice was the GIGABYTE B550 AORUS Elite and I was still able to get all sticks to run at 3600 MHz no problem. So far awesome RAM! Also used Corsair's software to change the lighting and had no issues with it.",
					"So when I bought these, they advertised a plug-in for aurasync. Then when they arrived, they pulled their aura sync support. Corsair products always do this crap. Super done with Corsair after these. Now I’m stuck with 4 sticks of ram that won’t sync up to everything else correctly. PITA.\n\nUpdate: They have the plugin back up but it does not work. I’ve tried every suggested method. My video card is Asus so the iCue software can control the motherboard and not the video card. The aura sync can control the video card/mobo but not the RAM. So basically they’re forcing me to run iCue just to change the ram color AKA impossible to get it to all sync correctly. If you’re using Asus, and you want it to all sync, go with another brand.\n\nEdit Oct 2020: now the plug-in works, THROUGH iCue. So basically. Run RGB to run your RGB. Super dumb. The industry needs an RGB standard or basically buy only 1 brand for everything ridiculous.",
					"I have been using this Corsair RAM for a while now and recently just got two more sticks to drop in to bump up to 32Gb. All there is to say is that they run well and with Corsairs iCue color engine they look great. The RGB is responsive and I have had zero performance issues with my RAM since I have had it.\n\nIf you want solid pretty RAM there is nowhere else to look.\n\n*Also most of the negative reviews here are people complaining about how it is not compatible with their motherboard or they are having problems because they just simply don't know how to install RAM. Don't even read them, Corsair shouldn't be punished for peoples incompetance.",
					" You might think that all RAM is the same and interchangeable but if you do, you’re not only wrong, you’re stupid. Corsair is always reliable and the RGB function is a plus. Their iCUE software is easy to use and plays nice with most other RGB software. 10/10",
					"Great product. Has more lights than most other rgb ram. Only downfall is going through ice software when its unneccessary to do so.",
					"I got this kit because I knew Ryzen 3 needed a kit with high speed, but decided to not go with the recommended 3200 kit. I see no difference between the two and would recommend 3200 if you are looking for best performance coupled with Ryzen, but I am not too disappointed looking back at it now. The kit looks great, even if iCue is clunky and not always working properly. I also am a fan of Corsair products.",
					" This is the lowest priced Corsair rgb vengeance I could find and still perfect for me I brought two already and I’m going to buy two more to have four I definitely recommend anyone buying these I haven’t synced them yet but you could barely two they already match with my pc",
					"Those rgb ram looks so great and not just that they are really fast, reliable and the software it comes with works nice.",
					"I’ve been updating my PC with an Intel 9900K CPU on an Asus Prime Z390-A motherboard. I wanted some fast RAM to compliment the setup. I settled on two of these Corsair Vengeance RGB modules giving me 16GB of RAM. I went for the 3600 MHz ones as I didn’t want to overclock them.\n\nSince popping them into the motherboard, they have worked faultlessly and at the rated speed. They are definitely plug and forget. The only setting up I needed to do was to set the colours I wanted. The LEDs are nice and bright but can be dimmed if needed using the Corsair iCUE software.\n\nThe software has to be downloaded but it works well. Incidentally, the software will control the motherboard lights as well. A lot of people say that this can’t be done as Asus uses its own Aura software. They’re wrong. You do have to download and install the Aura software but not have to use it. iCUE will then be able to control it all.\n\nThese memory modules are a little more expensive than some other modules but from experience they are well worth the extra. They have good built-in heatsinks and rarely get passed be a little warm to the touch. As long as there a little breeze flowing around them and you shouldn’t have any problems, even if you want to overclock them.\n\nOverall, they are a little pricey but that shouldn’t deter you. They are worth it!",
					"The Corsair website states that this memory is compatible with AMD X570 motherboards and that's the reason I bought it. However it caused BIOS data loss errors on reboot of computer. Gigabyte then informed me that they could do nothing as it was not on the Qualified Vendors List for the motherboard. The Qualified Vendors List turns out to be a big caveat as to what memory will work in a motherboard and results in a myriad of permutations that make it virtually impossible to find memory vs motherboard combinations that work across all 4 memory slots. I sent the memory back for a refund, but as yet can't find any Corsair memory that works in a X570 motherboard by Gigabyte... perhaps I should send that back too..",
					"I absolutely love this ram.\n\nI built my first gaming PC earlier in the year and got 16gb of this. However the OCD side of me didn't like 2 ram sticks in a 4 dim bay, so I had to get another 2.\n\nThe 3600mhz is perfect for 3rd Gen Ryzen that favours faster ram. The timings aren't superb but they can easily be tightened very safely to CL16. You can go to 14 too but that's about as good as its getting (do this at your own risk)\n\nThe RGB looks good and is quite smooth on flowing effects. Icue software is meh. Not bad but not great. It's been a little bit buggy but works for the most part. There's been an update lately and seems a lot more secure.\n\nOverall I'm extremely happy with this Ram. It's low profile, fast as hell, very easy to install and has good RGB. A winner in my books.",
					"i returned these as they didn't quite fit the aesthetics of my system. however, these are 100% A++++ products.\n\ni bought two sets of matched pairs as it was cheaper than buying a set of 4 matched pairs and even though they were separate pairs, they worked perfect.\n\nalso, the RGB works perfect through corsair icue v4. the performance, once you enable XMP works at the advertised speeds and going from 3200mhz, you get about 6 fps across games.\n\nwell worth buying!!",
					"This is a good bit taller than my non-RGB Vengeance RAM and I had to remove the outer fan from my Dark Rock Pro cooler (similar in scale to Noctua's NH-D15) just for it to fit into two of my slots (one slot it would not fit in at all). So be mindful of this if you also have a sizable air cooler on your CPU! Pics attached.\n\nOnto the RAM... I bought the 3600mhz sticks but am currently running at 3200mhz as that is the frequency of my other pair. Performance wise it's on par with the sticks it replaced, nothing more I can say on it really; I want a stable system and find the out of the box speeds plentiful so have no interest in overclocking.\n\nThis is paired with a Ryzen 5800X and an Asus ROG Strix X570-E motherboard, no issues whatsoever. I have a Corsair case with a number of RGB fans so am already using their iCUE software - it works well, it also lets me control my motherboard RGB, has lots of options and effects for in depth customisation, so I've no qualms with it at all. If you're particularly fussed about RGB then I'm sure you'll have an opinion on that already.\n\nAll in all I'm happy with it. Probably won't buy another pair because I'd have to change my cooler, but that's more my cooler's fault than the RAM - can heartily recommend this if you've got the room!"
				]
			}
		},
		{
			"id": "5cPI1Po",
			"title": "TEAMGROUP Elite DDR3 16GB Kit (2x8GB) 1600MHz (PC3-12800) CL11 Unbuffered Non-ECC 1.5V UDIMM 240 Pin PC Computer Desktop Memory Module Ram Upgrade - TED316G1600C11DC01",
			"price": "$37.99",
			"image": "https://m.media-amazon.com/images/I/81F2qnrhIZL._AC_SY450_PIbundle-2,TopRight,0,0_SH20_.jpg",
			"description": "About this item\nAdherence to JEDEC regulation.\nCompliance to RoHS with respect to environmental protection regulation, production and manufacturing.\nStrict test and verification procedures are performed for products.\nLifetime warranty and Free technical support.\nEasy upgrade your Desktop, installation video is attached in product image.",
			"reviews": {
				"customerProfileNames": [
					"Amazon_Customer",
					"911delorean",
					"DrewMerten",
					"FrankMartin",
					"GregAldrich",
					"GeorgeNY",
					"MarionE.Overbey",
					"PrompterGuy"
				],
				"customerProfilePictures": [
					"https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif"
				],
				"customerRatings": [
					"5.0 out of 5 stars",
					"5.0 out of 5 stars",
					"5.0 out of 5 stars",
					"5.0 out of 5 stars",
					"5.0 out of 5 stars",
					"5.0 out of 5 stars",
					"5.0 out of 5 stars",
					"5.0 out of 5 stars"
				],
				"customerReviewTitles": [
					"It works as it should and didn't cost much at all. What else is there to ask?",
					"DDR3",
					"Awesome value",
					"New life into a old APU machine",
					"Asus Z97-A Mobo- DDR3 RAM replacement 2x8GB 1600mhz",
					"Easy fix to double memory",
					"I'll be getting more of these for my backup HP PC!",
					"Excellent Product!"
				],
				"customerReviewBodies": [
					"I have 4 RAM slots on my motherboard with 2x4GB memory chips installed from way back in 2012. I upgraded to the 2x8GB chips from TEAM Group and they work fine in combination with the older chips. I made sure to put the different RAM on separate channels, so they are arranged as 8-4-8-4. Not an issue using the different size and brand, as long as they are the same speed and voltage.\n\nSaved me a lot of money over buying another brand. Now, my only issue is Photoshop has gone mad-crazy with RAM gobbling and ate it all up and is chomping at the bit to eat more. It's like the Cookie Monster on steroids, that Photoshop. Never satisfied. I feel like I could have 128GB and Photoshop would still complain about being starved for RAM. :(",
					"Getting very uncommon for DDR3 stuff to be made new, especially this cheap. I have heard of Team Group Memory, never used it so I figured... why not, especially at this price. Black DDR3 1600MHZ, cannot get much better than that. Have not overclocked it as of yet, no problems, and for a older computer upgrade it is perfect.",
					"Bought this ram for an older dell machine that I was planning to use to play games on it. I had 8 GB of ram in it but it wasnt quite enough. The max ram my machine takes is 16gb so this was perfect. Still running like a champ. Currently playing ffxiv, kingdom come deliverance, metro 2033, and a slew 9f other games. As a side note: you dont need a beast machine to play games decently on.\nMy machine:\nI3 4000 series\n16gb ddr3\nNvidia 1050 ti\n\nMost games I play on high/ultra except Kingdom Come. That runs on medium.\nAnyway, great value for the money.",
					"I decided to max out the memory on a old HP Pavilion p7-1227c running with 12 gigs of PC3-10600 memory with two kits of this for 32 Gigs to max out the mother board, considering the computer is also running Linux.. I thought it would give a moderate upgrade to my video editing machine.\n\nI was wrong.. totally wrong.. these modules have given me NEW life to a old machine that I was going to replace. The computer is faster in using KDENLive and for everything else that use to bog it down.. now. no longer do I see those issues.. Totally outstanding product and if you have a older machine that could run PC3-12800 (DDR3-1600) memory.. then I highly recommend this product!",
					"I purchased the 2x8GB RAM as a replacement for my existing 2x4GB setup. The motherboard would not POST while installing the RAM together, so definitely try installing one at a time if you have any issues, as that did work for me. It's only been a few days, but it is now much easier to run Fusion 360 and have 10 Chrome tabs open at the same time! Packaging was a bubble wrapped envelope. It did not appear damaged, but I would prefer a cardboard box for something like this.",
					"Reasonably priced and I doubled the RAM of my 5 year old Dell desktop. I was able to run some new memory-hog programs, not super fast but it has more to do with age of computer components than these memory banks. It seems you need at least 16Gigs of RAM these days. If I get a couple more years out of my pc, I'd be happy.\n\nJust open up the computer case, unhitch the old ones and pop those. Easy and you're good to go; nothing else to configure..\n\nI picked these based on reviews and didn't go with cheaper ones. Bad ones have problems from the getgo. I've used these one for several months, no issues.",
					"Finding the best performance and value for RAM for your home or office PC can be a bit confusing if you are not versed in electronic specifications.\n\nAlways make sure that you know exactly which type of RAM you should buy and HOW MUCH RAM your computer can handle. This is very important.\n\nAfter spending some time looking at what was available for my HP 8300 PC I bought the TEAMGROUP Elite DDR3 16GB Kit (2 x 8GB) 1600MHz (PC3-12800).\n\nI've used this product now for over 90 days and I am so happy with it that I am going to buy another 2 x 8GB kit from the seller.\n\n5 STARS",
					"Was hesitant to buy because i wasn't familiar with the TeamGroup brand. I added two of their 8 GB of Ram to my Kensington 8 GB and 4 GB on my Acer Predator and they blended perfectly giving me a total of 28 GB. Couldn't be happier because they not only saved me money but they work just as well as the big name overpriced brand!\nNeedless to say I'm now familiar with the TeamGroup brand and they will be my go-to memory provider from now on.",
					"Performed as expected for DD3 RAM once I placed it the the correct slot",
					"Works well, lets me play cruddy games on my pc so can't complain. :)",
					"arrivato puntuale non confrme a descrizione senza dissipatori,montata su scheda madre Gigabyte GA-970A-UD3P/Rev 2.0 Scheda Madre, ,AMD FX-8350 Box Processore 4GHz, Socket AM3 +, 16MB di cache, 125 Watt, montata mi crea problemi all'avvio mi da errore win.10 ripara e al secondo riavvio va regolarmente.precedentemente ho sempre usato questa marca, ho montato solo questa ram.",
					"",
					"Le Ram, secondo scheda tecnica, sono loro, spedizione velocissima, unica pecca, non sono il modello mostrato in foto, con dissipazione passiva...",
					"",
					"Avendo già 8gb di ram dello stesso brand sulla mia motherboard, ho deciso di prendere un secondo banco di ram. Risultato perfetto.",
					""
				]
			}
		},
		{
			"id": "0C4T24U",
			"title": "Silicon Power Value Gaming DDR4 RAM 32GB (16GBx2) 3200MHz (PC4 25600) 288-pin CL16 1.35V UDIMM Desktop Memory Module with Heatsink Grey SP032GXLZU320BDAJ7",
			"price": "$79.97",
			"image": "https://m.media-amazon.com/images/I/71mIIbiZO8S._AC_SY450_PIbundle-2,TopRight,0,0_SH20_.jpg",
			"description": "Render in higher resolutions. Witness realistic pictures and smooth transitions. End choppy animation and catastrophic lag. Handle complex tasks with ease. Browse unlimited tabs and multitask like a pro. Do what you love faster with confidence. Sound like a dream? The new XPOWER Gaming DDR4 makes it all come true. This high quality RAM features thrilling speeds up to 4133 MHz. Designed to support the most dedicated gamers and modders, the XPOWER Gaming DDR4 is the premier choice if you want a powerful and affordable memory upgrade. The XPOWER Gaming DDR4 meets Intel Extreme Memory Profile (Intel XMP) Standards. Now, maximizing your computer speed is easier and more accessible. Push beyond the limits. Once it is installed, it’s finally your time to shine. A cool blue heat sink keeps your memory module safe from overheating meltdowns. The aluminum heat sink displays an intense set of teeth. The only thing sharper is your abilities. In addition to providing a system upgrade, the XPOWER Gaming DDR4 also solves energy consumption issues. Improved heat dissipation keeps the computer running at low temperatures for higher stability and a longer system hardware lifespan.",
			"reviews": {
				"customerProfileNames": [
					"J.Wheeler",
					"Tim",
					"C.B.Manges",
					"BearCub",
					"ResonantSound&CineWorksLLC",
					"K.Faaborg",
					"MagazineGuy",
					"MTSapp"
				],
				"customerProfilePictures": [
					"https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif"
				],
				"customerRatings": [
					"5.0 out of 5 stars",
					"1.0 out of 5 stars",
					"5.0 out of 5 stars",
					"5.0 out of 5 stars",
					"5.0 out of 5 stars",
					"5.0 out of 5 stars",
					"5.0 out of 5 stars",
					"5.0 out of 5 stars"
				],
				"customerReviewTitles": [
					"Fast and effective (yet relatively cheap) upgrade for older PCs",
					"Won't pass memtest at stock timings, Inexpensive, Dual rank, Loose subtimings,",
					"Solved My Problem",
					"They work!",
					"Always Dependable",
					"16 GB DDR3 1600MHz RAM",
					"Worked perfect right out of the box",
					"How memory improves performance on a CPU limited PC"
				],
				"customerReviewBodies": [
					"Purchased to upgrade an older PC (circa 2012) from 4GB to 32GB (purchase quantity: 2). Popped old DIMMs out, shoved these in. Watched the BIOS report the good news on first boot subsequent to upgrade. Haven't done a damn thing since, besides enjoying the vastly improved multitasking experience. It can't be emphasized enough, even though you have likely heard it before: interacting with Windows becomes exponentially more pleasant when running on a machine boasting a sufficiently healthy surplus of RAM, such that the OS is forced to rely upon swapping to disk approximately, uhm, never.\n\nNo problems after 3 months and counting; bang for buck has been outstanding. I will note that the price seems to have increased somewhat during that time; if you're on the fence because of the cost factor, it might be worth checking the price history, and setting an alert for whenever the price comes back down (assuming it is still running above the historical average as you read this.) That said, so long as other brands were also charging comparably inflated amounts, I would be a satisfied customer even if I had needed to pay considerably more.\n\n(To anyone who remembers WAY BACK to the days when RAM was sold by unit(s) expressed in MB: from a long-term perspective, it is not at all difficult to appreciate the fact that this product and its peers objectively offer truly staggering quantities of exceptionally fast, reliable memory, constructed using unfathomably miniscule circuit fabrication technologies, all crammed into a sub-$100 package. Worth!)",
					"Ordered two kits, both run exactly the same XMP profile, subtimings and all. All Dual Rank as well.\n\nWith the many single rank 32gb sticks going around, it's nice to see a budget option that is dual rank.\n\nSubtimings are pretty loose, but that's to be expected at this price range. XMP worked fine and passed several hours on memtest.\n\nHeatsinks are only on one side of the PCB, not shown in photos. Heatsinks are mostly for looks anyway and don't help thermals all that much, just a bit strange that it's not shown in the product image.\n\nUpdate: I've found that at the XMP tREFI values it will not pass row hammer test in Memtest86 consistently, had to lower to 6240 to get it to pass, this does mean that there is a slight performance loss.\n\nUpdate 2: They won't pass even at non XMP settings, lowering the tREFI causes ~30% performance loss in some cases. Tried in multiple motherboards and all the sticks do the same thing. Avoid.",
					"My browsers were crashing constantly. Hourly. Sometimes multiple times an hour. I'm not a deep tech guy, so I solicited online help that ran the gamut from \"buy a new computer\" to baffling descriptions of adjusting registry stuff or altering settings or whatever. Then a guy I trusted said \"More RAM!\" I sent my system info and he recommended these. It took longer to fight my way through the very sturdy packaging then it did to slide the cover off my desktop, yank out the old card, and stick these in--boom! Problem solved. No crashes since then, noticeably faster performance on the same, horribly inconsistent, Xfinity broadband (the drops, the drops). So, yeah. WAY cheaper than a whole new machine. Great value. Highly recommended.",
					"I had some several years old PNY Anarchy sticks of a higher rating that have degraded over time and were causing periodic BSOD errors. I finally got fed up and bought these actually very affordable RAM sticks and replaced the old sticks. Problem solved and the performance so far has been great. Granted its only been about three weeks but compared to the old state of my computer this has been amazing. I can't comment on anything like gaming performance as I haven't put it through its paces but for all else these seem more than adequate.",
					"After having had purchased two other dual packs of 16gb ddr3, I finally bought a two pack of Silicon Power ddr3 16gb. I removed the Corsair and TeamGroup ddr3 and replaced them with the Silicon Power, and it worked perfectly. I bought their ddr4 for my main office computer and again all 4 sticks were spot on. Obviously testing the product before it is released is important to Silicon Power and I as a business owner appreciate that bit of quality control very much. I have found that their ssd's are quite remarkable and dependable as well. A+++ Use SiliconPower when it's really important.",
					"This memory works well in my ThinkCentre M83 tower, even though it has been only 2 days.\n\nI was able to max out the allowed memory to 32 GB for a very good price.\n\nI'm in IT, so installing the memory strips was a straightforward task. It took me 5 minutes to pull all of the USB cables and open the case and I installed the new memory in about 1 minute.\n\nThe performance improvements were not readily apparent, but I can open more apps and do more things than I could with only 16 GB of RAM.",
					"I",
					"Memory did everything asked of it but the poor PC just isn't really up to Windows 8. I've never seen a CPU peg at 98% so often.\nWanted to see how more memory, from 4 to 16GB, would help an insipid HP Pavilion Slimline 400-214.\nAMD E1-2500 APU soldered on MB, prohibiting an upgrade. Cheapest alternative, upgrade memory.",
					"Used to replace old memory. So far has no issues. 32gb running @2666mhz. Can't complain about it really.",
					"New and their alright",
					"I bought this DDR3 RAM to upgrade my old computer. Easily installed into the motherboard. Computer immediately recognized it; now there is new life in my old computer.\nGreat value and works well.\nIf you're getting extra RAM to upgrade your computer, no need to get a faster speed (i.e. 1600MHz) or lower CL number than your existing RAM as the speeds will be limited by the slowest RAM you have installed.",
					"This was the cheapest ram I could find. I spent almost 2 weeks searching, Used to have all sorts of ram problems everytime I turned my computer on, which these seemed to have fixed. I have now ordered 4 8gb sticks, currently running 24gb on my dell xps 8500. my dog got at 1 package and destroyed the stick, as the delivery driver left it on the ground. So am currently going through the refund process. And will give update on customer service once finalized. But so far I'm happy with the ram itself, it made a big difference in performance. This was also the first product I've gotten that right out of the package works with my dell motherboard.",
					"I received them 2 days earlier than schedule , packaging was professional, installation was easy but no fifferent from other rams. They were recognised by my computer instantly and the computer is working nice and ok however I have no means to measure the performance of this ram versus others. I can only say they are working properly within last ten days and it was a very nice value for what you get."
				]
			}
		},
		{
			"id": "eZf7T-Q",
			"title": "G.Skill Trident Z RGB Series 16GB (2 x 8GB) 288-Pin SDRAM (PC4-25600) DDR4 3200 CL16-18-18-38 1.35V Dual Channel Desktop Memory Model F4-3200C16D-16GTZR",
			"price": "$69.99",
			"image": "https://m.media-amazon.com/images/I/61l4EStxhnL._AC_SX450_.jpg",
			"description": "Featuring a completely exposed light bar with vibrant RGB LEDs, merged with the award-winning Trident Z heatspreader designed, and constructed with the highest quality components, the Trident Z RGB DDR4 memory kit combines the most vivid RGB lighting with uncompromised performance.",
			"reviews": {
				"customerProfileNames": [
					"kenschimmoller",
					"CactusKiller",
					"CharlesPrince",
					"MatthewC",
					"JaredArmbruster",
					"KillaBeeWess",
					"Tabitha",
					"khalidAhmed"
				],
				"customerProfilePictures": [
					"https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif",
					"https://images-eu.ssl-images-amazon.com/images/S/amazon-avatars-global/4b821b3b-2601-421c-9fac-380bd8a9cbed._CR0,0,500,500_SX48_.jpg",
					"https://images-eu.ssl-images-amazon.com/images/S/amazon-avatars-global/default._CR0,0,1024,1024_SX48_.png"
				],
				"customerRatings": [
					"5.0 out of 5 stars",
					"5.0 out of 5 stars",
					"5.0 out of 5 stars",
					"5.0 out of 5 stars",
					"5.0 out of 5 stars",
					"5.0 out of 5 stars",
					"5.0 out of 5 stars",
					"5.0 out of 5 stars"
				],
				"customerReviewTitles": [
					"Microsoft 365 Family | Premium Office Apps | Up to 6 users | 3 Months Free, Plus 12-Month Subscription\nMicrosoft 365 Family | Premium Office Apps | Up…",
					"Save $30 at checkout | Adobe Acrobat Pro DC subscription with auto-renewal\nSave $30 at checkout | Adobe Acrobat Pro DC…",
					"Save 60% on Webroot Antivirus Protection and Internet Security Software 2021 - 3 Device\nSave 60% on Webroot Antivirus Protection and In…",
					"works with AMD!!!",
					"These work great with MSI AM4 mobo's",
					"Exceptional RGB RAM, plays well with AMD/Ryzen builds",
					"Best looking RAM on the market and works with MSI motherboard",
					"Great RAM for Ryzen based systems",
					"Beautiful ram",
					"Pretty and functional",
					"Far better than anticipated"
				],
				"customerReviewBodies": [
					"This is for ",
					" compatability fix with AMD!\n\nFor anyone having issues, as I have seen comments, issues, concerns about it not working with ryzen/ AMD motherboards at posted speeds.\nFor some, not getting it to post at the 3200 advertised speeds... and maxing at 2933.\n\nPlease make sure that your BIOS is up to date!\n\nThis was a issue that I had ran into, and was a SIGNIFICANT increase to what I was using originally, but was stuck at 2677 (or whatever that speed is). Once I got it to the new BIOS, it posted (with a quick change) to the 3200.0!!\n\nSo no more having to worry or freak out about not working with ryzen.\nPlus they just look BAD ASS in your rig!!\n\nP.S.\nI run a MSI X370 SLI PLUS\nAMD ryzen 7 1700\n\nJust please make sure you are running the latest BIOS ladies and gents!",
					"These work great with MSI AM4 mobo's. I bought these for my wifes build. They look figgen awesome! Once you get the app to work correct. Which when you download it DO NOT unzip the file. First right click and select properties. Then in the general tab go to the bottom and check the unblock. If you don't do this you will get an error from the app for some reason because it can't detect the memory. After I did this I was able to launch the app.",
					" First product from G. Skill, definitely impressed! Fast RAM, the RGB lighting effect is awesome!\n\nPROS: High quality product, easy installation. RGB lighting is top notch and a real head turner. Works well with AMD/Ryzen builds (*see note below).\n\nCONS: Control software is questionable, will lighten your wallet a bit.\n\n*FOR AMD/RYZEN BUILDS: You will need to have the latest bios update for your motherboard (AGESA 1.0.0.2a) to get full RAM speeds, as well as enable XMP or manually set timings/voltage in the bios. I have this RAM running with a Ryzen 5 1600 on a MSI B350M Bazooka mobo, with the latest bios update and XMP set to profile 2. I'm getting 3200 Mhz with no issues. Having the latest motherboard bios update is critical, you may not get the full memory speed without it.\n\nYou can download the RGB control software from G. Skill's website, but be forewarned that some users have had problems with it causing crashes and memory corruption. G. Skill specifically states on their website that the software should not be used in conjunction with other RGB control programs like MSI Mystic Light and ASUS Aurora. I deleted Mystic Light before trying the software and was able to run it just fine. The software gives you excellent control of the light effects and has many options for customization. Be aware that even if you don't use G. Skill's control software, the RGB lighting on the RAM sticks will still function fine, they default to a rainbow pulse effect.",
					"I'm using this on the MSI B350 Tomahawk Arctic and it works fine, color presets and all. Even though it's made for Asus motherboard I think. You just need to go to TridentZ's website to install the program to control the RAM color. My motherboard can run these at 3200 MHz no problem and I'm using the Ryzen 2400g. Having it pulse with the music is pretty sweet too.",
					"So first of all this RAM is fairly easy to install, as it should. Just make sure you place each DIMM in every other slot so that it runs in dual channel. It takes some tinkering with A-XMP profiles to get the advertised speed. Also, you may want to save the settings in BIOS first, shut down the PC, then start it again from a cold boot. Hitting Save and Reboot after increasing the RAM speed in the BIOS may cause a boot loop. Again, set the RAM speed in the BIOS, save settings, power the PC off, then power it back on again. Either way this RAM pairs great with Ryzen CPUs once you get it stable. Ryzen processors almost always have higher performance with faster RAM, even with more CPU cores and threads. This is also some of the most visually appealing RGB RAM on the market, and for less $100 at the time of purchase.\n\nOverall if you're looking for fast RAM to pair with any Ryzen CPU, I would highly recommend this.",
					"Easy as can be, synced with aura on first startup. Exactly what I needed for my rgb build.\nRunning: Asus ROG Strix z370 e rgb mobo\nI7-8700k cpu\nAorus 1080ti gpu\n6 Corsair LL RGB Fans\nCorsair led strips\nCorsair 240mm liquid cooling\nCorsair pro controller\nCorsair 570x case\nCorsair 850w gold psu\nI tried Corsair vengeance pro rgb but iQue gets into a fist fight with Asus aura over RAM slot rgb they are not comparable. I am now a g.skills guy for life.\nMy entire rgb build only needs Aura and IQue for all of my light setting and they work very well together as long as you don’t get Corsair RAM. When I did try vengeance rgb pro it shorted out my mobo rgb but the ram did work. Seeing both up close and personal within the last couple days I don’t care that the Corsairs had a problem. These g.skills look even better",
					"Love these, the RGB's are really something! They sync well with my Asus Aura software. I have these on a Crosshair Hero VI mobo. I bought the wrong type (I needed the ones for AMD not Intel) but they seem compatible thus far.",
					"I’ve never tried these RAM sticks before. Bought 4 sticks and installed them once they arrived. Turned on the power and my system booted absent problem, restarted and booted up with XMP 1. On purchase I knew they were Hynix sticks, yet my system was performing unusually better with those sticks, the difference pretty distinct. System ran smoother and I could open many chrome tabs without a single stutter. I went on Thaiphoon to verify the Ram’s manufacturer. The moment I clicked “Read” a bolt of lightening struck down from the heavens flashing through my bedroom window me. The echo of deafening thunder soon followed as a revelation was revealed to me. And the revelation read\n“Manufacturer: Samsung, Die Density: B-Die”\nNever thought I would get my hands on them, especially after they stopped producing them. And so I did what any rational person would and overclocked them.",
					"L",
					"",
					"These things look quite nice, as you might expect, with a reasonably high RGB LED density under the light diffuser, two-tone heat spreaders and pleasing design. The memory itself is also high perfoamance, running at 3200MHZ with tight latency timings. Note that you will have to go in to your motherboard settings and manually set up the memory speed, either directly or through the XMP profile.\n\nPlease note, however, that I run a Ryzen system - I wasn't aware of this before I made this purchase and had to do a lot of troubleshooting, but Ryzen systems (particularly 1st gen) do not play nice with high speed memory. After much tweaking and overvolting, mine runs stable but only at 3066Mhz.\nI am not factoring this in to my review score, as this was a lack of research and user error on my part - but if you are buying this for a Ryzen system, consider saving money and buying the 3000Mhz kit instead. Most ryzen systems flake out above a memory frequency of 2988Mhz or so, so buying a 3200Mhz set of memory is likely to not work properly at its rated speeds unless they are made specifically for Ryzen - which these are not.\nThe silicon lottery does factor in to this, so you might be able to get high speed memory to work fine for you, but I could not.",
					"The kit I received uses Hynix chips, this was a bit of a surprise as I had assumed they are mostly Samsung B Die, however no issues at all reaching 3200mhz with XMP and beyond on X470 with a 2700X.\n\nI'm currently running them at 3466mhz with the basic 16-18-18-38 timings at 1.376v and it passes prime95+Heaven running together for several hours.\n\nOverall they are a little pricey, but performance is great and the look great, when I have more time I'll try messing with tighter timings.",
					"Works wonders, great RGB lighting, and totally good value for money.\n\nThe installation was very easy, did have to take them out once or twice due to them not making contact very well at the start. A bit difficult to pull out if they are side by side. Other then that, they work wonders. Upgraded from 2133 mhz RAM's to these 3200's. So many FPS gains.\n(Gamer :P)",
					"I bought two of these kits for 32 GB of RAM for my MSI Z390 motherboard and Intel 9700K CPU. These DIMMs look beautiful and feel sturdy, they're very well made. They're not the cheapest on the market, but they're excellent quality. No trouble hitting the advetised speed just by enabling XMP mode in the BIOS. Stress tested using OCCT, memtest, y-cruncher and some Doom Eternal for hours and they passed with no errors. RGB LEDs work as advertised and I can control them using my motherboard's own RGB lighting control software, which is very convenient. Highly recommended."
				]
			}
		},
		{
			"id": "B4BYtgs",
			"title": "OLOy DDR4 RAM 16GB (2x8GB) 3000 MHz CL16 1.35V 288-Pin Desktop Gaming UDIMM (MD4U083016BJDA)",
			"price": "$50.99",
			"image": "https://m.media-amazon.com/images/I/61Q59LwSpZL._AC_SY355_PIbundle-2,TopRight,0,0_SH20_.jpg",
			"description": "About this item\nDDR4 2x8GB UDIMM, total 16 GB\nFrequency : 3000 MHz 16-18-18-36\n1.35V UDIMM (XMP 2.0 Automated Overclocking Technology)\nLifetime Warranty\nCompatible with Intel and AMD",
			"reviews": {
				"customerProfileNames": [
					"Elena",
					"MishyChan",
					"FrogsOnTheRun",
					"Eire13",
					"Customer",
					"WayneMayville",
					"JosephGamble",
					"Didactic_oz"
				],
				"customerProfilePictures": [
					"https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif"
				],
				"customerRatings": [
					"5.0 out of 5 stars",
					"5.0 out of 5 stars",
					"5.0 out of 5 stars",
					"3.0 out of 5 stars",
					"5.0 out of 5 stars",
					"5.0 out of 5 stars",
					"5.0 out of 5 stars",
					"5.0 out of 5 stars"
				],
				"customerReviewTitles": [
					"YES! YOU NEED TO EDIT SPEEDS IN BIOS! THAT’S HOW IT WORKS!",
					"This is important for Asus am4 board. users with. Ryzen 2 and 3 series",
					"plug and play",
					"The SPD (serial presence detect) is 2133mhz, so I had to manually overclock in BIOS to get 3000mhz.",
					"Great performance, great value for money",
					"Not Like DD3 Ram",
					"WOW!",
					"Great value ram for any build"
				],
				"customerReviewBodies": [
					"There are a lot of reviews saying that the RAM speeds are “not advertised”. The truth is, you need to enable one simple option in your motherboard’s BIOS to make use of RAM’s full potential. Enabling XMP will fix that. Your motherboard will use the SLOWEST option in RAM and you have to fix it yourself.\n\nI got these on sale and while OLOy is a relatively newcomer in the PC parts business, they do not fall short on price to performance. Very good RAM that does not fail me. It also makes my wallet happy because I got a good bargain on it.",
					"I bought the ram a few hours ago it's running fine soon far. I had to update to the LASTEST bios. Then changed the setting of my xmp. This is what I did to get advertised speed of the ram.\n\nBoot into the BIOS by pressing [DEL] or <F2> if you PC starts up during the post procedure.\n\nSwitch to Advanced mode by pressing <F7> on your keyboard.\n\nGo to the Ai Tweaker section of the menu, and change the AI Overclocking Tuner to D.O.C.P Standard.\n\nAt the D.O.C.P. choose the appropriate XMP profile for your Ram modules. (it could be one and it could be more profiles)\n\nIf you did that, go to the Exit menu and select Save Changes & Reset or just press the <F10> key on your keyboard.\n\nI'm running a 2700x with a Asus rog b450 f.",
					"Working flawlessly. Run pretty hard for few month now. top-tier Quality memory without brand-name tax. As I suspected 64 wasn't really enough for me, so ordered 2 more sticks of 32gb. 3200Mhz is excellent speed.\n\nThe fault, dear Brutus, is not in our stars, but in ourselves, that we don't understand computers.\nThe negative comments about timing are ignorance to a long held common standard. this memory is on point. if your motherboard is on point in recognizing/setting is luck draw, as already endlessly noted, many will have to turn on XMP in bios because it wasn't already toggled on in their motherboard. that is just part of installing memory, you not swapping batteries. not the memory fault computers were designed for computer nerds. the memory is good, computers can be hard. For note, I have ASRock Z390 Phantom Gaming 4 motherboard bought at the end of 2019, but the leading memory standard so yea it will work in everything it should work in. Most things as this still the dominant hardware class.\n\nCPU/GPU's are evolving so the importance of ram speed is a shifting landscape. but most gamers would not be disappointed with this memory. yes, is faster speeds today but in bang for the buck with how fast hardware changes (or just trying get best system for the dollar), this good choice. in most setups 3200Mhz is still in the high end performance sweet zone, and there are a lot of advancements coming, I found this the perfect speed to tide me over until the next hardware revolution. wild times\n\n1/21 update: installed the 2nd set, so running 128gb ram now without issues. oddly XMP got turned off when adding 2nd set, so speed reverted to 2133, dunno why, but turned back on in bios and memory returned to 3200. Wanted enough ram that I wasn't using disk cache and this is what it took. need what you need i guess. certainly proven Bill Gates 'nobody ever need more 640k' wrong! lol! anyways, memory is solid, zero issues\n\n2/23 update: spoke too soon. system, not often, but on occasions has started to lock up. took me awhile to rule out some other things I changed. Is better to buy memory in sets or at the very least at or close to same time so better chance is less variance between the sticks. I wonder if that is problem I having here. The memory is good .. I've run memory test and no errors. Maybe I need a higher quality motherboard to better handle 128gb. But for now I will try tweaking the settings, maybe shuffle the sticks around (tech is silly sometime) .. will have research first, I think increasing(?) the voltage is one trick for stability, if doesn't work I'll try underclocking. see if that helps my system handle this much ram better. -- also considered problem could be my m2 overheating, isn't something that changed in my system, but ordering a heatsink for it anyways --\n\n2/28 - after changing clock speed to 3100 I've yet to experience another lockup running 128gb. could be imperfections in the memory but probably my lower end motherboard. I was considering upgrading my mobo, but if it stays stable then I'm happy.",
					"Because the SPD is 2133mhz, I had to manually change the setting in BIOS to get the ram to run at its' advertised speed of 3000mhz. The CL (cas latency) is now 22, vs the advertised CL16. Considering returning for another brand that is truly 3000mhz CL16.",
					"I was very sceptical on purchasing from Oloy as I have never heard of this brand before and compared to the other major memory manufacturers they are not as reputable. However, due to the positive reviews and this 64gb ram kit being almost 100$ cheaper compared to the major brands I gave it a shot. Enabling XMP 2.0 in bios and it ran at 3200mhz no problem however, I could not get it to overclock to any frequency beyond this speed. For gaming, streaming, and 4k video editing my pc runs like a dream.\n\nMy specs are:\nRyzen 9 3900x\n64gb ram (this kit)\n2070 super",
					"I have refurbished old company desktops over the years and installed upwards of 100 DD3 RAM Chips. Very easy to do and very evident when the chips are seated fully. This was my first ever experience with DD4 and I was about to send these back because I thought they were bad. Be advised DD4 Chips can look fully seated and not be. At least this was the case on the Motherboard I have. It was not until my third try installing these that I finally felt the chip actually seat fully. I really had to press to get them seated. Once they seated the machine recognized them and they work fine.",
					"this ram actually really suprised me it overclocks extremely well and performs flawlessly. not sure if i won the silicone lotto here or what but i highly recommend you buy! and please if you have any bad luck with it let me know. think i found a new ram manufacturer for all my future customers machines.",
					"The Ram worked perfectly in my Ryzen 5 3600x build, paired with a B550M Mortar motherboard. No issues at all. Don't forget to turn on the XMP settings in the bios so that the RAM will function at it's full speed. If you don't turn on XMP, then your ram will only run at the default low speed setting. So that is a very important step if you want the most out of your RAM. Great Value RAM!",
					"Bought this for a new build and the RAM is very poor to say the least.\nClock speed is stated as 3600mhz - it will never achieve anything above 26oomhz\n\nAfter a few days one of the RAM sticks failed.\nReturned the RAM and paid for the Crucial Ballistics 3200hmz rthat runs at 3200hmz without flinching.\n\nI wouldn't buy cheap RAM again - especially this item(Brand and Make).",
					"The ram looks good but when both ram sticks are in it doesn't boot so I took one out and it didn't boot so I switched the stick with the second one and it booted to bios when I restarted it it wouldn't boot again. I also tried on my friends pc and it wouldn't boot with both sticks the we added 1 of his stick and one of mine and one was unknown and other one had error.",
					"unstable at posted speed of 3600 CL18. suddenly getting BSOD. programs have problems accessing memory. creating memory management BSOD and critical program failure BSOD.\n\neverything back to normal putting in my old CL16 3200 sticks\n\nFor reference I'm using them in a x399-a with a 2950x",
					"No need for a complicated review - easy to fit and work perfectly.\n\nThat kick from 16 to 32GB makes a huge difference.\n\nBeen running for a while now and the reliability has been excellent. They're fitted to my gaming machine and I'm really happy.",
					"Massively underrated brand. Build quality is high. Tested and working as advertised with Ryzen 2000 and 3000 SERIES CPU's without an issue. Looks really clean and sleek too. Great RAM!"
				]
			}
		},
		{
			"id": "iSIh5NY",
			"title": "Corsair Vengeance RGB Pro 32GB (4x8GB) DDR4 3200MHz C16 LED Desktop Memory - White",
			"price": "Check fit by model, Find your brand",
			"image": "https://m.media-amazon.com/images/I/81nhDJH5oYL._AC_SX450_PIbundle-4,TopRight,0,0_SH20_.jpg",
			"description": "",
			"reviews": {
				"customerProfileNames": [
					"SteveSmith",
					"Naifm92",
					"MatthewR.Knell",
					"Matt",
					"JoePetty"
				],
				"customerProfilePictures": [
					"https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif",
					"https://images-na.ssl-images-amazon.com/images/S/amazon-avatars-global/4b0ae29c-2209-45ae-991b-c18e056a5dd4._CR0,0,252,252_SX48_.png",
					"https://images-eu.ssl-images-amazon.com/images/S/amazon-avatars-global/default._CR0,0,1024,1024_SX48_.png",
					"https://images-eu.ssl-images-amazon.com/images/S/amazon-avatars-global/2a86cb65-115a-4014-9715-b367959e58ed._CR0,1.0,330,330_SX48_.jpg"
				],
				"customerRatings": [
					"5.0 out of 5 stars",
					"5.0 out of 5 stars",
					"5.0 out of 5 stars",
					"5.0 out of 5 stars",
					"5.0 out of 5 stars"
				],
				"customerReviewTitles": [
					"Hey Ryzen users!",
					"for Ryzen 2000 series users (2700X)",
					"Quality, Beautiful, and Fast",
					"Quality RAM, works with my B450 Motherboard!",
					"Wow Corsair... What else can I say about this BEAUTIFUL RAM KIT...."
				],
				"customerReviewBodies": [
					"For my counterparts using Ryzen 7 and pulling their hair out over QVL. This is approved for Asus X370 Prime Pro and NOT (yet) ROG Strix X370 F Gaming. I have been through 4 sets of ram and so far two have worked and for the ROG Strix version, the RGB works swell even through Memtest86, even though the Vengeance RGB is NOT QVL approved for Strix. I am returning my Prime X370 Pro because the ROG Strix is prettier. I started with 3000MHz, it worked fine and passed the tests with 4 DIMMs inserted, but clocked down to 2933 no matter how many DIMMs inserted.\n\nIf you don't know, RAM will default to 2133MHz out of box on most Ryzen boards unless it's default at 2400MHz. This RAM worked with no BIOS issues on the latest BIOS' as of this date. This RAM is QVL'd for the Prime X370 Pro but not the Strix model but still passed hours of Memtest86 with 4 DIMMs inserted. I personally think the QVL is out of date for the Strix. I am giving this info because people want RGB and want to customize their stuffs. If you post a question I will try to help, good luck!\n\nI repeat, it worked at 3200MHz with FOUR DIMMs!\n\nUPDATE: HCI Memtest, Memtest86 all passed and had 0 errors!",
					"it does perform very will with ryzen 2700X (At lower Clocks), i manged to get 3600mhz 16-17-17-36(stable at gaming for 6 hours but unstable in stress tests like memtest64 barely finished 5 loops with some errors then the system crashed) so i tried lowering the frequency with tighter timing so i got 3400mhz 14-14-14-30 (stable at gaming for 6~8 hours but unstable in stress tests like memtest64 finished 10 loops with some errors then the system crashed) so what is the perfect spot ? i have it now at 3200mhz 14-14-14-24 and it's very stable no matter what i do it's solid stable it finished 30 loops in memtest64 without a single error, i might try increasing the frequency later but for now i think it's just excellent 10/10 recommended,\nBTW if you don't mind losing the RGB on this kit you might want to get the g-skill sniperx 3400mhz kit or the flare x maybe i think they might perform better and clocks higher maybe ?\n\nNOTE: I used \"Ryzen RAM Calculator\" to get all the settings for the ram",
					"The RAM is fast, though no better than the Corsair Vengeance LPX DDR4-3000 16GB kit equivalent, which is usually cheaper.\nThe kit I got is certainly not Samsung B-die, you can check yourself based on Thaiphoon Burner; mine is v5.32\nThe heat sink actually does something, surprisingly, and the LEDs are vibrant and beautiful.\nThe iCUE engine is easy to use and offers many RGB effects, and syncs with other Corsair products.\nIf there's only one thing I'd change, I'd make the Corsair logo on the side of the heatsink a cutout rather than white paint so that you could see it shine through in RGB glory. I can see why they didn't do this, however, because it would take a high level of detail and make it more fragile.",
					"When I initially was looking for RAM, I was going to go with the previous version of this RAM because it was on the QVL from MSI. I'm so glad I took the risk on these, listened to the reviews about these sticks working on AMD boards, and bought these for my first build. The LEDs are stunning and look amazing. I honestly have kept them at the stock color effect, and I didn't even think I was going to like that effect the most! It perfectly compliments my Cryorig H7 cooler with the white fan because it reflects the colors off of it.\nI did run into one issue initially. I was trying to overclock them to the A-XMP speed that my motherboard, MSI B450 Tomahawk, allowed (which is 2933 for the 3000mhz sticks). For some reason, I was getting issues where it would not go to the rated speeds. I went to the Corsair Reddit and submitted a post about it. Got feedback from one of the mods to try switching the RAM and using them individually. At first, I thought I had a dead stick because the system did not post. I later reinstalled the stick into the motherboard because I wanted to keep the colors running. Turns out I just needed to switch the RAM to the other's slot, which was odd. Not sure if it was a RAM problem or a motherboard problem. Point is, it works now. It recognized that I had 16GB usable and installed, and I was able to activate A-XMP and it posted immediately with that overclock. Works like a charm.\nAnother note: as of this review, I've had zero problems with MSI Mystic Light working with Corsair iCue software. I use iCue to run the lighting effects on the RAM, and Mystic light for my motherboard and my RGB front fans.",
					"So i purchased this RAM set. Ok let me say that this is my first experience with Corsair branded RAM. I am a Corsair fanboy to the extreme but i always thought their ram was expensive, and there are other kits out there that are cheaper. But let me say that this is an exceptionally beautiful kit of RAM! This is the 3000mhz kit. I have it in the Gigabyte Aorus Gaming 5 X370 Motherboard for the AMD Ryzen platform, paired with a Ryzen 5 1600x OC'd to 4.05ghz. My board officially supports up to 3200mhz ddr4 ram. I have my kit OC'd to 3200mhz with no issues whatsoever! Using the rgb function of the RAM is as easy is downloading Corsair Link, and playing with the colors inside of it. Theres different modes in there to play with as well. Im thoroughly impressed with what Corsair has done with this particular model of RAM. Not only does it perform like a champ, but it looks good doing so.",
					"Let's get this out of the way first, this is stunning looking RAM - on the surface at least. It looks great when powered off and it looks great at its default setting, assuming you like the default rainbow animation. This should be the best on the market right now, but...\n\nDig a little deeper though and there are problems with colour inconsistency, not just between supplied DIMMs but across each individual DIMM. The accompanying photos show the DIMMs set to \"white\" (R:255, G:255, B:255) but many of the RGB LEDs have a distinct cast, as can be seen. RGB LEDs from different manufacturers frequently have a particular colour cast, but this isn't a problem if it's uniform as adjusting the RGB levels will compensate for this. It is however a problem if the cast isn't uniform - as shown in the photos - as it's not possible to individually adjust each RGB LED for most of the lighting styles in Corsair's iCUE software. These inconsistencies aren't visible if the LEDs are set to pure red, green or blue, but any other colour will be a mix of R, G and B, and colour imperfections will be visible. White looks terrible.\n\nCorsair initially told me this was unusual but I had no further response from them when I asked them if they could show me a set with even, consistent colour from the RGB LEDs.\n\nThe second major issue is compatibility. These DIMMs work as traditional memory on all Intel DDR4 platforms but incompatibilities have been raised on newer AMD Ryzen systems - obviously check before buying if you're an AMD user.\n\nHowever, you don't buy RAM like this if you're not interested in the RGB illumination, and that's where the real incompatibilities lie, on both AMD and Intel platforms. My experience here is with Intel's X99 platform. A BIOS function \"SPD_WRITE\" is required to program lighting functions on the RAM. Not all motherboards offer the SPD_WRITE option in BIOS (the majority of Asus X99 boards do from experience) so again check that yours does before making a purchase.\n\nThe next problem, at least for X99 users, is with Corsair's iCUE software. Again, you don't buy performance memory just to run at its stock 2133MT/s speed, you buy to run at its rated XMP speed. Unfortunately, enabling XMP sets the BCLK to 125MHz, up from 100MHz, and iCUE loses communication with the DIMMs. This means if you use the memory at its rated speed you can't control the lighting effects. You can disable XMP in BIOS which allows iCUE to see the memory, and then set your lighting options before re-enabling XMP, but you must jump through this hoop every time you wish to change lighting effects if you with to run the memory at its rated speed. There is one other issue here, if iCUE can't communicate with the memory it can't synchronise the lighting effects. On top of this, the most advanced lighting effects require \"Software Controlled\" to be enabled in iCUE, and this mode doesn't work with XMP because iCUE can't se the RAM so you get nothing at all.\n\nIn summary, aside from the variable quality of the RGB lighting this memory is not recommended for X99 motherboards (and isn't supported by Corsair). Any board that doesn't allow SPD_WRITE to be enabled in BIOS will not be able to save lighting effects to the DIMMs, and in the absence of software control (such as during boot) the DIMMs will operate at their default settings. Fantastic memory on paper but the reality doesn't match up unfortunately and I've returned mine for a different brand altogether.",
					"J",
					"",
					"***das versprochene Update zum OC***\n\nIch habe vergangene Woche den r5 3600 in meinem System verbaut, der einen deutlich besseren memory controller verbaut hat, als der 2600, deshalb habe ich den Test direkt mit diesem gemacht.\n\nIch habe das Kit bei 3600 MHz CL 20 stabil bekommen, was für diese Preisklasse beachtlich ist. Bessere Timings sind zwar nicht drin, aber das ist okay so. Bin nach wie vor begeistert.\n\n*********\n\nIch habe mir ein relativ günstiges 1080p Gaming System gebaut, in dem diese Riegel ihre Arbeit verrichten. Und das tun sie nicht nur gut, sondern sehen dabei auch noch richtig gut aus.\n\nKurze Zusammenfassung der Konfiguration und der Installation:\n\n- Ryzen 5 2600\n- Hyper 212 Evo black edition\n- MSI B450 Tomahawk\n- Asus Expedition rx570 4gb\n- eben besagtes RAM Kit\n- 500 GB SSD von Samsung\n- Seasonic 550w Netzteil\n- Nzxt h500\n\nAm Wochenende habe ich alles zusammen gebaut und muss sagen: das Kit läuft ohne Probleme. Fix im BIOS XMP aktiviert (PSA: das müsst ihr machen, sonst läuft das Kit nicht mit der angegebenen Frequenz) und ab ging die Post.\n\nBeide Riegel wurden erkannt, die angegebene Frequenz und die angegebenen Timings laufen problemlos, also alles fein.\n\nAuch optisch war das Kit kein Problem, wird von der MSI Software erkannt und kann korrekt gesteuert werden.\n\nAlles in allem also ein guter Kauf, ein Update zum Overclocking kommt dann, wenn ich etwas Zeit habe.\n\nIch hoffe das hilft euch bei eurer Kaufentscheidung weiter!",
					"",
					"T",
					"",
					"Very bright LEDs but brightness can be changed with iCUE software (really large file size for such a software). XMP enabled and works well. Temps within norm. Not sure abou the small holes on the side of the ram (where light can pass through), but thats a personal preference. When brightness is lowered, individual LEDs can be seen underneath the plastic."
				]
			}
		},
		{
			"id": "7F65Neg",
			"title": "XPG DDR4 D60G RGB 16GB (2x8GB) 3200MHz PC4-25600 U-DIMM CL16-20-20 Desktop Memory Kit White (AX4U320038G16A-DW60)",
			"price": "$67.99",
			"image": "https://m.media-amazon.com/images/I/51BGybmlO5L._AC_SY450_PIbundle-2,TopRight,0,0_SH20_.jpg",
			"description": "Experience the New Halo XPG D60G brings you a new way to enjoy the freedom of customization. Enhanced with our unique dual RGB heatsink design, XPG D60G now can spread your RGB lighting effects to additional extent and brings you a new experience of customization. SPECIFICATION Speed : 3000MHz CL 16-20-20 3200MHz CL 16-20-20 3600MHz CL 17-18-18 / CL 18-20-20 4133MHz CL 19-19-19 / CL 19-23-23 Voltage: 1. 35V-1. 4V : Limited Lifetime.",
			"reviews": {
				"customerProfileNames": [
					"AnthonyG.",
					"DominickCrago",
					"JZ",
					"Midian",
					"CodyBur",
					"jamblo",
					"SerenityLove",
					"Angela"
				],
				"customerProfilePictures": [
					"https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif",
					"https://images-na.ssl-images-amazon.com/images/S/amazon-avatars-global/54bf835c-e035-4713-9556-5ec1a7f7da34._CR0,26.0,280,280_SX48_.jpg",
					"https://images-na.ssl-images-amazon.com/images/S/amazon-avatars-global/8502cf02-d656-440c-b33e-bf3690b650bd._CR0,0,233,233_SX48_.jpg",
					"https://images-na.ssl-images-amazon.com/images/S/amazon-avatars-global/50d6b3f3-a189-4ce8-9968-82d6d84c961d._CR62,0,375,375_SX48_.jpg",
					"https://images-na.ssl-images-amazon.com/images/S/amazon-avatars-global/3a3da858-b44d-4bc7-9ceb-a2dfdbd9cc8c._CR0,0,500,500_SX48_.jpg",
					"https://images-na.ssl-images-amazon.com/images/S/amazon-avatars-global/571cdd4f-a784-4ff6-ad17-630a5140bf37._CR0,0,500,500_SX48_.jpg"
				],
				"customerRatings": [
					"5.0 out of 5 stars",
					"5.0 out of 5 stars",
					"5.0 out of 5 stars",
					"5.0 out of 5 stars",
					"5.0 out of 5 stars",
					"5.0 out of 5 stars",
					"5.0 out of 5 stars",
					"5.0 out of 5 stars"
				],
				"customerReviewTitles": [
					"My existing 16 gig of XPG Ram was D41 series with 16-18-18 (Latency)",
					"Works as expected",
					"good product",
					"PRETTY!",
					"Very Gorgeous RGB and a Great Value",
					"confirmed speeds",
					"Very nice and easy to install",
					"Easy to use"
				],
				"customerReviewBodies": [
					"Z",
					"Only thing that's weird is it doesn't always sync up with the motherboard lighting in mystic light but I'm pretty sure that's because of MSI's most recent update. I wasn't having any other issues prior. Keep in mind that this is rated for 3200mhz. I didn't find that the 3600mhz was really worth the increased price but it also depends on your build. Looks awesome though!",
					" It works perfect on my MSI X470 with 2700X, large RGB and good performance, very EZ to install!! I would buy 4 of it if I have smaller CPU cooler fan~ LOVE IT!",
					"Verified compatibility with my motherboard and it works right out of the box. No issues no, all I had to do was set the XMP profile I was ready to rock and roll. And as for the software I have no issues changing the ram color & sequence.\n\nMy only gripe is the colors are more of an eggshell.",
					" These are fantastic sticks of RAM. I've been building computers for years, and have used several brands of RAM, including G.Skill Royal Trident currently in my personal computer that's OverClocked to 3600 with the timing still being at 18, and I don't quite buy into the hype on super high-speed RAM. Like, it no doubt makes a difference, but for average gamers- and especially just daily tasks- it's no where near worth the MASSIVE price increase.\n\nWith that said, at first I was kinda disappointed with these sticks because they just didn't look as vibrant as I was hoping. I REALLY debated deducting a star because especially when you have it set to a static color (I personally was going for a blue/black theme on this build), it just doesn't look quite as good as I hoped. But after trying out other settings, I decided it wasn't enough of a reason to deduct a star because it does actually look really good when changing colors. They do a really good job of diffusing the light and hiding hotspots, which I personally can not stand. I've got some better pictures and a video I'll upload soon to show what I mean.\n\nTLDR: for budget builds, or even slightly higher end builds, you can't beat the $70 price tag for this beautiful RAM that functions perfectly.",
					"These ram sticks run at the speeds they say they do and they overlock just fine. The lights are amazing and give off more light than most other LED ram sticks. There are no thermal problems. The price is also fairly decent.",
					"Compliments my white pc and love the RGB flow. For its value, I am pretty satisfied. Had these for 3 weeks, so far so good.",
					"Easy to install the colors are pretty neat as well if you have a clear case",
					"These worked amazingly, I absolutely love them, they work just as well as any other 3200 ram and I have little to no problems with them. They sync up fine to my msi mystic lights or razer synapse and are absolutely beautiful when doing so. The only thing I would have to say as a negative is that they dont turn off when my computer goes to sleep, They continue to light up unless my computer gets completely shut off. I don't mind it much but for you want it to be completely dark when you put your computer to sleep then get another RAM. IT may just be my particular pair but I doubt it",
					"These RAM sticks just look fantastic - just be careful about fit.\n\nMy setup:\n- MSI MPG Z390 Gamer Edge AC motherboard (ATX)\n- Metallic Gear Neo Air ATX case\n- Be Quiet! Pure Loop 240mm AIO CPU cooler (with radiator mounted on the top side of the case)\n\nThe RAM and my AIO radiator together BARELY fit. The top edge of the RAM is a bit high and it comes in contact (barely tho) with the edge of my AIO radiator fan, which isn't a big deal, but had things been 1mm tighter it would not have fit. I had to install the RAM first before mounting the radiator.\n\nThis RAM chip is not on the QVL of my motherboard but with the XMP profile turned on (and not changing anything else) I'm getting a stable 3200MHz.\n\nOverall great value. Have you seen how nice it looks?",
					"This is really DDR4 2666 Mhz ram using JEDEC standard @ 1.2v, 3000/3200 requires overclocking.\n\nto reach speeds of 3000 Mhz or 3200 MHz XMP profile is needed to be used, and at those speeds this memory module operates at 1.35v not 1.2v\n\nThe funny thing is my system cam with DDR4 3200Mhz ram at 1.2v and operates fine.\n\nBut using this memory, when using XMP, the 3200 Mhz profile causes me pc not to boot, and the 3000 Mhz option works fine (XMP profile #2). I am able to use profile #1 at 3133Mhz instead of 3200 to get my system to boot.\n\nSo this is strange.\n\nSo what it apears companies are pushing overclocked ram using XMP profiles to reach advertized speeds instead of just following safe JEDEC memory timings.\n\nIf this ram can operate at 3200, why doesnt it have a JEDEC profile for that speed ? Maybe the JEDEC profiles are for non-overclocked certified speed/timmings.\n\nMy poing is 3200 speed is not just plug and play. It requires tweeking at turning on option in the bios to utalize the XMP profiles. But 3200 speed may not be achievable. I seen some reviews that blame motherboards. But the fact my pc alreafy had ddr4 3200 in it using JEDEC, i know my board is capable.\n\nSo just beward 3200 may not be an option and you may have to use 3000 or do what I did and use 3133 with some tweeking.\n\nLoosing up the timing did not help the 3200 progile. I did not try to increase the voltage. But I bought ram to just work not to have to diffle with it,",
					"For anyone throwing this into a newer setup and noticing that it is only running at ~2666mhz you need to enable xmp (intel) or docp (AMD) to get the full 3200mhz.\n\nARGB is a bonus but works very well with Armoury Crate and Aura Sync. So far, I haven't had any problems with this in a ROG Strix B550-F Gaming mother board paired with an AMD 5800X. Runs great so long as you enable docp and do the bios update.",
					" They look amazing. This was my 2nd time purchasing this. The first time I ordered the grey ones, but same speed and memory. Decided to upgrade my case and replace the grey for white. So far I haven't had any issues with this ram. It is amazing. Seems to be the most decent rgb ram for the price! I'm really glad I decided to order this instead of more expensive options. I haven't noticed any performance issues with them yet either. This is a highly recommendable product. I'd suggest to get this over more expensive options, if you really want ram that has a lot of rgb. Might as well save a bit of money and get something that looks good and still performs well.\n\nCurrent PC components with this RAM:\n- ryzen 5 3600 CPU\n- Geforce RTX 2070 Ventus GPU\n- Deepcool Castle 240EX AIO\n- ASRock Steel Legend B450 mobo\n\nI use Aura Sync to control the rgb on the ram."
				]
			}
		}
	]
}
