{
	"SSDs": [
		{
			"id": "ghywrbM",
			"title": "SanDisk 1TB Extreme Portable SSD - Up to 1050MB/s - USB-C, USB 3.2 Gen 2 - External Solid State Drive - SDSSDE61-1T00-G25",
			"price": "$129.00",
			"image": "https://m.media-amazon.com/images/I/71wtYi+0t0L._AC_SY450_.jpg",
			"description": "Your life’s an adventure. To capture and keep its best moments, you need fast, high-capacity storage that accelerates every move. 1050MB/s read and 1000MB/s write speeds let you store your content and creations on a fast drive that fits seamlessly into your active lifestyle. Up to two-meter drop protection (3), with IP55 water and dust resistance (3), a Carabiner loop for securing the drive, and a 5-year limited warranty (1) give you the peace of mind to take it with you on travels near and far. From the brand trusted by professional photographers, the SanDisk Extreme Portable SSD provides fast solid state performance in a tough, reliable storage solution. 1GB = 1,000,000,000 bytes, 1TB = 1,000,000,000,000 bytes. Actual user capacity less. Up to 1050MB/s read speed, up to 1000MB/s write speed. Engineered with proprietary technology to reach speeds beyond UHS-I 104MB/s, requires compatible devices capable of reaching such speed. Based on internal testing; Performance may be lower depending on host device, interface, usage conditions and other factors. 1MB=1,000,000 bytes. (1) See official SanDisk website. (2)Password protection uses 256-bit AES encryption and is supported by Windows 8, Windows 10 and macOS v10.9+ (Software download required for Mac, see official SanDisk website.) (3)Based on internal testing. IPEC 60529 IP 55: Tested to withstand water flow (30 kPa) at 3 min; Limited dust contact does not interfere with the operation. Must be clean and dry before use.",
			"reviews": {
				"customerProfileNames": [
					"A.Benjamin",
					"AndreS.",
					"JIHLSEY",
					"Anthony",
					"RP",
					"WillVonWizzlepig",
					"B.Ong",
					"PJ"
				],
				"customerProfilePictures": [
					"https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif",
					"https://images-eu.ssl-images-amazon.com/images/S/amazon-avatars-global/3811f2b8-438a-42a1-8edb-b82192fcf0f0._CR0,0,500,500_SX48_.jpg"
				],
				"customerRatings": [
					"1.0 out of 5 stars",
					"3.0 out of 5 stars",
					"5.0 out of 5 stars",
					"1.0 out of 5 stars",
					"1.0 out of 5 stars",
					"3.0 out of 5 stars",
					"5.0 out of 5 stars",
					"5.0 out of 5 stars"
				],
				"customerReviewTitles": [
					"Does not work with MacBook Pro M1 Max",
					"Know your expectations",
					"2013 IMAcis usable again.",
					"Do not buy it! Should be recalled.",
					"Died within 2 weeks. Lost all my data!",
					"Worked great until it didn't",
					"Powerful and compact external ssd for ps5",
					"YOUTUBE VIDEOS WILL HELP YOU FORMAT THIS SSD EASILY"
				],
				"customerReviewBodies": [
					"Small cosmetic imperfection on top, front or sides of item. Small cosmetic imperfection on bottom or back of item. Missing bonus material. Missing manual. Item will come in original packaging. Packaging will be damaged.",
					"This product is incredibly frustrating. It would not mount properly on a MacBook Pro M1 Max or an iMac (Intel i9). No product support on the Sandisk site. No instructions. No nothing to support the product. DO NOT BUY THIS FOR YOUR iMAC or MacBook Pro. It does not mount at all. I did everything possible suggested to no avail. Had to return it.",
					"I had expectations before buying this SSD. I got the 1TB / 1000mbps version. My expectations were that I would plug it in and immediately get the 1000mbps write speed... Wrong.\nIn order for this to happen certain factors have to come into play.\nIf you are using hard disk drives to copy from you are wasting your time. Hard Disks will create a bottleneck with this drive. They are just not fast enough to keep up.\nIf your operating system resides on an SSD like me or an M.2 you'll be fine copying files from that drive.\nI got a lot of trouble also setting up this drive as I expected the cable to work in any direction as it's a USB-C type.\nNope. It will only work in one direction so if your speed is slow try changing it around. What I also did was I taped the correct end of the cable that is supposed to be attached to the drive so I won't forget.\nIf you use the wrong end you will get slow speeds.\nAlso to get good speeds you must use the fastest ports on your pc which should be USB 3.1 Gen 2 Type-A (which is a red usb port), USB 3.1 Gen 2 Type-C (a usb c port), or USB 3.1 (a blue usb port). If your computer is old and does not have these ports you are wasting your money.\nWhen I first used the drive properly I was getting and still get fluctuating data rates. So I am very wary as to if this drive is working properly or not. I was thinking about sending it back but I got a write speed of over 700mbps using my fastest ports so I decided to hold on to it for now and keep my eye on it.\nI also got 400mbps from my USB 3.1 (blue).\nWhat i'm thinking of doing is getting a 10Gbps USB 3.1 Gen 2 cable to test out and see if I can get the listed speed for this device. Also to get my hands on a SSD to work off of because right now i'm still using HDD for storage and working off of. Really hope It works out.\nStill giving 3 stars because at this price point it should be as close to the rated speed on the box as possible. Otherwise they should have put the average max speed on the box.",
					"We have a 2013 imac that has slowed to the point nobody will use it. I watched a few videos on how to use this external drive as our main hard drive. This drive installed easily just switched the boot drive after formatting and loading MAC OS on ssd. I did not use the software supplied on the drive. The imac is once again a pleasure to use. Ty",
					"I have been using this for less than five days and I tried using it for a DJ set and it overheated in less than an hour and was basically unusable. Don’t buy this unless you plan on using it just for storage and you never plan on working from the files that are on the hard drive. I am honestly surprised that a company like sandisk is continuing to sell an obviously defective product. It gets super hot even when it’s not in use if it’s even plugged in to the laptop. Glad I figured this out right away so I can return it.",
					"I filled a brand new 1TB drive with about 700GB of data. Two weeks later I could not access the drive--it says \"The media is write protected\". According to the Sandisk web site, the drive is toast and I must return it. I have four other of these SSD drives. Now I am worried about them. I am no longer a Sandisk customer! I will advise my students as well.",
					"I had the 2TB model. Got the amazing transfer speeds USB-C delivers for about four months, and I did not end up using it all that much.\n\nIt did get a little hot when in use.\n\nSuddenly I could no longer get more than 34mb/s out of it. SanDisk support had me run a speed check utility against it, and then told me I'd have to format it to see if that fixed the speeds (yeah, good thing it was a backup, mostly, or getting the data off of it at 34mb/s would have stunk).\n\nIt did not fix it, and they issued me an RMA. Note that if you RMA with them, they will ask you for your phone number in the form you fill in (it's a required field), but then they will delay your RMA by asking you to mail it to them (apparently their form loses the data or something stupid like that)- save yourself some time and include it in the description.\n\nOh, additionally, SanDisk apparently reserves the right so send you a reconditioned item as a replacement, because, you know, you bought a second-hand piece of junk originally, right? Actually, I am knocking another star off for that.\n\nI presume the replacement will work, update later if not.",
					"Amazing little ssd external storage. Wished I had also bought the 2 to version when it was cheaper. I bought the new generation model and I am using it solely for the ps5 to store ps4 games. So far it has been exceptional. Fast read and writes. No issues with storage errors. I had also use the same ssd to connect to the ps4 and had no issues reading it. Be aware that the ps4 needs to have an internal ssd so that it can fully utilize the r/w of the external ssd.\n\nI am also very amazed how small it is compared to most ssds out there. Almost like a laptop internal ssd. Attached is a picture comparing the size of the ps5 and the storage itself.",
					"I have downloaded so many videos on my Mac computer that I was running out of space so I decided to move them all to an external device. I'm 75 so not exactly an up-to-date techie but I managed to format it properly by finding several good YouTube videos that helped me out. There was a sheet included with the SSD but honestly the font was so small that I could hardly read it...it took a high powered magnifier to see where I needed to go to get format instructions and even though I wrote it down carefully and re-checked the web address several times, it still did not go to the correct address for formatting instructions. Then I went to YouTube and found help. I chose SanDisk for their reputation and having used their products before, I knew they made great products. I would recommend this tiny SSD...so fast, light and a solid product. I'm glad I bought it.",
					"Die SSD funktioniert einwandfrei auf einem Intel MacBook Pro und auf einem Intel Windows PC aber nicht oder nur sporadisch mit dem M1.\n\nDie Festplatte wird in den Systeminformationen erkannt aber nicht im Finder angezeigt. (Ja, in den Finder Einstellungen sind externe Festplatten angehakt.)\n\nWir haben versch. Kabel getestet - keins hat zuverlässig funktioniert.\n\nDie Festplatte wurde über zwei Tage und mehrere Versuche, Neustarts & Mac-Updates nur ein einziges Mal im Finder erkannt und konnte verwendet werden. Nach ordentlichem Auswerfen und wieder anstecken wurde die Festplatte wieder nicht im Finder erkannt. Auch eine Formatierung (als Sie einmal erkannt wurde) hat nicht geklappt (auf den letzten Block konnte nicht geschrieben werden). Unter Windows hat die Formatierung einwandfrei geklappt (ExFat).",
					"",
					"This was purchased for use as additional drive for M1 Mac Min which has only 256G drive built in.\n\nIt worked as intended but became very warm even if it was doing nothing, just being connected. Whether or not this is normal I don't know, but I do know that excessive heat shortens the life of SSDs.\n\nIt also disconnected from the computer intermittently, with the OS thinking that it had been removed, so was proving to be unreliable. Returned for refund, with no problems there.\n\nI note that there have been other buyers who have had the same problems.",
					"Ce disque dur est très rapide (voir photo) et compact/léger (+petit que mon iPhone!).\nJe peux facilement retoucher des photos en les laissant sur le DD et en utilisant le catalogue Lightroom stocké sur le disque dur.\nDe plus il y a vraiment 1to de capacité de stockage dessus (et non 9xx giga comme ça peut être le cas lorsqu’on achète d’autres disque dur).\n\nJe recommande !\nSi mon avis est utile, faites le savoir merci 🙏🏼",
					"",
					"Questa è un aggiornamento della mia precedente recensione. Ho potuto costatare che utilizzando le porte giuste e con i cavi appropriati, la velocità di trasferimento arriva tranquillamente agli 800 MB/s. Per il resto, essendo articoli di nuova generazione, mi fido e mi affido alla serietà qualitativa della Sandisk.",
					"",
					"Diese SSD wollte ich als Speicher für meinen Mac mini M1 nutzen. Dieser hat nur 256 GB. Darum sollten alle Daten sollten auf der 1 TB Platte liegen und bearbeitet werden.\n\nDies funktioniert auch problemfrei ohne nennenswerte Geschwindigkeitsprobleme.\n\nAllerdings kam es jetzt nun 2 x vor, das die SSD nicht mehr erkannt wird und alle Daten auf der Platte verschwunden sind. Glücklicherweise sichere ich meine Daten immer mehrfach, so dass mir ein Verlust erspart blieb.\n\nDaher keinerlei Empfehlung von mir.",
					""
				]
			}
		},
		{
			"id": "rpMbI87",
			"title": "WD 2TB My Passport SSD Portable External Solid State Drive, Gray, Sturdy and Blazing Fast, Password Protection with Hardware Encryption - WDBAGF0020BGY-WESN",
			"price": "$234.99",
			"image": "https://m.media-amazon.com/images/I/81y8P1up-PL._AC_SY450_.jpg",
			"description": "Save, access and protect the content that matters to you with the My Passport SSD, giving you accelerated read speeds up to 1050MB/s and write speeds of up to 1000MB/s with NVMe technology. Help secure your drive and keep productivity flowing with password enabled 256-bit AES hardware encryption. Resist drops of up to 6.5ft (1.98m) with a sleek, durable metal design that is both shock and vibration-resistant. Find peace of mind with the fastest My Passport drive to date, able to simply backup your data and is compatible with Mac and PC, ready to use right out of the box.",
			"reviews": {
				"customerProfileNames": [
					"kimber1911",
					"AZ",
					"TimP.",
					"G.Jackson",
					"teag",
					"AlexC.",
					"EricH.",
					"AUselessNoob"
				],
				"customerProfilePictures": [
					"https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif",
					"https://images-na.ssl-images-amazon.com/images/S/amazon-avatars-global/e6b0baa9-65e8-41db-9076-a2750f999f7f._CR0,0,430,430_SX48_.jpg",
					"https://images-eu.ssl-images-amazon.com/images/S/amazon-avatars-global/0ebacdad-df7b-480f-b828-43069db81965._CR0,0,500,500_SX48_.jpg"
				],
				"customerRatings": [
					"1.0 out of 5 stars",
					"1.0 out of 5 stars",
					"1.0 out of 5 stars",
					"5.0 out of 5 stars",
					"1.0 out of 5 stars",
					"5.0 out of 5 stars",
					"5.0 out of 5 stars",
					"1.0 out of 5 stars"
				],
				"customerReviewTitles": [
					"Can’t recommend",
					"Beware of SSD copy file structure and \"Real\" available space",
					"PRODUCT SERIAL NUMBER INVALID - Listen to the reviews!",
					"Smaller than expected",
					"DOES NOT WORK WITH MAC BIG SUR!!!",
					"WOW!! I'm impressed!",
					"Fast and Tiny External SSD",
					"Unreliable - Corrupts Your Data"
				],
				"customerReviewBodies": [
					"Minor cosmetic imperfection on top, front or sides of item. Minor cosmetic imperfection on bottom or back of item. Missing bonus material. Missing manual. Item will come in original packaging. Packaging will be damaged.",
					"The hard drive performs as expected. It does get hot when transferring large files. Unfortunately I can’t recommend it. I attempted to register is with WD and they are claiming the Serial Number is invalid even after sending the picture of the hard drive and the box showing the SN.",
					"Backed up files from my computer and discovered that ~250 GB of files on my computer resulted in >550 GB size on the SSD after back-up! After discussion with WD Manufacturer, I determined SSD geared more towards fast playback of large files (music, gaming, etc.) Vs storing of day to day files. Note - there is no way to change this setting for the SSD. So, this SSD would have only let me copy ~430 GB onto the 1 TB SSD!\n\nRecommendation is to stick with HDD. I went back and purchased another WD HDD!",
					"I should have listened to the other reviews that said they were not able to register their product. I tried to register two of these Western Digital SSD's and they both came up invalid. I contacted WD customer support and submitted all of the information that they requested (receipt, SN, part number, and pictures of them). After one week I had not heard back from WD, so I contacted support again. They told me I already filed a form and they are working on it. Here I am 15 days later and WD still has not validated the serial numbers. If I cannot register these products, I have no warranty on them and I cannot get support for them. So, they are being returned. I feel 2 weeks is an unacceptable amount of time for them to verify if they are valid WD products.",
					"One of, if not the, fastest write speed on the market at USB 3.2. I can store my entire music library on this SSD for the car.",
					"EXPENSIVE Piece of garbage. To use this drive with a MAC, you have to download a third party app and PAY $50 to use it! Otherwise, you will not have read/write capability on your drive. This is scandal! I am outraged. This is an expensive piece of junk, and WD should not sell it. If WD intends to have this product used with Big Sur OS, then it should update and provide the WD Utilities software and not direct customers to a third party to pay for it!",
					"I'm so impressed, and VERY satisfied. First, it's been a while since I needed an external hard drive. The one I had is an old 5200 rpm USB 2.0 external drive. It's held up well over the years but I didn't like having to pull out the USB adapter my my MacBook Pro (with USB-C) and large video files were transferring far too slow. So I started looking for a USB-C compatible fast and lightweight portable drive. After finding the WD My Passport SSD, I am beyond impressed!!! The thing fits in the palm of my hand and is about as thick as 4 credit cards. It's also LIGHTNING fast. It transferred 5 GB in about 3 seconds and a 13 GB mov file in about 13 seconds. I have never seen transfer speeds like this before. For the price, I consider the value of this little device amazing. Well done WD! Very happy with this purchase!!",
					"Just got this yesterday but so far so good. It’s quite a bit smaller than I was expecting, but performs well! Does seem to get a little warm during heavy write activity- but I don’t have any experience with other drives of this style to compare to. Warm, but I wouldn’t call it hot to the touch. Design is nice and it looks good on my desk sitting with my Mac Mini. The provided USB-C cable is too damn short. Probably fine if you’re using this actually as a mobile drive you take with you- but for me it stays attached to my Mac Mini for my photo, music, and movie libraries. Will probably have to pick up a longer cable at some point. Western Digital is known for quality and I expect no less out of this drive. Obviously time will tell- and if anything goes wrong I’ll update this review- but so far so good!",
					"This drive is unreliable. I’ve used Western Digital hard drive products for many years without issues, but it seems that they were too quick to jump on the SSD bandwagon without doing adequate product development/quality control.\n\nIt began corrupting my data from day 1. The drive itself does not identify any bad sectors, and running CHKDSK and performing low-level format has no effect. Based on the observed symptoms (corrupted blocks in images files, weird color blocking in PDFs, etc), I’m led to suspect that the drive is just riddled with bad bits. They’re still writable, so the drive doesn’t mark them off as bad and just keeps using them. Unfortunately, that’s not good if you want data integrity.\n\nLuckily I caught the problem on the second day, and my data was safely backed up elsewhere, so unlike some people I did not experience a total loss of data. But I easily could have, and that’s what concerns me.\n\nSSD is not a new concept, and companies have been making reliable SSD storage solutions for years - my previous computer had an SSD primary drive that worked fine for over 4 years. That a well-known company like Western Digital can’t figure this out in 2021 is a little concerning.",
					"Smaller than expected. Bought this for use with PS5. Speed is easily 10 x faster than my previous external HDD. I'm not sure if it's the PS5 firmware yet but when I transferred a lot of large games to/from it (nice and quickly :-), it would occasionally freeze on a loading bar and the PS would have to repair it then it was back fine. Done this a few times in a couple of days. Hoping a PS firmware update fixes this as other reviews sound great. It does get quite warm but never hot. 5 year warranty is great too, if WD's registration page worked properly that is. Tentative thumbs up for now.",
					"T",
					"The cable supplied with this drive is ridiculously short. 150mm including the C type USB plugs. Any one buying will need to factor in buying a sensible length of cable as this is unusable.",
					" After using a 2TB Seagate external hard drive for years for photo and video editing, I decided I needed a faster drive. From all the research, I found this hard drive to be the best one available for the money. Although it is expensive, it's fast!",
					"it does exactly what its designed to do and does it very well, i use it on a mac as a backup for my NAS drive, had no difficulty at all converting it from the defaul EX FAT to mac os format, SSD really is the way to go now, the cable could do with being a bit longer but nothing really to complain about."
				]
			}
		},
		{
			"id": "2xfMmG8",
			"title": "SAMSUNG SSD T7 Portable External Solid State Drive 1TB, Up to 1050MB/s, USB 3.2 Gen 2, Reliable Storage for Gaming, Students, Professionals, MU-PC1T0T/AM, Gray",
			"price": "$109.99",
			"image": "https://m.media-amazon.com/images/I/91YfRIy7kYL._AC_SX450_.jpg",
			"description": "The light, pocket-sized Portable SSD T7 delivers fast speeds with easy and reliable data storage for transferring large files. Whether you're storing critical business documents, games, or movies, the Portable SSD T7 gives you speed and durability in a palm-sized package. Introducing the new standard in external storage, available in three capacities to suit your needs: 500GB, 1TB, or 2TB. Samsung recommends users to download the latest firmware update via the included Portable SSD Software 1.0 to ensure optimal performance. Data transfer speed may vary depending on the user's PC environment and the types of data being transferred. USB 3.2 Gen2 and UASP support are required for maximum transfer speed (1,050MB/s). Samsung recommends the usage of the included USB Type-C to C and USB Type-C to A cables. Non-original cables may cause performance degradation due to the varying internal resistance and maximum allowable currency. Performance may vary depending on host configuration. To reach maximum read/write speeds of up to 1,050/1,000 MB/s, respectively, the host device and connection cables must support USB 3.2Gen 2 and the UASP mode must be enabled.Based on an internal free fall shock test conducted under controlled conditions. According to the Samsung internal quality standards for heat management and safety, T7 maintains its outer casing temperature below 118.4º F, except when the ambient temperature is above 118.4º F. Software requires Windows 7 and higher, Mac OS X 10.10 and higher, or Android 5.1 (Lollipop) and higher. Older versions of the Windows, Mac, and Android operating systems may not be supported. Firmware update requires PC or Mac and internet connection. Android app available on Google Play. Compatibility with host devices may vary. Some operating systems may require T7 Touch reformatting. Please find the compatible devices list on Samsung's website. T7 Touch is compatible with USB 3.0 and USB 2.0.",
			"reviews": {
				"customerProfileNames": [
					"CaliFilm",
					"W.Chilton",
					"Judy",
					"richardb",
					"dragoonslayer12",
					"Talisman"
				],
				"customerProfilePictures": [
					"https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif",
					"https://images-na.ssl-images-amazon.com/images/S/amazon-avatars-global/e0054671-c4d7-4db8-948a-3b537b8e03de._CR0,48.0,236,236_SX48_.jpg"
				],
				"customerRatings": [
					"3.0 out of 5 stars",
					"3.0 out of 5 stars",
					"1.0 out of 5 stars",
					"5.0 out of 5 stars",
					"5.0 out of 5 stars",
					"1.0 out of 5 stars"
				],
				"customerReviewTitles": [
					"Seems to be fast drive!! But.........",
					"Fast drive with issues",
					"Don't buy Samsung SSD T7 stick with the T5",
					"2017 iMac Blazing Upgrade",
					"Must buy for ps5",
					"Beyond Awful"
				],
				"customerReviewBodies": [
					"Been a Samsung T5 owner for a while, and couple other SSDs.\nWas excited that Samsung got a USB 3.2 SSD, which should be much faster.\n\nNOTE: If you want to be able to take full benefit of the T7 Drives, You need to have USB-C 3.2 Gen 2 on your PC/Laptop!! Without the USB-C 3.2 Gen 2 ports, it will perform pretty much like the T5.\n\nI have tested on my 2019 Surface Laptop 3 with USB-C 3.2 Gen 2 support. I was able to get the full speed from the best, and also copying files to it. Seems to be very fast!! But!!! As the file gets larger, the speed/performance started to decrease. This is not noticeable if the file size is smaller than 1gb, but once the file gets larger then 1gb, the larger they get, the worse the performance gets. I have also tested the T7 on my 2014 Macbook Pro, with USB 3.0. The speed test shows that its about the same speed as the T5.\n\nBottom line, When transferring smaller files, the T7 is super fast!!! As file size gets bigger, especially lager than 1gb files, you will start to see some performance/speed decrease. Since I do a lot of video editing, and files can be huge, this can be a problem for me. I think I will wait to upgrade to the newer T7 drives. Until the speed can be improved, and more stable.\n\nHere is my test, and experience\n\nTested with my new MS Surface Laptop 3 13\", with USB-C 3.2\n\nCrystal Disk Mark tests 1gb ( see attached photo for test details)\nT7\nSEQ1M read: 1055.43 MB/s\nSEQ1M write: 938.51 MB/s\nRND4K read: 273.95 MB/s\nRND4k write: 272.41 MB/s\n\nT5\nSEQ1M read: 565.00 MB/s\nSEQ1M write: 522.20 MB/s\nRND4K read: 237.65 MB/s\nRND4k write: 196.17 MB/s\n\nActual File Coping Experience\nT7 File transfer\n1gb: 3 seconds\n10gb: 22 seconds\n\nT5 File transfer\n1gb: 4 seconds\n10gb: 35 seconds",
					"This drive lives up to its speed claims, right around 900mb/s on my iMacPro... but. The drive runs very hot, even when its idle. I have it sitting right next to its brother, a Samsung T5 2TB SSD and that drive never gets hot even when hiting it hard (temp right now is (87-degrees F) while the T7 is hitting 100+ degrees F at idle.\n\nSometime the temperature of the T7 spikes very hard and the drive unmounts itself. At that point I am forced to unplug it, let it cool and then plug it back in. The it will run normally for a time before starting to run hotter and hotter.\n\nI've read all about this drive's fancy thermal management, but I don't buy it. You probably shouldn't either. get the T5. Its half the speed, but still fast, and more importantly it wont burn itself up.",
					"Avoid Samsung SSD T7. My experience is similar to the experiences others have had with this product. Specifically, SSD causes computers to over heat. The SSD also gets extremely hot! The issue does not correlate to i/o or computational load. The issue occurs the moment the SSD is attached to the computer. Interestingly, the Samsung T5 does not have these problems. It is my conjecture that the T7 is simply an overclocked T5. If my suspicions are true Samsung is engaging in very shady business practices. Please do your self a huge favor and avoid the T7 as it will ruin your hardware.",
					"So it reads/writes at some 1,000 Mb/sec while Apple iMac hard drive 5400 rpm pokes along at 20-40 mB/sec. Boots up now it has replaced apple OEM at blazing speed through a Thunderbolt port. Used a rubber band to attach to bottom of iMac metal frame support to help dissipate the tolerable heat. Quick start up time, quick apps. So new new Mac for a few years nor :) Well worth the $ to jump ahead of the Samsung T5 at 540 Mb read/write speed. 3 year warranty.",
					"TL;DR: plays as if it’s internal, a must buy for backward compatible games.\n\nI’ve been looking for videos, test, whatever for external SSD’s for backward compatibility on the ps5, and I seen one video where somebody did test an external SSD, and he said the games running on the external is just as fast as the internal, so I jumped the gun and bought this. YES, it is just as fast. A second or two slower, but you get all the benefits. Higher frame rates, higher resolution, faster loading, quicker responsive time.\n\nKingdom Hearts III is my “go to” for all of these, cuz on ps4 pro (HDD), the loading between worlds takes about 2 minutes and 20 seconds, when things get hectic, the frame rate dips a little (not enough to matter) and the responsiveness takes a (noticeable) hit. On the ps5’s internal ssd, it takes 20 seconds to load from world to world, and everything is perfect with upgraded visuals. On the external ssd; 22 seconds to load world to world, and everything runs perfectly as if it is installed onto the internal ssd.\n\nResident Evil 3 is my second test cuz while it runs perfectly on the ps4 pro, it is much more responsive on the ps5 (aiming) and a little faster. On the ps4 pro and Xbox One X, when Jill walks down a set of stairs as she covers her face, she can barely get half way down the stairs before she resumes her normal pace. On the ps5 (both internal ssd and external ssd), she gets to the bottom of the stairs before resuming normal pace.\n\nI’ve tested FF XV and a few other games, and they all run as if they’re running on the ps5ms internal ssd. This is a must buy for ps4 games running on the ps5. I wish there was a 4tb version (which would hold all of my games, 180+, ranging from 10gb-200gb), but the 2tb is perfect for selective titles I intend on playing, rather than holding my entire collection.\n\nOnce again, buy this for backward compatibility on os5. Same results should apply for Xbox Series X and S.",
					"T",
					" Product: 2TB Samsung Non-touch Blue Colour Portable SSD\n\nThe T7 came in a nicely sealed box. I was quite surprised that the product was manufactured in South Korea.\nThe box includes 2 USB cables, one manual, and the T7 device.\nIt comes with 1 USB-C to USB-C cable, capable of delivering up to 10Gbps, and a USB-C to USB 3 cable.\nBoth cables are about 40 cm long and the construction is very well built. I have no doubt they will last many years unless I exert some great physical abuse. Both cables fit very snuggly in the T7 body. Even if you are the type of person who likes to hang the SSD in the mid-air, I am certain that the device won't fall off unless you intentionally pull it off.\nThe device is very light. According to Samsung, T7 only weight 58 grams. It is a size of a credit card and about the same thickness of an iPhone 8. The SSD is enclosed in a solid metal body. I believe the metal body was used to dissipate heat faster to reduce throttling caused by heat.\nThe main reason why I purchased T7 without the fingerprint sensor is because of the price difference for technology that I will not be using. In order to use the fingerprint sensor, you need to encrypt the device using Samsung's application. The Samsung application will do the hardware encryption, which was notoriously known for its vulnerability to attackers. I am sure that Samsung fixed this bypass but I will stick to the more secure APFS encryption.\nI had some trouble installing the Samsung application on my Mac. When I launched the application, the software was not able to recognize my SSD. After many troubleshooting, I found out the Samsung SSD had to be formatted in APFS (non-encrypted) file system in order to be recognized. After formatting, I was able to do the hardware encryption with the application.\n\nThe performance of the device was solid. When hardware encrypted, it had no performance hit compared to having no encryption. However, after using the device for 30 minutes, I have noticed some degradation in performance due to throttling caused by heat. On average, it was hitting 890MB write and 900MB read speed. With some throttling, this number went down to 850MB wite but still respectable 900MB read speed.\nWith Apple's APFS Encryption, the performance had about 20 to 23 percent hit.\n\nCompared to my SanDisk Extreme SSD, the device is slightly cooler to touch. Form factors are about same, where SanDisk is slightly longer but narrower compared to Samsung T7.\n\nOverall, given the robust construction, solid performance, and small form factor, I am giving it 5 stars.",
					"This drive is frustrating. Everything about is amazing except when you need it to be. It transfers files blazing fast and is so small and portable. However, do not buy this if you need to read/write from it continuously. The drive will consistently crash and disconnect from your system about every hour if you use it consistently. Very frustrating when trying to use it as a game drive or if you wanted to edit footage off of it.\n\nUpdate: Drive needs more power than is supplied over my USB-C/Thunderbolt 3 port. Had to buy a powered adapter to make it work which is very annoying but at least it's a solution for anyone that encounters a similar issue.",
					"DON’T BUY! After a a few months of storing files on this device it gave me a notice saying “you need to format the disk before you can use it” and now all my files are gone",
					"Wow has technology come a long ways since I bought my last portable drive!\n\nUsing the T7 in a Tesla Model 3 for the Sentry mode / dash camera recordings. Works flawlessly; totally overkill but should last for darn near ever.\n\nFor the price is a great deal; very sleek, super fast, and comes with two different USB cables.",
					"Yo lo compre para usarlo con un PS5 para pasar todos mis viejos juegos de PS4 y no tener que usar espacio interno de consola para ellos. Lo unico que recomiendo antes de usarlo es descargar el software de samsung para actualizar el firmware del SSD. Por otro lado la primera vez que lo conecte al PS5 en el dia de lanzamiento se calentaba muchisimo, pero con updates posteriores de la consola parece que arreglaron este problema porque ahora se calienta pero una cosa normal. Por el rendimiento no he tenido ningun problema. Me gusta que es compacto aunque me hubiera gustado que el cable fuera un poco mas largo, eso si no recomiendo usar otro que no sea el provisto por samsung ya que podria verse afectada enormemente la velocidad de transferencia. Para mi ha funcionado bastante bien y era justo lo que necesitaba.",
					""
				]
			}
		},
		{
			"id": "sz34Ws8",
			"title": "Samsung Electronics 870 EVO 2TB 2.5 Inch SATA III Internal SSD (MZ-77E2T0B/AM)",
			"price": "$179.99",
			"image": "https://m.media-amazon.com/images/I/911ujeCkGfL._AC_SX450_.jpg",
			"description": "The latest 870 EVO has indisputable performance, reliability and compatibility built upon Samsung's pioneering technology.\n\n*Performance may vary based on SSD’s firmware version and system hardware &\nconfiguration. Sequential write performance measurements are based on Intelligent TurboWrite technology. Test system configuration: Intel Core i7-7700K CPU @ 4.20GHz, DDR4 1200MHz 32GB, OS – Windows 10 Pro x64, Chipset: ASUS PRIME Z270-A. All performance data was measured with the SSD as a secondary\n\n***5-years or TBW, whichever comes first.\n\n****Compatibility tests conducted with Samsung internal, AMD, MSI, Gigabyte, Synology, QNAP, BlackMagicDesign and ATMOS.",
			"reviews": {
				"customerProfileNames": [
					"JustSaying",
					"C.Cox",
					"DeejayG.",
					"Zunicat",
					"JarrodKatie",
					"MarkN",
					"AliciaVanHecke"
				],
				"customerProfilePictures": [
					"https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif",
					"https://images-na.ssl-images-amazon.com/images/S/amazon-avatars-global/bc86d5e8-76a2-4196-8730-3f04503e6644._CR0,0,340,340_SX48_.jpg"
				],
				"customerRatings": [
					"5.0 out of 5 stars",
					"5.0 out of 5 stars",
					"5.0 out of 5 stars",
					"5.0 out of 5 stars",
					"5.0 out of 5 stars",
					"5.0 out of 5 stars",
					"1.0 out of 5 stars"
				],
				"customerReviewTitles": [
					"It's a Samsung SSD",
					"Works great!",
					"Purely Excellent!",
					"Great SSD but Samsung copy program did not work.",
					"Best SATA SSD on the market right now!",
					"Braindead Installation",
					"Incompatible Disk - Wrong Sector Size!"
				],
				"customerReviewBodies": [
					"Small cosmetic imperfection on top, front or sides of item. Small cosmetic imperfection on bottom or back of item. Missing bonus material. Missing manual. Item will come repackaged.",
					"Clicked on add to cart in the morning, downloaded the samsung migration software from their website.\nBacked up my disk . At 5:30 PM it arrived. Started the backup. After dinner the computer was shutdown, removed the old SSD and put this one in it's place, and boom - up and running with a bigger SSD. Piece of cake.",
					"I purchased this to replace an aging and error prone mechanical disk in my mother's old laptop. After finally getting her original drive to clone over, everything has been great. The installation was as simple as replacing the drive and turning on the computer. It starts up and shuts down very quickly, and the programs start up a little quicker as well.\n\nIf you are trying to replace your drive and copy all your files over, make sure you have or purchase a SSD to USB cable. This just has the drive in the box with some less than stellar instructions.\n\nThis is the best upgrade option in an aging system without having to buy a brand new computer.",
					"Thus far, The Samsung 870 EVO 1TB is working flawlessly. I upgraded from the 850 EVO 500GB I purchased 5 years ago. I noticed the 850 drive performance started to diminish, not a lot; but noticeable. Once I use the Samsung Migration Software to transfer my Operating system to the new 870 EVO, the performance was night & day; purely excellent! Fast boot up time, averaging 18 seconds from a cold boot.",
					"Drive performance is great. Better than a new PC with HDD. I replaced a spinning HDD in an ASUS all in one PC, 2016 vintage. I tried 2 different versions of the Samsung copy program. They both appeared to run the copy. Than I replaced the old C drive with the SSD and no Windows 10. Initially went to the Samsung site listed with the drive. It did not have any downloads for the 870 SSD. So I used the generic version. I searched and found another Samsung site that did have a copy version specifically for the 870 SSD. Neither worked. Finally used Acronis. It took half the time and made the copy with no problem. The original HDD was a 3.5 inch. Possibly the copy problem was caused by going from 3.5 to the 2.5 size.",
					"After researching and reading many reviews, I knew this was the SSD I needed. My old hard drive died right after I ordered this (conveniently) and am very impressed by the performance. Read and write speeds are insane and the space it saves in the case is welcomed. Same storage space as my old HDD, but everything transfers over in no time and boots to the desktop in about 10 seconds. Highly suggested to anyone looking for an upgrade.",
					"T",
					"U",
					"Below is the response from Samsung regarding failed SSD\nGreat SSD until it fails and the it's\n\nHello Customer,\nThank you for your response. Unfortunately, we were unable to process your warranty request. Your SSD 870 EVO 2TB is a Canadian model (Serial#:S620NG0R303301R ). In Canada, all warranty support for Samsung memory products (SSDs, SDs, HDDs, USBs) is the responsibility of the retailer, at the point of purchase, including online purchases. We apologize for the inconvenience this has caused you. Please take the warranty letter below to your place of purchase for further assistance.\nCanada Warranty Letter:\nssd_warranty_letter.pdf",
					"If you're upgrading an older laptop, or just replacing a spinning HDD in something fairly new, this is a solid value SATA SSD. Samsung SSD have always proven to be fast and reliable.\n\nRemember that fresh SSDs often don't appear as a drive in Windows until you do into disk management and format it! It's recognized, it just doesn't show up as a drive until you complete that step. At that point, if you're using it for new storage, it's ready to go. If you're replacing your boot drive, make sure to clone the old one first. After cloning, swap them out, reboot, and it's like nothing changed except the speed that everything loads in!",
					"I",
					"U",
					"Installed this in a 2010 MacBook Pro. WoW. It's was like the dead coming back to life. Easy install took about 20min. The transferring of data on the other had was LONG. But once done my Mac runs better than when I first got it. More than happy with its speed and size. A great investment if you're havingng space or speed issues with an older device."
				]
			}
		},
		{
			"id": "rWrR6JV",
			"title": "BUFFALO External SSD 1TB - Compatible with PS4 / PS5 / Windows/Mac - USB-C - USB-A - USB 3.2 - External Solid State Drive - SSD-PG1.0U3B",
			"price": "$99.99",
			"image": "https://m.media-amazon.com/images/I/710WEX3bh0L._AC_SY879_.jpg",
			"description": "The Buffalo SSD-PG is an award-winning external SSD drive (Solid State Drive) that gives you fast, secure file storage that you can fit into your pocket. With its durability, compact form factor, and lightning fast SSD speeds, you can always have your data with you. The portable and powerful SSD allows you to easily back up all your data without needing to upload them the cloud. Even if you are in a remote location with no Internet, you will still have a backup of all your files. The best budget SSD at 500GB & 1TB capacities.",
			"reviews": {
				"customerProfileNames": [
					"M.S.Mec",
					"Mr.Tepig",
					"YusukeS.",
					"Cats.",
					"JanineAlure",
					"GaryF.Thomas",
					"YL",
					"JonIves"
				],
				"customerProfilePictures": [
					"https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif",
					"https://images-na.ssl-images-amazon.com/images/S/amazon-avatars-global/e94229a7-aff6-4d19-ad5f-a9f2d465fa05._CR0,0,500,500_SX48_.jpg"
				],
				"customerRatings": [
					"5.0 out of 5 stars",
					"1.0 out of 5 stars",
					"5.0 out of 5 stars",
					"1.0 out of 5 stars",
					"5.0 out of 5 stars",
					"5.0 out of 5 stars",
					"5.0 out of 5 stars",
					"5.0 out of 5 stars"
				],
				"customerReviewTitles": [
					"Clean, fast drive",
					"DO NOT BUY! I lost all my data after only 2 weeks...",
					"The SSD is a best device, soo stress free!!",
					"I would suggest avoiding this if you have an AMD Cpu.",
					"Little black box stores that data.",
					"Fast and inexpensive",
					"Excellent for the iPad Pro",
					"Blazingly Fast!"
				],
				"customerReviewBodies": [
					"First impression is that the drive is well made and small. It is great that a usb cable and type C adapter is provided. One of the best thing is no bloatware on the drive - just a bare drive, a welcome change. Quick speed test with a 700 MB video file showed ~200 MB/s write and ~160 MB/s read. No issues with video playback of high bitrate Full HD.",
					"T",
					"I",
					"I bought this for my new laptop. At first I was excited. Plugged it into my old pc, and it worked great, I started to move over files, installed some games on it. Tested it, it was good. Laptop gets here, I'm excited. Plug it in... instantly crashes the laptop. Tried again, crashed it. Crashed again. Worried the drive broke or corrupted, I plugged it into my old computer, and it worked fine. 488 mb/s transfer speed.\n\nConfused, I looked through the little papers that came with the drive. One one it says \"incompatible with certain amd processors.\" God knows why they wouldn't put that into the easy to see info before I purchased the thing. It works on my old intel pc, but constantly crashes on my new AMD laptop? To solve the issue, the card suggests going to d.buffalo.jp/SSD-PG/ where you can download \"usb mode manager\" to solve the compatibility issues. Welp, when I run it, it tells me there are no compatibility issues. Clearly there are, otherwise it wouldn't work on an intel system but crash on an amd one. Waited 24 hours buffalo support but with no reply, I've decided to return the drive and buy one from another brand.\n\nSo i guess, but be weary if you're running and AMD system.",
					"This 1 tb comes in a simple well protected package. Larger ssd. Stores data as anticipated. Good little unit.",
					"Good price, great performance, comes with a USB 3 A to USB 3 micro cable and an adapter to connect to USB C. Small, light, fast, easy to toss in a bag and carry with you.",
					"I just got my 1T SSD. I like this simple design, and it is very light. I formatted the SSD to exFAT and tried to connect with my iPad pro to back up the data. Everything works perfectly. I was able to copy all my photos and movies from my iPad to SSD, and I could watch movies directly on my iPad while connecting the SSD. I connected the SSD with my desktop and backed up all the data to the SSD as well. It functioned properly and perfectly. I am very happy with the quality of this device; especially the price for this model is very cheap compared to other brands.",
					"I got this hard drive because my 3TB external hard drive was seriously lagging when editing iMovie and running other programs. The first thing that I noticed was that iMovie clips rendered extremely fast! Sometimes before I could even scroll. This is exactly what I was looking for. The downside of every SSD is, of course, the storage capacity. I had to downgrade to a 1TB to be able to afford it. *sigh* Maybe in the future...",
					"Does NOT WORK for Sony Playstation 5 disc edition. Says not compatible. I'm sure my son will find another use for it so my $200 doesn't go to waste."
				]
			}
		},
		{
			"id": "HJEzWZO",
			"title": "SAMSUNG 870 QVO SATA III 2.5\" SSD 1TB (MZ-77Q1T0B)",
			"price": "$89.99",
			"image": "https://m.media-amazon.com/images/I/91S1PIX+yWL._AC_SX450_.jpg",
			"description": "Sequential Read/Write performance reaching up to 560/530 MB/s provides best in class performance via the SATA interface. Accelerated read performance up to 13% faster than 860 QVO for added benefits for everyday computing. 870 QVO provides adequate amount of TBW for daily use, equivalent to 3 bit MLC SSDs and offers up to 1. Expanded capacity up to 4TB for client SSD in 2.5” 7mm form factor. 720 TBW for 2TB model and 1,440 TBW for 4TB model. whichever comes first..",
			"reviews": {
				"customerProfileNames": [
					"JoelRice",
					"Lena",
					"BohdiTree",
					"MarcMatthews",
					"FreshNUNruly"
				],
				"customerProfilePictures": [
					"https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif",
					"https://images-na.ssl-images-amazon.com/images/S/amazon-avatars-global/c29e3bf2-e2e2-4e6d-80ad-05c92e9fc7c5._CR0,0,399,399_SX48_.jpg"
				],
				"customerRatings": [
					"5.0 out of 5 stars",
					"5.0 out of 5 stars",
					"1.0 out of 5 stars",
					"5.0 out of 5 stars",
					"5.0 out of 5 stars"
				],
				"customerReviewTitles": [
					"Works for my PS4",
					"The ONLY review you'll need to look at",
					"Received a used drive. At first Amazon refused a refund.",
					"As advertised and decent price",
					"Great SSD"
				],
				"customerReviewBodies": [
					"Small cosmetic imperfection on top, front or sides of item. Small cosmetic imperfection on bottom or back of item. Missing bonus material. Missing manual. Item will come repackaged.",
					"Having just recently bought a Playstation 4 Slim, I quickly became aware of the dilemma of storage. I read that PS4s \"officially\" support up to 2TB but people have been able able to use SSDs with much higher storage than that. Seeing that a 6TB SSD costs more than a brand new PS4 Pro, I decided to go with 4TB and hope for the best. Bottom line, it works fantastically and load times are almost a thing of the past. I'm pretty confident I'll have enough storage for all the PS4 games I want, especially since I'm more of a PS1 and PS2 guy at heart and those take up WAY less space.\n\nA few things to note: this drive is very thin so you'll need to hold it up in the caddy for the screws to catch. The only major thing is that it is not plug-and-play with the PS4. I was able to pop a new SSHD into my fat PS3 and the UI still worked and it re-downloaded the update file on its own. The PS4 absolutely will not work with just a new drive, you have to download the update file from the official Playstation website, save it to a USB flash drive (folder \"PS4\", subfolder \"UPDATE\" or it will not find the file), and reinstall the entire UI from there. Luckily my system preferences were saved to my PSN ID so I didn't have to redo those. No issues after that entire process, though.",
					"H",
					"I",
					"I took a risk on buying this new drive before many reviews were out. I based this on the controller being the same as the previous gen, but the \"new\" is the storage tech. The drive does not disappoint (after 72 hours installed) - speeds are as advertised (fast). Time will tell if it holds up, but the price is cheaper than the previous gen and it's faster!",
					"the name speaks for its self. No issues installing to my PC hot swap, have taken it out several times and put back in and there are no issues what so ever.\n\nTrue 5 stars",
					"This is NOT a bad review of the 870 QVO. I had purchased it expecting it to work with my MacPro 5,1 running OSX High-Sierra. The computer was able to read and write to the drive. However, when using it as the OSX bootable disk, the computer would not boot-up. I tried using APFS and Mac OS Extended (Journaled) and both attempts failed after many tries. So this is info for anyone thinking about installing the 870 QVO in an older Mac. After my issues, I did a deep dive down the rabbit hole of forums and eventually found some info from others who say this SSD will not work properly on some macs and advised to instead use the 860 EVO which many have had success with (I have ordered an 860 EVO).\n\nSo this is not a negative review - Samsung SSDs get high marks from many. This is more of a general comment/feedback for others regarding compatibility so they don't have the same issues I encountered.",
					"Around 530M/sec read speed which is Standard for mainstream SATA3 ssd, as for the write speed it is a little bit tricky, this SSD has a 6-78G dynamic cache for 2TB and above models, a 42G cache for capacity below 2TB, before the cache been filled up the write speed is about 500M/sec, again it is comparable to other mainstream TLC/MLC SATA3 SSD, however, once the cache been used up write speed decrese sharply to 160M/sec for 2TB and above models, which is still a tad faster than most 7200rpm HDDs, but for models have less capacity the write speed is ONLY 80M/sec which is FAR worse than HDD even at 5400rpm! To make things worse, it took VERY long time to release the cache, I copied 650G files from my 4TB ssd into this one, the cache filled up only few secs in, the speed down to 160M/sec and stayed there for the rest of the time, it took a bit more than 1 hour to finish the transfer and it never done releasing it's cache during that time. BTW, if you use sumsung's tool kit bechmark the drive it will gave higher numbers which I found less accurate, according to it mine was 561M/sec read 531M/sec write.\n\nConclusion, if you want buy a ssd with 4TB or less capacity then don't buy this QLC model especially those models below 2TB, with cache been filled up they have the worst perfomance I have ever see! There are plenty better ones from other brands as well as sumsung itself which don't have cache issue, some of them are even cheaper. In my opinion only 8TB model is worth buying WHEN they are ON SALE as it's pretty much the only 8TB SATA3 SSD in the market right now.",
					"Fácil de instalar, reduziu o tempo de inicialização da máquina para cerca de impressionantes 4 segundos.\n\nNão é exatamente barato, mas a melhoria de performance é incrível.\n\nExistem algumas considerações:\nBaixe o programa da Samsung para fazer a imagem do HDD antigo (Samsung SSD Data Migration)\nConecte o SSD via porta USB ao computador, execute o programa e ele fará a imagem do seu HDD velho no SSD. Não desligue nem mexa no computador enquanto não terminar o processo. Se for um laptop, faça isso com ele ligado na tomada.\nUma vez concluído o processo, desligue a máquina, se for um laptop, remova também a bateria.\nSe você nunca fez isso antes, sugiro ler as instruções da Samsung ou ver algum vídeo no YouTube antes para se familiarizar com as etapas do processo de substituição do HDD pelo SSD.\nSe for um laptop, procure pelo Manual de Serviço de modelo na internet. Assim você saberá como acessar o compartimento do HDD sem danificar a máquina.\nAbra o acesso ao HDD, remova o HDD antigo conforme instruções que você viu.\nConecte o SSD e o instale no lugar do HDD antigo.\nFechae a máquina, coloque a bateria, ligue na tomada e ligue o computador.\nNa primeira vez vai demorar alguns segundos mais. Mas de qualquer forma, você verá que a velocidade até carregar o Windows será grandemente reduzida.\n\nSugiro que você guarde o HDD antigo (não formate nem apague às menos que você tenha absoluta certeza que não vai precisar.) Se algo der errado, você terá um backup funcional.\n\nOutra sugestão é: se possível, aumente a memória RAM da sua máquina. Veja no manual do modelo, a capacidade máxima suportada e o tipo. Estas duas ações combinadas vão renovar a duração da sua máquina por mais alguns anos (minha experiência foi com processadores Core 5, não sei se valeria à pena fazer isso com um processador mais fraco que isso.)",
					"",
					"Opened up the package and installed Samsung magician. Hooked it up to find the serial number and found it was counterfeit drive. No proper serial number and can’t bench mark it. Sent it back as incorrect information listed on the ad.",
					"É um bom SSD, mas não sabia da diferença das células QLC pras outras, esse tem uma escrita extremamente lenta para arquivos grandes, mais lento mesmo que um HD comum. Precisei transferir mais de 30 GB de arquivos para ele e nos primeiros segundos estava tudo ok, porém 10 ou 20 segundos depois a velocidade caiu para 80 MB/s, enquanto um HD comum geralmente escreve a 150~200 MB/s.\nComo não tenho costume de escrever quantidades grandes nesse nível isso não vai me afetar muito, porém estou decepcionado devido à marca utilizar uma tecnologia que não barateia tanto o custo do produto final, visto que outros SSDs de outras marcas que utilizam TLC são até mais baratos.",
					""
				]
			}
		},
		{
			"id": "uzO9qZB",
			"title": "BUFFALO External SSD 500GB - Up to 600MB/s - USB-C - USB-A - USB 3.2 Gen 2 (Compatible with PS4 / PS5 / Windows/Mac) - External Solid State Drive Stick - ‎‎‎SSD-PUT500U3B",
			"price": "$74.99",
			"image": "https://m.media-amazon.com/images/I/61zDXh6e7uL._AC_SY879_.jpg",
			"description": "The Buffalo SSD-PUT is an award-winning external SSD stick (Solid State Drive) that gives you affordable fast, secure file storage that you can fit into your pocket. With its durability, compact form factor, and lightning fast SSD speeds, you can always have your data with you. The portable and powerful SSD allows you to easily back up all your data without needing to upload them the cloud. Even if you are in a remote location with no Internet, you will still have a backup of all your files. The best budget SSD drive in a compact flash drive form factor. Available in 500GB & 1TB capacities.",
			"reviews": {
				"customerProfileNames": [
					"Munchiniwa",
					"KingJoffe",
					"B.Covington",
					"DarrenDuffy",
					"Nathaniel",
					"WisdomX",
					"StephanieDuLaux",
					"WLV43"
				],
				"customerProfilePictures": [
					"https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif",
					"https://images-na.ssl-images-amazon.com/images/S/amazon-avatars-global/3996ff23-a0f6-4cf9-8870-d392fec24733._CR62,0,375,375_SX48_.jpg",
					"https://images-eu.ssl-images-amazon.com/images/S/amazon-avatars-global/9926dc73-c28f-40a1-8630-d7c2c4e1cd4d._CR0,0,335,335_SX48_.jpg"
				],
				"customerRatings": [
					"3.0 out of 5 stars",
					"5.0 out of 5 stars",
					"1.0 out of 5 stars",
					"5.0 out of 5 stars",
					"3.0 out of 5 stars",
					"5.0 out of 5 stars",
					"5.0 out of 5 stars",
					"5.0 out of 5 stars"
				],
				"customerReviewTitles": [
					"Not for large files",
					"Amazing SSD Stick",
					"Crashed within a couple of weeks.",
					"So far so good",
					"Feels Flimsy And Does Not Reach Top Speed",
					"Impressive size and speed.",
					"It WORKS!",
					"Great product and fast"
				],
				"customerReviewBodies": [
					"I purchased this SSD because I find myself needing to transfer 50+ gig files for a project. Therefore the SSD rather than a flash drive. I find that for small files, less than 3gig, the Buffalo drive works well. But somewhere just over 3gig it slows down dramatically. Doing a copy on my computer of a 55gig file the speed dropped to 21mps (yes that's MEG). It took 2 1/2 hours to copy the file. Tried it on a Samsung 500SSD and it took 43 minutes. When I ran the speed test, one thing that really stood out is that on the Samsung the read and write speeds are consistently almost the same (400g+). On the Buffalo drive the write speed was 60% slower than the read speed (69g+). Bottom line -- if you are looking for a fast flash drive to copy a few pictures and songs to, this may do it for you. But if you are looking for a high speed device for large files, not so much.",
					"T",
					"Let us set aside for a moment that even if this had worked perfectly, the casing is not good at all. Let us focus on the fact that within a couple of weeks, the drive become entirely unusable. The worst storage drive I can recall purchasing.",
					"I’m using this in my Xbox Series S as an extra drive even though I have the Segate official drove already. The putstick works great and was plug n play. Minimum formatting required. What’s odd is that I moved six Series S games to that drive and four of the six play right from the drive while two do not. No big deal since transferring is a breeze. It’s just odd that some of those games run without having to transfer to the internal drive or the segate. Regardless the stick drive has been great. The only downside is 500GB goes quick. Good for the value and ease of use.",
					"The drive feels cheap and like it's going to snap in my fingers. It may not, but sure feels that way.\n\nCame with that sticky protective plastic skin to keep from scratching, except it's on even the smallest pieces, so I spent 5 mintues picking all these little plastic bits off.\n\nI ran 5x different winsat speed tests on both USB 3.1 Gen 2 (10Gbps) and Gen 1 (5Gbps) ports, with an extension cable, and over a hub. It maxed at out 3.15Gbps tops ~ 400MB/s tops. That's 33% off advertised speed of 4.8Gbps ~ 600 MB/s, even with the update.\n\nIs it fast? Yes.\nIs at as fast as advertised? No.\nIs it worth the price? Maybe. It's the only one claiming these speeds that isn't $350~600 so, that's the trade-off I guess?",
					"Buffalo is a middle of the road HDD brand. But, this portable SSD seems to be one of their very best devices! I love it! It is the correct capacity EXACTLY as advertised, is VERY fast, and it has a very cool look. It arrived on my birthday. I'm truly impressed this time.",
					"I purchased this SSD with trepidation, wondering if it would indeed be \"easy\" to use. It is! I needn't go into its function, as the fact that you are reading this, you probably know more about its inner effectiveness than I do! And it is sturdy! It arrived well packaged. It also had a protective sticky cover, which is easy to remove, or not to bother, it works with the protective cover as well. I just removed it simply because I wanted to, rather than needed to. I raved about it to a friend, and she ordered one for herself. This is my first purchase of the Buffalo SSD; it will not be my last. I highly recommend this Buffalo SSD.",
					"Was looking for something portable and large in size of which this product is great.",
					"Ich arbeite seit etwa 2011 mit diversen externen Speichern, darunter fast alle Buffalos. Der Buffalo SSD 500 GB für € 93 ist nun wirklich die grösste Überraschung, noch kleiner als die berühmten SanDisk 256 GB, aber noch handlicher und mit doppeltem Fassungsvermögen. Ich benutze ihn als aktuellen Tagesspeicher mit Hosentaschentransport. Ergänzt wird er durch einen ADATA mit 5 TB für € 129. Den Buffalo einstecken, funktioniert sofort. Geeignet für Mac und Windows, Anschlüsse für A und C. Einmalig sind Lese- und Schreibgeschwindigkeit - noch nie so erlebt.",
					""
				]
			}
		},
		{
			"id": "mLjDImy",
			"title": "SanDisk Ultra 3D NAND 500GB Internal SSD - SATA III 6 Gb/s, 2.5 Inch /7 mm, Up to 560 MB/s - SDSSDH3-500G-G25",
			"price": "$54.99",
			"image": "https://m.media-amazon.com/images/I/71ETKYdbjLL._AC_SX450_.jpg",
			"description": "Get accelerated performance for better gaming and pro?level multitasking with graphics?intensive apps. Powered by 3D NAND technology, the SanDisk Ultra 3D SSD delivers enhanced endurance and reliability, blazing sequential read speeds of up to 560MB/s and sequential write speeds of up to 530MB/s for no?wait boot?up, shorter application load times, and quicker data transfer3. In addition to cooler, quieter computing, the SanDisk Ultra 3D SSD includes proven shock and vibration?resistance to protect your drive. From the company that invented the solid state technology that makes SSDs possible, the SanDisk Ultra 3D SSD catapults your performance to new levels. SanDisk products are constructed to the highest standards and rigorously tested. You can be confident in the outstanding quality, performance and reliability of every SanDisk product. This drive is compatible with servers and arrays that accept 2.5” 7mm SATA drives",
			"reviews": {
				"customerProfileNames": [
					"C.Okamuro",
					"Nick",
					"FaslaneTech",
					"DerCat",
					"JimRaynor",
					"Samir"
				],
				"customerProfilePictures": [
					"https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif",
					"https://images-na.ssl-images-amazon.com/images/S/amazon-avatars-global/364c8072-c0ec-4a21-b73c-60af0795de78._CR0,45.0,243,243_SX48_.jpg"
				],
				"customerRatings": [
					"4.0 out of 5 stars",
					"1.0 out of 5 stars",
					"1.0 out of 5 stars",
					"1.0 out of 5 stars",
					"5.0 out of 5 stars",
					"5.0 out of 5 stars"
				],
				"customerReviewTitles": [
					"Big and cheap. Recommended, but expect economy-tier performance and TLC durability. Recommended",
					"Failed after 1 year, Sandisk refuses to replace it",
					"Never again with SanDisk....warranty claims take forever!",
					"These SSDs may be fraudulent",
					"Saved me having to replace my kids laptop",
					"Faster performance, huge difference in response time."
				],
				"customerReviewBodies": [
					"M",
					"I purchased this drive about a year ago, and now it's constantly throwing CRC errors and going offline. Opened a warranty request with Sandisk, and they denied it because the disk is used for \"continuous data logging\". That's right, I write data to the SSD, therefore its warranty is void, even though it's nowhere close to the end of its 5 year term. Buy a different SSD from a company that doesn't have language in its warranty to deny every claim that comes through.",
					"Awesome drive but I'l never buy another Sandisk product again. The warranty process is asinine and it takes like 9 days to complete the testing of the returned drive whether its under warranty or not. That's ridiculous! An RMA at most ever other big company doesn't take near as long and most just send you a new one and fix the old one since it's under warranty anyways it shouldn't matter but they took forever on my warranty procedure and then had to ship it which was GROUND and took another 6 DAYS! TOTAL BS! 15 days to return a drive I had for 3 months and just died....I'm not faulting them on that, this sort of thing happens but in the last 3 months I had to warranty replace a 128GB MicroSD card and this 250GB SSD and both times they honored the warranty but it took forever. If it's under warranty HONOR it without making the customer wait two weeks! So for that I'm giving them ONE star and never buying another SanDisk high ticket item again. Samsung took 2 days and shipped it over night when I had an SSD DOA on me. Bye SanDisk!",
					"I",
					"Made my son's potato of a laptop start acting fast. Went from taking minutes to load Windows and like 40 seconds to open a browser, to booting very fast and the browser seemingly to open instantly. This saved me having to replace the computer. The old hard drive was a 5400k rpm drive that had a read speed of 32 mb/sec, this SSD is registering as being 324 mb/sec.",
					"I've had SanDisk SSD in the past, and it has been a while that I had used it for my laptop. I have a laptop from 2013, that I use for daily stuff, but no gaming. It was acting sluggish and boot/reboot times were taking upwards of 10minutes, then logging in and opening firefox/chrome took aditional 2 -3 minutes. I wasn't sure if it was the computer itself. It was not infected with malware.\n\nI decided to try this out to see how it'll work out. Once I received, I cloned the disk to this SSD, took about 4 hours for 350GB of data plus additional partitions. Popped this baby in the laptop and bootup time was 10 seconds. That was fast, and the login to launching firefox/chrome took an extra second. Shutdown is astoundingly fast as well.\n\nI've always been impressed with SanDisk SD cards, as I use it for my Canon cameras as well, but the SSD for my laptop, it made it 100 times better.",
					"このSSDをPS4proで使用するために購入。\n最初は認証してましたが次に起動したら全然認証しませんでした。\nこれは不良品だと思い返品か交換をしようとアマゾンに送りましたところ商品が違うと連絡がきて改めて買った商品を送ってくださいときました❗\n正直全然意味がわかりません。\n\nしかも同じ商品を送らないと送った商品は破棄しますときて、正直呆れて言葉が出ません。",
					"",
					"Bonjour a tous, comme tous les Français de base, je n'ai pas été sur le site de sandisk avant ATTENTION N ACHETEZ PAS DE LOGICIEL DE CLONAGE IL EST FOURNIT, mais en fait il faut d'abord s'enregistrer sur leur site, ensuite télécharger l'application \"SanDisk SSD Dashboard Installer\" ensuite dans outils, cliquez sur logiciels supplémentaire et là vous avez le line ACRONIS afin de faire votre clonage voila c'est tout ne dépensez pas 30€ comme moi hier ...si ça peux aider et éteindre la polémique ^^",
					"",
					"Ich benutze mein Macbook Pro seit 2012 und die interne 1TB- Festplatte war fast voll und die Arbeitsgeschwindigkeit sehr mau.\nDa ich es eh meist mit externen Monitor benutze, erwartete ich sehnsüchtig die Wiedergeburt des Mac Mini, die doch tatsächlich zur großen Überraschung der meisten vor Kurzem stattfand.\nDa der Mac Mini in einer vernünftigen Austattung (z.B. 2TB SSD + 16 GB RAM) mindestens €2.500,- kosten würde, kam ich ins Grübeln.\nMit Erstaunen stellte ich fest, dass gut SSD-Festplatten sehr erschwinglich geworden sind und bestellte diese mit einem passenden Gehäuse und noch 16GB RAM, weil ich gerade dabei war.\nMit Carbon Copy-Cloner über Nacht die gesamte Festplatte kopiert, Probelauf ohne Probleme und inkl. RAM in gemütlichen 10 Min. eingebaut.\nNach dem ersten Neustart wurde mir ganz warm ums Herz: Mein altes Macbook Pro war so schnell wie nie zuvor, selbst anspruchsvollste Programme poppen so schnell auf, dass fast Hektik entsteht.\nDas einzige Ärgerliche: Das ich dieses einfache Upgrade nicht schon viel früher gemacht habe!",
					"",
					"職場で同僚が使っている、2013年製造の富士通製事務PCの250GB HDDの挙動が怪しかったのでこちらに交換しました。クローンの時間も含め30分ほどで作業完了、容量二倍で起動もアプリの立ち上がりも早くなって同僚も満足です。自分の周りでは、windows10にアップデート済のsandy ivy世代のNEC Mate等の国内メーカー製PCの延命に大活躍しています。\n\n自分が購入したときは、J25より安かったので購入してみたのですが、正直、自分の事務PCに使用しているJ25との違いがパッケージ以外わかりません。\n\nここ2年位でJ25と合わせて、個人のPCや知人に組んだPC、職場のPC合計で5つ程使用していますが、今のところ不具合はありません。DRAMキャッシュレスの激安SSD程は安くありませんが、こちらか860EVOあたりが無難で安心なSSDだと思います。\n\nなお、同じ価格帯か、やや安めのクルーシャル製品は昨年MX300でプチフリの後にdiskpartですら認識しなくなった不具合を経験してるので個人的には選びにくいです。今のところ不具合も無く安定しているこちらのシリーズを使用しています。\n\n2020年1月19日追記\n\n値上がりしそうなので、本日また2枚購入、通算10個目です。\nWD Blueと合わせると20個近くですね、なお今まで購入したUlta 3Dは相変わらず全てお元気です。\n\n数日前にお遊び用として選別下位のNANDを使用した激安SSDを購入したのですが、初期不良で返品するハメになったので、今後はやっぱりどんな適当な用途でも、WD SunDisk SumSung辺りのチップメーカーに近い信頼できるものを購入しようかと思います。\n\n2020/3/30追記\n3月中に更に1TB 500GB合わせて5枚購入。\n今のところ初期不良はゼロです。迷ったらG25かJ25かWD Blueの中で一番安いのを買えば良いと思います。\n\n2021/9追記\nWD Blueと合わせて既に30枚近く購入しましたが、今年の5月頃初めて不具合に遭遇しました。\n\n外付のバスパワー2.5inケースに入れて動画や音楽を垂れ流すためにスティックPCに繋いでいた個体が突然認識と切断を繰り替えず様になり、しばらくするとdiskpartでは認識されるものの、ディスクの管理ではフォーマット出来なくなってしまいました。怪しくなった時にCrystal Disk infoで確認したら5000時間程の使用時間でした。書き込み量は100GB未満だったと思います。\n\n正直いつ購入した物か枚数があり過ぎて分からなかったので、全て正直にSandiskのサポートに連絡したところ、快く新品への交換をして頂けました。\n\nこういう時日本語でサポートが受けられて5年のメーカー保証は楽ちんでありがたいですね。\n\n先日CORSAIRのMP600のRMAを利用した時は、英語での会話はともかく画像を結構求められてそこそこ面倒でした。\n\nこれからも他に信頼性のあるSSDが出ない限りは、WD Blueと並んでマイ標準SATA SSDとして使用して行きたいと思います。",
					"",
					"PS4ProをSSDに換装する為、購入。\n私が購入した時は16,400円でした。\n(2019/03 時点では約15,800円)\n徐々に下がってきてますね。\n1つ前のモデルのレビューは\n2000件を越えていましたが\n最新型のコチラは数件だったので\nちゃんと動くのか等、心配でしたが\n問題なく動作しています。\n\n容量ですが、\n私は全てダウンロード版なので1TB。\nAPEX、FORTNITE、FFXIV、PSO2など\nオンライン専用ゲームや\nMHW、KH3、SEKIROなどのゲームも複数DLしていますが\n500GBを少し越えるくらいです。\nパッケージ版をお持ちの方や、\n複数のゲームを同時期にしなければ\n500GBでも十分かと思います。\n\nモンスターハンターワールドで\n検証したところ\nロード時間がかなり高速化されました。\n\nモンスターハンターワールドの場合\nSSDにすると、\nロード画面では右下に\n読み込みバーが表示されますよね？\nあれが4～5割くらい進んだら\nすぐバーがMAXになりロードが終わります。\n(普通は最後までゆっくり進んで終わる)\n\n例えば、\n・クエストをクリアし集会所に戻ってきて\n自分が猫飯を食べ終わった頃に、\nやっと他のハンターが\n帰ってくるくらいです。\n猫飯分の時間くらい早いですね。\n\n・誰かが受注したクエストにすぐ参加すると\n受注した人より早くロードが完了し、\n出発可能な状態になります。\n\n勿論、ログインや拠点での\n工房エリアや流通エリアの移動も\n早くなります。\n\n他のゲームでも明らかに違いますね。\n換装手順も簡単なのでオススメです。",
					""
				]
			}
		},
		{
			"id": "duy9QLU",
			"title": "Western Digital 500GB WD Blue 3D NAND Internal PC SSD - SATA III 6 Gb/s, 2.5\"/7mm, Up to 560 MB/s - WDS500G2B0A",
			"price": "Check fit by model, Find your brand",
			"image": "https://m.media-amazon.com/images/I/81H5+gI7Q3L._AC_SX450_.jpg",
			"description": "The Western Digital Blue 3D NAND SATA SSD utilizes 3D NAND technology for capacities up to 4TB with enhanced reliability. Featuring an active power draw up to 25% lower than previous generations of Western Digital Blue SSDs, you’re able to work longer before recharging your laptop, while sequential read speeds up to 560MB/s and sequential write speeds up to 530MB/s give the speed you want for your most demanding computing applications. Combined with the free. you can confidently upgrade your system to the Western Digital Blue 3D NAND SATA SSD. |As used for storage capacity, one terabyte (TB) = one trillion bytes. Total accessible capacity varies depending on operating environment. | Active power draws are up to 25% lower during sequential reads than previous generations of Western Digital Blue SSD at the 500GB capacity point. | As used for transfer rate or interface, megabyte per second (MB/s) = one million bytes per second and gigabit per second (Gb/s) = one billion bits per second.",
			"reviews": {
				"customerProfileNames": [
					"CDL",
					"Marty913",
					"M.Gotts",
					"JohnMC",
					"ITBeast"
				],
				"customerProfilePictures": [
					"https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif"
				],
				"customerRatings": [
					"5.0 out of 5 stars",
					"5.0 out of 5 stars",
					"5.0 out of 5 stars",
					"1.0 out of 5 stars",
					"5.0 out of 5 stars"
				],
				"customerReviewTitles": [
					"Very fast & works in a desktop computer",
					"Recommended",
					"Good upgrade for old Win 7 machines",
					"No More 5 Year Warranty?",
					"This SSD is approximately $50 cheaper than it's predecessor and delivers same fantastic results!"
				],
				"customerReviewBodies": [
					"I bought this WD Blue 1TB SSD to replace a hard drive that I thought was the likely cause of some data corruption experienced in a desktop top-line computer.\n\nIt required also buying an SATA III cable and a 2.5” to 3.5” adapter bracket to fit in the desktop bay since they are not included with the drive.\n\nThe drive did not come with any useful instructions, but this procedure worked:\n1. Shut down\n2. Leave original drive as is; connect new drive to power and an unused SATA port on motherboard\n3. Power up. Normal but new drive does not show in My Computer\n4. Run Acronis software available free from WD’s site\na. Select “Clone disk” and automatic mode\nb. It identified the old and new disks\nc. It ran about 1.5 hours and cloned the original drive, including all partitions and 500 GB of data\nd. It shut down computer automatically\n5. Disconnected power and SATA cable from old drive\n6. Connected new drive to the SATA port on motherboard where old drive had been\n7. Powered up. It booted OK. Everything seems fine.\n\nBoot up and opening programs seems about 5 times faster than with the original spinning disk hard drive. I can’t evaluate long term reliability, but my initial impression is excellent.",
					"I've bought hundreds of drives over the years (I'm an old computer technician) and it always comes down to Western Digital & Seagate for standard mechanical drives; and Western Digital or Samsung for SSD-type drives. I prefer the Western Digital for the mechanical type but for the SSD-type like the Blue 500GB drive referred to here, either the Samsung or WD work great (I have several of each). Go with the least expensive of the two, they are both high quality drives.",
					"Bought 6 of these to upgrade old office PCs and milk another year or so out of them. They are Dell Win 7 machines, and now boot in 15-20 seconds vs 2-3 min before. Everything launches quicker, too, and the SSDs give the impression of a much faster computer without having a faster CPU or memory. Within reason. Won't necessarily speed up already running programs. But, for these old ones that only have 4 GB RAM, it should also speed up shuffling data in RAM to the pagefile virtual RAM.\n\nI used Macrium Reflect to clone each of the drives, using a USB3 external hard drive case made for quick swapping of drives, in case anybody cares.",
					"I've ordered many of these drives, a couple 256, 500 and 1TB. Today I received a 500GB for a raid1, I already had the 2nd 500 on hand from a couple months ago and when I put the two packages next to each other I noticed the old on says 5 year warranty and the new one said 3 years! I compared the SKUs, the model numbers and more and they are identical in every way except for the warranty.\n\nI read the document included in the box and that also confirms the 3 year warranty but when I look at retailers sites, Western Digital's website, their data sheets and warranty status checker, everything still says 5 years. Very confusing and concerning.",
					"I got this SSD HD to replace and improve my daughters HP Pavilion Laptop (The original HD was a Segate 5400rpm 500GB SATA II Traditional Laptop HD) the performance issues that this laptop had been having which was mainly due to the growing resource demands over the years from the newer Windows Operating Systems (Going from Windows 7 to Windows 10) and the newer requirements from the current software as well. Needless to say very infuriating for someone who is trying to get her school work done.\n\nPROS: Nothing but Praise\n\nCONS: Absolutely None\n\nRecommended Additional Software and Tools to perform the Hard Drive upgrade with:\n- (Needed, unless your reloading the OS from Scratch) Use Macrium Reflect 7 Free Edition (Just do a Google Search to find) to clone your Old hard drive to the New One. It's an easy download that will install into your existing hard drive to make an exact clone to your New One. Best part the Free Edition does not cost a dime.\n- (Needed, unless your cloning a Desktop then Optional) Use this USB to SATA Drive connection cable ",
					" for only $10 to clone the new drive with. Of course if it is for a Desktop this will not be needed but for 95% of the Laptops out there it's a must!\n- (Optional, if you already have a similar tool set) If your changing the hard drive out of these newer Laptops (within the Last 4 years) I would buy this tool kit ",
					" to access the Hard Drive, especially for those needing a plastic pry tool, can't go wrong for $20.\n\nOnce I installed the new SSD the difference was literally night and day, the boot up from Bios to Operating System (Windows 10) was almost literally instantaneous (I would say give or take 5 to 10 seconds), the response time on applications and any action in general was also instantaneous.\n\nOnly other recommendation I would make is to make sure the BIOS on your laptop/PC is current so there are no compatibility issues with the SSD.\n\nPlease NOTE: This HD is approximately $50 cheaper than it's predecessor ",
					" but has the same excellent results.\n\nOverall I could not be happier, This will unfortunately will be that last upgrade that I will be able to do this Laptop (See the system system specs below).\n\nI would highly recommend this SSD Hard Drive for all older PC performance related problems.\n\nSpecs:\nHP Pavilion Laptop (June 2012)\nOS: Windows 10 Pro\nProcessor: AMD X6 @ 1.40 GHz (4 Cores)\nRAM: 8 GB (Max Capacity)\nHard Drive: 500GB WD-Blue 3D NAND SSD (Replaced original Segate 500GB 5400RPM SATA Drive)\nVideo: AMD Radeon graphics card (HDMI & VGA)\nDisplay: 1920 X 1080p 17.3 inch Screen\nInternal NIC: 100MB\nWiFi NIC: Internal Intel Centrino Dual Band/USB LB1 AC600 Dual Band USB Dongle (5 ghz)\nUSB Ports: 3 X USB 2.0 Ports\nROM: DVD/CD Burner",
					"I've had a conventional 4TB Hard disk in my Dell Optiplex 7010 workstation for a while and when it started to take over 15 minutes to start Windows, I knew something was wrong.\n\nI've just bought the Western Digital 4TB SSD as a replacement, did a backup image to a 10TB WD back up drive, which took 8 hours, swapped out the drives and restored everything to the new SSD in less than 3 hours.\n\nBooting Windows 10 now takes abut 20 seconds to load and I'm ready to get to work. Everything works better and my PC is much quieter without the constant HDD drive noise.\n\nBuild quality is excellent, its incredibly light and I've fitted the SSD into a Sabrent 2.5\" to 3.5\" HDD tray which slipped straight into my Mini Tower.\n\nI have 32gb of RAM, a 4k NVidia Quadro 1000 graphics card, Elgato 4k HDMI Capture Card, running MS Office, Adobe Creative Suite and Solidworks. Overall I'm very pleased; this is the single most significant speed enhancement to my rig ever. I highly recommended this SSD drive for value, warranty and overall performance.",
					"Tried very hard to create a clone with the 4TB model, impossible to do so as Macrium cloning, TodoUS cloning, Acronis provided cloning software were seeing errors on the drive unable to process with it further-Acronis was showing the error message at the end of the cloning process.\nI trully envy those who succeeded. I tried all the computers at home and office. No luck.\nToo expensive for just storing data.",
					"4TB is Utterly overkill, but is great if you want to drop Spinning Drives from (for example) a small form factor PC, or a Gaming PC where you run a m.2 boot drive.\n\nGiven the current hard drive shortage [Q3/4 2020] a 2TB or 4TB SSD is probably worth the money versus hard drives at their current prices.",
					"Easy to fit in place of 1TB HDD - took about 100 minutes to re-format as a data drive and about 75minutes to copy contents from the previous drive, Diagnosticsfound no faults and has been working perfectly for over a week. Very fast compared to HDD.",
					"P"
				]
			}
		},
		{
			"id": "WWTscjf",
			"title": "LEVEN JS600 SSD 2TB 3D NAND SATA III Internal Solid State Drive - 6 Gb/s, 2.5 inch /7mm (0.28\") - up to 560MB/s - Retail 1 Pack",
			"price": "$124.99",
			"image": "https://m.media-amazon.com/images/I/71pCztrnl8L._AC_SY450_.jpg",
			"description": "About this item\nMore Efficient: Sequential read speeds up to 560MB/s and sequential write speeds up to 500MB/s.\nMore Reliable: A solid state design is a more durable and reliable alternative to a traditional hard drive. No moving parts, less risk. The MTBF (Mean Time Between Failures) of JS-600 SSD is 2 Million Hours. Enjoy the long and trustworthy quality of LEVEN JS-600 SSD.\nMore Choices: LEVEN provides all kinds of capacities to meet your needs: 128GB, 256GB, 512GB, 1TB, or 2TB. Take your pick.\nWarranty: 3 years warranty provided by the manufacturer from the date of purchase.\nNote: The actual available capacity of our solid state disk is a little smaller than we listed due to the different calculations between computers and manufacturers. Computer: 1 MB = 1,024 KB. 1 GB = 1,024 MB / Manufacturer: 1 MB = 1,000 KB. 1 GB = 1,000 KB.",
			"reviews": {
				"customerProfileNames": [
					"Hex",
					"JohnC.",
					"JoshuaPhillip",
					"Texun",
					"katanaturbo",
					"BobfromTexas",
					"THanna",
					"JWWimpy"
				],
				"customerProfilePictures": [
					"https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif"
				],
				"customerRatings": [
					"5.0 out of 5 stars",
					"1.0 out of 5 stars",
					"1.0 out of 5 stars",
					"5.0 out of 5 stars",
					"5.0 out of 5 stars",
					"5.0 out of 5 stars",
					"5.0 out of 5 stars",
					"5.0 out of 5 stars"
				],
				"customerReviewTitles": [
					"Perfect for a PS4 Pro",
					"Not reliable. 1 of 2 drives failed in less than 2 weeks & not compatible with Dell laptops/AIOs.",
					"You get what you pay for",
					"Well pleased so far",
					"Great SSD for the cost.",
					"Good Product Works as Advertised",
					"Decent Performance",
					"Accurate temp readings"
				],
				"customerReviewBodies": [
					"Bought this for my PS4 Pro, and boy does it work. Swapping out the drives was quick and easy. Followed the steps online to reload the OS. Booted up fine with no issues. Took maybe 30 minutes total.\n\nSystem boots much faster as do most games (sorry, AC Odyssey and Valhalla are still slow as mud). And downloads are faster. Went from about 80Mbps to up around 320Mbps. I'm guessing the lack of a buffer means DLs are reduced to the speed the HDD can save the info. Patched Mass Effect LE's 10GB patch in a fraction of the time.\n\nGot the 2TB version. OS shows 1.84GB usable. Not bad for the low cost of the drive.\n\nI've been telling all my friends with PS4 Pros to snag one of these drives as they are worth every penny...now I'm telling you ^_^",
					"With Samsung abandoning the mSATA drive space, I thought I'd try two of these 512GB version of the Leven brand drives to increase the storage capacity of my Dell 6430u laptops. Need to have another source of reliable-ish mSATA drive brands other than Kingston. Both failed to function properly in the laptops. Was able to install the OS but the drive will eventually disappear causing the laptop to hang. Tried different OSes with the same results. Was not stable when installed in a Dell AIO desktop computer either.\n\nNo problem I thought, I'll just place these drives into a mSATA to 2.5\" SATA adapter to use them in other computers that uses the 2.5\" drive form factor. The adapter used works great with 1TB Samsung 860 EVO mSATA drives and the Leven drives appeared to work fine with acceptable throughput. But this morning, I couldn't boot the Toshiba laptop that one of these Leven drives was installed in. Did some troubleshooting and not only does the Toshiba laptop report the drive as FAILED, tested with other computers and they also will not recognize the Leven drive anymore. IT BE DEAD, so back it goes for refund. Perhaps it is just crib death and hopefully the second Leven will have a longer lifespan, but time will tell.",
					"I ordered 4 of these drives. Of the 4 my computers did not even realize 3 of them were there. The other one was 50/50 sometimes windows recognized it, sometimes not. Never worked at all on my apple machines. Honestly, spend another $5-10 to get a Kingston, Samsung, or another reputable brand. It will save you a lot of time and annoyance",
					"This drive is used in an external USB enclosure to move large files from one computer to another and store temporary backups for reinstalls. My impression as of right now is that it is a very nice and inexpensive drive that performs well.\n\nThe drive does everything it should as a portable backup. Reading from a platter drive to this 256 gig LEVEN my write speeds start at 110MB\\s and stabilize between 78-85MB\\sec or 640mb\\s on large file transfers through a USB 3.0 enclosure and 3.0 hub, which I consider excellent considering the limitation and bottlenecks between the two drives.\n\nSetup was a 30 second process.\nNOTE: In Win-10 the drive will NOT show up in File Manager until it has been initialized (no Plug-n-Play) so go to Drive Management and let Windows initialize it for use. You may be prompted to select MBR or GPT. I used GPT but either will work. However, if you are planning to use this as a Windows boot drive in an older machine that does not have UEFI your will have to use MBR.\n\nWhat's in the box? The drive and that's it. If you are building a PC or adding the drive to an existing system you will need a SATA cable and mounting hardware.\n\nOverall I'm 100% satisfied with the performance and price per gig. I've never heard of this company and info on product reliability is a minimal as their website at this time, but it has a 3 year warranty and I have no plans to keep any critical info on it so the risk is acceptable for my needs.",
					"I ordered this to replace the 2TB HDD that was in my PS4. The HDD although it was a gaming HDD did not impress me after a while. It started out really good but seemed to slow down after a while. I put this in and WOW!!!! what a huge difference. I would definitely suggest this brand, I'd never heard of it until I purchased it. I believe it was a great $164.99 investment for 2TB of space and functionality for my PS4.",
					"Name brand? Who knows for the past few years I have been buying SSD's for different PC builds 120gb and up.\nAll kinds of brand names have worked well some advertise fast transfer write speeds but bottom line is they all work and work faster then any Hybrid or HHD, none have failed, can't say that for USB or SD cards got to be careful to much junk and fakes out there but SSD drives no prob!",
					"I received a 2TB QLC drive, if there's any question about that. I'm not using it as a boot drive but only to store and load game installs/files and it performs very well. I also overprovisioned it by 15%. No idea if that's necessary, but it may have some bearing on it's performance, which is completely in line with what anyone can expect from a SATA SSD. It's easily on par with the likes of Crucial and Samsung's offerings in the QLC segment (performance wise). I'm not able to attest to it's reliability as I've only had it for maybe 5-6 weeks.\n\nIt was easily recognized and configured by Windows drive manager and file copies were flawless. This was used as a storage upgrade for a Dell Precision T3600 tower.",
					"I was pleased to see that the temp readings provided by smart data for this drive appear to be correct. This has not proven to be the case with at least three competitors SSD's which all display either zero F or 200 F. Previously many of the SSD's just displayed no temp reading at all.\n\nI've only just set this machine up and installed the OS so I can't speak to reliability but so far so good. The speeds are what I'd expect from an SSD in this price range.",
					"2Tb SSD at a very good price indeed. This is primarily for video and Canon Raw picture storage for our home build Desktop. It fitted easily, was recognised by the disk manager and once formatted is efficient and fast enough. Will look to this maybe for additional storage in the future",
					"I can confirm these do NOT have any DRAM Cache.",
					"Added to the spare slot in my new laptop, works well and very pleased with the SSD",
					"Bought to install for a customer in an iMac 21.5” 2012 model. Within two weeks it’s started developing SMART errors. Sent back for a refund.",
					"Got two of these for £109 each when no other drive was under £150. Put one in my laptop replacing a normal HD where its been a significant speed boost."
				]
			}
		},
		{
			"id": "4IS920H",
			"title": "LaCie Rugged SSD Pro 2TB Solid State Drive — USB-C Thunderbolt 3, Drop Shock Dust Water Resistant, for Mac and PC Computer Desktop Laptop, 1 Mo Adobe CC (STHZ2000800)",
			"price": "$699.99",
			"image": "https://m.media-amazon.com/images/I/712xZ84ec7L._AC_SY450_.jpg",
			"description": "Rugged SSD Pro harnesses the power of a Seagate FireCuda NV Me solid state drive to maximize Thunderbolt 3 capabilities. The result? Portable SSD speeds of up to 2800MB/s—that's 5x faster than traditional SATA SSDs—and extreme durability so filmmakers and DITs can directly play back the most demanding 6K, 8K, and super so-so source files in any environment—without transcoding. Tackle any terrain with extreme IP67-rated water resistance, three-meter drop resistance, two-ton pressure resistance, and 2TB of space in a smart-cooling, palm-sized drive. Enjoy seamless compatibility with Thunderbolt 3 and USB-C on both Mac and Windows computers. For long-term peace of mind, this SSD includes a five-year limited product featuring Rescue Data Recovery Services. Lastly—take advantage of the one-month complimentary membership to Adobe Creative Cloud All Apps Plan for access to awesome photo and video editing apps!",
			"reviews": {
				"customerProfileNames": [
					"TonyB.",
					"AliF.",
					"RyanA.Davis",
					"B.Parry",
					"Ms",
					"MichelJM",
					"GregJ",
					"SteveT."
				],
				"customerProfilePictures": [
					"https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif",
					"https://images-na.ssl-images-amazon.com/images/S/amazon-avatars-global/4f31ad03-bd60-4cb4-90ce-7aa6ae3f3377._CR7,0,485,485_SX48_.jpg"
				],
				"customerRatings": [
					"5.0 out of 5 stars",
					"3.0 out of 5 stars",
					"5.0 out of 5 stars",
					"5.0 out of 5 stars",
					"4.0 out of 5 stars",
					"5.0 out of 5 stars",
					"3.0 out of 5 stars",
					"5.0 out of 5 stars"
				],
				"customerReviewTitles": [
					"Screaming Fast",
					"GREAT DRIVE WITH CAVEATS",
					"Cool, but not a need.",
					"Really fast access; a whole order of difference with other drives",
					"WILL ONLY WORK WITH THUNDERBOLT 3 OR USB-C",
					"High performance Speed robust water proof and nice very small fit in a pocket.",
					"The weakness of the connecting cable",
					"Wonderful SSD portable"
				],
				"customerReviewBodies": [
					"Got a MacBook Pro w/ thunderbolt3? Work in film/vfx world? This thing is a must have. I deal w/ vfx and 4k+ resolution files everyday. Need 24fps playback on EXR file sequences..yeah no problem w/ this thing. 2000+MB/s read speed. I almost paid thousands for a similar SSD inside the MacBook..glad I didn't because this thing = same performance by and large. Highly recommended for industry professionals!",
					"This does the job but is less than perfect. First the good. Once working it is blazingly fast. Faster than anything I have ever used. Now the bad. It really only works with a Thunderbolt port. And formatting it is a mystery worthy of a lot of online research. If you just plug it into a Mac and try to encrypt it using Disk Utility you will be unpleasantly surprised that APFS formatting and encryption are not an option. If you use the included toolkit, you will also see encryption is not an option (despite what the online manual says). You have to know how to go to the root of the disk and then format the drive to get the sub formatting option for APFS or encryption. If you are techy and get through his part amd encrypt your drive in APFS you will have a very fast drive with security. If you want a plug and play drive with encryption or if you don’t have the proper thunderbolt input, save yourself some money and agony and buy a simple and cheap portable hard drive.",
					"Honestly thing is great but unless you REALLY need to have the full bandwidth speed this provides on a portable level. It’s not worth the $$.\n\nI’m kicking myself because I just bought an OWC Thunderblade which has 4x the capacity at a little over 2x the $$ but i don’t NEED that much speed on the go. I’ve got 5 or 6 Sandisk Extreme SSDs and one of the Extreme Pro, which can get about half this speed and frankly, that’s enough for my use case. But, I guess we’ll see, once I start really shooting 8k regularly this might be them norm but for now, I can’t see myself pushing this thing to the limits.\n\nBut there is the benefit of speeding up my card dumps but once again... that’s not something I NEEDED.\n\n🤷🏻‍♂️\n\nOtherwise it’s solid, its tiny and I really like that it comes with a 5 year data recovery plan.",
					"Very small, and incredibly fast. The speed was the most important to me and did no disappoint.",
					"I have a 2014 iMac which has Thunderbolt 2 and USB 2.0 ports. They do NOT supply enough power to this drive and therefore it will not work. You MUST have Thunderbolt 3 or USB-C ports.",
					"This 2 TB Combination of the Thunderbolt 3 with high grade SSD gives it the high performance speed so you may boot from it as fast as booting from the internal SSD of the computer. If we add the hardware robustness, water proof,, smoothness tough, light weight and small size to fit in a pocket, likely best in the market.",
					"This external drive is all I wanted and needed for my video production as a college professor. Unfortunately the cable connection to the drive is loose causing me to lose much information in daily use. For the price, I expected flawless performance. I still use it but cautiously and with the awareness that at any point it might wiggle and lose the project I am working on.",
					"It’s just the fastest most compact SSD on the market, It is in-destructible.",
					"This intended as robust portable drive but i bought it as a high-speed auxiliary SSD drive for for my Mac Mini, doubling its internal capacity of 2TB. Spped tests show it lived up to the maker's claims supporting transfers at about 80% of the internal drive (thus, it it could replace the internal SSD if it failed), and about 12 time faster than my non-SSD backup drives. Feels extremely well-engineered but life tests will take a long time (I hope!).",
					"I'm using the drive for virtual machines on a mac-mini (2018). It's super fast with similar throughput (both read/write) as the internal Apple NVMe disk. Even under heavy I/O, the enclosure is just warm, never overheating.",
					"I got quite disappointed as I spent such an amount just to receive the product in dead state. I have 2 different laptops with Thunderbolt 3 ports. SSD was not detected on both the systems. A very bad experience with me as I was desperately waiting for the drive and received the faulty one, I have initiated the return and this time ordered Samsung X5 2TB as I can see feedback is very good.",
					"Used for video editing. Super fast drive"
				]
			}
		},
		{
			"id": "7Hdoknp",
			"title": "SAMSUNG 980 SSD 1TB PCle 3.0x4, NVMe M.2 2280, Internal Solid State Drive, Storage for PC, Laptops, Gaming and More, HMB Technology, Intelligent Turbowrite, Speeds of up-to 3,500MB/s, MZ-V8V1T0B/AM",
			"price": "$89.99",
			"image": "https://m.media-amazon.com/images/I/714VYiAYssL._AC_SX450_.jpg",
			"description": "Harness your PC's potential with the 980 SSD. Whether you need a boost for gaming or a seamless workflow for heavy graphics, the 980 is a smart choice for outstanding SSD performance — and it's all backed by an NVMe interface and PCIe 3.0 technology. Satisfy your need for speed with PCIe 3.0, using HMB technology and NVMe interface for high efficiency. The 980 delivers value, without sacrificing sequential read/write speeds up to 3,500/3,000 MB/s, over 6.2x the speed of SATA SSDs. Keep your SSD running at its peak with Full Power Mode, which drives continuous and consistent high performance. Enable through Samsung Magician software to keep your SSD in active mode with no latency, so you can instantly jump back into large intensive work files or graphics-heavy games. Unlock the full potential of 980 with Samsung Magician's advanced, yet intuitive optimization tools. Monitor drive health, optimize performance, protect valuable data, and receive important updates with Magician to ensure you're always getting the best performance out of your SSD.The NVM Express design mark is registered to NVM Express, Inc.HMB (Host Memory Buffer) technology enables the SSD to use the DRAM of the host system for read/write caching and buffering.Performance may vary depending on the SSD’s firmware version, system and hardware configuration. Performance measurements are based on IOmeter 1.1.0. The write performances were measured with Intelligent TurboWrite technology activated. The sequential write performances after Intelligent TurboWrite region are: up to 250 MB/s (250GB), 500 MB/s (500GB) and 900 MB/s (1TB). Test system configuration: Intel(R) Core(TM) i7-6700K CPU @ 4.00GHz,DDR4 2133MHz 8GBx2 OS-Windows 10 Pro 64bit Asrock Z-170 Extreme7+ Results are based on a comparison with Samsung SATA SSDs.TBW : Terabytes written. For 980: 150 TBW for 250GB model, 300 TBW for 500GB model, 600 TBW for 1TB model.",
			"reviews": {
				"customerProfileNames": [
					"Ryan",
					"Darwindan",
					"PublicName",
					"MichaelDeroia",
					"RamonS.",
					"Alex",
					"Magesw"
				],
				"customerProfilePictures": [
					"https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif"
				],
				"customerRatings": [
					"4.0 out of 5 stars",
					"4.0 out of 5 stars",
					"3.0 out of 5 stars",
					"5.0 out of 5 stars",
					"4.0 out of 5 stars",
					"5.0 out of 5 stars",
					"5.0 out of 5 stars"
				],
				"customerReviewTitles": [
					"Great NVMe drive for the price",
					"Samsung software is horrible",
					"Good",
					"Great product",
					"Amazing Drive",
					"The Samsung 980 is the best Gen 3 M.2 SSD I've Owned.",
					"As advertised! Speeds are there and works great."
				],
				"customerReviewBodies": [
					"Small cosmetic imperfection on top, front or sides of item. Small cosmetic imperfection on bottom or back of item. Missing bonus material. Missing manual. Item will come repackaged.",
					"Great NVMe drive for the price, what wasn't entirely clear upfront is the corners that were cut to get to this attractive price/performance combo. The short answer is this drive has no dedicated dram on board, most Samsung NVMe drives have a dedicated dram chip that is used for buffering command queues, so in the situation where a drive is being asked to pull a bunch of small files all at once or write a bunch of small files all at once the dram helps to queue up these commands and ensure that things get done in as efficient of manner as possible. This drive lacks that dedicated dram, but while historically that has proved to be a detriment to performance Samsung has pulled a rabbit out of a hat here and actually implemented a system that works pretty darn well while utilizing system memory. So in extremely low RAM setups this drive may not perform as well, in most typical cases (8-16GB of system memory) this drive you can expect to perform as well if not slightly better than a 970 Evo NVMe (see picture for benchmark results, the generally slower of the two being my 970 Evo, and the 980 the other). That being said, I'm not sure I'd run this drive as a primary OS drive, or in some kind of home file server or game server situation, but it will do fine as a primary OS drive for most people while not necessarily providing optimal speed, but its definitely at home as a secondary drive to store videos/games/music/photos. If you're looking for a primary drive I'd probably still steer people towards either a 970 Evo (or better) or another drive with dedicated dram, but if you're looking to save a buck with minimal compromises or just need a secondary NVMe drive this will probably tick all of the boxes.",
					"It was a nightmare to install. I was upgrading a laptop from a Samsung 970evo plus 500gb to this 980 1tb. It took me more than 12 hours. I'm not an IT technician but I understand computers, have built and customized them. Samsung makes outstanding hardware. Their drives are great. Their software is absolutely idiotic. Who runs this place?\nExample of what I learned trying to install a simple drive that should have taken 30 minutes max, took 12 hours. How did I not give up? I really felt like it.\nIt went something like this....\nCloned the 500gb Samsung to the 1tb Samsung using a USB enclosure. Their stupid migration software, designed to work ONLY with Samsung will not work if that Samsung drive is in an enclosure. It's a laptop, what else can I do.. Ok, no problem. I am familiar and have used Macrium Reflect, Easus ToDo backup, AOMEI Backupper, Casper, you get the picture. Tried every one of them and I could not get the 1tb Samsung drive to boot after cloning. Something I have done hundreds of times. I tried dozens of times with no success.. Just do a search for NVME upgrades and cloning and you will see how many problems there are with Samsung. I tried everything in a long process of elimination. SPOILER ALERT: My problem? I was running Samsung Magician software and using the Samsung NVMe driver. All I had to do is remove the program and driver and voilá!!!\nIt reverted back to the default Windows driver and the cloning software worked flawlessly. I have to thank a person that wrote in one of the dozens of thing I read about this problem that gave me a clue. He said that the 980 has a different driver than a 970. Both Samsung product. How could they make the upgrade process any harder. This is their fault, bad software. Samsung Magician software should be renamed: Samsung Nightmare. I will never use their buggy software ever again!!!\nBTW...their phone software for syncing contact to say Ouloook called Smart Switch should be renamed Dumb Switch. So many bugs its pathetic.\nCome on Samsung, fix your stuff or you will lose your customers. PLEASE!!!",
					"Works Great. $130 product doesn't come with a $0.02 screw to install it with though, come on man.",
					"This is my second samsung drive and 3rd m.2. Easy install and great performance as expected.",
					"T",
					"The Samsung 980 is a perfect culmination of storage technology, I find it to suit my needs as an open world gamer. I'm running it on Gen 3 Asus ROG Maximus X Code. And benchmarks with over half used capacity show 3395mb/2728mb sequential and 326171/27381 IOPS on Random which is doing a perfect job for games with world streaming like Star Citizen. Game loads are in seconds not minutes and that makes for a happy gamer. The 980 also boasts solid longevity having good thermals for me it's at steady 40c and a write life of 600 TBW backed by a 5 year limited. warranty. Now I'm just waiting on a 2tb version to sweeten the specs.",
					"Replaced a 1st gen WD non NVMe with this 980 and what a difference NVMe makes! Speed tested and they match as advertised. So far so good!",
					"Took 2 weeks to finally ship, and what I received was a fake device.\npackage was properly sealed and everything.",
					"M",
					"T",
					"Upgrading from a 500tb m.2 with slower transfer speeds to this one, Samsung cloning software made it very easy and so far I am happy with what I have purchased.",
					"It comes with Data Migration Software. This will allow you to copy your HDD to your SSD without third party software. That's the reason to buy Samsung over other options."
				]
			}
		},
		{
			"id": "ocpWg_l",
			"title": "SAMSUNG 970 EVO Plus SSD 1TB, M.2 NVMe Interface Internal Solid State Hard Drive with V-NAND Technology for Gaming, Graphic Design, MZ-V7S1T0B/AM",
			"price": "$99.99",
			"image": "https://m.media-amazon.com/images/I/81vkjxbO-rL._AC_SX450_.jpg",
			"description": "For intensive workloads on PCs and workstations, the Samsung SSD 970 EVO Plus delivers ultimate performance powered by Samsung's NVMe SSD leadership. The ultimate in performance, the 970 EVO Plus is upgraded to be faster than the 970 EVO. It maximizes the potential of NVMe bandwidth for unbeatable computing that meets the needs of the most demanding tech enthusiasts and professionals. For performance that puts you in command, the 970 EVO Plus combines the next-gen PCIe Gen 3.0 x4 NVMe interface with the latest V-NAND technology to achieve fearless read/write speeds up to 3,500/3,300MB/s, up to 53% faster than the 970 EVO. Samsung’s advanced nickel-coated controller and heat spreader on the 970 EVO Plus Solid State Drive enable superior heat dissipation. The Dynamic Thermal Guard automatically monitors and maintains optimal operating temperatures to minimize performance drops. Advanced drive management made simple, Samsung Magician software will help you keep an eye on your drive. A suite of user-friendly tools helps keep your drive up to date, monitor drive health and speed, and even boost performance. Troubleshooting steps: 1) Confirm that your computer/ motherboard supports the drive through the manufacturer. 2) Confirm that your computer Bios is up-to date and supports the drive. 3) Confirm your version and mfg. of Operating System supports the drive. 4) Refer to your computer/ motherboard manual as to how to upgrade/install the drive. 5) Take Anti-Static precautions prior to installing the drive.",
			"reviews": {
				"customerProfileNames": [
					"Bobbo",
					"UnaClocker",
					"GuanghuaZha",
					"Val",
					"Mike",
					"Luis",
					"Darwindan",
					"Echoes"
				],
				"customerProfilePictures": [
					"https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif",
					"https://images-na.ssl-images-amazon.com/images/S/amazon-avatars-global/591c9911-fc29-4699-ba1c-41469771271c._CR53,0,294,294_SX48_.jpg"
				],
				"customerRatings": [
					"5.0 out of 5 stars",
					"5.0 out of 5 stars",
					"5.0 out of 5 stars",
					"5.0 out of 5 stars",
					"5.0 out of 5 stars",
					"5.0 out of 5 stars",
					"4.0 out of 5 stars",
					"1.0 out of 5 stars"
				],
				"customerReviewTitles": [
					"Wow - not just benchmark good, but really GOOD!",
					"Does not work with macOS",
					"So far so good",
					"Faster than the 970 Pro for less",
					"Fast",
					"Great speed and amazing startup times.",
					"Great drive, stupid software",
					"Not compatible with OS X"
				],
				"customerReviewBodies": [
					"All I can say is wow! I returned an ADATA XPG SX8200 PRO 500GB for this one and am so glad I did. All PCIE NVME drives are not created equal and benchmark's don't mean anything because they are synthetic and the drives are built to show the \"best\" performance on the benchmarks, which can be a far cry from how they actually perform. First the XPG SX8200 Pro website only gives you the best specs from the 1TB drive and it's nearly impossible to find the slower performance information of the 512GB and 256GB drive on their website (should be a big hint to performance since they don't easily publish it, or list the smaller drive specs on the main page). Second, the bench marks were pretty close on cyrstal diskmark, but when I was actually testing 9GB file copies to and from the XPG, it was often below 600MB/s (even as low as 150MB/s steadily). It did perform better at times, but it was so spotty and nowhere near the benchmarks on a regular basis, I either got a dud or it's just not as good as the specs are in real world performance. Yeah, it was about $30 cheaper than the the new Samsung EVO PLUS 970, but in the end, the price difference was waaaaay overshadowed by the real world performance.\n\nSo, when I got the 500GB Samsung EVO PLUS 970, I popped it in the same slot that the ADATA was just in and not only did it surpass the specs of the CrystalDisk Mark bench, but the real world file copies (using the same file as before), were steadily around 2000MB/s. Not as fast as the benchmark, but leaps and bounds better than the ADATA and the other PCIE NVME drives I've had the ability to test with. Also, those speeds stayed constant for the entire file copy, where most other drives fluctuate up and down. I know that even larger file copies will eventually slow down when the cache runs out, but that's the same for all PCIe NVME drives that are using TLC (or anything other than MLC flash). And, Samsung is upfront with not just the benchmark read/write performance of the drives when using TurboBoost with the cache, but also the performance speeds you can expect when the cache runs out. No other manufacturer is showing that and that shows Samsung's confidence int their drives.\n\nThis drive blew me away, so much, I just ordered another one. I honestly don't think other \"similar\" drives are even in the ballpark on performance (The WD N750 might be the closest, but it's still not on the level of this drive in REAL-WORLD performance for file copies). If you're considering saving a few bucks on a cheaper PCIe NVME drive, I'd highly suggest you do your own large file copies and see if your \"cheaper\" drive really handles how it says it will based off of the superficial benchmark tests. Otherwise, save yourself the disappointment and just get the Samsung EVO PLUS to begin with and you'll be happy that you did.",
					"Re-writing my review, as this drive did not work with macOS when I first bought it. Luckily, they published a firmware update which solved that problem. So I can now report that this drive works great. It's extremely fast, actually bumping up against the limits of the PCI-Express bus that M.2 slots use. Great value from a reputable brand. I'm glad I didn't send it back, and instead just waited. If you have one of these and it's causing crashes and reboots with macOS, update the firmware on the drive.",
					"Note the nvme mounting screw is not included. Check your motherboard kit or buy a new one.",
					"This thing is as advertised, which is kinda rare in PC hardware. Check out the diskmark scores and see for yourself.\nI used macrium reflect free version to clone my older 256GB ssd to this guy, enabled the UEFI bios to handle it and off I go.\n\nCouple things to keep in mind with this drive or any NVME drive. Enable support in the BIOS. Without that, the drive will not be recognized. It's not DOA, you have to enable NVME in the UEFI(bios).\n\nMy board, z170 s didn't like any devices connected to SATA1 and SATA2 in order to work with this drive. The bios found it, but Windows 7 had a fit. It took me a bit to figure this out. Also, if you clone another OS drive to this one, pull the other drive and save any potential hassle.\n\nI'm keeping my other drive for a bit just in case this thing fails because they model is new and ... well ya know..\n\nI bought this before the price jumped up because once word gets out that this thing is as good as it is, the price is gonna skyrocket.",
					"I'm using this SSD on a PCIe adapter card because my older Z97 motherboard doesn't support x4. The system is a little quicker, but not much of a gain over the 850 EVO it replaced. I have only really noticed deletion is quicker. I usually transfer files to external drives so I don't benefit from the speed boost much. I like to have the fastest, greatest thing so it was worth the upgrade for me.\n\nNote if using a PCIe adapter card:\nEven if a motherboard has multiple PCIe slots, this does not mean they all support GEN3. If you are experiencing half speeds, try a different slot.",
					"The Samsung Data Migration software is very useful, cloned my OS drive to my new Evo 970 plus un less than 30 minutes.",
					"Total nightmare to install on a Dell Inspiron 14 laptop. Samsung software only works if it senses a Samsung drive. I mounted the Ssmsung drive in a USB enclosure to clone my existing drive. WRONG! it now identifies as the enclosure name and the Samsung software cannot work as it does not recognize the drive as Samsung. Stupid way to do things Samsung. It makes upgrading to your drive very difficult and your cloning software useless. Had to find a third party cloning program. Tried 3 of them until the last one worked. Wasted many hours to get it to work. Documentation is horrible and the software worse. However, once I got it to work.....WOW! What a difference from the Dell NVME 128gb drive. Way, way faster. Proven by benchmarking program. Very happy with the performance. Makes a big difference. SAMSUNG please make it easier for customers to migrate their data.",
					"Not yet compatible with OSX 10.14.3. I kept getting kernel panics followed by a reboot.\n\nI was really looking forward to this drive!",
					"Nice SSD, nothing to complain about the actual drive.\nBut beware Samsung warranties.\nThey have no RMA process for Canada, for the whole Memory division (SSD, Flash cards, etc).\nIf you ever have issues with SSD, Samsung support is not going to provide any support. They put the responsibility back on the store/seller for the whole period product is supposed to be under warranty.\nIf the store refuses to refund, you're likely out of luck. Stores are generally not aware of those Samsung policies.\nThere are several articles on the Web on this subject, and I was personally affected by this issue.",
					"O",
					"This m.2 form factor is for you if you are running a mid-high range system.\n\nTo give a quick overview of my current spec;\ni7-7700k\n16GB ddr4 HyperX RAM\n2x Samsung 850 Evo 2.5” SATA 500GB\nMSI GTX1060 6GB\nASUS Prime z270-a\n\nValue:\nThis is a great upgrade if you are happy with your spec with video editing & graphics performance. I am not a heavy gamer nor I edit videos (thus my storage) but with lots of file transfer, new NVMe storage solution was the next go-to upgrade. @ $0.74 per GB and with NVMe m.2 form factor being the next generation storage solution, the price will be going down and already has. I purchased the current two SATA 500GB for about $170 so this was a no brainer for me. With read and write speed being about 5x faster (your mileage may vary explained below) you will instantly see an improvement in your quality of life when spending time transferring files or opening an application are now painless.\n\nInstallation:\nThis is a hard part for most people. If you currently have an m.2 ssd as a boot drive you already should know how to install/migrate the old boot drive to this one. Samsung Migration App is very straight forward and easy to use. But there are few hurdles. First initalize the drive first, I’m a total novice and didn’t realize I had to initialize the drive (SATA is easier as it has its own connection) as NVMe is read through PCIe slot so don’t fret if you don’t see the drive not being read on first boot.\nCheck your mobo if the support is there for newest gen m.2. I have z270 and boy was I glad I didn’t cheap out on mobo when I first bought it.\nAnd finally check if you have the m.2 slot enabled to x4 speed in your BIOS. (Usually x2 or x4 as an option) and newest drivers installed both for Mobo and m.2.\n\nPackaging:\nPretty simple, no BS packaging. I however personally don’t like excessive packaging but with electronics becoming smaller and more delicate I understand.. comes with manual and the m.2 stick. No screws, most mobo will include m.2 screws if they support it.\n\nOverall:\nVery happy with the purchase, again it’s a no brainer upgrade if you are content with cpu/gpu performance at the moment and looking to make your pc have a bit more snap. Definitely consider purchasing if you are in the market, Samsung has always made a quality product and this one (to issues with fakes going around from microSDs to SSDs) was made in Korea and with benchmark tests, was a legit piece. If you are looking for a long term and massive storage solution I suggest you instead go for Barracudas 4TB-8TBs with your favourite RAID settings, much more effective and cost efficient",
					"I've always had excellent results with SamSung SSD's and I'm not expecting any thing less then excellent performance from this drive.\n\nI recently got a new ASUS SCAR STRIX with came with an Intel SSD which is ok but it simply isn't as fast as the SamSung options. My old laptop had dual 512GB 950 EVO drives which are still running, I only updated the laptop to get better CPU and GPU performance.\n\nThe below screen shot of Crystal Mark shows the read/write speed while the laptop was in use streaming video and running other functions, this provides a more realistic and real world representation of its capabilities in a working environment than the SamSung bench mark tool.\n\nInstallation was simple enough, once I got access to the MOBO it only takes one small screw to release the installed drive and replace with this one. All told, it took me about 10 minutes from starting to access the MOBO till I was able to fire up the machine.\n\nI didn't have to install Windows and go through that hole saga, I used Acronis to clone the working drive to this one beforehand. I purchased an external SSD enclosure here on AMZ (make sure you find one that specifies NVMe PCIe M.2, there are a few options) which held the new drive. It took about 20 minutes for the clone process on a USB C connection to complete compared to several hours rebuilding a new install with all the programs and data. I use Acronis on a regular basis and it my primary back up tool.\n\nThere are a lot of options from various manufacturers but I've had the best performance and longevity from SamSung drives. We use SamSung SATA SSD'd in production servers with millions of writes every week and have yet to see one crater. We do rotate them out every 3 years to be safe but other brands have crashed, fortunately everything is in at minimum RAID 1 (depending on the server).",
					"I purchased this nvme really for extra storage of my battlefield games.( Battlefield1,3,4,5,) Having upgraded from a Samsung 850 pro ssd 250gb .Does this nvme drive enhance,speed up performance? Not really.Load games quicker! not really .Improve performance when gaming? Not really. So the samsung 850pro was the best ssd anyway, so i was not surprised ref performance .ps I have also installed another fan below this drive as it can get warm when using samsung magician software to test for performance.When im gaming it runs at aprox 38/45 degrees so its good.Hope this helps :)"
				]
			}
		},
		{
			"id": "fbnbMTU",
			"title": "PNY CS900 240GB 3D NAND 2.5\" SATA III Internal Solid State Drive (SSD) - (SSD7CS900-240-RB)",
			"price": "Check fit by model, Find your brand",
			"image": "https://m.media-amazon.com/images/I/61y6gOyq6VL._AC_SY450_.jpg",
			"description": "The PNY CS900 2. 5-Inch SATA-III (6 GB/s) solid state Drive (SSD) is an excellent choice for a mainstream solid state Drive (SSD) Upgrade from a hard disk Drive (HDD). The CS900 drive is designed for an easy and cost-effective HDD replacement in the existing PC system to help realize faster boot times, quicker application launches, and better overall system performance. With no moving parts, PNY CS900 is highly durable, less likely to fail..",
			"reviews": {
				"customerProfileNames": [
					"RocketCityChas",
					"N.S.",
					"Dealors",
					"Customer",
					"DR"
				],
				"customerProfilePictures": [
					"https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif"
				],
				"customerRatings": [
					"1.0 out of 5 stars",
					"2.0 out of 5 stars",
					"5.0 out of 5 stars",
					"5.0 out of 5 stars",
					"1.0 out of 5 stars"
				],
				"customerReviewTitles": [
					"Horrible reliability",
					"Short term, be sure to do frequent backups *UPDATE",
					"Perfect for my secondary drive and at the right price",
					"From decent to uber boyfriend in under 10 seconds",
					"Easy. Fast and also short-lived"
				],
				"customerReviewBodies": [
					"I built a RAID 5 for a home security system with 5 of these. One drive failed at 5 weeks. (Five is a magic number with this review. 5 drives in RAID 5 failing in 5 weeks.) Instead of repairing the RAID 5, I decided it simply wasn't worth repairing if the drive failed that quickly.\n\nI also built a RAID 0 in a Linux home rig for High Performance Computing for assisting for my work towards a PhD in the filed of computational electromagnetics. One drive failed on merely the 4th week. Instead of rebuilding, again applying the reasoning, why rebuild the same configuration if its reliability was so low, I bought an LSI (now BroadCom) NVME Host Bus Adapter and one of the crazy fast and crazy reliable Samsung 970 Pro NonVolatile Memory (M.2 form-factor NVMe) SSD (with SAS to NVMe cable and M.2 housing for installing in a drive bay). The build with the LSI HBA and 970 Pro has been AMAZING -- extremely high performance and flawless reliability so far though granted I am only 4 months into this configuration. To be fair, I think a comment on reliability should be made after at least a year of service, preferably 4 or 5 years.\n\nAs a closing note, one may wonder if I had a good power supply, meaning anything from enough power capacity to clean enough power for the 5 Disk RAID. Well a month after removing the 5 disk RAID 5 and installing stand alone SATA III SSDs for each of my security cameras, I wanted better performance from this build. The system is maxed out at 32 GB DDR3. The cameras are a mix of older H.264 and newer H.265. I record all in 24-bit color depth, 2 MPi and 20 fps. In real-time I transcode the two older H.264 to H.265. I did have a P1000 and the CUDA libraries installed in this rig before commissioning the P1000 for my Linux HPC. Now I simply transcode the H.264 to H.265 in (as close to) real-time (as possible) with Intel QuickSync on an i5-4430. If both of the two older cameras are triggered at once, my 32 GB of memory can file rather quickly. I am running Windows 10. I also immediately mirror the files to a remote server for improved security. When the OS starts paging frequently, the video files were getting corrupted as this 4-core QSync rig simply couldn't keep up with real-time when multiplexing processor time for paging memory contents. I likely could have tweaked things to get the OS and any unneeded processes unloaded from memory. However, instead I took a huge chance. Even with my lousy two recent experiences with RAIDs failing, I took 5 of the Samsung 860 Pro SATA SSDs and built a RAID 0 of the PRIMARY (SYSTEM) drive -- a very scary thing and highly unadvisable in general. However, my experience (even before knowing or reading the specs) with Samsung's Pro series has been rock solid. I use a few 840 Pros to build a RAID 10 at the office several years ago, and I have had ZERO troubles from it. With the new 860 Pro boasting 1.5 million hours Mean Time Between Failures and 300 Terabytes written warranty and with a 512 MB cache, I was willing to take my chance. I also used a slightly larger than default block size in hopes of speeding paging operations. That was 3 months ago, and I have not had any corrupt video files from my security system since. It wasn't that the video files were being paged. It was that the processors had to take time out to orchestrate a great amount of paging, and the OS could only page so fast. This RAID consumes a peak power of 16.5 W and a standby power of 0.25 W. My power supply has had no difficulty meeting the power requirements. These, as one would certainly expect, support TRIM as well as AES-256 and IEEE1667 encryption. The drawback... the Samsung Pro Series SATA III SSD are considerably more expensive than many low-cost SOHO SATA III SSDs -- $88 vs $40. When building a 5 disk RAID that is a price difference of $240 OR 120% more costly, but my experience has been that low-cost SOHO SSDs simply cannot be used in RAID configurations.\n\nWhen a user has plenty of PCIe lanes, I highly recommend NVMe. Reliability is fantastic and performance is considerably better than RAID. I benchmark and also experiment with real-world scenarios of NVMe vs SATA RAID vs SAS RAID. I am yet to have seen the performance of even a 6 disk SAS RAID come even close to performance of an NVMe in both personal benchmarks and personal real-world experience. For now, Intel doesn't offer enough lanes to satisfy my insatiable appetite for data. I have an i9 rig with 44 lanes for an extreme HPC server. I'd like to have a x16 display, my x16 Tesla, my x4 NVMe OS drive, my x4 10 Gbe NIC, an x4 NVMe data drive, an x4 mirror for the system drive and an x4 mirror for the data drive. That is 52 lanes. AMD offers processors with more than 52 lanes, but I already commited my money to the i9. Also, at the time AMD only supported DDR3. Now they support DDR4. AMD's slow adaptation of DDR4 really hurt them even though they have managed to stay ahead of Intel on PCIe lane count and on core counts and on clock rates and sometimes ahead on chace though in general, poorer cache and poor Platform Control Host... traditionally. AMD seems to be gaining momentum. However, mothertboard manufacturers seem slow to embrace the recent advances of AMD. I also am a big fan of QuickSync. I find it to be fairly comparable to NVidia's GPUs when scaled to 64-bit bus though the ever expanding bus is where NVidia is able to load and unload gobs of data between on-board memory and compute cores extremely quickly -- very nice for iterative solutions. NVidia cannot yet fit 128 GB like QSync. While on-board and off-board (\"off-core\") memory share is possible with OpenMP and even many message passing interfaces by treating the GPU has a node and the host CPU as the parent node, efficiency takes a huge hit, negating the value. Intel needs to get more than 44 PCIe lanes and NVidia needs to push beyond 48 GB DDR5 to 64 GB and even hopefully very soon to 128 GB -- granted the NVlink/NVbridge is available for many HPC cards, but I find only a limited few.\n\nIn summary, these cards are cheap, meaning affordable and very low quality. The net effect is close to placing the money directly in a paper shredder. Do not waste your precious time, money or data. Do not be swayed by Sirens sweetly singing a low price on these SSDs.",
					"Well, this was a recently fast SSD upgrade over the HDD that was in the laptop before. I bought it just over a year ago, and until tonight it's been in use in my laptop for about a year.\n\nQuick and easy to install the hardware, Windows installed quickly as well.\n\nTonight, however, it decided it was done. The computer hard locked, so I reset it and that was it... \"No bootable device found...\"\nI attempted to fix the OS install with a Windows boot disc, but it wasn't having it. So, eventually, I attempted to reinstall Windows, but the SSD couldn't even be initialized. It's just dead. :/\n\nNow I get too try out the PNY warranty claims and customer service...\n\n*UPDATE*\nTheir returns process was easy and the replacement arrived quickly. They do the “you pay to ship yours, we’ll pay to ship ours” method. Which is... fine. We’ll see how long the replacement lasts.",
					"I",
					" went from 2 minutes to around 30 seconds which is a huge difference from booting from a SATA or IDE drive and it was real easy to install.\n\nBut this SSD drive was an addition to the speed factor as I have a pair of ",
					" with the addition of a affordable ",
					". So my computer has sped up greatly with the addition of this SSD. You may need a mounting plate for this SSD if your computer case is not screw-less since it does not come with one. An excellent mounting kit is the ",
					" since it can hold 2 SSD drives and comes with everything included such as SATA Data Cables and Power Cables to complete your SSD drive installation.\n\nI also have a ",
					" but I purchased the ",
					" since it was over half the price of the Samsung SSD and I could use it as a backup drive.\n\nAlso I did a speed read / write test with Crystal Disk Mark 6.0 and the write speed was about 250 MB/s with a brief peak near 400MB/s and read speed was about 425MB/s.\n\nHope this helps someone - have an awesome life.",
					"Girlfriend has a laptop (lenovo flex 4) that was until a week ago slower than certain populations are to accept climate change (something about a windows 10 update nixing the amount of power the stock HDD needed to operate as intended). Anyway, I took an evening and migrated her old windows image and files onto this using the included drive cloning software then swapped drives. The Lenovo's boot time went from 3 mins plus to 10 seconds, and my status as caring, nurturing bf went from okay to highly decent. I really recommend.",
					"Drive initially worked great, easy install, performance boost of over 300%. Then, without any warning, the drive crashed a week ago (6 wks. old). Unbootable now. Pny is going to replace it at my expense of shipping cost so there goes the initial savings on this model.",
					"E",
					"",
					"F",
					"",
					"Good name, good price",
					"Produto muito bom. Qualidade da embalagem e do produto muito boa. Rápido como se espera de um SSD. Foi compatível com o meu hardware e não tive problemas pra instalar e nem configurar o windows. Chegou bem rápido e dentro do prazo. Nada a dizer. Fica apenas a questão da durabilidade do produto. que só vou poder responder com o tempo de uso mesmo. Do mais, excelente custo benefício.",
					"",
					"Pues tengo un todo en uno dell.. la compre en 2017 a partir de que instale la actualizaciòn de cortana.. la computadora se moria lentamente (considerando que tiene un core i7 a 3.4, 8 de ram)... entonces decido agregarle este disco solido... de estar 60 segundos a que me dejara utilizar el equipo al iniciar... con el disco solido tarda 3 segundos en inicializar al 100.. todas las aplicaciones corren excelente... videojuegos, hojas de excel, paginas web.. todo el mismo tiempo y no he tenido ningun lentitud... una mejora del 500%.. lo recomiendo.",
					""
				]
			}
		},
		{
			"id": "i07CdOa",
			"title": "WD_BLACK 2TB SN850 NVMe Internal Gaming SSD Solid State Drive with Heatsink - Works with Playstation 5, Gen4 PCIe, M.2 2280, Up to 7,000 MB/s - WDS200T1XHE",
			"price": "$259.99",
			"image": "https://m.media-amazon.com/images/I/61qGBDw+fDL._AC_SY450_.jpg",
			"description": "The Future Of Gaming Has Arrived With The Wd_Black Sn850 Nvme Ssd With Heatsink. Long Load Times Are Obsolete With Pcie Gen4 Technology, Reaching Up To 7000Mb/S Read Speed And Up To 5300Mb/S Write Speed (1Tb Model). Spend More Time Playing And Less Time Deleting, Storing Your Latest And Favorite Games With Up To 2Tb Capacity (Not Intended For Nas Or Server Environments).",
			"reviews": {
				"customerProfileNames": [
					"H.MCGEE",
					"Trailblazer15",
					"Bookly",
					"A.Jones",
					"Kaldune",
					"JP"
				],
				"customerProfilePictures": [
					"https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif",
					"https://images-na.ssl-images-amazon.com/images/S/amazon-avatars-global/329f90d2-7574-4f9f-bb1f-584ed93d7e21._CR0,0,347,347_SX48_.jpg",
					"https://images-eu.ssl-images-amazon.com/images/S/amazon-avatars-global/28dc2dcf-d411-43f0-9259-f4f751c70e76._CR30,0,440,440_SX48_.jpg",
					"https://images-na.ssl-images-amazon.com/images/S/amazon-avatars-global/6a373f24-8d46-4748-a91e-7851347d37b4._CR0,0,500,500_SX48_.jpg"
				],
				"customerRatings": [
					"5.0 out of 5 stars",
					"5.0 out of 5 stars",
					"5.0 out of 5 stars",
					"5.0 out of 5 stars",
					"5.0 out of 5 stars",
					"3.0 out of 5 stars"
				],
				"customerReviewTitles": [
					"Amazing for the PS5 & I LOVE IT!!",
					"Really fast",
					"Works with PS5 Extended Storage!",
					"Bought for PS5, Excellent for the price!",
					"Top Consumer SSD",
					"WD GET YOUR ACT TOGETHER"
				],
				"customerReviewBodies": [
					"I bought the 2 TB WD SN 850 for my PS5 as soon as I got the beta SSD update from Sony. Came in today, installed and this is a game changer as games loads even faster than the stock internal SSD that came in the console. The drive is pricey but I am fine investing in my console for years of enjoyment. I highly recommend any of the different sizes for PS5 gamers.",
					"Got this drive installed and Windows installed and I am now getting close to the speed specs after having to change a couple things. Please read my tips, it may help you and save some frustration and even maybe save you from returning it. To get that max speeds this needs to be installed in a PCIe 4.0 compatible motherboard with a PCIe 4.0 compatible CPU. I am using this in an Asus X570 Tuf Gaming Plus with a Ryzen 3900X. This also needs to be installed in the M.2 slot closest to the CPU which has a direct connection to the CPU, I initially had it in the bottom slot below the PCIe slots and that one is connected to the chipset which is slower, I was getting like half the write speeds at first until I switched it. You also need to download and install the WD SSD Dashboard so you can enable the Gaming Mode, otherwise again, speeds won't be as fast. After those couple things, I am now getting close to advertised speeds and I am happy. I will update my review if anything changes down the road.",
					"I joined the PS5 Beta program and wanted to extend the m.2 SSD Storage in the console. I took the risk of trying this drive after reading their measurements and speed specifications and this drive seemed to match them all. I went with 500GB just due to price/risk. I think it's safe to go ahead and try the 1TB version if you're serious. I'm glad WD comes through again with a solid product for gamers.",
					"Y",
					"Getting similar numbers to TweakTown's review. Great for gaming, programming, and content creation. It's noticeably faster than the HP EX950 I just replaced, which was already pretty dang fast.",
					"I originally bought a WD 2tb NVME to use as my main OS, but it would not migrate/clone properly even with their own software. I downloaded a 3rd party migration/cloning software and that didnt work either. I tried nearly everything I could for 1.5 days! I even tried backing up/restoring manually and then repairing. Nothing worked. It was a complete waste of time. I didnt even learn anything in the process other than learning that I should go with a company that has a readily available comprehensive solution that doesn't needlessly waste your valuable time. 1.5 days down the drain.\n\nSo I ended up migrating my Samsung 1tb NVME to a new Samsung 2tb NVME and it couldnt have been any easier. < 15 minutes, very quick! I previously, migrated from a corsair SSD to Samsung 1tb NVME (when i couldnt get another SSD to migrate properly), and that was flawless as well. Why didnt I initially go with the Samsung 2tb instead of WD? Press had positive news about it. I am not a fanboy so I like to try different solutions. That was a mistake. What's apparent to me after this experience is that Samsung is better than all their competitors at providing a comprehensive package of the best hardware and software. The experience is FLAWLESS. I havent had any issues with any of their storage solutions to date.\n\nWhy did I bother writing this review? Because I wasted 1.5 days. Something has to come out of it. Maybe itll help someone or maybe WD will get their act together and work on their cloning/migration software because the hardware seems to be fantastic.\n\nDisclosure, I bought and paid for everything myself and I still own HDs/SSDs/MicroSds by WD (only old HDs), Sandisk (microsds, ssds), Seagate (HD), Samsung (SSDs, Micro SDs and NVMEs).",
					"Produkttest: WD_BLACK SN850 1TB NVMe Gaming SSD mit Kühlkörper\n\nAusgangslage bzw. Einsatzbereich, optischer Eindruck:\nIch bin zum glücklicher Besitzer einer PS5. Jeder der eine PS5 besitzt kennt das Problem das der interne Speicher sehr schnell knapp wird. Deshalb war ich auf der Suche nach der passenden Speichererweiterung in Form einer NVMe SSD. Sicherheitshalber mit einem Kühlkörpern wie er von Sony empfohlen wird. Optisch sieht die SSD sehr gut aus, ich bin von Western Digital bislang auch nie enttäuscht worden.\n\n👍🏻Vorteile:\n+ SSD lässt sich sehr einfach installieren\n+ SSD besitzt einen Kühlkörper\n+ Die Geschwindigkeit von bis zu 7000 MB/s in der Beschreibung entspricht annähernd der Realität\n+ Wird auch in der PS5 problemlos erkannt\n\n👎🏻Nachteile:\n- Keine\n\nTest & Fazit:\nIch habe die SSD ausschließlich in der Playstation 5 getestet da ich am PC aktuell keinen Bedarf an einer weiteren SSD habe. Das praktische an der SSD bzw. am SSD Format ist das man sie auch jederzeit am PC verwenden kann. Ist eventuell interessant wenn man seine PS5 mal verkaufen möchte.\n\nDie Installation ist super einfach, man muss lediglich die Abdeckung der PS5 entfernen. Im zweiten Schritt ist dann das Abdeckblech des SSD Slots zu entfernen. Bevor man dann die SSD in den Slot einstecken kann muss noch der Abstandshalter an der richtigen Stelle eingeschraubt werden. Details sind in den Bildern zu sehen. Anschließend die SSD einstecken und in der umgekehrten Reihenfolge die Teile wieder zusammensetzen.\n\nBeim Einschalten der PS5 wird dann sofort die SSD erkannt und man bekommt die Option die SSD zu formatieren. Kurz darauf wird noch ein automatischer Speed Test durchgeführt. Dabei ist ersichtlich das die SSD einen Datendurchsatz von 6200 MB/s also fast die 7000MB/s schafft.\n\nUm das auch unter realen Bedingungen zu testen habe ich mal Far Cry 6 von der original SSD auf die getestete SSD verschoben und die Zeit gemessen wie lange es dauert bis das Spiel geladen ist. Der Startpunkt war der Klick auf „Starten“ im Home Menü der PS5 bis zum Erscheinen des Startbildschirms von Far Cry 6.\n\nFolgende Zeiten konnte ich messen:\n\nFar Cry 6 Ladezeiten\nOriginal SSD: 13,2 Sekunden bis zum Startbildschirm\nSSD von WD: 12,48 Sekunden bis zum Startbildschirm\n\nDas Verschieben von Far Cry 6 von der original SSD auf die getestete SSD von WD mit einer Größe von ca. 80,7GB hat 1:08,41 Minuten gedauert.\n\nDie WD Black SN850 SSD bekommt von mir volle 5 ⭐️⭐️⭐️⭐️⭐️. Die SSD ist mindestens genauso schnell wie die in der PS5 verbaute interne SSD. Der Einbau hat problemlos funktioniert. Zusätzlich kann man jederzeit die SSD auch in einem PC verwenden wenn man die in der PS5 nicht mehr benötigt.\n\nIch hoffe das ich Ihnen mit meiner Rezension ein wenig behilflich sein konnte, danke für das Lesen :-)",
					"",
					"This took me about five mins to install , on startup it say format and follow the screen basically , seems ok and good speed . I’ll find out more when I add a few games to it . I bought the heatsink one and it has been on for an hour and has no issues so I expect any would have shown up by now . All good. I have tested the ssd it’s fast and has no issues it’s got severel games on now. And I’ve moved from this ssd to console memory and back and it’s fine . I bought at nearly half price so can’t complain. It is still working very very well and recommend highly",
					"Installed in to a PS5. Was fine for 5 days, then in the middle of use the PS5 shut down. Powering on again, it said that the drive couldn’t be repaired and needed to reformat. However, reformat wasn’t possible. Seems this is a more common occurrence than one would think, after looking online.\n\nI’m incredibly disappointed as usually WD products have been solid for me.\n\nI’d advise against buying, at least for a PS5 use, until seeing evidence that this is no longer an issue.",
					"Lo compre para mi PlayStation 5 con disipador ya que Sony lo recomienda y el mismo diseñador de la consola Mike Cerny lo recomendó. En PC su velocidad es impresionante 7000mb/s en lectura y 5000 mb/s en escritura la prueba la hice en CrystalDisk Mark 8 con una unidad de 1TB.",
					"",
					"I installed this drive in my PS5, it was easy to fit (sliding the side off was the most difficult aspect). The drive was recognised on boot-up and formatted and is now in use. There are plenty of video tutorials of how to fit drives in the PS5 and it is worth looking at these to ensure it is a smooth process.\n\nThe heatsink is great for the PS5 and fits comfortably.\n\nThe only downside, it is not a cheap drive, but I did got for a fair bit cheaper than the equivalent drive sold for the XBox Series X."
				]
			}
		},
		{
			"id": "WhQKjHw",
			"title": "LaCie Rugged SSD Pro 1TB Solid State Drive — USB-C Thunderbolt 3, Drop Shock Dust Water Resistant, for Mac and PC Computer Desktop Laptop, 1 Mo Adobe CC (STHZ1000800)",
			"price": "$389.00",
			"image": "https://m.media-amazon.com/images/I/712xZ84ec7L._AC_SY450_.jpg",
			"description": "Rugged SSD Pro harnesses the power of a Seagate FireCuda NV Me solid state drive to maximize Thunderbolt 3 capabilities. The result? Portable SSD speeds of up to 2800MB/s—that's 5x faster than traditional SATA SSDs—and extreme durability so filmmakers and DITs can directly play back the most demanding 6K, 8K, and super so-so source files in any environment—without transcoding. Tackle any terrain with extreme IP67-rated water resistance, three-meter drop resistance, two-ton pressure resistance, and 1TB of space in a smart-cooling, palm-sized drive. Enjoy seamless compatibility with Thunderbolt 3 and USB-C on both Mac and Windows computers. For long-term peace of mind, this SSD includes a five-year limited product featuring Rescue Data Recovery Services. Lastly—take advantage of the one-month complimentary membership to Adobe Creative Cloud All Apps Plan for access to awesome photo and video editing apps!",
			"reviews": {
				"customerProfileNames": [
					"Gregory",
					"Sareeya^_^",
					"MichaelJordon",
					"User#147-234",
					"RubyKim",
					"RobertScales",
					"JamesC.",
					"Customer"
				],
				"customerProfilePictures": [
					"https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif"
				],
				"customerRatings": [
					"5.0 out of 5 stars",
					"5.0 out of 5 stars",
					"5.0 out of 5 stars",
					"5.0 out of 5 stars",
					"5.0 out of 5 stars",
					"5.0 out of 5 stars",
					"4.0 out of 5 stars",
					"4.0 out of 5 stars"
				],
				"customerReviewTitles": [
					"Unexpectedly small and extremely powerful",
					"Works as expected",
					"Blazingly FAST !!!",
					"Would buy again",
					"good",
					"Amazing",
					"Great external SSD but cable too short",
					"Great, but you need to buy your own USB C cable"
				],
				"customerReviewBodies": [
					"NEW, NO original box",
					"Was in the market for an external HDD Hard drive and stumbled upon this pup and decided to spend the extra money and go with and SSD. Glad I did. I am using this to store extended sound libraries from some Logic Pro X and other third party sound libraries.\n\nPros\n1) Extremely small and light weight. Fits in the palm of my hand\n2) Has the same LaCie Durability that their HDD Hard Drives have\n3) Incredibly fast. It took about 20 minutes to download 80% of extended Logic Pro X sound library onto this little thing.\n4) The connection when using the external sound libraries with the program is seamless. No delays in connection.\n\nCons\n1) The mini thunder bolt 3 (USBC) cord they give you is small and very sensitive so if you're moving the computer around at all, the connection will get cut. Something to keep in mind if you're outdoors and using this for photography.\n\n2) Can heat up rather quickly if its being used for an extended period of time. I am currently using it in the winter time in a cooler room, so i'm not overly concerned about it now.",
					"I use this for Mac OS time machine backup. It works great and fast. Small and tough perfect for travel.",
					"If you want to download/copy files and can't wait for GigaBites to transfer, then you need this in your life,\n\nBasically, 1Gb per second transfer speed!",
					"Seems very well made. Its certainly fast at read write. Would buy another one.",
					"very good",
					"I love this ssd worth the money I’m definitely buying other one",
					"This is a fast drive and since it's SSD and rubberized, it's probably very sturdy. But at about 8\", is too short. I tried to address this by buying a genuine Apple brand USB-C cable but the drive is not recognized by my Mac when I use it. If I change back to the short cable that it came with, everything is fine. I looked at the LaCie FAQ section and they say that if a longer cable doesn't work, then use the short cable it came with. This indicates to me that they know of the limitation and chose to ignore it since the provided cable works.",
					"Seriously, you will need to buy your own cable. It is so comically small that it essentially needs to be placed on top of your laptop. The most useless cable ever. BUT the product is way smaller than you think it is, which is a huge benefit. It works it’s great yadda yadda yes, but how hard is it to include a cable that is longer than an inch?",
					"I'm running a MacBook pro 2017 (the one they came out with 4 thunderbolt ports) and I'm using this to get the same performance out of windows 10 vm as if they were on the local drive. It's no surprise, really, given the speed of the thing and of its thunderbolt connection. You will NOT regret this buy! It's also very stable. I've never had anything this fast. It gets warm, but that's about it, its never really hot or anything. I'm sure it'll last. It's a LaCie, after all, and statistically speaking, a good bet!",
					"So fast I can use it as a cache for motion graphics design work. It's not cheap but it's worth it as it is far superior to USB external drives.",
					"Il n avait les fils adéquats!!!!!!!",
					""
				]
			}
		}
	]
}
