[
  {
    "id": "9sHL_BqTJAiONmU6-SuXT",
    "title": "Degree Men Original Protection Antiperspirant Deodorant 48-Hour Sweat & Odor Protection Extreme Blast Antiperspirant For Men 2.7 oz, Twin Pack",
    "imageUrl": "https://m.media-amazon.com/images/I/71qYIlIOMUL._AC_SX425_.jpg",
    "price": "$5.78",
    "description": "Degree Men Extreme Blast Antiperspirant Deodorant delivers 48-hour sweat and odor protection to keep you feeling dry and fresh. This antiperspirant deodorant for men works as hard as you do and offers 48-hour protection, so you can take on the day. Our Extreme Blast Antiperspirant Deodorant features a refreshing kick of crisp, citrus freshness. The powerful antiperspirant deodorant responds when you need it most, so you can stay confident without having to worry about slowing down. You can be confident you’ll be protected from sweat and odor by this antiperspirant for men. Stay fresh and feel clean from morning to night. Simply twist, glide and get moving. The crisp, energizing scent helps to keep you as fresh as when you started your day. Stay dry, cool, and confident thanks to Degree Men Extreme Blast Antiperspirant Deodorant. At Degree, we want to inspire  the confidence in everyone to move more and go further. We’re here to support  your journey through an antiperspirant that moves with you and helps you go beyond your limits. As well as increasing our use of reusable materials, we’re making it easier for you to recycle our antiperspirant and dry spray packaging. Degree. It won’t let you down.",
    "reviews": [
      {
        "name": "Denise Nembhard",
        "pictureUrl": "https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif",
        "rating": "5/5",
        "reviewTitle": " Doesn't irritate my skin!",
        "review": "As I have gotten older (58) my skin has become sensitive to certain soaps & deodorants that I was accustomed to using. Now I have to be a little choicy in what I use. This deodorant does that! Keeps me dry, smells nice & does not burn or make me itch!"
      },
      {
        "name": "LesB",
        "pictureUrl": "https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif",
        "rating": "5/5",
        "reviewTitle": " Got all 6",
        "review": "I was scared because of the reviews that people only got 3 sticks, when it clearly advertised 6 in the first line of the description.\n\n\"Case of three packages, each containing two 2.7-ounce deodorant sticks (total of 6 sticks)\"\n\nI didn't read the reviews until after I purchased (I know bad habit) and was worried. I was totally prepared to file my refund when the package came in.\n\nI opened it up and there they were; 3 twin packs totaling 6 sticks, which makes this a fantastic deal! Less than $2 a stick.\n\nWill buy again and hopefully I never get the 3 stick box ever."
      },
      {
        "name": "Love to shop",
        "pictureUrl": "https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif",
        "rating": "5/5",
        "reviewTitle": " Stinking great!",
        "review": "I sweat, a lot. Pretty obvious why I need deodorant, but I've learned the hard way that not all are created equally and I am now exclusively committed to Degree.\n\nTo be fair, no Antiperspirant is going to stop me from sweating, just not going to happen. But there's a marked difference in terms of preventing odor between a good and poor brand, and this one prevents me from smelling like the gym hours after I've showered. I'd say it gives me a good 10-12 hours, in my book that's as much as I can ask from any deodorant. I'm sticking with Degree (no pun intended) until it stops working or I stop smelling...wonder which will happen first!"
      },
      {
        "name": "beedyreader",
        "pictureUrl": "https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif",
        "rating": "5/5",
        "reviewTitle": " Great Price, Great Product, Hubby's Happy!",
        "review": "This is my husband's favorite deoderant, and frankly, mine too. First I loved it because of how he smelled, and one day I ran out of mine and started using his - it worked better than what I'd been using and still smelled great without being too 'manly' for a woman. (Though it is certainly a manly enough scent for hubby, and I love it!).\n\nBought the pack of 3 - two sticks per, and it's the same as if I'd gotten it at the store, except I caught it on sale and saved a BUNDLE. My wallet's really loving this!"
      },
      {
        "name": "D Soto",
        "pictureUrl": "https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif",
        "rating": "5/5",
        "reviewTitle": " Degree deodorant",
        "review": "Great buy for the price and was delivered quickly!"
      },
      {
        "name": "E. Tewald",
        "pictureUrl": "https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif",
        "rating": "5/5",
        "reviewTitle": " Great",
        "review": "Great product. Same as I’d get locally only cheaper."
      },
      {
        "name": "Dan Hammer",
        "pictureUrl": "https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif",
        "rating": "5/5",
        "reviewTitle": " As described",
        "review": "Great value and the stick inside was intact!"
      },
      {
        "name": "Matthew Stephen Propst",
        "pictureUrl": "https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif",
        "rating": "5/5",
        "reviewTitle": " Great Price per Stick, Product I've Used for Years and Does the Job and Smells Great",
        "review": "Was traveling out of the country and unsure of what would be available in the 3rd world. Stocked up on plenty of these to go with me. They smell great, anti-antiperspirant does the job except in very hot climates or exertion and even if sweating a lot frequently complimented on smelling good while wearing nothing else with a scent. Would definitely recommend as long as price in bulk online remains cheaper than your local grocery store."
      }
    ]
  }
]
