[{"id":"l-PLwU-6GvB_N6TPSs75-","title":"Fidget Toy Pack Push Pop Bubble Popping Set Big and Mini Spinners Full Selection of Sensory Toys for Autistic ADHD Kids Girls Great Kid Valentine Toy Sets to Share","imageUrl":"https://m.media-amazon.com/images/I/91stKMrU2oL._AC_SX425_.jpg","price":"$25.49","description":"Product description","reviews":[{"name":"Jennifer L.","pictureUrl":"https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif","rating":"5/5","reviewTitle":" Very good buy","review":"The child I gave this too was ecstatic to receive it, they at this point only ever ask me for fidget toys since \"you always get me the best ones!\""},{"name":"Kayla Driggers","pictureUrl":"https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif","rating":"3/5","reviewTitle":" Storage box arrived broken","review":"Receive the item in the mail today and when i opened the package the storage container that came with the toys inside was broken."}]},{"id":"6s58BNR04WFtRC7rmvmd8","title":"42 Pcs Sensory Fidget Toys Pack, Push Bubble Popping Fidget Sensory Toys, Stress Relief & Anxiety Relief Tools Bundle Fidget Toys Set for Kids Adults, Autistic ADHD Toys","imageUrl":"https://m.media-amazon.com/images/I/81JQpoV0yDL._AC_SX425_.jpg","price":"$19.99","description":"【42 Pcs Sensory Fidget Toys Pack】: 1 Ice Cream Push Bubble, 1 Hero Push Bubble, 1 Fidget Spinners, 1 Infinity Cube,1 Squeeze-a-Bean Soybean, 1 Squeeze Football, 6 Mochi Squishy Toys, 6 Marble And Meshes, 6 Stretchy String, 1 Snake Cube Twist Puzzle 1 Flippy Chains, 4 Pop Tubes, 2 Rainbow Springs, 2 Fingertip Skateboard, 2 Wacky Tracks, 6 Gold Finger Massage Rings.\n【Perfect Stress & Anxiety Reducing】: Have your child or yourself felt anxious, restless and a bit OCD suddenly? Then you might need or even love this fidget box. These fidget toys can relieve anxiety well or simply pass the time by simply playing squeezing, stretching and flipping with these fidget toys. Great for kids & adults with ADD or ADHD and people with OCD or high stress/anxiety levels.\n【Portable Size & Easy to Carry】: These relaxing mini fidget toys are portable and pocket sized, small enough to play with one hand and take to anywhere, like the office, home, church, libraries, station, in special education classrooms, therapy ,sensory rooms and on the go. Keeps brain focus and hands busy busy as long as you want.\n【Top Quality for All Ages】: Each fidget toy is made from safe and durable materials, safe for kids and adults. Have fun playing without worrying.They can be reused and cleaned for a long time. Get it and share it with your family or friends, enjoy a fun party time.\n【Amazing gifts and rewards】:These fidget toys are currently the most popular toys. Great for kids birthday party favors, school classroom rewards, classroom treasure box, carnival prizes, pinata fillers, Christmas stocking stuffers, Christmas giveaways, goodie bag fillers, miniature novelty toys.","reviews":[{"name":"Susan","pictureUrl":"https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif","rating":"5/5","reviewTitle":" As expected","review":"I believe it will be a very good choice for my grandkids stockings,"},{"name":"carletta kinsler","pictureUrl":"https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif","rating":"5/5","reviewTitle":" amazing i got this for xmas i love it sm!","review":"it has great pops and amazing toys!"},{"name":"Melissa B.","pictureUrl":"https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif","rating":"5/5","reviewTitle":" Good","review":"Fun for the kids."},{"name":"Paola Barboza","pictureUrl":"https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif","rating":"4/5","reviewTitle":" Variedad","review":"Good combo"},{"name":"Dan hessler","pictureUrl":"https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif","rating":"5/5","reviewTitle":" Fast shipping","review":"Nice products"}]},{"id":"tgBqi3paGLTmwqIGq2nhu","title":"DIIGER 50Pcs Fidget Toys Pop Fidget Set Sensory Toy Packs Stress Anxiety Relief Artifact Pop Bubble Suitable for Adult Kids Gift","imageUrl":"https://m.media-amazon.com/images/I/81haRB9HjYL._AC_SX425_.jpg","price":"$19.99","description":"FIDGET SET TOYS: A Perfect Way to Relieve Stress .Hold in the Palm of Your Hand. It's a fun way to keep the brain focused .\nSAFE: Non-Toxic. Meets toy standards and durable. good quality.\nMULTIPLE CHOICE:This set has 50 Piece of sensory toys in total.When you feel bored playing with just one toy, you can choose other toys to relieve your stress\nBEST GIFT:Sensory toys great for kids birthday, school classroom rewards, christmas activity, Christmas giveaways.\nProviding a 100% satisfaction experience is our main priority to our customers.If the products have any problems,please feel free to contact us.","reviews":[{"name":"Anna Issic","pictureUrl":"https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif","rating":"5/5","reviewTitle":" worth the money","review":"worth the money! My kids totally love them! amazing quality, no plastic smell!"}]},{"id":"5WXndYvXsleitsjB7I5jR","title":"Winning Moves Games Monopoly The Mega Edition","imageUrl":"https://m.media-amazon.com/images/I/9105SYMsSiL._AC_SX425_.jpg","price":"$33.99","description":"Product Description\n\nThe same classic board we all know and love PLUS 9 new properties including 7 new states! In Monopoly the Mega Edition, you'll be able to build skyscrapers AND the game will play faster thanks to the Speed Die - invented by Winning Moves! Winning Moves Games was founded in 1995, and is a leading producer of iconic board games, card games and handheld puzzles. With a talented group of designers, developers and marketers, our mission is to provide happiness to consumers by offering classic, retro, cool and fun games for play with friends and family. Monopoly The MEGA Edition is recommended for everyone ages 8 and up, for 2 to 8 players.\n\nFrom the Manufacturer\n\nEveryone loves the timeless game-play of Monopoly. Now, with Monopoly: The Mega Edition, you'll be able to own more properties, build more buildings, handle more cash, and -amazingly- play faster than ever before!","reviews":[{"name":"American Consumer","pictureUrl":"https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif","rating":"5/5","reviewTitle":" we are hardcore Monopoly players and this has become our new favorite edition. It brings a new spin to the ...","review":"We were a little hesitant to get yet another edition of Monopoly. We have about a dozen different editions already. My three boys and I are addicted to Monopoly. In any case, we are hardcore Monopoly players and this has become our new favorite edition. It brings a new spin to the game by adding another level of buildings (skyscrapers and train depots), more money ($1000 notes, e.g.), and of course more properties (every set has one additional property - except the railroads). If you are not interested in playing forever, use the speed die which will help ensure that the game ends sooner rather than later once there are some developed monopolies on the board. Most of the game is well thought-out. There are a few exceptions, however. For example, there is a chance card that says to move to the next utility and roll the dice and pay the owner 10 times the number rolled. Well, if you own all three utilities, the rent is 20 times the number rolled. It seems like in fairness, the owner of three properties should get 20 times. We do not like that bus tokens can expire. I see the point...but it's rather annoying. We're debating whether or not to remove the cards that force all other cards to expire. We also think that the bus tokens should be reused - like Chance and Community Chest. Despite these anomalies, the game plays well and super fun. If you're already a Monopoly addict, then this will be a lot of fun. If you've never played, you might want to start with regular Monopoly and then work your way up to this edition later."},{"name":"Adam Leonard","pictureUrl":"https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif","rating":"5/5","reviewTitle":" Great for fans of the original","review":"I randomly stumbled upon this game one day, and being a huge fan of Monopoly as well as similar types of games, it immediately clicked with me. I heard this from some online forums claiming that with Monopoly being a terrible game, Mega Edition fixes seemingly every problem people may have with it. Of course, I ignored that first part, I was really just interested in trying out this game, the bigger board, and its new mechanics. And I was not disappointed in the slightest.\n\nI was able to gather together a group of 7 people, including myself, to test this out. Immediately it was apparent that the bigger would be better to support larger groups of players. The original game features 28 purchasable spaces, and this version has 36. It makes for more balanced games, giving everyone more property to work with, more money to deal with, and it becomes harder for a player to actually get a monopoly. In that sense, yes, it becomes a lot easier to get into. And I can back that up as a good 3 of the people I had been playing with, who originally hated the game, are now a lot more open to playing as long as we use this board. I was personally satisfied as this was a great expansion upon the original that did not fundamentally change how to play the game. Basically in the end, everyone was satisfied with this version of the game.\n\nOf other reviews of this game that I have seen, people seem to be complaining about two things - the time it takes to set up, and 'customization' because (apparently?) you can customize the board. I do not care at all for customizing the board, so if that scares you, just ignore it. I'm not even sure what they are referring to, but any kind of board customization is completely unnecessary. As for the set up time, it just takes as long as regular monopoly, and if you know how to do that efficiently, it takes 5 minutes.\n\nOverall, there is nothing I particularly find bad about this version of Monopoly. Everything is either an improvement or easy to overlook. Worst case scenario - just apply house rules so you can play how you want. I love, and I hope more fans of Monopoly get to experience this version."},{"name":"Stickman","pictureUrl":"https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif","rating":"5/5","reviewTitle":" So far loving it. Introducing the game to a new generation.","review":"What can you say about Monopoly? It's probably the best board game in the world. This one is very big. Really big. About 2' square on the board. And it has more than houses and hotels, it has skyscrapers. And there are 3 piles of cards now. And BEST YET: The tokens are metal and nicely made. You get a money bag, top hat, race car, horse, wheelbarrow, thimble, cannon, scotty (dog), shoe and ship. The bank tray is also nice.\n\nMy only suggestions: Needs more money if you are going to play with the max no. of players and the deeds really should be a little thicker material and laminated. That's what I did with our old game. They have a coating but it's still just a thin card. Note like the original. Also the money sticks together. That will probably change with wear.\n\nBut over all a great new version of Monopoly. :-)"},{"name":"das","pictureUrl":"https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif","rating":"2/5","reviewTitle":" American Edition","review":"Unfortunately it was the American edition which was not mentioned in the description so returned for a refund."},{"name":"Lori Sara Gauthier","pictureUrl":"https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif","rating":"5/5","reviewTitle":" Endless fun","review":"I grew up playing monopoly but never played the game at it's true length. This board is amazing it's big enough to play as a group of 6 comfortably and the added rules such as bus tickets make room for serious strategy. This is amazing if you're staying home for a while with friends and family and just looking to have a low effort good time. Highly recommended!"},{"name":" Customer","pictureUrl":"https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif","rating":"4/5","reviewTitle":" Fun new monopoly","review":"There are thousand different monopoly additions out there so when I saw this which is not the same monopoly but different I had to buy it. It’s fun and there’s alot of new stuff. The new stuff is fun but at times annoying it’s actually fun to play the original monopoly rules without adding in the new stuff. Overall it’s a fun game for die hard monopoly fans and for monopoly fans who want a change."},{"name":"Robert fox","pictureUrl":"https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif","rating":"5/5","reviewTitle":" buy it if you enjoy classic monopoly","review":"an interesting variation of the classic game. the speed die is a fun idea but takes away from skill and traditional probability. the big novelty is that it is a bigger busier game with more properties and many more rules which are not always clear or well explained. a painful learning experience for those used to serious classic monopoly play. if you like the classic game you will enjoy playing mega monopoly."},{"name":"Leonardo Cedeño","pictureUrl":"https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif","rating":"5/5","reviewTitle":" INCREIBLE","review":"si alguna vez haz tenido o tienes algun otro monolopy estandar, este te dejara con el ojo cuadrado, el tamaño, las mecanicas aumentadas, las nuevas propiedades, construcciones, todo, simplemente es la misma mecanica un poco mas extensa con propiedades y todos eso.\n\nno puedo decir nada malo del juego, es magnifico, me encanto y si lo combinas con mecanicas de otros monopoly o piezas, es simplemente un juegazo !!"}]},{"id":"FXwCdUCYxoexAVJqSwFuh","title":"100 PCS Water Bottle Stickers, Cute Vsco Waterproof Laptop Vinyl Hydroflask Stickers Computer Phone Aesthetic Skateboard Stickers for Kids Teens Girls Adults Sticker Packs","imageUrl":"https://m.media-amazon.com/images/I/91Dk08Pls3L._AC_SY450_.jpg","price":"$6.99","description":"About this item\n😘HIGH QUALITY ENVIRONMENTAL STICKERS😘: The cute stickers use non-toxic and harmless vinyl materials, which will not harm the health of children and adults. At the same time, this material is also environmentally friendly. Our hydroflask stickers use 3D high-precision printing technology, which will make the printed patterns clearer.\n😘100 PCS STICKERS WITHOUT REPETITION😘: You will receive 100 non-replicated cute stickers designed for kids, including all the vinyl stickers shown in the pictures. Our stickers are widely used. You can put them on any items you want to decorate, such as your mobile phone, hydroflask, laptop, water cup, diary, luggage, car, bumper, bicycle, skateboard, computer, storage jar, etc.\n😘SURPRISING GIFTS FOR GIRLS AND KIDS😘: Our vsco stickers are specially designed for girls and children. The patterns have been carefully selected, there will be no pictures and words that appropriate for children. Best gift for children and children can decorate their own stuff.\n😘WATERPROOF AND REUSABLE😘: The waterproof stickers can be affixed to the water cup, so there is no need to worry about the stickers falling off when cleaning the water cup. If you paste it in the wrong place, our stickers can be gently torn off and reused, and re-attached to the correct place, and there will be no residues on the surface of the item after tearing it off.\n😘AFTER-SALES SERVICE😘:Customer satisfaction is our greatest motivation. If you have any problems after receiving the sticker packs, please feel free to contact us. We will help get everything solved for you.","reviews":[{"name":"Elizabeth","pictureUrl":"https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif","rating":"5/5","reviewTitle":" Love these for the kids at my job!","review":"I bought these for children at my job. These are water-resistant and that makes the children go crazy as they can place these on their water bottles and laptop covers. I would suggest going through and checking for appropriateness as some of the stickers were not incredibly appropriate and I needed to sort them out. Overall, these were perfect!"},{"name":" Customer","pictureUrl":"https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif","rating":"5/5","reviewTitle":" Daughter has had so much fun with these.","review":"Bought for my 11 year old daughter. There are so many cute stickers in there, she has had so much fun picking out favorites and decorating stuff. So far she has decorated her scooter helmet and water bottle. She has shared some with friends and still has so many left. They are nice quality and adhere very well. They have even held up nicely to be washed on the water bottle."},{"name":"Tina W.","pictureUrl":"https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif","rating":"5/5","reviewTitle":" As described","review":"These were as described. Only one duplicate & it was stuck to the first one so I think it was just an oversight. SN both stickers are usable. Kids loved them & immediately stuck them on their thermos'. So far they have stuck through 2 dishwasher cycles."},{"name":"Jennifer Maris","pictureUrl":"https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif","rating":"5/5","reviewTitle":" Great quality","review":"The stickers were beautiful , no wierd ones ... They arrived quickly and on time . kids and adults both loved them . I've stuck one to a tumbler and 2 weeks later its still there (hand wash I dont have a dishwasher so I cant attest for that kind of abuse) looks just as new as day one .\nThey were a real hit in my kids pinata ."},{"name":"magan","pictureUrl":"https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif","rating":"5/5","reviewTitle":" Kids love these","review":"This is a good deal for the amount of stickers. I’ve ran a few threw the dishwasher already that are on my daughters water bottle. They seem to hold up well, and no issues so far."},{"name":"SueLew","pictureUrl":"https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif","rating":"5/5","reviewTitle":" Great stickers","review":"These are really fun stickers. So many different designs and they’re all pretty cool. I used them in birthday party loot bags for my daughter. The kids loved them (and so did I — I kept some for myself!)"},{"name":"GMD","pictureUrl":"https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif","rating":"5/5","reviewTitle":" Appropriate for all","review":"The variety of stickers worked well for my grandkids water bottles. They span age 4 to 14 and I was able to find many cute stickers for each age. They loved them especially the good ones."},{"name":"Lisa F","pictureUrl":"https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif","rating":"5/5","reviewTitle":" Adorable and good quality","review":"The designs are adorable. Ordered for school valentines. I ended up buying another set! Kids love to decorate their water bottles with these. And so do I! ;) Nice durable quality."}]},{"id":"jlV8MyWWsdFv3eKpttflI","title":"MONOPOLY Animal Crossing New Horizons Edition Board Game for Kids Ages 8 and Up, Fun Game to Play for 2-4 Players","imageUrl":"https://m.media-amazon.com/images/I/71YS-K1iCIS._AC_SX425_.jpg","price":"$17.59","description":"In this Monopoly board game, players can enjoy island life and immerse themselves in the colorful and creative world of Animal Crossing New Horizons. Moving around the board with tokens inspired by the video game, players complete island tasks and meet other characters. Instead of buying properties and paying rent, players collect bugs, fish, fossils, and fruit. They can also stop at Nook's Cranny and cash in Bells to buy decorations. Decorations are worth Nook Miles and the player with the most Nook Miles wins the game. Monopoly: Animal Crossing New Horizons board game is for ages 8 and up and makes a fun indoor activity for kids.","reviews":[{"name":"Keyeno","pictureUrl":"https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif","rating":"1/5","reviewTitle":" Already Scalped","review":"Boy that was quick, hoping to get a copy for genuine purposes...\nFor those that don't want scammed, the current MSRP is $24.99."},{"name":"Joshua R. Tompkins","pictureUrl":"https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif","rating":"1/5","reviewTitle":" Fun game but not true to the source material.","review":"I recently picked up a copy of this game because my wife, kids and I are all fans of Animal Crossing. That being said, there are so many inaccuracies and missed opportunities it's sad.\n\nStarting with the basics, the 4 corners were kept in the classic Monopoly theme. Go could have been Town Hall, Go to Jail could have been Booker and Copper, and Free Parking could have been Able Sisters.\n\nThe value of the money was broken down to 1 coin or 5 bell bags. The values should have been 100 for the coins and 1000 for the bags of bells. With the bags being worth 5, you run out of money far too quickly.\n\nThe four skill bonuses for passing Go the first time are off balance with some being clearly better than others. Not only that but at least one of them is very unclear.\n\nMany chance cards are just plain disappointing to get as they make you lose money.\n\nStore cards are based on items you would craft and instead should be based upon items you would actually purchase from Nooks. Their values should be better balanced as well to line up with the actual game.\n\nNook miles cards were in short supply and ran out quite quickly.\n\nHaving a cap of 7 items you can buy limits any strategy for passing up low point items and maximizing your point totals.\n\nOn that topic, not capping the amount of Islands you can claim can put some players at a disadvantage. Max number of tokens should be adjusted based upon number of players. Additionally, the static island system is flawed as you can only get to islands in New Horizons via Dodo airlines, and they destroy the flight plan after each trip so you can never actually return to the same island twice.\n\nI feel like this was either not playtested whatsoever, or maybe not tested by anyone who was familiar with the source material, and as an item marketed to fans of the game, this does a poor job representing not just Animal Crossing, but Spinoff Monopoly games as well. If Monopoly can't get the themeing down right for this, how can I be sure they'd get it right for other franchises like Fortnite, Dragon Ball or others?"},{"name":"Bonnie R. Peck","pictureUrl":"https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif","rating":"2/5","reviewTitle":" WAAYY over priced for the market value.","review":"The game is super fun but definitely shop around first. I just found this at Walmart for less than half the price and mad at myself for spending $60 when I could have spent $25."},{"name":"Jordan","pictureUrl":"https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif","rating":"5/5","reviewTitle":" Just as Described","review":"Monopoly Animal Crossing New Horizons is wonderful for kids and adults. Shipped fast and wrapped for a safe delivery. Yes, price was more than other sellers but item came in two days. Other sites offer pre- orders for August."},{"name":"Tiffany","pictureUrl":"https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif","rating":"2/5","reviewTitle":" Low Quality","review":"It is a cute game. As an Animal Crossing and Monopoly fan I just had to get it. I am disappointed in the quality of the product. The dice are smaller than normal. The unique die has stickers that have to be put on yourself and they are not the best sticky stickers and hard to center just right as they are sized too close to the size of the die. I didn't get my stickers on perfectly straight and the edges of the sticker hang off. Speaking of stickers, the box is closed by 4 big circle stickers that stick too good. I tried to peel them off as it seemed it would peel off, but alas, no, it ripped the box artwork. If they were stuck to the box neatly I would have just cut them open with a knife and left the plastic sticker on the box, but they were wrinkled and goofy in position, leaving clear plastic hanging. The cardboard parts inside the box are thin. It just has a feel of a cheap game. Not the same quality as a typical Hasbro brand product or Monopoly brand game. Even the printout of the instructions are poorly printed with dark background and blurry ink that makes reading difficult. For the price point I expected higher quality. It is still very cute and the saving grace is its Animal Crossings. We own other recent Monopoly spin offs and find they are fun to play but a big difference in strategy compared to the original layout. We haven't played this one yet as I'm saving it for gift giving. I just wanted to check that we had all the parts in our box since others have commented about missing pieces. And since I was so disappointed in the quality I thought others may want to know. I wish I could have gotten mine without the 4 clear circle stickers holding it close as they have made my box ripped up ugly. It worth shopping around to see if another store will have it shrink wrapped instead."},{"name":"ren","pictureUrl":"https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif","rating":"5/5","reviewTitle":" Love this game!","review":"This game was a gift for my kids. It is easy to learn and can be played in a decent amount of time. The set up takes a little time the first time as you have a lot of prices to punch out of the cards initially. I enjoyed the game as well and we have played quite a few times since they received it in December. My kids are 10 and 13 and both enjoyed it but I’m sure younger kids would be able to pick it up pretty quick and as an adult I enjoyed it more than original monopoly! Definitely recommend!"},{"name":"itzme","pictureUrl":"https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif","rating":"5/5","reviewTitle":" Best Monopoly game EVER.","review":"This is easily one of our family’s favorites. It really feels like you’re playing Animal Crossing, without the screen time! Game play feels familiar if you’ve played ACNH, and it’s easy enough for kids to learn while still being fun for adults. The duration of the game is much more manageable than most every other version of Monopoly out there. It needs to come with more Bells, though - we run out too quickly! Buy the game, you won’t regret it."},{"name":"David Mansfield","pictureUrl":"https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif","rating":"5/5","reviewTitle":" For the Animal Cross fan","review":"My wife and all three of my kids are obsessed with Animal Crossing. So, when my wife saw this, the had to have it. It is of the quality that you would expect in a Monopoly game and adds a new turn for fun. I am not into Animal Crossing but the Monopoly take on it was a fun family pastime. A must have for Animal Cross fanatics and fun for the rest of us too."},{"name":"Ross","pictureUrl":"https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif","rating":"5/5","reviewTitle":" Esta hermoso","review":"Si eres fan de animal crossing, cómpralo!! Esta precioso, tiene excelente calidad TODO. Las piezas están bien hechas y con mucho detalle 🤩😍 me encantó. Llegó en la fecha estimada y todo perfecto por parte de . Lo recomiendo totalmente y es precioso lo reitero."},{"name":"Ricardo Muñoz","pictureUrl":"https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif","rating":"5/5","reviewTitle":" Una bella adición a tu coleccion","review":"La verdad estoy impresionado por la calidad de los materiales y el detalle que tienen tanto las figuritas como todo el juego en general, la forma de jugar es muy original y la verdad está tan alejada que no se si debería llamar monopoly pero es muy entretenido y si recuerda a animal crossing, recomendadisimo"},{"name":"Erika García","pictureUrl":"https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif","rating":"4/5","reviewTitle":" Llegó antes de lo esperado, completo, sellado.","review":"Llegó antes de lo esperado, lo queríamos para regalo antes de navidad, llegó muy bien empacado, con sus stickers de sello completas, en lo personal para regalo está perfecto pero llegó con un leve golpe en la caja y eso hizo que perdiera puntos, pero el juego de mesa venía completo y a la persona q se lo obsequiamos quedó fascinada."},{"name":"Tania Navarro","pictureUrl":"https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif","rating":"5/5","reviewTitle":" Monopoly diferente","review":"Es un monopoly muy diferente a lo que conocemos, ya que en lugar de propiedades, se recolectan y comercian recursos para conseguir dinero y decoraciones. Las fichas de los personajes son muy bonitas y se ven bien hechas, lo único que estuvo complicado es que tiene muchas fichas de cartón de recursos y como monedas y es fácil perderlas, deberían comprar un estuche o algo para guardarlas antes de usarlo. Es increíble, y muy bonito"},{"name":"Cliente de ","pictureUrl":"https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif","rating":"3/5","reviewTitle":" muy divertido pero le faltan cartas","review":"El juego es bastante divertido y entretenido pero faltaban las tarjetas para salir de la carcel, y las tarjetas de actividades para juntar nook miles son muy pocas. Pero viene con algunas tarjetas en blanco donde se pueden escribir las tarjetas para salir de la carcel y mas actividades, hubiera preferido que vinieran una ya hechas."}]},{"id":"LHgQgV6X_WKfGXYA_xJC0","title":"Fidget Box for Girls Boys, FunKidz Sensory Fidget Pack Toy for Kids Adults with Bulk Popitsfidget Fidgetget Figit Party Favors Treasure in Portable Gift Box","imageUrl":"https://m.media-amazon.com/images/I/91M2UYnQe6L._AC_SX425_.jpg","price":"$19.99","description":"About this item\n[PRETTY FIDGET TOYS PACK BOX]- This sensory fidget toys kit for kids is packed in a beautiful portable storage box, convenient for collecting these hand toys after playing. Can be used as a classroom prize, cool travel gadgets toys for student teen girls and boys.\n[BULK FIDGET TOYS BUNDLE]- Package includes 24 pieces mini sensory toys. They are Mochi Squishies, Fidget Spinners, Bubble Popper, Sensory Rings, Braided Mesh Tubes, Infinity Cube, Mesh Squishy Ball, Fidget Beans, Fidget Pad and more.\n[ANTI-ANXIETY]- FunKidz figit toys pack is the best calming stuff and stress relief toys for teens, adults. Great gadgets for autism. Squeezing, stretching, and flipping with them can relieve anxiety well. Anxiety stress toys for 3 4 5 6 7 8 9 10 11 12 years old girls and boys.\n[SUITABLE FOR ANY OCCASION]- Small enough to hold in the palm of your hand. Fidget toys can assist kids adults with ADD, ADHD, OCD better focusing.\n[SAFE MATERIAL]- All the fidget toys are made of non-toxic and durable silicone or high-quality ABS plastic. Safety test approved. Fidget toy pack for girls 5-8 8-10 10-12 ages.","reviews":[{"name":"Jennifer T.","pictureUrl":"https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif","rating":"5/5","reviewTitle":" Great value! Fun Fidgets!","review":"My daughter ordered this for herself with birthday money, after we purchased this for her friends birthday gift. I thought it would be filled with lots of cheap items but it actually came with a huge assortment of high quality fun fidget toys. My 10 yo daughter says “I like it because it comes with a lot of different items and they are small enough to carry around.”"},{"name":"Alicia Craven","pictureUrl":"https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif","rating":"5/5","reviewTitle":" Cute gift","review":"My granddaughter loved this. Her parents loved the fidgets came in a container!"},{"name":"fitzy77","pictureUrl":"https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif","rating":"5/5","reviewTitle":" Wide variety","review":"This box came with many different fidgets that I could split up and give out as prizes. A few have broken over time (to be expected with 5 year olds). The peas in the pod have had 1 pea \"unhook\" twice but with a tweezer and good eye sight you can get it back together."},{"name":"Brooke Greenberg","pictureUrl":"https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif","rating":"5/5","reviewTitle":" Kids love.","review":"Kids love this."},{"name":"Deb Short","pictureUrl":"https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif","rating":"5/5","reviewTitle":" Shipping was very fast","review":"Super fast service. Granddaughter is very happy with them."},{"name":"Georgia Roby","pictureUrl":"https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif","rating":"5/5","reviewTitle":" Kids love them","review":"Lovely"},{"name":" Customer","pictureUrl":"https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif","rating":"5/5","reviewTitle":" MY GRANDAUGHTER LOVED IT","review":"GREAT TOYS"},{"name":" Customer","pictureUrl":"https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif","rating":"5/5","reviewTitle":" Kinda cheapie","review":"More like part favors"}]}]