{
  "amongUsDolls": [
    {
      "id": "pTu7W0s",
      "title": "Hot Figures Toys for hot game PVC Space Figures Model Toys Cake Topper Decorations Accessories Computer Desktop Dolls Gifts Figures Collection Toys Gifts Free 50pcs Stickers and Bag (12pcs Set B)",
      "price": "$24.85",
      "image": "https://m.media-amazon.com/images/I/612mBSoAjuL._AC_SY355_.jpg",
      "description": "About this item\n🌟【HOT GAME】 Refer to high quality figure toy action game figures. Touch to delicate, easy to hold and comfortable, non-toxic and eco-friendly PVC material.\n🌟【12pcs/24pcs Deluxe Edition】 12pcs/24pcs vivid figure toy sets are great for kids who love creating the best in giant-sized action figure battles! Different character is great for decoration.\n🌟【Perfect Size】: The figure toy is about 3.5 inch. Small size, easy to carry, you can take it anywhere and anytime.\n🌟【BEST GIFT】: This figure toy set is inspired by the famous game, which is a wonderful gift for this game fans, and they will surely fall in love with it. Each order will be throw in 50pcs stickers and Exquisite storage bag.\n🌟【Quality Guarantee】If you are not satisfied with the products, we will 24*7 hours customer service and full refund/ replacement. More than pleasure to meet your needs",
      "reviews": {
        "customerProfileNames": [
          "Brady",
          "Lovinmysunnylife",
          "RomanGarza",
          "MyrandaT.",
          "Joanna",
          "phoenix_ablaze",
          "sarahstrickland",
          "jenna"
        ],
        "customerProfilePictures": [
          "https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif",
          "https://images-na.ssl-images-amazon.com/images/S/amazon-avatars-global/4ad802bf-e1f1-4854-9e73-d168b523d6ed._CR0,0,375,375_SX48_.jpg",
          "https://images-na.ssl-images-amazon.com/images/S/amazon-avatars-global/ec218a5b-a1f3-47e7-98b5-e4f29b14cc4d._CR0,26.0,281,281_SX48_.jpg",
          "https://images-na.ssl-images-amazon.com/images/S/amazon-avatars-global/906d8797-a05c-4752-9871-6efbd0622bb5._CR0,0,368,368_SX48_.jpg"
        ],
        "customerRatings": [
          "5.0 out of 5 stars",
          "5.0 out of 5 stars",
          "5.0 out of 5 stars",
          "5.0 out of 5 stars",
          "5.0 out of 5 stars",
          "5.0 out of 5 stars",
          "5.0 out of 5 stars",
          "5.0 out of 5 stars"
        ],
        "customerReviewTitles": [
          "Perfect for the Among Us fans",
          "So fun!",
          "Two happy Parents",
          "Better than I had expected!!",
          "Happy Surprise",
          "Much better than expected!",
          "Love these",
          "OMG Outstanding"
        ],
        "customerReviewBodies": [
          "I normally am not a review writer, but felt like these deserved one. I was honestly expecting cheap breakable plastic, but these are surprisingly thick and durable. They’ve already taken quite the beating from our kids and are holding up very well. I was also hesitant on ordering since they ship from China (I didn’t want to have to wait forever for them to arrive) but they took 13 days from the day I ordered to get here and that is insanely fast for shipping all the way from China. I’ve had clothing store orders take longer to arrive. We also received a surprise Among Us drawstring storage bag that I don’t remember seeing in the listing. It’s very cute and perfect to keep the characters from getting lost when they’re not in use. Our package didn’t include the brown character, but we got two of the teal characters (so still 12 total). But our kids don’t mind so it wasn’t a huge deal. Overall very impressed and highly recommended.",
          "I ordered the 24 pc set. They are so cute!! About 3”-4” inches in height, hard plastic and their bodies can be taken apart and also the “hats” can be taken off and put on a different character. My 7 yr old loves them!",
          "I was so excited to see that my package was delivered as promised! They made the cake look fabulous. My husband and I love them because they allow my son to use his imagination and cut screen time.",
          "These were much bigger than I thought they were going to be. I was expecting hatchimal size, these are bigger and better!!! They each came individually wrapped. You can taken them apart and change out the top hats. It also came with a cute among us drawstring bag and 50 adorable among us stickers! Keep in mind these are made of some sort of hard plastic, but they’re super thick so their very sturdy! My 7 year and 9 year old loves these!!",
          "I’ll admit I didn’t read any reviews, I didn’t read about their size, and I don’t think I even looked at the rating - I just bought them. My two boys play pretend Among Us all the time so I thought ‘let’s get some figurines.’ To my happy surprise it came with a bag to keep the toys in, their innards, hats, and bodies are interchangeable (which is a total plus), and it came with stickers. What kid doesn’t love stickers?! Another bonus, they aren’t itty bitty and they’re made of durable thick plastic/rubber substance, which means they won’t crack down the sides like an Easter egg or bend in half like a McDonald’s toy. ⭐️⭐️⭐️⭐️⭐️",
          "A little long, but bear with me. So, since my child has been in elementary school I've given gift bags to the class and/or for the birthday party (usually very small and just close friends, so in no way birthdayzilla). So, this year I chose Among us, since during lockdown that became a favorite. But as with any parent who they thinks they know what their kid likes, only to find out that was so last week, I was worried because now Friday Night Funkin has been the flavor of the month, with next to no gift opportunities for parties, birthdays, or basically anything (and believe me I tried!). However, with a pandemic still bumbling along, I arranged with my youngster to have a party somewhere outdoors when it gets warmer...or so I thought. Young one informed me that they told all their friends about the party on Saturday (this was Wednesday) so I started scrambling. Well, it turned out the mouse house their heart was set on would enforce a full vaccination mandate for 5-11 on the day the party would happen. Try as I might, no vaccines before then, so I had to inform my beloved that the party would have to wait. Much disappointment! And I get it. My child really doesn't ask for much and weathered isolation as an only like a, very lonely, trooper. So, I really wanted to do something special at home to make up for it. So, the family decided on a video game treasure hunt for presents, with an Among us theme (since no FNF). So I searched frantically for decorations, and since we don't like balloons and stuff, choices were limited. I opted for a table cloth, a huge sign, and these figures of Among us characters around the table in all forms of Among us chaos (if you've played the game you know what I mean). Well, I was worried about timing, but they came when they said they would. They are about 2.5 inches tall, well made and open up to a little bone for when they are eliminated. I had fun decorating with that, lol. One was reading a book (a present), a few were in conversations, a couple eliminated...It looked great! I ended up not needing 24, but no worries because they became party favors for when the birthday party actually happened. They are good quality, larger than expected and didn't smell bad (you know what I mean). So these are great! Like really saved a hohum idea and made it more special.\nNow, just a few notes. They all come separately wrapped in plastic little baggies, which might be a deal breaker for you. Also, the 24 pieces were 2 x the 12, which was not an issue for us but may be for you. Finally, if you want the figurines, make sure that's what you order and not the candles. Ours came with a small backpack that I store them in. All on all, my tween played with them and thought they were really cool, so if your child is younger it would be an even bigger hit. I definitely recommend them if you have an Among us fan in the house (and even the adults were impressed, so I actually mean it). I don't write reviews often, but these figurines were worth my time. Hope this helps!",
          "I bought these for my Among Us obsessed child. He absolutely loves them! They seem well-made and they are a good size, not teeny-tiny & fit nicely in your hand. The pieces are all sturdy and it doesn't seem like anything will break. The hats and 'guts' are all interchangeable. Overall I am pleased with the quality and value. My kid has been playing with these toys instead of the video game all afternoon so I am very happy with my purchase!",
          "I just opened these- I set them aside for Christmas and hid them. These are AMAZING and my son is going to LOVE THEM. These are pretty big, and they cut if half just like in the game with the bone sticking out. Lots of colors and weird accessories. They came with a bag instead of in a box, so some creativity will be required from the North Pole, but everything was packed nicely, and the bag was a bonus. There was also stickers included. Absolutely wonderful : )\n\nUpdate- my son LOVED this for Christmas and played with it for hours. He even shared with his toddler sister. I got a little box for them and he went nuts when he opened it because he had never seen them in a store : )",
          "Es genial. Lo pedí el 16 nov y llegó el 30 al Edo. de México. Están las 24 piezas y la bolsa con los stickers. Solo abrí uno para verlo porque son para reyes para mis dos nenas, esta muy bonito y de buen tamaño para que no se pierdan.\nMi única observación es del rastreo del paquete, solo se actualizo hasta el despacho de aduanas y no cambio hasta que me llamaron y entregaron.",
          "",
          "I was shocked at their size they’re great, my kids will love them, might fight over the bag though which is super cute, stickers are a great bonus as well. 10/10 would recommend. I was skeptical at first, I thought it came from US, found out after purchasing that it came from China, but it came a week before my delivery date. Thank you 😃",
          "W",
          "I bought these Among Us figures for my 8 yr old and she loves them. They are pretty large and can take a lot of beating form being played with. It comes with a Among Us bag and a handful of vinyl stickers, which btw I'm keeping for myself. Anway, I would definite get more ...",
          "Compre el paquete de 12 piezas, todos están en buenas condiciones y el material se ve de calidad. Venia con una bolsa y stickers tal como dice la publicación.",
          ""
        ]
      }
    },
    {
      "id": "_PoCHv8",
      "title": "11 Inch Among Ma-Rio US Plush Toys, Soft Amongus Stuffed Plushie Doll Crewmate Astronaut Space Figure Toys with Bulging Eyes, Best Gifts for Game Fans and Kids Birthday",
      "price": "$15.99",
      "image": "https://m.media-amazon.com/images/I/71QZsJQCrdL._AC_SY355_.jpg",
      "description": "About this item\n【Unique Design】This plush toy is inspired by the combination of the famous Among U&S space game and mari0, with cute hat, big prominent eyes, three-dimensional full body, beautiful multi-color combination, giving you a different character experience and unexpected surprises.\n【Soft Material and Portable Size】The plush toy is made of high-quality cotton material, which is soft and comfortable to touch; the doll is full and will not change its shape even after long-term use. The size is about 28cm/11 inches, portable and perfect for kids to play.\n【Durable and easy to clean】Every detail of the fabric is carefully sewn to ensure its quality, the soft plush doll is hand washable and machine washable, so don't worry about getting dirty and enjoy your playtime. Tip: It is vacuum packed, please pat it with your hand after you get it, and let it dry in the sun for a few hours to restore the original state.\n【Wide Application】This is a very cute Among & Ma-rio plush toy, you can put it on your desk, bedside, shelf, counter and sofa as a beautiful decoration. The plush toy is so soft that you can hug it as a stress-relieving plush toy, and it will also be your child's best companion before bedtime.\n【Perfect Gift】The cute design looks realistic and fun, perfect for watching movies, long trips, relaxing and sleeping, it's an ideal gift for game fans and for kids birthday and Christmas present.",
      "reviews": {
        "customerProfileNames": [],
        "customerProfilePictures": [],
        "customerRatings": [],
        "customerReviewTitles": [],
        "customerReviewBodies": []
      }
    },
    {
      "id": "L_woW-_",
      "title": "Yevt Plush Story Among You&Us Plush Toy 8 Inch Blue Soft Crewmate Astronaut Imposter Plushy Large Astronaut Plushie Figures Big Cute Stuffed Doll for Boys and Girls",
      "price": "$9.99",
      "image": "https://m.media-amazon.com/images/I/91WrFCVGiLS._AC_SY355_.jpg",
      "description": "MATERIAL This blue amung us plushie based on the famous game, crewmate plush is made of short plush very soft material and filled with PP cotton. Very easy to clean plush toy, a little soap and water and you can remove stains and dust. SIZE The soft toy stuffed size 8 inch 20 cm is very convenient to carry in a handbag or a backpack, you can take amung us plush toy with you wherever you go. RELIEVE STRESS In moments when you are sad, the small astronaut figure us will help you relieve stress, amongus plushy will always be there to give you warm and pleasant sensations. You or your children can sleep with an amung us gifts for boys and girls that will soothe you before bed. DECORATION The big among plush will be an excellent decoration in the interior of your home, office, living room. Crewmate plushie can be a great decoration for your bedroom and serve as pillows. Will be a great addition to the car. GIFT The large plush toy is a great gift for fans of the amung us game. Also amungus toys for kids are a great gift for your close friends, relatives, and colleagues for New Year, Christmas, Easter, birthdays.",
      "reviews": {
        "customerProfileNames": ["LoriMartin", "Kayli", "Jannett"],
        "customerProfilePictures": [
          "https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif"
        ],
        "customerRatings": [
          "5.0 out of 5 stars",
          "3.0 out of 5 stars",
          "4.0 out of 5 stars"
        ],
        "customerReviewTitles": [
          "Adorable",
          "Missing things, But otherwise good.",
          "Soft"
        ],
        "customerReviewBodies": [
          "My grandson loves his plush Among Us",
          "The plush was so soft! and I love it. But, It failed to come with the stickers and there's no sounder in it. I wanted it to squeak or something :( The stickers would've been nice, too.",
          "Cute"
        ]
      }
    },
    {
      "id": "fsjsfve",
      "title": "12 Inch Game US Plush, Hot Game Character Plushie Plush Doll Soft Plushie Big Gifts for Game Fans and Kids, Multicolor",
      "price": "$14.99",
      "image": "https://m.media-amazon.com/images/I/71uSKH5VgoL._AC_SY355_.jpg",
      "description": "About this item\nSOFT MATERIAL--- Plush toys are made of skin-friendly soft plush material, and the inside is filled with elastic pp cotton, which is soft and durable, and the product is vacuum packed to protect the doll, after taking out the doll, pat it lightly or put it in the sun for a while Swell and plump.\nEASY TO CARRY---Game character plushie size: 12 inch, light weight, super soft, easy to carry, you can play anytime, very decompressed. With 5 colors for you to choose, it can be placed as a decoration in your room, bedside, table top, sofa or car, etc.\nTHE PERFECT GIFT---Plush toys will be the perfect gift for children, children will be very happy to see plush toys as gifts, which can enhance the relationship between adults and children, and can also shorten the distance between children, suitable for Give as a gift at birthdays, events, parties, New Years and other festivals\nDESIGN INSPIRATION---The design inspiration of this plush toy comes from children, giving children more emotional snuggle, and accompanying children every day of their growth, it will be the ideal companion for children.\nACCOMPANYING GROWTH---Plush toys are very suitable for children to hug and fall asleep. It is not only a doll, but also a friend of children. It is the spiritual sustenance of children for a beautiful world, and can accompany children to spend every good night.",
      "reviews": {
        "customerProfileNames": [
          "Journey2FindKay",
          "Hannahp",
          "gerisweat",
          "Shawn&#47;Texas",
          "SarahDoēTara",
          "Customer",
          "Tacha",
          "PaulaG.Cannon"
        ],
        "customerProfilePictures": [
          "https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif"
        ],
        "customerRatings": [
          "5.0 out of 5 stars",
          "5.0 out of 5 stars",
          "5.0 out of 5 stars",
          "5.0 out of 5 stars",
          "1.0 out of 5 stars",
          "5.0 out of 5 stars",
          "5.0 out of 5 stars",
          "4.0 out of 5 stars"
        ],
        "customerReviewTitles": [
          "So soft and cute! Nephew loves it!",
          "Malformed and Low Quality but Cute As Heck",
          "<3 it!!!",
          "Well worth the money!!!",
          "Immediately started unthreatening",
          "Perfect! Love it!",
          "A fantastic gender neutral gift for all Among Us fans.",
          "Cute but very thin material"
        ],
        "customerReviewBodies": [
          "Came on time so cute. Nice and soft! my nephew could not put it down ever since he opened it on his birthday. I will definitely buy him the other colors and other variations as this was great. I also appreciated that it came vacuum packed made it easier to ship and was fun to open.",
          "Not the best made, has some stitches out of place. Low quality and very malleable in terms of fluff in wrong places and deformed on one side, but very cute. 20 year old boyfriend loved as birthday gift. Very cute/funny gift for a wonderful nerd in your life.",
          "<3 it!",
          "As expected. Very good purchase.",
          "Not even 10 min out of the packaging the threading at the seem started coming undone. I had to sew it shut again.",
          "My grand daughter loves it. It's so soft and the colors are beautiful 😍",
          "This 12 Inch Among Game US Plush was chosen for my 10-year-old son, who enjoys the Among Us game. As seen in the photo, it has found a home among his other plushies. This plushie arrived in a vacuum-sealed bag and immediately came to life when unwrapped. This plushie is approximately 12 inches long from head to toe and 6.5 inches deep from the most protruding points in the front and back.\n\nThis plushie does have a tad asymmetrical shape. For example, the right leg is more rounded than the left, what I assume is the eye is slanted at tad to the left, and the top of the head is lopsided. My son, on the other hand, doesn't seem to notice (or care), enjoys playing with this plushie, and gives it 5 stars. The stitching is lovely, and the fabric is extremely soft. When I opened it, there were no odors. My son likes how colorful and soft this plushie is. He also likes how big it is because it makes it easier to play with.",
          " I know this isn’t a dog toy but my 4 year old Boston Terrier loves to suck on stuffed animals, she’s done this since she was a baby. I knew she would love this, whatever it’s supposed to be, it has a minimal shape with a hump, perfect for sucking on. She went nuts for it and immediately claimed it as hers and sucked on it for 15 minutes. She wore a hole in it right away, the material is paper thin. It’s cute but really thin material, doubt it would stand up to much hard play."
        ]
      }
    },

    {
      "id": "A3sARzD",
      "title": "Among Us Plush Red Reversible Plushie Among Us Toys Stuffed Mood Doll Plushie Gift for Game Fans",
      "price": "$9.99",
      "image": "https://m.media-amazon.com/images/I/51b5d+EH9zL._AC_SY355_.jpg",
      "description": "About this item\n🎁【Reversible Design】The among us reversible plush adopts a unique double-sided two-color design which you can easy flip it.\n🎁【Premium Quality】Among us plush is made of durable plush material and is filled with high-quality PP cotton material.It is comfortable and safe to touch.\n🎁【Occasion】Flip it to relieve your stress.You can use it to decorate your bedroom, office, car.When children are crying, you can also use it to divert their attention and make them happy.\n🎁【Ideal Gift】Cute soft plush is a great gift for your child.It can bring a lot of fun to your kids.The stuffed toys are the perfect gifts for holidays, birthdays, baby showers, Christmas, Valentine's Day & more!\n🎁【Size】15cm*15cm",
      "reviews": {
        "customerProfileNames": ["Niks", "Superbrain.", "Laz", "Katie"],
        "customerProfilePictures": [
          "https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif",
          "https://images-na.ssl-images-amazon.com/images/S/amazon-avatars-global/076530d2-5f5d-486d-9259-f73b6d776a63._CR0,0,520,520_SX48_.jpg"
        ],
        "customerRatings": [
          "4.0 out of 5 stars",
          "5.0 out of 5 stars",
          "5.0 out of 5 stars",
          "5.0 out of 5 stars"
        ],
        "customerReviewTitles": [
          "Cute gift",
          "Great quality & super soft",
          "Great gift for kids",
          "Cool toy"
        ],
        "customerReviewBodies": [
          "Super cute gift. 10 yr old happy. Arrived early. Just slight color difference than expected. Evrything else good. Great for any age",
          "I bought this is as a gift for a friend of mine who is super into among us. I discovered today she likes the plushies a lot, so I’m confident she is going to like it. It’s great quality and super soft. I absolutely would buy one again",
          "Birthday present for my 7-year-old nephew who loves the AmongUS games and Characters, he loves these plushies, and was very excited when he realized they were 2 in 1.",
          "I got it as a gift for my daughter. She loves it. It had a hole on the top. It was an easy fix."
        ]
      }
    },
    {
      "id": "ufl0vry",
      "title": "12 Pcs Among Plush Toys Merch Crewmate Astronaut Stuffed Plushies Doll, Best Gifts for Game Fans and Children (12pcs Full Color)",
      "price": "$25.99",
      "image": "https://m.media-amazon.com/images/I/91C67i31KTL._AC_SY355_.jpg",
      "description": "About this item\n✨Small and Portable: About 4.0in*3.1in, small, cute and easy to carry\n✨Soft Material：This astronaut plush toy is made of pp cotton,soft and skin-friendly, with complete stitching, not easy to pull the thread\n✨Lovely Squeaky Sound: All the among u&s plush toys have squeaky sounds that interact well with all children and adults\n✨Beautiful Room Decorations：These cute among u&s plush dolls can add color to your room and make your home full of love and warmth\n✨Perfect Gift: This game figure doll is very suitable for game fans of the game “among us\", It is also a great choice for Christmas gifts for children, friends and family",
      "reviews": {
        "customerProfileNames": ["Vanessa"],
        "customerProfilePictures": [
          "https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif"
        ],
        "customerRatings": ["5.0 out of 5 stars"],
        "customerReviewTitles": ["Cute"],
        "customerReviewBodies": ["Super cute and the nephew loved them!"]
      }
    },
    {
      "id": "15L4UMQ",
      "title": "3 Pack Among U&US Plush Toys, Cute Stuffed Plush Squeak Doll, Among U&US Plushie Action Game Figures Gifts for Game Fans (Black+ White+Light Green)",
      "price": "$15.99",
      "image": "https://m.media-amazon.com/images/I/71tA2HQw0mL._AC_SY355_.jpg",
      "description": "About this item\nA SURPRISE THAT KIDS WILL LOVE: Built-in plastic BB sound generator in the Among U&US Plush Toy will make a sound when pinched, kids will fall in love with it.\nSOFT MATERIAL: Among U&US Plush Toy is made of high-quality 100% cotton, not easily deformed, full of filling, soft, comfortable,and durable.\nSMALL AND PORTABLE: Among U&US is about 11cm/4.34 inches. Small size, easy to carry, you can take it anywhere and anytime.\nBEST GIFTS: Our Among U&US Plush Toy is an ideal gift for this game fans. It's also a very cute decoration in bedroom, living room, office/desk. A great gift choose for your kids, friends, family.\n100% SATISFIED GUARANTEE: If you have any questions or need any assist, don't hesitate to contact us. We will reply you within 24 hours! What are you waiting for? Add it to the shopping cart!",
      "reviews": {
        "customerProfileNames": [
          "EricaS.",
          "Stayhumble",
          "DawnC",
          "Melody",
          "Deb",
          "jessica",
          "EmilyO",
          "christophera."
        ],
        "customerProfilePictures": [
          "https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif"
        ],
        "customerRatings": [
          "3.0 out of 5 stars",
          "5.0 out of 5 stars",
          "5.0 out of 5 stars",
          "5.0 out of 5 stars",
          "1.0 out of 5 stars",
          "1.0 out of 5 stars",
          "5.0 out of 5 stars",
          "5.0 out of 5 stars"
        ],
        "customerReviewTitles": [
          "These probably cost cents to make, but you're charged a fortune",
          "Adorable. My 6 yr old loved them. Squeeze them to hear a noise!",
          "Cute!",
          "They loved them",
          "Fell apart",
          "Very small and they squeak",
          "My 7 yr old loves these!",
          "Great son loved them"
        ],
        "customerReviewBodies": [
          "These are cute and well made, but the price is ridiculous just because these are popular toys right now. I'm sure they were made in China for cents on the dollar, but we have to pay it because we have no choice.'\n\nThey're super small, as the listing mentions, but my son loves them.",
          "The package arrived quickly. 3 adorable plush toys. He’s obsessed with among us. Please reference the picture for a visual. If u squeeze them, they make a noise which was a surprise to him and I.",
          "Kid loves them. They're very soft and just the right size to carry around in little hands.",
          "Thanks for making us look good",
          "The back packs are glued on and fall off. Not for playing with.",
          "Beware, very tiny. Very unhappy child.. Not what we expected. They also unfortunately have a squeaker like a dog toy. Made more for your pet then you child. They are cheaply made if you give to your pet as well.",
          "Plushy and cute. My son loves Among Us and these were the perfect gift!",
          "Awesmoe"
        ]
      }
    },
    {
      "id": "1VwFqDq",
      "title": "Among Us Plush Reversible Plushie Octopus Stuffed Animal Mood Double Sided Toy Happy Angry Pulpo Reversable Plushies Bear Toys Doll Game Flip Impostor Crewmate Fluffy 6 inch Best Gift 2022 (Red/Black)",
      "price": "$13.99",
      "image": "https://m.media-amazon.com/images/I/81isTDqv3ZL._AC_SY355_.jpg",
      "description": "About this item\nAS SEEN ON TIK TOK - Cute and soft among us plush doll with realistic expression. This reversible plushie among us toy is very popular because of the top trending game. The flippable Among Us plushie is perfect for kids, teens and adults who are looking for a mood plush to add to their collection or as a gift for friends and family. Available in many color: Yellow, Orange Grey, Red, Purple, Pink, etc. There's a suitable color for every mood!\nPERFECT GIFT FOR ALL AMONG US GAME FANS - Perfect for playing, collecting & cuddling. These plushies are the perfect gifts for birthdays, baby showers, Valentines day & more! Funny gift for any plushie lover! Among Us Toys are highly popular collectibles especially Among Us Plushies or Among Us Plush. This reversible plush toy mood plushie will never look sus!\nSUPER KAWAII AND SOFT - These super soft toys are perfect for playing, collecting & cuddling. This Among Us plush toy will never be voted out because of its kawaii overload feelings it gives you. This reversible plush is soft and super cuddly that will make you happy! Flipping toy for every mood you have. It has an angry alien face emoji on the other side and suspicious on the other.Get every color of this cute Among us toy!\nHIGH QUALITY AND WASHABLE - This double-sided flip plush doll is made of durable plush material and is filled with high-quality PP cotton material. Easy to clean, use a small amount of soap and water to remove stains, and dry naturally. This Among Us plushy is meant to last with proper care. Made with fabric that does not fade easily or change color over time. It's cuddly if it's clean and well-maintained.\nFOR EVERY OCCASION - Suitable for home, office, nursery bed, children's room, car and every place you like. The best gift for Among Us game fan. It's also a very cute decoration in the bedroom, living room, office desk. When you look at this moody plushie, you'll never get angry or frustrated because it's gonna soak up all the negative emotional vibes in the room. It's reversible body so it can fit almost any mood and emotion you have. So if you're feeling that someone's sus, buy one today!",
      "reviews": {
        "customerProfileNames": [
          "paulieclark",
          "Bella",
          "CynthiaWenMcKenzie",
          "NancyRhodes",
          "TinAZ",
          "Janhundeby",
          "CindyLBurke",
          "DJMorgan"
        ],
        "customerProfilePictures": [
          "https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif",
          "https://images-na.ssl-images-amazon.com/images/S/amazon-avatars-global/81d34c89-bd64-4a02-993c-767a47afa5c7._CR0,29.0,274,274_SX48_.jpg"
        ],
        "customerRatings": [
          "5.0 out of 5 stars",
          "5.0 out of 5 stars",
          "5.0 out of 5 stars",
          "5.0 out of 5 stars",
          "5.0 out of 5 stars",
          "5.0 out of 5 stars",
          "5.0 out of 5 stars",
          "5.0 out of 5 stars"
        ],
        "customerReviewTitles": [
          "beautiful color",
          "Exactly as shown.",
          "I bought this for my son",
          "Soft plush that my grandson loves",
          "Grandkids loved em(bought 3)",
          "Gift they loved it!",
          "My grandson",
          "Grandson's Christmas Gift..."
        ],
        "customerReviewBodies": [
          "I'm a big Among Us player and absolutely loved this product! Keep in mind it isn't lisenced by Innersloth but I absolutely love it! It sits right on my desk and it gives me good vibes when I play! good quality stitching, soft material I've recommended it to many friends that game too!",
          "Bought for my Among Us obsessed kids and they loved them. 100% would buy again.",
          " He loves this especially since among us is popular. He sleeps with this next to his bed. It's soft, washable and dryable.",
          "My grandkids are into among us and requested this gift. They really enjoy it.",
          "Bought as a gift for the grandkids. Their momma I said that they love them.",
          "Got a wonderful thank you",
          "My grandson loved it",
          "He loves it!",
          "Con envío a México costo más de $400 pesos mxn, y cuando vimos el paquete nos desconcertó; al abrirlo nos decepcionamos mucho por el tamaño tan pequeño del peluche, porque es mucho más pequeño de lo que te imaginas al verlo en la imagen, pero sabemos que nosotros tuvimos la culpa por no leer especificaciones. Aún así no lo regresaremos, pues lo habíamos comprado para regalar.",
          "",
          "Es el clásico caso de que está mejor la foto que el producto. Aguantó al final, le gustó al crio, pero llegó aplastado, es decir que no tiene volumen hasta que uno lo \"infla\" con la mano. Y una patita venía invertida, volteada.\nSé que puedo solicitar que me lo cambien, pero es más gasto, tiempo, y daño al planeta, contra que la abuela hizo el trabajo de costura en 20 minutos.\nYa se me hacía caro desde el inicio, más caro es aún, cuando no es lo que uno quiere y con defectos.",
          "",
          " El producto está súper pequeño, no tiene nada de relleno, está muy caro para lo que es, es un total engaño. No puedo creer que exista gente que te estafe con este tipo de publicidad que no es cierta. No lo recomiendo",
          "",
          "Precio muy elevado para el producto que es",
          "",
          "bonito y suave a mi hijo le encanta",
          ""
        ]
      }
    },
    {
      "id": "XGSmrWB",
      "title": "12 Inch Among Plush US Toys, Soft Amongus Stuffed Plushie Doll Crewmate Astronaut Space Figure Toys with Bulging Eyes, Best Gifts for Game Fans and Kids Birthday",
      "price": "$15.99",
      "image": "https://m.media-amazon.com/images/I/71I92822gUL._AC_SY355_.jpg",
      "description": "About this item\n【Unique Design】This plush toy is inspired by the combination of the famous Among U&S space game, with cute hat, big prominent eyes, three-dimensional full body, beautiful multi-color combination, giving you a different character experience and unexpected surprises.\n【Soft Material and Portable Size】The plush toy is made of high-quality cotton material, which is soft and comfortable to touch; the doll is full and will not change its shape even after long-term use. The size is about 30cm/12 inches, portable and perfect for kids to play.\n【Wide Application】This is a very cute Among plush toy, you can put it on your desk, bedside, shelf, counter and sofa as a beautiful decoration. The plush toy is so soft that you can hug it as a stress-relieving plush toy, and it will also be your child's best companion before bedtime.\n【Durable and easy to clean】Every detail of the fabric is carefully sewn to ensure its quality, the soft plush doll is hand washable and machine washable, so don't worry about getting dirty and enjoy your playtime. Tip: It is vacuum packed, please pat it with your hand after you get it, and let it dry in the sun for a few hours to restore the original state.\n【Perfect Gift】The cute design looks realistic and fun, perfect for watching movies, long trips, relaxing and sleeping, it's an ideal gift for game fans and for kids birthday and Christmas present.",
      "reviews": {
        "customerProfileNames": ["A.Mom", "MyPenName"],
        "customerProfilePictures": [
          "https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif"
        ],
        "customerRatings": ["5.0 out of 5 stars", "3.0 out of 5 stars"],
        "customerReviewTitles": ["So very cool!!!", "Needs more stuffing"],
        "customerReviewBodies": [
          "F",
          "Very cute, but definitely needs more stuffing. It is rather floppy all over and the ears do not stick out or up at all. Needs more stuffing."
        ]
      }
    },
    {
      "id": "8VQqOFo",
      "title": "A-mong Game Rever-sible Plushie Toys, Double-Sided Flip Rever-sible Among in US Expressions Doll Reversible Stuffed Plushie Toy (Black-RED)",
      "price": "$12.99",
      "image": "https://m.media-amazon.com/images/I/71qAFyIsrhL._AC_SY355_.jpg",
      "description": "We constantly strive to provide customers with low-priced high-quality products and high-quality services to achieve our goals\n\nspecification\nProduct name: Flip doll\nMain fabric: short plush (super soft crystal).\nFilling material: PP cotton\nProduct specifications: 6 inch high\nProduct color: √ various colors\n\nProducts include:\n1*soft toy\n\nNote: The product itself has no color difference. All products of the company are taken by professional photographers. For the difference between the light and the display, the color difference with the actual object may be small. Please refer to the actual product.\n\nAbout after-sales:\n\nThe products sold by our company have passed a strict quality inspection process before leaving the factory to ensure the quality of the products. Please check carefully before receiving the goods. If you have any questions, please contact us in time",
      "reviews": {
        "customerProfileNames": [
          "VictoriaM",
          "Customer",
          "AJRumsey",
          "MichaelEarach",
          "DarraSargent",
          "REESE",
          "Star",
          "AbbeyClouser"
        ],
        "customerProfilePictures": [
          "https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif"
        ],
        "customerRatings": [
          "3.0 out of 5 stars",
          "2.0 out of 5 stars",
          "5.0 out of 5 stars",
          "5.0 out of 5 stars",
          "3.0 out of 5 stars",
          "5.0 out of 5 stars",
          "5.0 out of 5 stars",
          "5.0 out of 5 stars"
        ],
        "customerReviewTitles": [
          "Not fluffy just squishy",
          "Came vacuum sealed...",
          "Super cute!",
          "So sus",
          "Super small",
          "Very Small plush.",
          "😁👍",
          "Cute"
        ],
        "customerReviewBodies": [
          "It came in one of those flat plastics with all the air sucked out. I let it sit and fluff up for 3 days and it still is just ok. It doesn’t hold its shape as well as the octopus kind. My son still loves it though.",
          "I was really excited for this gift and it came vacuum sealed so when I opened it it's not as plush as it should be and it's wrinkled, other than that the quality of the stitching is good.",
          "We got this for my 8yo daughter because she loves playing Among Us on her tablet. Our neighbor ended up getting one, too, and now they go outside and pretend to play Among Us in real life. I have to whisper in their ears who the \"imposter\" is and then they run out and play. I have know idea what is going on, lol, but they are having fun.\n\nThe plush is durable and it flips between the two characters easily. If your kids are into this game, this toy is great and inexpensive.",
          "Great for your little Among Us fans. Got it for my daughters bday which was Among US themed. She loves it.",
          "Waaaaay smaller then you think. Might be okay for stocking stuffer but that's it.",
          "Very cute and small. My son loves it.",
          "greatest purchase of all time",
          "Great gift"
        ]
      }
    },
    {
      "id": "GNArA-a",
      "title": "6 Pcs Among Plush Toys Merch Crewmate Astronaut Stuffed Plushies Doll, Best Gifts for Game Fans and Children (Light Color)",
      "price": "$14.99",
      "image": "https://m.media-amazon.com/images/I/81XT9uqYEML._AC_SY355_.jpg",
      "description": "About this item\n✨Small and Portable: About 4.0in*3.1in, small, cute and easy to carry\n✨Soft Material：This astronaut plush toy is made of pp cotton,soft and skin-friendly, with complete stitching, not easy to pull the thread\n✨Lovely Squeaky Sound: All the among u&s plush toys have squeaky sounds that interact well with all children and adults\n✨Beautiful Room Decorations：These cute among u&s plush dolls can add color to your room and make your home full of love and warmth\n✨Perfect Gift: This game figure doll is very suitable for game fans of the game “among us\", It is also a great choice for Christmas gifts for children, friends and family",
      "reviews": {
        "customerProfileNames": [
          "AuroraHemingway",
          "Mlo",
          "Customer",
          "AmberBernard"
        ],
        "customerProfilePictures": [
          "https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif"
        ],
        "customerRatings": [
          "1.0 out of 5 stars",
          "3.0 out of 5 stars",
          "5.0 out of 5 stars",
          "5.0 out of 5 stars"
        ],
        "customerReviewTitles": [
          "Cheap!! Don’t waste your money!",
          "Disappointed",
          "Amazing plush!",
          "My kids are obsessed!"
        ],
        "customerReviewBodies": [
          "I got these for my son for his birthday in October 2021! My son was excited at first but as the days went by his happiness and excitement since these fell apart almost immediately. The “backpacks” are just little pillows hot glued onto the back of the characters and they start to fall off right away. Two of the character’s backpacks were falling off of their backs when we opened the package. Also when the “backpacks” were glued on it seems the heat of the glue damaged the pillow~backpack which has caused the stuffing to start falling out! Don’t waste your money! These are crap!!",
          "It could of be a little bit bigger for the price",
          "It is a perfect plush for my 10 year old. She loves the plushies and is the size of her hand and she carries it everywhere.",
          "My kids love these toys. They are soft and they may a noise when you squeeze them. Its a cute gift and there are enough to share."
        ]
      }
    },
    {
      "id": "DJjY7yM",
      "title": "9 Inch Among Sonic U&S Plush Toys, Shadow The Hedgehog Plushie Figure Toy, Soft Stuffed Animal Doll Pillows Decoration Gifts for Game Fans and Kids Birthday",
      "price": "$14.99",
      "image": "https://m.media-amazon.com/images/I/71soDcCd+XL._AC_SY355_.jpg",
      "description": "About this item\n【Unique Design】This plush toy is inspired by the combination of the famous Amongus space game and sonic the hedgehog, with big prominent eyes, three-dimensional full body, bright colors combination, giving you a different character experience and unexpected surprises.\n【Soft Material and Portable Size】The sonic amongus plush is made of high-quality cotton material, which is soft and comfortable to touch; the doll is full and will not change its shape even after long-term use. The size is about 23 cm/9 inches, portable and perfect for kids to play.\n【Durable and easy to clean】Every detail of the fabric is carefully sewn to ensure its quality, the soft plush doll is hand washable and machine washable, so don't worry about getting dirty and enjoy your playtime. Tip: It is vacuum packed, please pat it with your hand after you get it, and let it dry in the sun for a few hours to restore the original state.\n【Wide Application】This is a very cute among plush toy, you can put it on your desk, bedside, shelf, counter and sofa as a beautiful decoration. The plush toy is so soft that you can hug it as a stress-relieving plush toy, and it will also be your child's best companion before bedtime.\n【Perfect Gift】The shadow among plush looks realistic and fun, perfect for watching movies, long trips, relaxing and sleeping, it's an ideal gift for game fans and for kids birthday /Christmas present.",
      "reviews": {
        "customerProfileNames": [],
        "customerProfilePictures": [],
        "customerRatings": [],
        "customerReviewTitles": [],
        "customerReviewBodies": []
      }
    },
    {
      "id": "hi2wF0H",
      "title": "20 Pcs Among U&Us Mini Keyrings Earrings Doll Toys, Video Game Character Games Key Pendant Christmas Tree Decor Cute Colorful Toys for Kids Adults",
      "price": "$14.99",
      "image": "https://m.media-amazon.com/images/I/71qSupzJXXL._AC_SY355_.jpg",
      "description": "20 Pcs Video Game Mini Keyrings Earrings Doll Toy, Video Game Character Games Key Pendant Christmas Tree Decor Cute Colorful Toys for Kids Adults\n\nFeature:\n-These video game mini pendant toys are designed as adorable little character. Different colors video game mini pendant for choose, you can choose your favorite color.\n-Made of high quality material, handmade safe and non-toxic, lightweight and durable, can be used a long time.\n-Easy to carry, you can take it anywhere and anytime. A great gift choice for your kids, friends, family.\n-Suitable for both personal dress up and key decorations, such as earrings, keyrings, car pendant, Christmas tree decoration and more.\n\nSpecification:\n\nMaterial: Silicone\nColor: Random multicolor\nSize: 2 cm* 2 cm /0.8 * 0.8 inch\nPackage Include: 20 Pcs\n\nNote: Just the pendant, no other accessories, the keychains and earrings are NOT included in the package.\n\n",
      "reviews": {
        "customerProfileNames": [
          "EvelynGarcia",
          "prettymommy",
          "LauraHernandez",
          "BrittanyScott",
          "NaiomyleeTorres",
          "JY",
          "Neversleepsawink;)"
        ],
        "customerProfilePictures": [
          "https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif",
          "https://images-na.ssl-images-amazon.com/images/S/amazon-avatars-global/81b53d8d-c652-4cb9-a2df-5d2bef812418._CR0,34.0,264,264_SX48_.jpg",
          "https://images-na.ssl-images-amazon.com/images/S/amazon-avatars-global/863939de-4c1f-4d6d-bef6-768471886eae._CR62,0,375,375_SX48_.jpg"
        ],
        "customerRatings": [
          "5.0 out of 5 stars",
          "5.0 out of 5 stars",
          "5.0 out of 5 stars",
          "5.0 out of 5 stars",
          "5.0 out of 5 stars",
          "5.0 out of 5 stars",
          "3.0 out of 5 stars"
        ],
        "customerReviewTitles": [
          "Cute!",
          "Cute",
          "Hermosos!",
          "",
          "Cute party favors!",
          "Original",
          "cute and well made!",
          "Loved them until they stopped giving mixed colors shown"
        ],
        "customerReviewBodies": [
          "I had been looking for little figurines to give out in goodie bags... these are super cute. I got all 20 of them 2 in each color. The white ones are more of a clear color rather than white and I wish the backpack part of them was a bit more detailed. Also great price for something that will most likely get lost by 7 year olds lol.",
          "My daughter ordered this and she loves it! They’re very cute. Very small too (less than an inch) but that’s how she likes it.",
          "Los compré para complementar unas pulseras que hago y quedan perfectos 😍",
          "",
          "Used to make keychain party favors for my 10 year old twins' birthday party. Very cute, and seem fairly durable too!",
          "Bello",
          "They are sturdy and well made. loved them! made them into little bracelet charms for bday favor, and it was great",
          "I love these for earring making. Every time I order they do their best to give mixed colors. This time I received 6 orange, 5 green, 5 yellow, 2 blues, 1 pink, 1 black. Seriously?! Not happy."
        ]
      }
    },
    {
      "id": "qeuCPZe",
      "title": "Among u&s Plush Toys 12 inches Soft Plush Cute Astronaut Crew Doll Role-Playing Game Accessories Accessories Around Cute Goods Cute Children Adult Gifts (Red)",
      "price": "$17.90",
      "image": "https://m.media-amazon.com/images/I/315GmPxCxiL._AC_SY355_.jpg",
      "description": "12 Inch Among U&s Plush Toys ​Cute Crewmate Astronaut Stuffed Plush，Imposter Plush Doll with Bulging Eyes for Game Fans and Children（Red） Crewmate or impostor? Voted out the suspicious imposters from these plush! Inspired by the famous game, these among u&s plush toys will be a fun addition to your collection! Our plush toys are made of soft plush fabric and filled with PP cotton for softness and elasticity. The stitching is intact and not easily deformed. The chubby body with bulging eyes is adorable and makes a great gift for family, friends, and game fans!",
      "reviews": {
        "customerProfileNames": [],
        "customerProfilePictures": [],
        "customerRatings": [],
        "customerReviewTitles": [],
        "customerReviewBodies": []
      }
    },
    {
      "id": "g0sKwoB",
      "title": "Among us sanro kulomi Plush Toys,Children's Dolls,Plush Dolls 10 inches,Cartoon Filled Plush Toys,Lovely Children's Girl Fans Plush Toys",
      "price": "$16.68",
      "image": "https://m.media-amazon.com/images/I/61Tu-vwyiDL._AC_SY355_.jpg",
      "description": "Stuffed toys are made of high-quality Plush materials and filled with PP cotton to maintain fullness and elasticity. Soft, safe and lovely, it can bring you better skin touch without causing skin allergy. Vivid plush toys are suitable for cribs, children's bedrooms and living rooms. They are very suitable for babies to hug, sleep and fall asleep in this way. Hug this lovely plush toy and lie on the sofa or bed to bring you sweetness and fun in your spare time. It can also be used as birthday and Christmas gifts. Or as a beautiful souvenir of childhood. Bring joy to your childhood and sweet memories to your child's childhood. We put the safety and quality of each toy first. If you have any questions about this product, please feel free to let us know.",
      "reviews": {
        "customerProfileNames": [],
        "customerProfilePictures": [],
        "customerRatings": [],
        "customerReviewTitles": [],
        "customerReviewBodies": []
      }
    },
    {
      "id": "UKG1nkc",
      "title": "Among U&S Plush 21CM/8.3\" Toys Stuff Animals Merch Cute Soft Figure Mini Doll Plushie Stuffed and Gifts for Kids Birthdays Christmas Xmas Game Fans Crewmate (Orange)",
      "price": "$12.99",
      "image": "https://m.media-amazon.com/images/I/81wSS5A5-jL._AC_SY355_.jpg",
      "description": "Full of PP cotton filler and made of skin friendly silk wadding and soft plush, Give you better skin touch feeling.Smooth to the touch. Squeeze this soft plush to relieve your stress; Can use as nap pillow/ hug pillow/ office noon break nap pillow/ plush toys, meet your all needs. As a home decoration, make your home full of love and warmth. 11CM or 21CM design. Put it next to you and follow you to win the game. The most suitable gift for game fans, but also a very cute decoration.Perfect Decoration:They suit for bedroom, living room, home, office, nursery bed,car and every place you like. The cute Plush pillow will be the presence of the best. They suit for bedroom, living room, home, office, nursery bed,car and every place you like. The cute Plush pillow will be the presence of the best.",
      "reviews": {
        "customerProfileNames": [],
        "customerProfilePictures": [],
        "customerRatings": [],
        "customerReviewTitles": [],
        "customerReviewBodies": []
      }
    },
    {
      "id": "OiveeLT",
      "title": "Maikerry Among U&S Plush Toys Double-Sided Plush Toy Doll 5.9’’ Tall Reversable Astronaut Game Toy Figure for Kids Birthday Gifts Fans Party Car Home Decoration (Gray to White)",
      "price": "$9.99",
      "image": "https://m.media-amazon.com/images/I/71EmPRUst7S._AC_SY355_.jpg",
      "description": "Style:Gray to White",
      "reviews": {
        "customerProfileNames": [],
        "customerProfilePictures": [],
        "customerRatings": [],
        "customerReviewTitles": [],
        "customerReviewBodies": []
      }
    },
    {
      "id": "1df2fah",
      "title": "12 Inch Among Plush Toys ​Cute Crewmate Astronaut Stuffed Plush，Imposter Plush Doll with Bulging Eyes for Game Fans and Children (Pink)",
      "price": "$15.99",
      "image": "https://m.media-amazon.com/images/I/71BfrbpKFpL._AC_SY355_.jpg",
      "description": "About this item\n❤️SOFT MATERIAL: The among u&s plush toy is made of soft plush material and filled with high quality PP cotton material, which is elastic and durable\n❤️MODERATE SIZE: This astronaut stuffed plush toy measures 8 x 8 x 12 inches with bulging eyes, and is a cute children's toy and a beautiful bedroom decoration\n❤️GAME COLLECTIBLE: The Imposter plush toy is inspired by famous games and is available in red, pink and blue for gamers to collect\n❤️PERFECT GIFT: This game plushie toy is an ideal gift for game fans and a great birthday/Christmas gift for kids, friends and family\n❤️AFTER-SALES SERVICE: If the delivered product has initial defects or other defects, please feel free to contact us and we will deal with it for you in time",
      "reviews": {
        "customerProfileNames": [
          "SFox",
          "CandiceDix",
          "GeorgeO.",
          "Amber",
          "Figment"
        ],
        "customerProfilePictures": [
          "https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif"
        ],
        "customerRatings": [
          "5.0 out of 5 stars",
          "3.0 out of 5 stars",
          "5.0 out of 5 stars",
          "5.0 out of 5 stars",
          "5.0 out of 5 stars"
        ],
        "customerReviewTitles": [
          "Cute, but big",
          "Not same as photo",
          "Elegant and portable!",
          "Great gift",
          "My son loves this"
        ],
        "customerReviewBodies": [
          "For some reason my 3-year-old daughter is obsessed with Among Us. She loves this toy, her only complaint being that it's big, and it is probably a little too big for someone her size; she has to use both hands to carry it around comfortably. It looks very authentic and is very soft, so as long as you're looking for a pretty big plush, this one seems like a winner.",
          "I got this for my cousin and I was disappointed when I opened it. It was mostly orange, the color overall was not like the picture. Still my cousin seemed to like it so i wouldn't say it was a bust.",
          "I gave it to my friend he loves it and the size makes it really convenient for travel or carrying outside for afternoon tea.",
          "Gave this to my 6 year old niece as a gift she loved it.",
          "My son loves among us and I thought this was perfect. As son as he pulled out of box he loved it, also his favorite colors, so win win"
        ]
      }
    },
    {
      "id": "3z3X5ST",
      "title": "🌈Rainbow Plush Toys 12\" inch | Cute Soft Pride Gifts | Large Stuffed Plushie Merch | Astronaut Plushies Doll Birthday Party Decorations Free Stickers for Kids Boys and Girls(Stars Edition)",
      "price": "$26.98",
      "image": "https://m.media-amazon.com/images/I/81g2XOVLz6L._AC_SY355_.jpg",
      "description": "About this item\n🌈 THE BEST HOLIDAYS GIFTS Plush is inspired by the astronaut. It's a great gift for anyone who loves space. it's also ideal as a bedtime companion for every little one, with the rainbow flag symbolizing peace, tolerance and diversity.\n🌈 HIGH - QUALITY The fabric is of high quality. It is made of high-density and high-woven fabric, making it more durable, breathable, comfortable, soft and skin-friendly.\n🌈 PERFECT SIZE &FREE STICKERS 12\"inch Large size suitable for bedroom,living room,home,bedside.Free three-size stickers can be affixed on your mobile phone, laptop, Water Bottles and any place you likeIt adds more color to your life and holidays.\n🎁CHRISTMAS GIFTS For your lover, family, friends and coworkers. If you need a good gifts for your special friend, this is the one.\nSATISFACTION GUARANTEED If you have any questions about our plush, you can contact us via email. Our team will get back to you within 24 hours.",
      "reviews": {
        "customerProfileNames": [
          "SmithHaus",
          "Jackie",
          "Benj",
          "GaileDaniels",
          "CHill",
          "sandymurillo",
          "NathanFayyer",
          "ShawnaNicole"
        ],
        "customerProfilePictures": [
          "https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif"
        ],
        "customerRatings": [
          "5.0 out of 5 stars",
          "4.0 out of 5 stars",
          "5.0 out of 5 stars",
          "5.0 out of 5 stars",
          "5.0 out of 5 stars",
          "5.0 out of 5 stars",
          "5.0 out of 5 stars",
          "5.0 out of 5 stars"
        ],
        "customerReviewTitles": [
          "Great to put in a birthday bag as an add on",
          "For 7 year old grandson.",
          "Among us",
          "Cute",
          "Small and Cute",
          "Soft",
          "Cool toys",
          "Love them"
        ],
        "customerReviewBodies": [
          "What a great little add-on for a girl’s birthday party that we just went to. This rainbow plush toy 8inchs cute soft stuffed plushie and soft imposter doll gifts for girls’ kids’ birthday party decorations or just for fun.\n\ninspired by an astronaut. it's a great gift for anyone who loves space. it's also ideal as a bedtime companion for every little one, with the rainbow flag symbolizing peace, tolerance, and diversity",
          "Really cute and my Grandson loves playing Among Us! He requested these for his birthday!",
          "My daughter loved it!",
          "Granddaughter loves them.",
          "These are very cute!",
          "Would buy again, good quality.",
          "Child was very happy",
          "What can I say other than adorable, plush, and squeaky too!"
        ]
      }
    },
    {
      "id": "mh_FE_X",
      "title": "JUSHOO 9 Inch Blue Hedgehog Stuffed Plush Toy, Soft So-nic Plushie Doll for Game Fans, Kids Birthday Party Favor and Home Decor",
      "price": "$15.99",
      "image": "https://m.media-amazon.com/images/I/71vK4VPPqEL._AC_SY355_.jpg",
      "description": "Features: Inspired by a Famous Game: Giving you different character inspirations, bring you unexpected surprises High quality material: Comfortable to touch, elastic washable, and not easily deformed, will be a great kids playmate Great Gift Choice: Cute figure character, attractive to game fans and kids, bringing much imagination you, perfect as a birthday, role-playing gift and school rewards Specifications: Material: pp cotton Color: Blue Size: 22cm/9 inch Package Include: 1 x soft stuffed plush Note: Manual measurement, please allow slight difference on size The color may exist slight difference due to different screen displays Hand wash or machine wash, then dry it on cool place",
      "reviews": {
        "customerProfileNames": [
          "timl.",
          "Odessasullen",
          "TerraceLucydia",
          "Kailey",
          "TeresaRivera",
          "Jonathan",
          "Adam",
          "caseyj."
        ],
        "customerProfilePictures": [
          "https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif",
          "https://images-na.ssl-images-amazon.com/images/S/amazon-avatars-global/99b5df64-b946-41f3-ab65-372e153cb715._CR0,0,312,312_SX48_.jpg"
        ],
        "customerRatings": [
          "5.0 out of 5 stars",
          "5.0 out of 5 stars",
          "5.0 out of 5 stars",
          "5.0 out of 5 stars",
          "5.0 out of 5 stars",
          "4.0 out of 5 stars",
          "3.0 out of 5 stars",
          "1.0 out of 5 stars"
        ],
        "customerReviewTitles": [
          "Awesome",
          "Did Plush all I need is tails",
          "Sonamoungus",
          "i love it",
          "Very accurate from the picture.",
          "Well made but much smaller than described!",
          "Inaccurate Size Description",
          "It was not the size I thought it was"
        ],
        "customerReviewBodies": [
          "Love it",
          "It came in a day and it was Golden The plush has good stuffing everything is attached nothing is wrong with it I just wish there was a tails one I would order that too",
          "Perf, hes perf. Buy him",
          "I bought as a gift for my bf",
          "Such a cute and unique Among Us/Sonic the Hedgehog themed stuffed animal! Very soft and immediately enjoyable! I am disappointed with the exaggeration in size, I personally look ahead at those details before purchasing and this was WAY OFF.",
          "This is very soft, and adorable… But the size is very off in the description! As other reviews have stated, it is closer to 6.5 inches, very small for the price! Disappointed.",
          "It's soft but way too small."
        ]
      }
    },
    {
      "id": "4jIcR4S",
      "title": "8inch Plushie Among Plush Toy,Cute Bulging Eyes Plush Figure Cute Doll, for Gifts Game Fans (Red)",
      "price": "$11.58",
      "image": "https://m.media-amazon.com/images/I/41dLl1ruMeS._AC_SY355_.jpg",
      "description": "",
      "reviews": {
        "customerProfileNames": [
          "Amanda",
          "mia",
          "AmaraRodriguez",
          "Eileen",
          "LEANN",
          "RUTHTRICE",
          "NA",
          "Kritsal"
        ],
        "customerProfilePictures": [
          "https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif"
        ],
        "customerRatings": [
          "5.0 out of 5 stars",
          "5.0 out of 5 stars",
          "5.0 out of 5 stars",
          "5.0 out of 5 stars",
          "5.0 out of 5 stars",
          "5.0 out of 5 stars",
          "5.0 out of 5 stars",
          "5.0 out of 5 stars"
        ],
        "customerReviewTitles": [
          "Perfect! Not sus at all",
          "twas a good purchase 📮📮📮📮📮📮",
          "So cute definitely worth the money",
          "Great",
          "The kids will love it",
          "It is so soft and cuddley",
          "Good",
          "Wonderful size and color!"
        ],
        "customerReviewBodies": [
          "My sons eyes lit up when I gave this to him! I was surprised when the vac packed package came but it fluffed right up!",
          "It comes flat as a pancake but as soon as you open it and fluff it a little it's perfect and fluffy my son loved it definitely reccomend",
          "Gave it as a gift and it was perfect, nice and soft, squishy little guy. I thought the size was perfect but it is not big by any means.",
          "Came fast and exactly like other reviews said it is vacuum seeled pack but does come out regular sized once you open it",
          "M",
          "I got this for a friend since he’s obsessed with Among Us and he loves it. He treats that thing as if it were truly alive and takes very good care of it. I was a bit worried about the quality of the plushie and if it would be able to withstand my friend’s energetic and lively personality, but so far the plushie is holding up good. I love the way it looks and do not regret the purchase.",
          "My son loved this gift but unfortunately I've had to sew it three times in different spots. My son was very upset about it. Other then that the size is great and its very soft!"
        ]
      }
    },
    {
      "id": "im7Atl7",
      "title": "IUTOYYE 9.8 Inch Axolotl Plush Astronaut Among Stuffed Animal Cute Pink Wing Plushie Doll Toy Cosplay Prop Merch for Game Fans (Pink)",
      "price": "$19.99",
      "image": "https://m.media-amazon.com/images/I/61bzd2YKjJL._AC_SY355_.jpg",
      "description": "About this item\n【Product Size】Salamander doll size is 9.8inch/25cm, it is very suitable for hugging, You can take it to any place you want, and it will accompany you like a friend. (there may be an error of 0.5-1inches).\n【High Quality Material】This cute pink plush doll is made of high quality short plush material, which is soft to the touch, safe, odor-free and skin-friendly. The interior is filled with elastic PP cotton, which has strong resilience and is not easy to deform.\n【Unique Design】The unique design with pink fabric makes the doll more cute. Soft touch, let people put it down.\n【Multiple Uses】Not only can be used as a plush toy, but also can be used as a sleeping pillow, a baby's soothing doll, and accompanying children to play.\n【Gift】This doll is perfect as decoration in office, library, bedroom and living room. Dolls with unique shapes are also the best gifts for birthdays, parties, Halloween, Christmas, Valentine's Day.",
      "reviews": {
        "customerProfileNames": ["Customer", "Sandra"],
        "customerProfilePictures": [
          "https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif"
        ],
        "customerRatings": ["5.0 out of 5 stars", "5.0 out of 5 stars"],
        "customerReviewTitles": [
          "My son loves it.",
          "Great quality, worth the money"
        ],
        "customerReviewBodies": [
          "Loves it because it is soft -and size.",
          "My son absolutely loves his plusses, very well made, will definitely be ordering more"
        ]
      }
    },
    {
      "id": "vXhBf7u",
      "title": "Among Us Plush Buddies | 8-Inch-Tall Among Us Plushie Collectibles | Playable Among Us Toys | Among Us Kids’ Toys by P.M.I. | Licensed Plush (Orange Rammed)",
      "price": "$19.99",
      "image": "https://m.media-amazon.com/images/I/81OALkLMjCL._AC_SY355_.jpg",
      "description": "A whole bag of Among Us plush toys is a great gift idea, especially if your or your friends’ children like the game. It will also come in handy if you’re looking for simple Among Us birthday party supplies, and it can even be used as Among Us party decorations. Get the right pack to help a young Among Us enthusiast complete their collection or start one from scratch. Perhaps, an adult Among Us plushies collector will appreciate the gift, too.",
      "reviews": {
        "customerProfileNames": ["Robyn"],
        "customerProfilePictures": [
          "https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif",
          "https://images-na.ssl-images-amazon.com/images/S/amazon-avatars-global/43e57c91-eccb-4891-822c-9f97cd04cf99._CR0,0,399,399_SX48_.jpg"
        ],
        "customerRatings": ["4.0 out of 5 stars"],
        "customerReviewTitles": ["Horns aren't removable."],
        "customerReviewBodies": [
          "There's no fabric under the horns, just holes, so if you remove them and then sew the holes shut it becomes a weird star shape. Whoops."
        ]
      }
    },
    {
      "id": "HqVCAkM",
      "title": "FATIZONE 12pcs PVC Toys Action Figures Set | Mini Game Figures Desk Character Model Toys, Cake Decorations Impostor",
      "price": "$23.99",
      "image": "https://m.media-amazon.com/images/I/71un036FMpS._AC_SY355_.jpg",
      "description": "About this item\nAction Figures: These action figure toys are inspired by the famous game, richly painted details bring them to life and help inspire creativity for kids or teens.\nPremium Quality: These game figures are made of high-quality pvc material, non-deformed, touch to delicate, easy to hold and comfortable, non-toxic and eco-friendly.\nSmall & Portable: The suit contains 12pcs pvc action figure model of different costumes, each of which can be disassembled and divided into 2 parts. These are small size(3.25inch tall), easy to carry, you can take it anywhere anytime.\nDedicated Gift: These mini astronaut figures toy set is a nice, enjoyable choice to give as a gift to children, friends, partners, and it also a good gift for Christmas, Valentine's Day, Cake Accessories Decoration and Birthday Present.\nYour Satisfaction is Our Priority: If you aren't satisfied with our action figures toy quality and would like to return it, we will issue immediate refund.",
      "reviews": {
        "customerProfileNames": [
          "MichaelCiociola",
          "Berneal",
          "LazyArgon",
          "JarrettLyons",
          "ChristineTsinChiu",
          "lauraaarayyy",
          "AngelaSchlagenhaft",
          "KalibFisher"
        ],
        "customerProfilePictures": [
          "https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif"
        ],
        "customerRatings": [
          "5.0 out of 5 stars",
          "5.0 out of 5 stars",
          "5.0 out of 5 stars",
          "5.0 out of 5 stars",
          "5.0 out of 5 stars",
          "5.0 out of 5 stars",
          "5.0 out of 5 stars",
          "5.0 out of 5 stars"
        ],
        "customerReviewTitles": [
          "Daddy Wins Again",
          "Beautiful Memories",
          "Perfect for kids who love the game",
          "Amazing!",
          "Perfect birthday gift!",
          "Super cool/cute!",
          "9 year old loves them",
          "My little guy LOVES THEM"
        ],
        "customerReviewBodies": [
          "My two young kids have recently discovered \"Among Us\" video game. I hear them talking and laughing playing it, and thought this would be an easy win. These are decent sized figurines, with lots of colors and creative designs. NOT ELECTRONIC. It's a quiet toy they can bring along on car rides, or play quietly with in church or during other \"grown up\" meetings.\n\nThey gasped with delight seeing them last night, and brought some down to the breakfast table this morning, informing me how they had divvied them up between them, which they liked best, and where they would keep them in their rooms.",
          "I Loved Them Because They Brought Happinessc",
          "My kids love these. They were super excited about the colors and love how the pieces are interchangeable. They have been playing with them like crazy, doing missions and mimicking the game. Would definitely recommend.",
          "If you are looking for a gift for the kid who loves Among Us then look no further!! These little action figures are so cool and perfect for kids! Bought these for our 7 year old son and I literally can’t wait to give it to him! Worth every penny!",
          "You know how I know my kids love them? Each figurine has multiple parts and three months later, my boys have not lost one part. They are so careful with them and my boys aren’t careful with anything! I bought two sets just in case but haven’t needed to open the spare ones.",
          "If your kids love among us (my 5y/o does lol) this is perfect for them! They have soo many cute little pieces & their heads come off too. The ”hat” tops come off & can be changed. So many colors as well. Interchangeable, big & cool.",
          "My son was so excited for these and played Among Us with his legos for hours often. He keeps them displayed on his dresser when he’s not playing with them.",
          "Super good for the price and quality",
          "I got these for my son for Christmas. You get a lot of figurines for the price. He absolutely loved them.",
          "Bought this for birthday gift…nephew loved it…",
          "Great toys",
          "My son loved them and was so excited to open them all up. They are bigger than we thought which is nice and the plastic is nice and sturdy. They are good quality for what we paid.",
          "These were very expensive and there not even made properly. I gave this as a gift and I was embarrassed!!!"
        ]
      }
    },
    {
      "id": "kLc0vXh",
      "title": "12 Pcs Merch Figurines Set, Collection Toys for Game Fans, Mini Character Action Figure Decorations, Astronaut Crewmate Desk Toy Gift for Children, Cake Topper Party Supply (A)",
      "price": "$23.99",
      "image": "https://m.media-amazon.com/images/I/51PpUaVz8ZS._AC_SY355_.jpg",
      "description": "Ideal gift for festival, holiday, birthday party, any party. Great gift for girl friends, boy friends, children, friends, family, classmates.",
      "reviews": {
        "customerProfileNames": [
          "KaylaL.",
          "SolomonAnima",
          "AnaL.Deleon",
          "JanelleAshley",
          "LucasCorrao",
          "JamesD.Moore",
          "HCW",
          "Jessica"
        ],
        "customerProfilePictures": [
          "https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif",
          "https://images-na.ssl-images-amazon.com/images/S/amazon-avatars-global/53606722-ddfa-4c62-a9fb-87dd48b097a2._CR0,26.0,281,281_SX48_.jpg",
          "https://images-na.ssl-images-amazon.com/images/S/amazon-avatars-global/05b6ec3e-3734-4adb-94b0-915cc15080a4._CR0,0,500,500_SX48_.jpg"
        ],
        "customerRatings": [
          "5.0 out of 5 stars",
          "5.0 out of 5 stars",
          "5.0 out of 5 stars",
          "5.0 out of 5 stars",
          "5.0 out of 5 stars",
          "5.0 out of 5 stars",
          "5.0 out of 5 stars",
          "5.0 out of 5 stars"
        ],
        "customerReviewTitles": [
          "Best of available merchandise",
          "Your kid will be happy!",
          "Great buy",
          "Excellent cake toppers and party favors",
          "They are huge!",
          "Cute little dudes",
          "So Cute",
          "Bought this for a coworkers birthday..."
        ],
        "customerReviewBodies": [
          "AmongUs became unexpectedly popular before I think anyone was ready for it, so merchandise hasn't been easy to come by. I got these for my son for his Birthday, everyone that likes AmongUs has enjoyed them. They're not tiny, they are good quality, durable; the fact they're interchangeable gives more versatility for use, and the while they're not what I'd consider cheap or a 'great buy', they're definitely the best value for your money from all of the merchandise available.",
          "Quality isn’t the best but the figures work like they are supposed and your kid will love it. What I mean by the quality is that the inside bone piece doesn’t not fit flush because either that piece or the bottom piece it fits into are warped from being tightly packed in storage. I haven’t tried the hot water trick to reform the plastic on these yet because they pretty much stay in for the most part. The top and bottom pieces do fit and stay on perfectly. The figures stand up perfectly on flat surfaces as well! My son has played with these for over a week and hasn’t run into any issues.",
          "Great products and good size worth the $$",
          " These were very durable and I was able to wash them before putting them on the cake with no problem. It was nice I could take them apart and put some dead ones and some venting on the cake!",
          "I was expecting some cheap tiny toy set from china but boy was I wrong! I’m very impressed with this set the figures are about the size of a seasoning Bottle and are made of thick plastic! I will be purchasing more toys from this company!",
          "Couple of them are a little misprints BUT the price I paid, and the fact that I'm keeping the 2 I'm holding, I really don't mind lol. My kids LOVE these guys and I've made them all sorts of stuff with the characters, I knew these would be a hit!\nThey were even on sale, so I couldn't say no lol. My daughter was thrilled to get a couple and the little bones on the inside made her LAUGH so hard. So they're already totally worth it!\nFrivolous purchase, but absolutely no regrets!",
          "These are stinkin' cute yet not babyish. I am using them as reward incentives just to make them more valuable instead of giving my child the whole bag. I think it will be fun to \"collect\" them by completing chores/tasks/responsibilities.",
          "I bought these bad boys to hide in a co worker's tool box and around our work environment to mess with him leading up to his birthday. I had him fooled up until he ran out of people to accuse 😆 He loved them and so did his daughter. Would work good on a cake or cupcakes 🧁",
          "Resistentes, buen detallado en las figuras.",
          "",
          "le encantó el juguete a mi hijo!!",
          ""
        ]
      }
    },
    {
      "id": "zct-Lbp",
      "title": "Among U&s Plush Toy 12Inch Cute Stuffed Figure Bulging Eyes Astronaut PlushToy Figure with is The Best Gift for Kids (Red)",
      "price": "$15.99",
      "image": "https://m.media-amazon.com/images/I/618BCMQ2o1S._AC_SY355_.jpg",
      "description": "❤Introductions: It's the best gift for Among Us game fans. These plushies are crewmate members very kawaii in the game.Very suitable for plush animal cartoon doll anime collection toy collectors. Please rest assured to choose our products! Full of filling and very durable. It is filled with soft 100%PP cotton, smooth to the touch. ❤Condition: 100% Brand New. ❤Functions:This soft among us plush to relieve your stress. Suit for bedroom, living room, home, nursery bed, car and anywhere you like. A great gift choice for your kids, friendsand family. ❤Specifications: Package Included: 1x Among Us plushie Cut tag off with scissors to avoid the actual plushie rip.",
      "reviews": {
        "customerProfileNames": [
          "ChristinaJenkinsisverysus",
          "DwightM.",
          "EdwinAbarca"
        ],
        "customerProfilePictures": [
          "https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif"
        ],
        "customerRatings": [
          "5.0 out of 5 stars",
          "5.0 out of 5 stars",
          "5.0 out of 5 stars"
        ],
        "customerReviewTitles": [
          "Maybe the imposter?",
          "Accurate description",
          "Sus"
        ],
        "customerReviewBodies": [
          "Very sussy… red is always sus… i think i found the imposter?!?!",
          "My grandson liked it. It was true to size, soft, and didn't have any funny smells. He loved it, so I'm happy with this purchase.",
          "Sus"
        ]
      }
    },
    {
      "id": "frH7fzV",
      "title": "TIMSOPHIA Hedgehog Plush Figure Knuckles Toys Cartoon Character Plush Children's Cute Plush Doll Shadow Soft Stuffed Game Doll Toys Gift for Kids (20cm, Black)",
      "price": "$19.99",
      "image": "https://m.media-amazon.com/images/I/61uVMUUv2LL._AC_SY355_.jpg",
      "description": "About this item\nPremium Quality:This toy is made of high-quality soft short plush, filled with PP cotton, which could provide you a comfortable and skin-friendly touch.\nSmall and Portable: About , small size and easy to carry, you could carry it anytime, anywhere to play.\nIdeal Gift: It is very cute, inspired by famous games, is an ideal gift for game fans, and it is also the best choice for children, friends and family as a holiday gift.\nWide Application: High-quality plush toy can be used for home and office decoration, which could give you a sense of warmth and love.\n100% Customer Satisfaction : If there are any issues with this pillow, please do not hesitate to contact us. Your satisfaction is our top priority.",
      "reviews": {
        "customerProfileNames": [
          "Dominicparsons",
          "RoamRobles",
          "LibbyF.",
          "mickinzee",
          "sharongulnac",
          "yes",
          "ashley",
          "EllenaPerovic"
        ],
        "customerProfilePictures": [
          "https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif",
          "https://images-na.ssl-images-amazon.com/images/S/amazon-avatars-global/4a299479-992c-43d9-b0b9-73833ff0c117._CR31,0,438,438_SX48_.jpg"
        ],
        "customerRatings": [
          "5.0 out of 5 stars",
          "5.0 out of 5 stars",
          "5.0 out of 5 stars",
          "5.0 out of 5 stars",
          "4.0 out of 5 stars",
          "4.0 out of 5 stars",
          "2.0 out of 5 stars",
          "5.0 out of 5 stars"
        ],
        "customerReviewTitles": [
          "Pass the gas shadow!!!!",
          "Weird little nose I love him",
          "Lovely",
          "I bought this sus child awhile ago and I LOVE HIM. Great material and came on time.",
          "quality",
          "It’s beautiful.",
          "YOU DID NOT",
          "shamoungus"
        ],
        "customerReviewBodies": [
          "This is probably the best purchase I've made in my life, Among us shadow the hedgehog is legit, got me through my hardest times... ☝🏼",
          "His stitching is up to par (I’ve ordered stuffies coming apart at the seams before) and he looks just like the picture. He has a nose and little quills on the backpack too, cute little details. He’s so ugly I love him.",
          "he was a little deformed at parts, but for a friends birthday. safe to say she LOVED IT!",
          "Oh the title is the review",
          "The pants on the plushies fall off easily.",
          "I love it",
          "YOU DID NOT CALL MONOMI MONOKUMA",
          "shamoungus"
        ]
      }
    },
    {
      "id": "1RknNEC",
      "title": "RubRab Hot Game Character Plush Toys Soft Merch Plushies Cute Astronaut Stuffed Plushies Doll Gifts for Game Fans and Kids Birthday Build-in BB Whistle (Figure Toy D)",
      "price": "$13.85",
      "image": "https://m.media-amazon.com/images/I/61qmupetbEL._AC_SY355_.jpg",
      "description": "About this item\n🛸【Funny voice】: Plush built-in plastic BB sounder, when you press the plush toy, and it will make a sound, which makes these toys more funny.\n🛸【Soft Material】: Plush is made of durable plush material and filled with high-quality PP cotton material. Easy to clean, use a small amount of soap and water to remove stains, and dry naturally.\n🛸【Small & Portable】: This plush is about 6 inches x 3 inches x 4 inches . Small size, easy to carry, you can take it anywhere and anytime.\n🛸【Best Decoration】: Perfect for Christmas tree, burlap wreaths, car, dining room, etc; Make your home filled with festive atmosphere, perfect blends well of Christmas, holiday or home decoration. A cute plush toys keychain bring you a good mood when using it on your backpacks.\n🛸【After Sale Service】: If the delivered product has initial defects or other defects, please feel free to contact us. Please be assured that our shop will respond seriously.",
      "reviews": {
        "customerProfileNames": [
          "Jamie",
          "SomeRandoWithAnOpinion",
          "StephanieFroman",
          "Jay",
          "BarbaraNowell"
        ],
        "customerProfilePictures": [
          "https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif"
        ],
        "customerRatings": [
          "5.0 out of 5 stars",
          "5.0 out of 5 stars",
          "1.0 out of 5 stars",
          "2.0 out of 5 stars",
          "5.0 out of 5 stars"
        ],
        "customerReviewTitles": [
          "My son was very happy.",
          "Accurate",
          "Cheap and not as pictured",
          "Rip",
          "Happy grandson"
        ],
        "customerReviewBodies": [
          "I bought it for my son and he loves it he's been wanting one for awhile arrived in good condition and time.",
          "Stitching is sturdy. Has a suction cup and hanger which can be easily hidden by the sewn-on hat, and has a squeaker in its middle which never fails to get my dog's attention.\n\nSus/10",
          "Very cheap looking. Seams are not done correctly. Also, the plush I recieved was not what was pictured. Mine came with a thick white string attached to its back with a suction. Very disappointing",
          "Very good plush but came with a big rip",
          "Character looks just like the ones on TV.",
          "Pongo 3 estrellas porque me enviaron el among us rojo y no el verde (que pedí). La calidad es bastante buena sin embargo",
          ""
        ]
      }
    },
    {
      "id": "TWTpj6g",
      "title": "Hot Mini Figures Toys for Game Figures Model Toys Cake Decorations Accessories Computer Desktop Dolls",
      "price": "$10.99",
      "image": "https://m.media-amazon.com/images/I/61Paz4jRNfS._AC_SY355_.jpg",
      "description": "12 set",
      "reviews": {
        "customerProfileNames": [
          "EJHANNA",
          "Angela",
          "Chris",
          "CindySue",
          "HumanPerson",
          "LZ",
          "DebUbaldini",
          "Danielle"
        ],
        "customerProfilePictures": [
          "https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif"
        ],
        "customerRatings": [
          "5.0 out of 5 stars",
          "5.0 out of 5 stars",
          "5.0 out of 5 stars",
          "5.0 out of 5 stars",
          "4.0 out of 5 stars",
          "2.0 out of 5 stars",
          "5.0 out of 5 stars",
          "5.0 out of 5 stars"
        ],
        "customerReviewTitles": [
          "Good",
          "Smaller then I expected.",
          "Cute",
          "Great for Among US themed birthday party",
          "They are good for what they are.",
          "They don't separate into two pieces",
          "Among Us is among us",
          "Worked out great"
        ],
        "customerReviewBodies": [
          "Bought them for my sons birthday party goody bags, it works for what we needed them for.",
          "Smaller then expexted",
          "Cute for kids, recommend",
          "Used as a birthday cake topper and party favor for kids who all had an opinion on which color character they wanted in their slice of cake. Was really cute and the right size. One of the \"hats\" would not go on because the attachment hole was not big enough, otherwise details and colors were great.",
          "I bought these to use in Easter eggs and they were perfect for it. Everyone loved them and the fact that the accessories are mix and match was very nice. They're decent quality but nothing fancy.",
          "The lines around the figurines are pointless and deceptive; the figurines are a single piece and do not separate into a \"dead body with a single bone sticking out\". The description does not claim this is the case, but it is written in bad English, so that plus the line around the figurines gave me hope that the pieces would separate. I'm highly disappointed. However, aside from that, they are cute, and the hats/headgear are game classics; for $12, it's not a bad deal.",
          "Grandson loves these. I had a 600 plus Easter Egg Hunt for the kids thus year and bought 2 sets to put in th plastic eggs. Nuce that ea h one was in an individual bag. This way the little add on piece didn't get lost in the grass during the hunt. Note: they are tiny. Not for little ones.",
          "I ordered these to go on my son's birthday cake. They are the perfect cake topper or cupcakes topper size, the best was my son could remove them and now has new toys."
        ]
      }
    },
    {
      "id": "5iVLbQ6",
      "title": "Among U&S Plush Toys 12 Pcs Stuffed Animal Plushie Toy, Funny Little Animal Gifts for Children and Super Game Fans Young 1",
      "price": "$28.99",
      "image": "https://m.media-amazon.com/images/I/717XbCq4DhL._AC_SY355_.jpg",
      "description": "Among U&s Plush Set 12 Pcs\nSize: 4.3 inch | Color: 12\nCollect this unique plush toy. This will be the perfect gift for your child.\nMade of super soft materials, plush fabric and PP cotton, cute appearance can win the love of children.\n",
      "reviews": {
        "customerProfileNames": ["ACE", "lreich"],
        "customerProfilePictures": [
          "https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif",
          "https://images-na.ssl-images-amazon.com/images/S/amazon-avatars-global/7c721bdb-91ee-4cd4-a717-07deff0b377f._CR0,0,375,375_SX48_.jpg"
        ],
        "customerRatings": ["5.0 out of 5 stars", "2.0 out of 5 stars"],
        "customerReviewTitles": ["Cute among us plushies", "Cheap"],
        "customerReviewBodies": [
          "My kid loved these among us plushies ! Not too big not too small .\nPerfect size for 6yr old.",
          "My son ordered a large lot of among us and they were much better quality than this order. These are very cheaply made"
        ]
      }
    },
    {
      "id": "S6VEFWX",
      "title": "Stuffed Plush Toy, Soft Hedgehog Plushie Doll for Game Fans, Kids Birthday Party Favor and Home Decor",
      "price": "$15.99",
      "image": "https://m.media-amazon.com/images/I/71uLY7Xij2L._AC_SY450_.jpg",
      "description": "About this item\nATTRACTIVE PLUSH TOY: This upgrade stuffed animal Plush is derived from a popular game, let you get close to the characters of game, which can give you different character inspirations, bringing you unexpected surprises. Are you ready to let it join your toy squad?\nPERFECT GIFT FOR KIDS: Kids like novel and unique toy, this stuffed animal plush toy will satisfy their needs. It' s very attractive to children, which will bring fun and imagination to them, enhancing their imagination and hands-on ability, perfect as a birthday, school exchange and role-playing gift\nHIGH QUALITY MATERIAL AND SUITABLE SIZE: hedgehog plush is made of skin friendly silk wadding and soft plush, filled with supper soft PP cotton, featured with elastic, safe, comfortable to touch, and not easy to be deformed; the size measures 22 cm/9 inch, suitable for carrying\nDURABLE AND WASHABLE: Careful stitching every detail of fabric makes sure its quality, and the surface of the game plush doll is washable by hand and machine, so don’t worry about getting dirty, just enjoy your game time\nWIDELY APPLICATION: Multi-color design on doll's nose and legs makes it cute enough, very suitable for decorating on your desk ,bedside, shelf, tabletop, counter and sofa; Also you can hug or throw it as a stress relief plush toy",
      "reviews": {
        "customerProfileNames": [
          "DoelSantanaSoto",
          "Arzach",
          "opal",
          "Lulubelle",
          "Ashleigh",
          "bernadette",
          "101",
          "A.Mom"
        ],
        "customerProfilePictures": [
          "https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif"
        ],
        "customerRatings": [
          "5.0 out of 5 stars",
          "5.0 out of 5 stars",
          "5.0 out of 5 stars",
          "5.0 out of 5 stars",
          "4.0 out of 5 stars",
          "5.0 out of 5 stars",
          "5.0 out of 5 stars",
          "4.0 out of 5 stars"
        ],
        "customerReviewTitles": [
          "Su originalidad. Mi hijo adora a Tails y a Among Us",
          "",
          "Why?",
          "Unique and fun plushie!",
          "Cute Lovey",
          "Soft and Cuddly but with some wrinkles",
          "My 10yr is obsessed",
          "So much fun. Giftable.",
          "Very nice!"
        ],
        "customerReviewBodies": [
          "El tamaño es perfecto; bastante grande. Mi hijo adora a Tails y a Among Us..más aún su combinación",
          "",
          "A Sonic/Among Us mashup seems about as random as it gets, especially in plush form with Tails as the character! That's why we love it. Whatever weird, parallel universe spawned this must be a groovy place. It comes vacuum packed (to protect from inter-dimensional forces during transition, I presume), but floofs out quickly when exposed to our reality. Here's to smashing things together that don't belong, to create things that should never be!",
          "My sons, like many other reviewers' kids, are big fans of sonic and among us- I couldn't pass this adorable stuffed doll up for them! I don't know were else one can find such an interesting mix as this, and my kids love this toy.\n\nIt does come vac-bagged and needs time to fluff up, a quick trip through the dryer on low or no heat fluffs it faster. Since this comes as it does, it's not the best for gifting unless you open it first and put it into a gift box yourself.\n\nStuffed Plush Toy, Soft Hedgehog Plushie Doll for Game Fans, Kids Birthday Party Favor and Home Decor (Yellow)",
          "This was a cute lovey and my son is into Among Us and Sonic. The whiskers were sewn on and one side came off after an afternoon of playing. Haven't seen anything like it in the stores or online so I can't tell you how well it is priced.",
          "4.4 Stars (standard rounding rules apply)\n\nMy kiddo is obsessed with Sonic the Hedgehog and Among Us and mixing the two together was a hit for him. He absolutely loved this Tails Among Us plush.\n\nSome things about the plush, it is very soft, and cuddly. These are musts for any stuffed animal or plushie, which means it checks these boxes. The craftsmanship and sewing looks durable, and from what I can see (as someone who sews) that this isn't going to be falling apart after a lot of use and even some washing- though always use a gentle cycle if handwashing isn't an option.\n\nOne of the reasons this wasn't a five star for me was mostly due to packaging. It was in a vacuum sealed bag, meaning that had this been a gift I would have needed to open it with enough time for it to fluff up; and even then it's not without wrinkles. The tails are still slightly flattened - even two days after opening the package. Tails' ears are flimsy compared to the rest of the body and almost like a different material was used when making them.\n\nOverall, this plush was a hit in my house and I am sure it would be a hit in yours! Even with the wrinkles and the feeling of a different material used on the ears it is still a very much loved item. I would absolutely recommend it.",
          "I have a fanatic at home and let me just say they loved this! Best of both worlds with this plushie. It’s just the right size and super soft.",
          "This was a hit with the kids. They really enjoyed it and it made them happy. The colors are vibrant and it is soft enough to throw around. Very cool and giftable.",
          "I have to say, this plush is pretty adorable. My daughter is a huge fan of AU, so she was thrilled from the moment this came out of the package. That is, once we got it opened and she realized what she had. The thing I didn't love about it is that the plush came super vacuum sealed. Smooshed flat. So inside the packaging, it isn't quite obvious what it was. Meaning the plush doesn't come in the best form to give as a gift. It fluffed back up fine though. And since she loves it, we both would have to recommend it.\nHope this review was helpful"
        ]
      }
    },
    {
      "id": "a5c9yT3",
      "title": "Among U& Us Game Plush Crew Toys(6 Packs)-Built in Sound Toy,Game Figures Plush Animal Toy Merch Gift for Adult Kids",
      "price": "$19.99",
      "image": "https://m.media-amazon.com/images/I/71OH3fvPtQL._AC_SY355_.jpg",
      "description": "About this item\nQUALITY GUARANTEED:This toy is made of high-quality soft short plush, filled with PP cotton, good resilience and feels comfortable, skin-friendly and fluffy.\nSOUNDER DESIGN:All small toys have a built-in plastic BB sounder, no battery is needed, just a light pinch will make a \"chirp\" sound.\nSMALL & PORTABLE:The size of this plush toy is about 3.93 inches, small and exquisite, mini cute, very easy to carry, you can put it by your side and enjoy the fun it brings to you anytime, anywhere.\nWIDELY USED:It can be decorated in the bedroom, living room, car,office, adding a warm atmosphere to your space, or as a decompression doll, when you are upset, pinch this little plush toy to release stress.\nIDEAL GIFT:This plush toy is very cute. Its design is inspired by famous games, It is an ideal gift for game fans, and it is also the best choice for children and friends as a holiday party gift.",
      "reviews": {
        "customerProfileNames": ["LarryRaddatz", "L", "Nicole"],
        "customerProfilePictures": [
          "https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif"
        ],
        "customerRatings": [
          "5.0 out of 5 stars",
          "5.0 out of 5 stars",
          "5.0 out of 5 stars"
        ],
        "customerReviewTitles": [
          "They're like dog toys with a squeaker.",
          "Kid loved it",
          "Small but Cute"
        ],
        "customerReviewBodies": [
          "I bought for birthday treat bags. I didn't realize they were like dog toys.",
          "Kid loved it, good enough for me man",
          "They’re a little smaller than I was expecting but my kid loves them. Also, likes to throw them as well. Feels like you’re being hit with balled up socks.",
          "Los imaginaba más pequeños pero están de buen tamaño y calidad",
          ""
        ]
      }
    },
    {
      "id": "7Ab13eJ",
      "title": "Plush Story Among You&Us Plush Toy 8 Inch Green Soft Crewmate Astronaut Imposter Plushy Large Astronaut Plushie Figures Big Cute Stuffed Doll for Boys and Girls",
      "price": "$9.99",
      "image": "https://m.media-amazon.com/images/I/819keMtU5YS._AC_SY355_.jpg",
      "description": "MATERIAL This green amung us plushie based on the famous game, crewmate plush is made of short plush very soft material and filled with PP cotton. Very easy to clean plush toy, a little soap and water and you can remove stains and dust.\nSIZE The soft toy stuffed size 8\" 20 cm is very convenient to carry in a handbag or a backpack, you can take amung us plush toy with you wherever you go.\nRELIEVE STRESS In moments when you are sad, the small astronaut figure us will help you relieve stress, amongus plushy s will always be there to give you warmth and pleasant sensations. You or your children can sleep with an amung us gifts for boys and girls that will soothe you before bed.\nDECORATION The big among plush will be an excellent decoration in the interior of your home, office, living room. Crewmate plushie can be a great decoration for your bedroom and serve as pillows. Will be a great addition to the car.\nGIFT The large plush toy is a great gift for fans of the amung us game. Also amungus toys for kids are a great gift for your close friends, relatives, and colleagues for New Year, Christmas, Easter, birthdays.",
      "reviews": {
        "customerProfileNames": ["kb", "mi-matt", "Customer", "Customer"],
        "customerProfilePictures": [
          "https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif"
        ],
        "customerRatings": [
          "1.0 out of 5 stars",
          "5.0 out of 5 stars",
          "3.0 out of 5 stars",
          "5.0 out of 5 stars"
        ],
        "customerReviewTitles": [
          "Dog toy/Bad stitching",
          "Great quality, very cute!",
          "False Advertising!",
          "Cute"
        ],
        "customerReviewBodies": [
          "There was a rip on this thing right out of the package. Horrible.\nThe sound it makes is the same as a dog toy. If that's what you want then great. We were disappointed especially for the price. A dog would have this thing torn to shreds in seconds.\nReally bad quality.",
          "Perfect for what he wanted",
          "The \"built in sounder\" is a squeaker for a dog toy.",
          "My daughter is a huge “among us” fan. Lavender is her favorite color and also the color of her room so I figured the deep purple would have to do. Come to find out, the purple one is the hardest to find so I was happy to get this one. An even better surprise is that when it arrived I noticed it’s a much lighter purple than how it looks in the photo. That was perfect for us since she prefers lavender but for others who might be looking for that dark purple, it’s helpful to know that it is not that dark."
        ]
      }
    },
    {
      "id": "jdQ3P3F",
      "title": "11inch Among Plush Us Game Plushie Toys, Sonic Red Knuckles Stuffed Animals The Movie Hedgehog Doll for Boys Girls Kids Birthday Party Xmas Gift",
      "price": "$13.99",
      "image": "https://m.media-amazon.com/images/I/71RvQoveetL._AC_SY450_.jpg",
      "description": "About this item\n【High-Guality Game Plush】 Inspired by two famous space & adventure game figures, this upgraded plush toy with prominent big eyes and cute expressions can bring you different character inspirations and unexpected surprises, giving your kids more emotional snuggles and accompanying them every day as they grow up, it will be an ideal companion for children.\n【Material and Size】 Made of skin-friendly silk wool and soft plush, filled with soft PP cotton, our game plush is very full and fluffy, fine workmanship, firm stitching, safe and comfortable to touch. Small in size, easy to carry and can be used anywhere, anytime.\n【Great Decoration & Best Partner】 Multi-color design on game doll's nose and legs makes it cute enough, not only can decorate your desk, bedside, bookshelf, tabletop, counter and sofa, but also a friend of children to embrace with while watching movie, relaxing and sleeping. Our game plush is the spiritual sustenance of children for a beautiful world, and can accompany children to spend every good night.\n【Easy to Clean & Easy to Care】Our game plush doll is machine washable, so you can enjoy your play time without worrying about getting dirty, saving time and convenience. And the product is vacuum packed to protect the doll, after taking out the doll, just pat it gently or put it in the sun for a while. Swell and plump.\n【Great Gift】This figure toy the best gift for space & adventure game fans of collection, role-playing, Christmas, party, holiday celebration. If you are not satisfied with the products, we will 24*7 hours customer service.",
      "reviews": {
        "customerProfileNames": [],
        "customerProfilePictures": [],
        "customerRatings": [],
        "customerReviewTitles": [],
        "customerReviewBodies": []
      }
    },
    {
      "id": "LWPvBqR",
      "title": "Among Us Mini Figures",
      "price": "$9.79",
      "image": "https://m.media-amazon.com/images/I/617ANtfux3L._AC_SY355_.jpg",
      "description": "Surprise the biggest Among Us fans with the smallest mini figures. Each blind box comes with one random 2\" Among us mini figure. It makes opening each minifigure an exciting surprise. Collect all 18 Among Us mini figures. Each purchase is for ONE mini figure, not an entire set.",
      "reviews": {
        "customerProfileNames": [
          "Troy",
          "CindyLBurke",
          "Sarah",
          "LauraFunderburgh",
          "JuanMoreno",
          "Lex.DD",
          "Lin",
          "bri"
        ],
        "customerProfilePictures": [
          "https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif"
        ],
        "customerRatings": [
          "5.0 out of 5 stars",
          "5.0 out of 5 stars",
          "1.0 out of 5 stars",
          "5.0 out of 5 stars",
          "5.0 out of 5 stars",
          "5.0 out of 5 stars",
          "5.0 out of 5 stars",
          "1.0 out of 5 stars"
        ],
        "customerReviewTitles": [
          "Its only 1 figure",
          "Surprises",
          "Deceiving. You only get 1 figure.",
          "Grandson loves these Characters",
          "This item only comes with ONE figurine! READ the item description!",
          "Cake topper",
          "Grandsons birthday",
          "Not worth the $$$"
        ],
        "customerReviewBodies": [
          "Its only 1 random figure",
          "I thought you got all 18 figures and found out you only got 1 figure",
          "I ordered this for my sons birthday thinking it was multiple figures. Turns out it’s only one. Big disappointment. They need to change the advertising title.",
          "Felt the item is a bit pricey. But my grandson. Is enjoying his new toy.",
          "My figurines were delivered a bit late, but I guess it was worth the wait! Ignore the negative reviews because obviously people who gave it low stars didn’t read the item description! 😡😤 $7.99 for a whole set? That would be too good to be true in my opinion! Yes I agree that the price is a bit high for these little guys but honestly that’s what you pay for if you were to find them at the mall and at places such as Brad’s Toys & Collectibles. This item only comes with ONE figurine and it’s a complete mystery on what character you may receive! That’s what makes this item enjoyable and exciting to find out who you got! Overall, I’m happy with my purchase! 😊🤭🤭",
          "This was going to be used for cake decorating but I missed that it was just 1 minifig. We used as a topper. Expected quality.",
          "Grandson Loved them!",
          "The advertising picture is misleading; it shows many little charators and I only received ONE LITTLE about an inch high charactor for $10 was a joke. NOT WORTH IT!!! it looks like something that cost .05 to make. NEVER AGAIN will I order from this company!!!"
        ]
      }
    },
    {
      "id": "apYJo0B",
      "title": "Among Plush Toys 12Inch Cute Plushies Us Stuffed Animal Toys with Bulging Eyes Wonderful Gifts for Game Fans or Children",
      "price": "$19.99",
      "image": "https://m.media-amazon.com/images/I/61PcOavD9iL._AC_SY355_.jpg",
      "description": "Cute and Soft Plush Stuffed Animal Toy",
      "reviews": {
        "customerProfileNames": [
          "bei",
          "LauraFunderburgh",
          "RobertSadowl",
          "ZhiLi",
          "MichelleE",
          "B.T.",
          "Antonette",
          "JessicaVentura"
        ],
        "customerProfilePictures": [
          "https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif",
          "https://images-na.ssl-images-amazon.com/images/S/amazon-avatars-global/3b92df28-4312-4699-9891-aef6794893b7._CR0,26.0,281,281_SX48_.jpg"
        ],
        "customerRatings": [
          "5.0 out of 5 stars",
          "5.0 out of 5 stars",
          "5.0 out of 5 stars",
          "5.0 out of 5 stars",
          "1.0 out of 5 stars",
          "3.0 out of 5 stars",
          "5.0 out of 5 stars",
          "1.0 out of 5 stars"
        ],
        "customerReviewTitles": [
          "Silly plush",
          "As expected",
          "Grand kid loves it????",
          "If you are an Among Us Fan....",
          "24 inches is a lie",
          "Color not as pictured, a very light peach color",
          "Super cute",
          "no estoy conforme con ese producto gracias",
          ""
        ],
        "customerReviewBodies": [
          " It’s soft, it’s silly. Why did I buy this? I don’t know, but I’m not mad. It’s cute. It doesn’t stand up on its own as expected but I don’t care. I love it.",
          "It came all deflated for shipping purposes. My grandson wasn't too sure a out it until the package was opened and the pillow fluffed.",
          "Grand kid loves it???",
          "I bought one of these for my nephew as part of a Birthday gift, he loves Among Us. He loved it so much that he wanted another one and his brother wanted one.\nThey could be a little pricey, but most plushies are. It is worth it if they really like the character. They do get worn and dirty after a while, especially if you have young kids throwing them around, but they wash and dry well in the wash machine and dryer. Delicate and hand wash cycles.",
          "I am not happy at all, I spent More for this item because it said it’s 24inches.. it is not even close to 24 inches. Picture shown it’s 18inches. I got screwed over. I want my money back",
          "My grandson loves the color orange. I purchased this particular Among Us stuffed toy because the picture showed a deep orange colored creature. When it arrived it was a very pale peach color. He liked the creature but I was not satisfied with the color. It was to close to Christmas to return and get another.",
          "Smaller and just as described. Ver happy with purchase",
          "Es de mala calidad para el precio muy pequeño ymal echo compré otro en otra tienda más grande mejor calidad y mismo precio no estoy conforme con este producto",
          ""
        ]
      }
    },
    {
      "id": "-gfQ9sz",
      "title": "Among Us 9\" Plush (White)",
      "price": "$21.95",
      "image": "https://m.media-amazon.com/images/I/51IG9UWwAPS._AC_SY355_.jpg",
      "description": "These officially licensed 9\" Among Us Plush will be a fun addition to your collection. If you like Among Us, then you can not miss out on these exclusive Among Us plush. Collect all 6 plush.",
      "reviews": {
        "customerProfileNames": ["Gogo", "mr.bloodworth", "abdennacera."],
        "customerProfilePictures": [
          "https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif"
        ],
        "customerRatings": [
          "5.0 out of 5 stars",
          "4.0 out of 5 stars",
          "5.0 out of 5 stars"
        ],
        "customerReviewTitles": ["Cool", "Its a stuffed toy", "On time"],
        "customerReviewBodies": [
          "My little brother loved it and brings it with him around the house.",
          "Not much to say, its a stuff toy. It is soft & squishy. It is a bit pricey.",
          " Make videos.",
          "丁度いいサイズ感とフォルムがとにかく最高です。\n真っ白よりはすこしブルーがかっていますがだんだん慣れてきました^^",
          ""
        ]
      }
    },
    {
      "id": "Kg3K7Vk",
      "title": "LEEPED Hot Space Kill Game Figures Building Blocks Toys (2022 New Blocks) The Best Gift for Kids（No Box）",
      "price": "$18.99",
      "image": "https://m.media-amazon.com/images/I/71tUNCDZBDL._AC_SY355_.jpg",
      "description": "LEEPED Werewolf Kill Game Figures Building Blocks Toys",
      "reviews": {
        "customerProfileNames": [
          "EstebanGarcia",
          "JoeinNYC",
          "jabloke",
          "AmandaSchaapveld",
          "VivianandAlex",
          "RachelA.",
          "Diego",
          "thomasjmarallo"
        ],
        "customerProfilePictures": [
          "https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif"
        ],
        "customerRatings": [
          "5.0 out of 5 stars",
          "5.0 out of 5 stars",
          "5.0 out of 5 stars",
          "5.0 out of 5 stars",
          "5.0 out of 5 stars",
          "5.0 out of 5 stars",
          "5.0 out of 5 stars",
          "5.0 out of 5 stars"
        ],
        "customerReviewTitles": [
          "Legit",
          "Fun Toys-Great Sleepover Activity",
          "Awesome",
          "Perfect for the Among Us fan",
          "Kids love it",
          "Fun set for kids",
          "Llegó en el tiempo indicado, vendedor confiable",
          "",
          "Excellent"
        ],
        "customerReviewBodies": [
          "Kids loved it had no problem building",
          "My son got these for his friend's 9th birthday. He's sleeping over and we just had a photo texted with the boys focused on building the toys. The fact that they'd rather play with these than play with technology, is a very good sign.",
          "Great alternative to lego's.",
          "My daughter loved this toy!",
          "My kids love this.",
          "Great set and the kids love it but it did not have instructions for assembly so they had to look at the online photo and figure it out. Each “task” comes in its own bag so that made it a bit easier.",
          "Fácil de montar",
          "",
          "Excellent",
          "Mala calidad, las piezas no embonan bien y las instrucciones no son claras.",
          ""
        ]
      }
    },
    {
      "id": "j1_iRtw",
      "title": "Maikerry Among Plush US Toys Stuffed Plushies Doll Animal Toy, Best Gifts for Game Fans and Children (6 Color)",
      "price": "6 Pcs Among Plush Toys Merch Crewmate Astronaut Stuffed Plushies Doll, Best Gifts for Game Fans and Children (Light Color)",
      "image": "https://m.media-amazon.com/images/I/71cqbiABKRL._AC_SY355_.jpg",
      "description": "The cute and novel Among Us Plush plush toys will make your home full of love and warmth.Ideal gifts for festivals, birthday parties, and any gathering. A great gift for children, friends, family, and classmates. Suitable for children's bedroom decoration, warm gadgets, super game fans, you can put them in your living room, bedroom, kitchen and other places, you can add color to your room, make your home full of love and warmth.",
      "reviews": {
        "customerProfileNames": ["KatieHacker", "Customer"],
        "customerProfilePictures": [
          "https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif"
        ],
        "customerRatings": ["5.0 out of 5 stars", "5.0 out of 5 stars"],
        "customerReviewTitles": ["Pretty good!", "Super cute and small"],
        "customerReviewBodies": [
          "very cute little fellas. seller was nice. good price!",
          "They are cute and tiny. The toy does come with squeaker inside."
        ]
      }
    },
    {
      "id": "2xnHXGV",
      "title": "Among Us Mega Plush - Purple w/ Purple Mohawk",
      "price": "$34.99",
      "image": "https://m.media-amazon.com/images/I/61h8hR1oi4S._AC_SY355_.jpg",
      "description": "These large officially licensed Among Us MEGA Plush featuring a Purple Among Us character with a mohawk will be a fun addition to your collection. If you like Among Us or video games, then you can not miss out on these giant MEGA sized plush.",
      "reviews": {
        "customerProfileNames": ["Customer", "Antonette", "Andrewsteele"],
        "customerProfilePictures": [
          "https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif"
        ],
        "customerRatings": [
          "5.0 out of 5 stars",
          "5.0 out of 5 stars",
          "5.0 out of 5 stars"
        ],
        "customerReviewTitles": [
          "Best Gift",
          "Radical Dude! Perfect addition to our among us family. The hippest and coolest one! Well made",
          "Better than expected"
        ],
        "customerReviewBodies": [
          "My son absolutely loved his amount us plushie. It was a total hit",
          "Expensive but worth it. Wry well made and unique.",
          "I bought this for a Christmas gift for my son. It’s super soft, perfect size, very good quality! Definitely recommend this product!",
          "ふわふわしていて大きくてかわいいです！大切にします。",
          ""
        ]
      }
    },
    {
      "id": "qphSk-a",
      "title": "Offcially Licenced Among Us 6 Inch Plush Impostor Crewmate Stuffed Toy (Green with Beanie)",
      "price": "$29.90",
      "image": "https://m.media-amazon.com/images/I/515025ke5wL._AC_SY355_.jpg",
      "description": "At last, you can finally cuddle a crew member from your favourite game in real life with the Among Us 6\" Plush Doll Collection! If you're a fan of Among Us, these officially licensed 6″ Among Us Plushies will be a fun and essential addition to your collection.",
      "reviews": {
        "customerProfileNames": ["Customer", "AxelMontes"],
        "customerProfilePictures": [
          "https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif"
        ],
        "customerRatings": ["5.0 out of 5 stars", "5.0 out of 5 stars"],
        "customerReviewTitles": [
          "My nephew will not put it down. He absolutely loves it!",
          "Present for the Kids"
        ],
        "customerReviewBodies": [
          "My nephew loves it.",
          "They love these plushies. Good for presents to keep them happy."
        ]
      }
    },
    {
      "id": "ufxtEd6",
      "title": "2 PCS 5.9inch/15cm Reversible Plush Toy Double-Sided Flip for Game Fans The Best Party Gift for Boys and Girls (Black Red+Green Blue)",
      "price": "$15.99",
      "image": "https://m.media-amazon.com/images/I/71UuKXe1d0L._AC_SY355_.jpg",
      "description": "NEW",
      "reviews": {
        "customerProfileNames": ["MomInOC", "HarryS.", "KindleCustomer"],
        "customerProfilePictures": [
          "https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif"
        ],
        "customerRatings": [
          "1.0 out of 5 stars",
          "5.0 out of 5 stars",
          "5.0 out of 5 stars"
        ],
        "customerReviewTitles": [
          "Not good",
          "Perfect for kids",
          "Great product and service"
        ],
        "customerReviewBodies": [
          "It’s a flat plushie reversible. The 2nd side doesn’t hide inside and partly comes out the bottom. It is not stuffed well. It’s soft though but that’s about it. I have returned it.",
          "Among us is so popular with kids now a days, they don't care what they get as long as its a among us theme. Got it for a friends kid and he loved it.",
          "Great product, just as advertised. Were shipped separately. Great seller feedback, same day response."
        ]
      }
    },
    {
      "id": "qBtvhuS",
      "title": "Among Plush Toys 12 Pcs Cute Merch Crewmate Astronaut Stuffed Plushies Doll, Imposters Game Figures with Squeak for Game Fans and Children",
      "price": "$26.99",
      "image": "https://m.media-amazon.com/images/I/81oKqEvH-hL._AC_SY355_.jpg",
      "description": "About this item\n🚀SAFE MATERIAL:These among plush toys are made of PP cotton, soft and skin-friendly, with complete stitching, not easy to pull the thread\n🚀LOVELY SQUEAKY SOUND: When you pinch this astronaut stuffed plushy toy, it will make a funny squeaking sound and bring you a good mood\n🚀SMALL AND PORTABLE: The size of our plush toy is 3.3 x 2.5 x 4.1 inches, small, cute and easy to carry\n🚀MULTIPLE USES: These cute plushie crewmate dolls are not only home decoration and warm atmosphere maker, but also the best gift for kids and super game fans\n🚀QUALITY ASSURANCE: If you are not satisfied with the product, please contact us in time and we will arrange a refund/exchange for you",
      "reviews": {
        "customerProfileNames": ["Ken"],
        "customerProfilePictures": [
          "https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif"
        ],
        "customerRatings": ["5.0 out of 5 stars"],
        "customerReviewTitles": ["Good small plushies"],
        "customerReviewBodies": [
          "Great value for the cost and the smaller size is great uses less space. My kid is into amongus and liked this"
        ]
      }
    },
    {
      "id": "H_fL2Fl",
      "title": "Among us Plush, 6 Pcs Among us Plushie Toys Stuffed Doll, 4in Plushies Set Imposter Crewmate Plush, Merch for Game Fans and Kids Birthday Gifts, Soft Anxiety Relief Toy Figure Stuffies (4 inch 6Pcs)",
      "price": "12 Inch (30cm) Among U&s Plush Toys Large Cute Stuffed Plush Toys Figure Astronaut Gifts with Bulging Eyes for Game Fans (Red)",
      "image": "https://m.media-amazon.com/images/I/81AYPX6nHfS._AC_SX355_.jpg",
      "description": "What's Included\n\n● Among us plush 6 pcs\n● Colors= Red, White, Blue, Black, Pink and Yellow\n\nSpecifications\n\n● Product dimensions: 4\" x 3\" inches\n● Material: Soft Plush and 100 % cotton filing\n● Super Soft: This cute buddy is super soft and fun to squeeze.\n● Stress Reliever: You can squeeze it hard whenever you feel stress and it will act as an anxiety relief. This lovely small plush will make you feel good.\n● Cool Decoration: The Crewmate among us plush is a perfect decorative plush and it will look cute anywhere in your bedroom, living room, kids room, dinning room or Nursery\n● Sound on Squeeze: The plush toy will produce squeaky sound upon squeezing to amuse your child.\n● Small and Portable: The cute little plush is easy to carry and can amuse your kid anywhere and anytime.\n● Safe to use: Very safe super soft plush, filled with high Quality Cotton and non-toxic material.\n● Gift: Perfect as a gift for crewmate and imposter game fans on occasions like Birthdays, Christmas, New Year, graduation and parties. This is a perfect toy for your children and will certainly make them happy",
      "reviews": {
        "customerProfileNames": ["AdryanBartlett"],
        "customerProfilePictures": [
          "https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif"
        ],
        "customerRatings": ["5.0 out of 5 stars"],
        "customerReviewTitles": ["AMOGUS"],
        "customerReviewBodies": [
          "I love them and for some reason my cat really likes them. He tossed them around the house at night."
        ]
      }
    },
    {
      "id": "sElOWFJ",
      "title": "8.6” Shadow Stuffed Plush Toys, Hedgehog Plushie Cute Cartoon Plushies Figure Doll Pillows, Decoration Gifts for Game Anime Fans Kids Boys Girls Children (Black Shadow)",
      "price": "$18.99",
      "image": "https://m.media-amazon.com/images/I/81mqD5n6hyL._AC_SY355_.jpg",
      "description": "About this item\n[Cute Shadow Plush Toy]-- This soft Shadow plush toy is designed with bright colors and fun Shadow shapes to make bedtime or playtime more fun. Every fan will be attracted by its cute expression.\n[Super Soft Material]-- High quality soft and lovely short plush, PP cotton filling, good elasticity. Carefully handcrafted, the material is very compact and durable. Surface washable structure, easy to clean.\n[Portable Size]--8.6 inch is perfect for hugging, very convenient to carry, can play at home or take it out to play with friends. Let your favorite characters accompany your playtime!\n[Suitable for any occasion] -- Great for play and home decoration, Shadow plush toys are suitable for bedroom, living room, home, office, nursery and anywhere you like.\n[Great gifts] -- Delicate and beautiful Shadow plush toys are ideal gifts for birthdays, Christmas, Halloween, Black Friday, family day, graduation season, couples and friends. It can be played with kids, friends and family.",
      "reviews": {
        "customerProfileNames": [
          "VickieLambertsen",
          "Customer",
          "texasmom",
          "aziz",
          "Sarah",
          "chelsie",
          "nancymyhill"
        ],
        "customerProfilePictures": [
          "https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif"
        ],
        "customerRatings": [
          "3.0 out of 5 stars",
          "5.0 out of 5 stars",
          "4.0 out of 5 stars",
          "5.0 out of 5 stars",
          "2.0 out of 5 stars",
          "5.0 out of 5 stars",
          "5.0 out of 5 stars"
        ],
        "customerReviewTitles": [
          "A Little Ragged from Delivery",
          "Shadow was an imposter",
          "Love Them",
          "amongus",
          "Seem cheaply made, don't stand up well",
          "So cute!",
          "absolutely charming"
        ],
        "customerReviewBodies": [
          "Gnomes arrived looking disheveled and sitting crooked. Nothing torn, but furry beard and hair was matted and hats need a good pressing.",
          "Cute plushie. Just buy Shadow for yourself and play Among Us",
          "I love these but the problem is they won’t stand up without leaning them against something.",
          "amongus",
          "These look a lot cuter in the pictures, they don't stand up well on their own and they just seem cheap. Now I have gotten a lot of comments on them when people walk into my house and see them, but to me I see all the defects on them and maybe I'm just overly judgemental on these. I'm just not thrilled with the quality and overall look of them.",
          "Super cute and well made!",
          "These gnomes are so cute! Well made, bright colors and they will be displayed all through the autumn season."
        ]
      }
    },
    {
      "id": "f6nb87m",
      "title": "Among Us SquishMe",
      "price": "$9.99",
      "image": "https://m.media-amazon.com/images/I/61nVehQC-oL._AC_SY450_.jpg",
      "description": "Relieve your stress with the brand new officially licensed Among Us SquishMe. Made from high quality extra soft polyurethane foam. SquishMe, is super slow rising once squeezed and is fun for everyone. Collect all 6 characters. Includes one (1) random Among Us SquishMe toy. Each purchase comes blind and at random.",
      "reviews": {
        "customerProfileNames": [
          "Joe",
          "Daniel",
          "Tina",
          "MyleenVidal",
          "Christelwright",
          "Cyndi",
          "wolfmara",
          "Sed"
        ],
        "customerProfilePictures": [
          "https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif"
        ],
        "customerRatings": [
          "5.0 out of 5 stars",
          "5.0 out of 5 stars",
          "5.0 out of 5 stars",
          "5.0 out of 5 stars",
          "5.0 out of 5 stars",
          "5.0 out of 5 stars",
          "3.0 out of 5 stars",
          "1.0 out of 5 stars"
        ],
        "customerReviewTitles": [
          "Happy with buy",
          "Great as a gift, and collectable",
          "Grandson loves it.",
          "Squish squish CrAcK squish CrAcK squish CrAcK",
          "Smaller than pictured",
          "My grandson loved it",
          "Squish, squish, CRack!",
          "Not What I Thought I Was Ordering"
        ],
        "customerReviewBodies": [
          "Very happy after five purchases my son finally got the red one he wanted only got two duplicates so very happy with my purchase as these are almost impossible toFind anywhere",
          "This among us squishy makes a perfect gift. My son loves among us and I got this one as a gift for him. I think he's really going to like it.",
          "Got for my grandson for his b-day. It's worth every penny. Because I have a set limit for b-day. He's happy and that makes me happy.",
          "My son LOVED it and named it “Eggy” Until.. My son tried to make Eggy dance but the legs CRACKED! And the a few hours later… THE BACKPACK BROKE!!! And then a few hours later (again)… THE VISOR BROKE!!!! It’s not that stable!!!",
          "Love it",
          "It was a gift for my grandson",
          "It was adorable...my daughter loved it...\nShe happily squished it a few times and almost immediately it developed a fault line crack at the top, diagonally at the base of one of the 'horns'. She put a band aid, on it; upset that, \"He got hurt.\"... 🙄🤦🏻\nCute, but if that is their standard for durability; I'm rather disappointed. 😞",
          "The photo shows the red Crewmate & that's what I thought I was getting for my Halloween costume. When it arrived & it opened up the package to find the pink Crewmate I came back to see that the very last line of the description says these are random characters.\n\nNot much value for the money but it would have suited my purpose to complete a Halloween costume.",
          "Too easily broke, my daughter was disappointed",
          "Kids loved it",
          "10 € pour avoir que une figurine....! C est quand mm abusé... En plus c est bien mis dans le descriptif , 6 figurines !.... Donc annonce mensongère .... Très déçu...",
          "",
          "This is an amazing gift for my son!!!! He loved this item, and plays with it often. I would highly recommend purchasing this item!!!",
          "11 euros pour une seule figurine alors que je pensai qu'il y avait 6 firgurines s'est une arnaque d'après l'annonce pas question de faire une colection pour une merdouille provenant de chine .",
          ""
        ]
      }
    },
    {
      "id": "yotQq0O",
      "title": "Okedico Among Plush Toy 8\" U&S Astronaut Stuffed Plushie Doll Soft Cute Plush Figure for Game Fans Kids Birthday Christmas Party Supplies (8inch, Red)",
      "price": "$12.99",
      "image": "https://m.media-amazon.com/images/I/71PGuT6nIdL._AC_SY355_.jpg",
      "description": "About this item\n【Premium Material】Our Among U&S Astronaut stuffed toys are made of high quality short plush material, high grade PP cotton, very good resilience, not afraid of squeezing, not afraid of deformation, very suitable for hugs.\n【Unique Design】This cute superhero plush doll is inspired by the famous spuerhero movie and a popular game character. The lifelike cartoon superhero shape is easy to attract children's attention. If you also like spuerhero , you should take it home now!\n【Multiple Uses】Can be used as a plush toy and home decoration. Or as a stress relief doll, when you are upset, squeeze this small plush toy to release stress. It is your friend who listens to your troubles and spends happy time with you.\n【Best Gift】The cute soft stuffed plush doll is perfect for accompanying your kids to sleep and play. Best gifts for birthday, Christmas, Valentine's Day.Size is suitable for hug, easy to carry, you can accompany you anytime, anywhere.\n【Warm Tip】Vacuum compression packaging.When you receive the package, you need to pat the whole body of superhero plush doll several times, let them loose and put it in the sun for 30 minutes, then you will see the cute Among U&S plush just as we described.",
      "reviews": {
        "customerProfileNames": [],
        "customerProfilePictures": [],
        "customerRatings": [],
        "customerReviewTitles": [],
        "customerReviewBodies": []
      }
    }
  ]
}
