{
  "amongUsToys": [
    {
      "id": "cetd3Pb",
      "title": "Among Game Figures Toys 12 Pcs Action Figures，Astronaut Crewmate Desktop Character Model Toys for Children and Game Fans (Set 2)",
      "price": "$23.99",
      "image": "https://m.media-amazon.com/images/I/71o3L8QwIpL._AC_SY355_.jpg",
      "description": "🚀HOT GAME: These among action figures are inspired by the famous game, each doll has rich painting details, looks lifelike\n🚀HIGH QUALITY: These game figure toys are made of thick and durable PVC material, not easy to deformation, the size of each toy is 1.5 x 1.5 x 3.5 inches\n🚀INTERESTING DESIGN: Each action figure toy can be disassembled and divided into 2 parts with removable and interchangeable hats, you can freely combine\n🚀MULTIPURPOSE：These cute among toys can be used as interior decorations, room decor and cake decorations at parties\n🚀WONDERFUL GIFTS: This among action figure toy is the best gift for kids and game fans. Use this crew character model to create beautiful memories with your kids or friends",
      "reviews": {
        "customerProfileNames": ["TheresaFickel", "BarbWalz"],
        "customerProfilePictures": [
          "https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif"
        ],
        "customerRatings": ["5.0 out of 5 stars", "5.0 out of 5 stars"],
        "customerReviewTitles": [
          "My daycare boy loved this sooo much!!!",
          "My grandson loves them"
        ],
        "customerReviewBodies": [
          "My daycare boy Lewis age 6 loves these! I had never heard of these before! He received these as a gift from me for his K graduation!!",
          "Exactly what we expected!"
        ]
      }
    },
    {
      "id": "8ONjH_k",
      "title": "LEEPED Hot Space Kill Game Figures Building Blocks Toys (2022 New Blocks) The Best Gift for Kids（No Box）",
      "price": "$18.99",
      "image": "https://m.media-amazon.com/images/I/71tUNCDZBDL._AC_SY355_.jpg",
      "description": "LEEPED Werewolf Kill Game Figures Building Blocks Toys",
      "reviews": {
        "customerProfileNames": [
          "EstebanGarcia",
          "JoeinNYC",
          "jabloke",
          "AmandaSchaapveld",
          "VivianandAlex",
          "RachelA.",
          "Diego",
          "thomasjmarallo"
        ],
        "customerProfilePictures": [
          "https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif"
        ],
        "customerRatings": [
          "5.0 out of 5 stars",
          "5.0 out of 5 stars",
          "5.0 out of 5 stars",
          "5.0 out of 5 stars",
          "5.0 out of 5 stars",
          "5.0 out of 5 stars",
          "5.0 out of 5 stars",
          "5.0 out of 5 stars"
        ],
        "customerReviewTitles": [
          "Legit",
          "Fun Toys-Great Sleepover Activity",
          "Awesome",
          "Perfect for the Among Us fan",
          "Kids love it",
          "Fun set for kids",
          "Llegó en el tiempo indicado, vendedor confiable",
          "",
          "Excellent"
        ],
        "customerReviewBodies": [
          "Kids loved it had no problem building",
          "My son got these for his friend's 9th birthday. He's sleeping over and we just had a photo texted with the boys focused on building the toys. The fact that they'd rather play with these than play with technology, is a very good sign.",
          "Great alternative to lego's.",
          "My daughter loved this toy!",
          "My kids love this.",
          "Great set and the kids love it but it did not have instructions for assembly so they had to look at the online photo and figure it out. Each “task” comes in its own bag so that made it a bit easier.",
          "Fácil de montar",
          "",
          "Excellent",
          "Mala calidad, las piezas no embonan bien y las instrucciones no son claras.",
          ""
        ]
      }
    },
    {
      "id": "L9LypMx",
      "title": "Among Us SquishMe",
      "price": "$9.99",
      "image": "https://m.media-amazon.com/images/I/61nVehQC-oL._AC_SY450_.jpg",
      "description": "Relieve your stress with the brand new officially licensed Among Us SquishMe. Made from high quality extra soft polyurethane foam. SquishMe, is super slow rising once squeezed and is fun for everyone. Collect all 6 characters. Includes one (1) random Among Us SquishMe toy. Each purchase comes blind and at random.",
      "reviews": {
        "customerProfileNames": [
          "Joe",
          "Daniel",
          "Tina",
          "MyleenVidal",
          "Christelwright",
          "Cyndi",
          "wolfmara",
          "Sed"
        ],
        "customerProfilePictures": [
          "https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif"
        ],
        "customerRatings": [
          "5.0 out of 5 stars",
          "5.0 out of 5 stars",
          "5.0 out of 5 stars",
          "5.0 out of 5 stars",
          "5.0 out of 5 stars",
          "5.0 out of 5 stars",
          "3.0 out of 5 stars",
          "1.0 out of 5 stars"
        ],
        "customerReviewTitles": [
          "Happy with buy",
          "Great as a gift, and collectable",
          "Grandson loves it.",
          "Squish squish CrAcK squish CrAcK squish CrAcK",
          "Smaller than pictured",
          "My grandson loved it",
          "Squish, squish, CRack!",
          "Not What I Thought I Was Ordering"
        ],
        "customerReviewBodies": [
          "Very happy after five purchases my son finally got the red one he wanted only got two duplicates so very happy with my purchase as these are almost impossible toFind anywhere",
          "This among us squishy makes a perfect gift. My son loves among us and I got this one as a gift for him. I think he's really going to like it.",
          "Got for my grandson for his b-day. It's worth every penny. Because I have a set limit for b-day. He's happy and that makes me happy.",
          "My son LOVED it and named it “Eggy” Until.. My son tried to make Eggy dance but the legs CRACKED! And the a few hours later… THE BACKPACK BROKE!!! And then a few hours later (again)… THE VISOR BROKE!!!! It’s not that stable!!!",
          "Love it",
          "It was a gift for my grandson",
          "It was adorable...my daughter loved it...\nShe happily squished it a few times and almost immediately it developed a fault line crack at the top, diagonally at the base of one of the 'horns'. She put a band aid, on it; upset that, \"He got hurt.\"... 🙄🤦🏻\nCute, but if that is their standard for durability; I'm rather disappointed. 😞",
          "The photo shows the red Crewmate & that's what I thought I was getting for my Halloween costume. When it arrived & it opened up the package to find the pink Crewmate I came back to see that the very last line of the description says these are random characters.\n\nNot much value for the money but it would have suited my purpose to complete a Halloween costume.",
          "Too easily broke, my daughter was disappointed",
          "Kids loved it",
          "10 € pour avoir que une figurine....! C est quand mm abusé... En plus c est bien mis dans le descriptif , 6 figurines !.... Donc annonce mensongère .... Très déçu...",
          "",
          "This is an amazing gift for my son!!!! He loved this item, and plays with it often. I would highly recommend purchasing this item!!!",
          "11 euros pour une seule figurine alors que je pensai qu'il y avait 6 firgurines s'est une arnaque d'après l'annonce pas question de faire une colection pour une merdouille provenant de chine .",
          ""
        ]
      }
    },
    {
      "id": "qUz87Ov",
      "title": "Among Us Airship | Iconic Red Among Us Ship with 3 Unique Among Us Toys in The Box | Among Us Merch and Collectibles Incl. Pink Crewmate in The Muenster Hat | Among Us Gift Set | Kids’ Toys by P.M.I.",
      "price": "$39.99",
      "image": "https://m.media-amazon.com/images/I/71-So+9bBOL._AC_SY355_.jpg",
      "description": "An ultimate Among Us toy for kids to play with, start a collection, or throw an AmongUs theme party!\n\n✔ A package deal:\n●red airship with moving turbines just like in the game\n●3 exclusive characters in the box\n●includes a pink crewmate wearing the Muenster: a top hat made of Swiss cheese\n●the figures come in different colors and with different hats\n\n✔ Unique collectibles:\n●both the ship and the additional characters will complement any Among Us collection\n●official collector’s set\n●check out the other two unique figures with headpieces from the Airship Bundle: a white crewmate wearing the Recruited Ellie (a pinkish top hat with a purple rose on it) and a black crewmate in A Real Wiz (a pointed blue hat with yellow stars on it)\n\n✔ Use these toys as Among Us party decorations and supplies\n●kids love to play with these Among Us toys for boys and girls together\n●organize an AmongUs theme party by giving the kids Among Us toys each\n●create the atmosphere by placing Among Us merch around the place where you’re planning to have the party\n●Among Us stuff allows children to take on roles (crewmate vs. impostor) as they’re playing\n●inspire children to have offline matches, figuring out which one is the impostor\n",
      "reviews": {
        "customerProfileNames": [
          "AmandaD",
          "A.Mom",
          "J.Monty",
          "SpringNewman",
          "Rossi",
          "MyPenName",
          "Wayne",
          "Larson"
        ],
        "customerProfilePictures": [
          "https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif",
          "https://images-na.ssl-images-amazon.com/images/S/amazon-avatars-global/99636945-3e4c-4b56-b82c-1e757e774999._CR0,0,375,375_SX48_.jpg",
          "https://images-na.ssl-images-amazon.com/images/S/amazon-avatars-global/2094c926-49a2-47e4-8a3f-49c01b58f8b5._CR0,41.0,251,251_SX48_.jpg"
        ],
        "customerRatings": [
          "5.0 out of 5 stars",
          "5.0 out of 5 stars",
          "5.0 out of 5 stars",
          "5.0 out of 5 stars",
          "5.0 out of 5 stars",
          "4.0 out of 5 stars",
          "5.0 out of 5 stars",
          "3.0 out of 5 stars"
        ],
        "customerReviewTitles": [
          "Durable, Fun for Older Children & Fan of the Game",
          "Huge Hit!!!",
          "Among Us Toy Airship!",
          "My son loves it!!!",
          "Great gift for a 7-year-old who loves Among Us",
          "Ok",
          "Great Among Us toy and collectible!",
          "Meh. Not worth the price."
        ],
        "customerReviewBodies": [
          "This Among Us Airship toy is a great size for collectors of the figurines, fans of the game and older children who may play the game but still engage in imaginative play. The ship itself is very durable and interactive; it arrives with a foam inside that holds all three figurines that arrive with the set. This foam can be removed of maintained as a display piece, as the other side of the ship has the Among Us logo on it. The features of the airship have been carefully detailed, with the front of the ship is painted in a displayable fashion. The propellers also can be moved and add to interactive play.\n\nThe figurines are the same, high-quality plastic, made for both play and display, and have details added that imitate the looks in game. Even the eyepieces on the figurines have been painted to carefully resemble the Among Us characters in game. They are the same height and shape as other collectors’ figurines, so they can be compatible with the surprise figures from a previous collection.\n\nThis ship and crewmates airship set would make a fantastic gift for any fan of the game. It is a quality set that is both interactive and displays well. It compliments an established Among Us figure collection but also serves as a starting point for those who want to start collecting. I would definitely recommend it.",
          "P",
          "The Among us game has become a massive Internet success. My kids love it, and I'm happy to see there are now toys and other products based off the hit game. This toy is a representation of a hover-capable aircraft (like a harrier). This is accomplished/simulated by the engines on the airship rotating from horizontal to parallel.\nInside the airship there is a foam insert containing small cut-outs for the three included characters.\nFun toy for my sons (age 7 and 9). 5-stars!",
          "I got this Among US toy for my son for his birthday and he loves it. He is a huge fan of the game and I knew this toy would be perfect for him. It comes with the aircraft, which can be played with and used as a carrier, and three figurines. It's well made and nice quality. This would be a great toy for any kid who loves Among Us or it could be a collector item. Either way it's awesome and I would recommend it. My son has played with it a lot and has so much fun with it.",
          "My 7-year-old son is obsessed with Among Us and absolutely loves this toy. There is no assembly required. There is black foam inside the ship which can hold the 3 Among Us figures and you can also remove the black foam. My son leaves the black foam in so the figures don't roll around the ship. It would have been nice if the hats could be removed and interchanged between figures.",
          "The ship isn't hinged so you can't just open and close it. It comes apart from the bottom. This irritates the 4 yr old for some reason lol. He wants to be able to just open and close it, like a hinged lid. He thought he broke it. But ita just that while there is a latch on one side to help keep it closed, there is no hinged to keep it attached to the other half. There are 2 little magnets to help hold it together, but they really don't do much. The little snap latch is what mainly holds it together, but the magnet side can still come open. And if you try to open the magnet side while leaving the latch side latched, the latch just comes open anyway. So the product picture up there where it looks like it is setting open with the top part up, is very misleading because you can't do that.\n\nSo basically it is more of a case to hold the 3 figures, but is also playable. He still likes it, regardless. He loves Among Us. Been playing it since he was very young, surprisingly. This little guy is a whiz at games somehow. It is mindblowing for his age. He is crazy good at all the Mario games. But that's irrelevant and I'm babbling now.\n\nThis set is good as a collector item or an actual toy for play.\n\nThe characters are solid.\n\nSet seems to be well made, yet slightly overpriced for what it is, but that is typical with this type of stuff.\n\nThe ship is not the hard clanky plastic. A little softer, more durable.\n\nAll in all, not bad. Kid loves it. I just wish they opted for a more secure way to open and close the ship and not have to just take it apart into 2 pieces.\n\nOne figure is outside of the ship attached to the box and the remaining 2 are inside the ship, nestled in a foam insert. Hope to see more items we can add to his ever growing collection.",
          "My son loves playing the Among Us game. This is a great toy for fans of the game! Very nice and high quality! Highly recommended!!",
          "My 10-year-old was pretty excited about this, but he only spent maybe 10 minutes playing with it, then he just put them on his display shelf.\n\nThe ship is basically just a case to hold the little guys. They're made well enough, given that the game itself has cheesy low-budget graphics.\n\nMy kid likes it well enough, but I would say this definitely isn't worth $40. Maybe $15."
        ]
      }
    },
    {
      "id": "oSnK68J",
      "title": "Among Us Crewmate Figures | 8 Among Us Toys Out of 16 Collectibles in 1 Box | Among Us Merch Incl. The Peeled and The Clogged | 2 Hidden Impostors | Mini Toys with 5 Add’l Hats",
      "price": "$29.95",
      "image": "https://m.media-amazon.com/images/I/812Es+KPCrL._AC_SY355_.jpg",
      "description": "Get a whole box of Among Us figures to play with, start a collection, or throw an AmongUs theme party!\n✔\nVarious selections of crewmates:\n●8 figures in 1 deluxe box\n●5 accessories included\n●2 figures are hidden (the impostors!): open the pack to find out which characters those are\n●the figures come in different colors and with different hats\n●one figure is the purple impostor with sharp teeth and the tongue sticking out\n●you can even find the dead body (report it!)\n\n✔ These mini toys are collectibles:\n●collect the total of 16 characters\n●find the characters wearing the coolest new and classic hats: the Vi King, the Peeled, the Clogged, and the Rammed\n●find the four rarest crewmates: the crewmate wearing the Punkin (purple), the one wearing the Floaty Flamingo (cyan), the one wearing the Chop-chop (red), and the running one wearing the Great Goalie (or the Jason mask?) (lime)\n●two figures in each pack are hidden, so collecting them is a quest!\n✔ Use these toys as Among Us party decorations and supplies\n●kids love to play with these Among Us toys / figures together\n●inspire children to have offline matches, figuring out which one is the impostor\n",
      "reviews": {
        "customerProfileNames": ["Jessica"],
        "customerProfilePictures": [
          "https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif"
        ],
        "customerRatings": ["4.0 out of 5 stars"],
        "customerReviewTitles": ["Too cute but you can’t swap hats around."],
        "customerReviewBodies": [
          "These are cute but you can’t swap hats around. Don’t buy for the accessories, just for the figures, which were cute."
        ]
      }
    },
    {
      "id": "kdtlXVF",
      "title": "12 Pcs Figurines Set, Collection Toys for Game Fans, Mini Character Action Figure Decorations, Astronaut Crewmate Desk Toy Gift for Children Cake Topper Party Supply (B)",
      "price": "$23.99",
      "image": "https://m.media-amazon.com/images/I/516D86lJTCS._AC_SY355_.jpg",
      "description": "Ideal gift for festival, holiday, birthday party, any party. Great gift for girl friends, boy friends, children, friends, family, classmates.",
      "reviews": {
        "customerProfileNames": [
          "KaylaL.",
          "SolomonAnima",
          "AnaL.Deleon",
          "JanelleAshley",
          "LucasCorrao",
          "JamesD.Moore",
          "HCW",
          "Jessica"
        ],
        "customerProfilePictures": [
          "https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif",
          "https://images-na.ssl-images-amazon.com/images/S/amazon-avatars-global/53606722-ddfa-4c62-a9fb-87dd48b097a2._CR0,26.0,281,281_SX48_.jpg",
          "https://images-na.ssl-images-amazon.com/images/S/amazon-avatars-global/05b6ec3e-3734-4adb-94b0-915cc15080a4._CR0,0,500,500_SX48_.jpg"
        ],
        "customerRatings": [
          "5.0 out of 5 stars",
          "5.0 out of 5 stars",
          "5.0 out of 5 stars",
          "5.0 out of 5 stars",
          "5.0 out of 5 stars",
          "5.0 out of 5 stars",
          "5.0 out of 5 stars",
          "5.0 out of 5 stars"
        ],
        "customerReviewTitles": [
          "Best of available merchandise",
          "Your kid will be happy!",
          "Great buy",
          "Excellent cake toppers and party favors",
          "They are huge!",
          "Cute little dudes",
          "So Cute",
          "Bought this for a coworkers birthday..."
        ],
        "customerReviewBodies": [
          "AmongUs became unexpectedly popular before I think anyone was ready for it, so merchandise hasn't been easy to come by. I got these for my son for his Birthday, everyone that likes AmongUs has enjoyed them. They're not tiny, they are good quality, durable; the fact they're interchangeable gives more versatility for use, and the while they're not what I'd consider cheap or a 'great buy', they're definitely the best value for your money from all of the merchandise available.",
          "Quality isn’t the best but the figures work like they are supposed and your kid will love it. What I mean by the quality is that the inside bone piece doesn’t not fit flush because either that piece or the bottom piece it fits into are warped from being tightly packed in storage. I haven’t tried the hot water trick to reform the plastic on these yet because they pretty much stay in for the most part. The top and bottom pieces do fit and stay on perfectly. The figures stand up perfectly on flat surfaces as well! My son has played with these for over a week and hasn’t run into any issues.",
          "Great products and good size worth the $$",
          " These were very durable and I was able to wash them before putting them on the cake with no problem. It was nice I could take them apart and put some dead ones and some venting on the cake!",
          "I was expecting some cheap tiny toy set from china but boy was I wrong! I’m very impressed with this set the figures are about the size of a seasoning Bottle and are made of thick plastic! I will be purchasing more toys from this company!",
          "Couple of them are a little misprints BUT the price I paid, and the fact that I'm keeping the 2 I'm holding, I really don't mind lol. My kids LOVE these guys and I've made them all sorts of stuff with the characters, I knew these would be a hit!\nThey were even on sale, so I couldn't say no lol. My daughter was thrilled to get a couple and the little bones on the inside made her LAUGH so hard. So they're already totally worth it!\nFrivolous purchase, but absolutely no regrets!",
          "These are stinkin' cute yet not babyish. I am using them as reward incentives just to make them more valuable instead of giving my child the whole bag. I think it will be fun to \"collect\" them by completing chores/tasks/responsibilities.",
          "I bought these bad boys to hide in a co worker's tool box and around our work environment to mess with him leading up to his birthday. I had him fooled up until he ran out of people to accuse 😆 He loved them and so did his daughter. Would work good on a cake or cupcakes 🧁",
          "Resistentes, buen detallado en las figuras.",
          "",
          "le encantó el juguete a mi hijo!!",
          ""
        ]
      }
    },
    {
      "id": "KOzEjx6",
      "title": "Among Us Stickers Big 50 Pcs Graffiti Anime Waterproof Trendy Adult Stickers, Perfect for Water Bottles Laptop Phone Car Skateboard Travel Suitcase Durable 100% Vinyl",
      "price": "$5.99",
      "image": "https://m.media-amazon.com/images/I/71d+WIm8xZL._AC_SY450_.jpg",
      "description": "About this item\n❤️ 50 assortments of trendy laptop stickers. No duplicates, not random sticker pack, and vibrant cute water bottle stickers will add color in life.you will get 50 pieces of different flask stickers. Compliments and good mood are guaranteed!\n❤️ EXTRA DURABLE 100% vinyl made, which has waterproof function, sturdy and strong adhesive. Easy to remove and doesn't leave any residue behind.\n❤️ All decals are 2 inches to 3 inches in size, designed for teens, adults, girls, adult. Fantastic gift solution for girls(teens) and womens.These stickers are also a great Christmas gift or birthday gift for your child or friend.\n❤️ A perfect mix for everyone. Suitable to stick on your laptops, macbook, water bottle, skateboards, luggage, cars, bumpers, bikes, motorcycle, snowboard,PS4, Xbox one, Switch, Mugs,Vehicle, Guitar, Bedroom, Wall Decals, Door, ETC.\n❤️ Easy use to any smooth surface! Clean the surface then sticker on, use your imagination to create works. An amazing assortment of stickers decals, a wonderful gift for your family to DIY decoration. Get your stickers, clean the surface, sticker on, use your imagination to create works NOW!",
      "reviews": {
        "customerProfileNames": [
          "YOLO",
          "valeriana1280",
          "DocSue1",
          "KC",
          "RICKY",
          "JulieHipp",
          "FeliciaWhitfield",
          "SandiT."
        ],
        "customerProfilePictures": [
          "https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif"
        ],
        "customerRatings": [
          "5.0 out of 5 stars",
          "5.0 out of 5 stars",
          "5.0 out of 5 stars",
          "5.0 out of 5 stars",
          "5.0 out of 5 stars",
          "5.0 out of 5 stars",
          "5.0 out of 5 stars",
          "5.0 out of 5 stars"
        ],
        "customerReviewTitles": [
          "Received Exactly What was Depicted",
          "Loved these!",
          "Excellent variety",
          "Nice stickers, would buy again, but I have so many now!",
          "Among Us Stickers",
          "Just what we wanted",
          "Perfect for the job",
          "Huge variety, decent price"
        ],
        "customerReviewBodies": [
          "We haven’t used the stickers yet as we just received them today so I can’t comment on adhesion etc, but appear to be very sturdy and waterproof. I also want to mention that we got exactly what was depicted. I ordered 50 from a different seller just previously and received only 4 of the 50 stickers depicted. My child is very happy that he received the stickers he was looking forward to getting! Still a bit small but happy!",
          "Awesome! I can’t believe I got 50 (AMONGUS!) stickers for that price. Very happy and my 1st graders loved them! Some were inappropriate for kids but I kept those myself and actually have one on my water bottle and it has been very durable so far. Still stuck on it after a few washes. Very happy 😃",
          "Great stickers for my AmongUs-crazed students! They loved them!",
          "These are cute, and feel like they will last. Of course we just received them, and I didn't want to test the waterproof claim on a laptop case. There is a good variety, and something that particularly appealed to each of us.",
          "The stick on these is good. The only way to take them off is by force, They will never fall off. These are very good quality as well.",
          "Bought these for my kids to decorate their plain cellphone cases. They are quality stickers. The kids are into among us and they love the stickers. I would buy them again.",
          "I use on a tumbler for my grandson",
          "Fun gift for anyone who enjoys Among us. Tons of sticker that were enjoyed by my teenagers for placing on their water bottles and lap tops.",
          "T",
          "The price was reasonable, the kids loved the sticked and have put them on everything. I would say they are permanent so make sure they are not sticking on surfaces that you don't want them on.",
          "My teen is on a wolf kick and these were exactly what she wanted to decorate her new skateboarding helmet. I'm sure the rest will find homes on waterbottles, notebooks, binders and her Chromebook.",
          "Exactly as described , they are stickers and NOT paper thin. Made my kids day.",
          "The photo of the hand holding up these stickers show me that the ones we received are WAYYYY smaller than what they advertised. Not happy. For 10$, I thought these would be much bigger.\n\nUnsatisfied customer."
        ]
      }
    },
    {
      "id": "fptATxS",
      "title": "FATIZONE 12pcs PVC Toys Action Figures Set | Mini Game Figures Desk Character Model Toys, Cake Decorations Impostor",
      "price": "$23.99",
      "image": "https://m.media-amazon.com/images/I/71un036FMpS._AC_SY355_.jpg",
      "description": "About this item\nAction Figures: These action figure toys are inspired by the famous game, richly painted details bring them to life and help inspire creativity for kids or teens.\nPremium Quality: These game figures are made of high-quality pvc material, non-deformed, touch to delicate, easy to hold and comfortable, non-toxic and eco-friendly.\nSmall & Portable: The suit contains 12pcs pvc action figure model of different costumes, each of which can be disassembled and divided into 2 parts. These are small size(3.25inch tall), easy to carry, you can take it anywhere anytime.\nDedicated Gift: These mini astronaut figures toy set is a nice, enjoyable choice to give as a gift to children, friends, partners, and it also a good gift for Christmas, Valentine's Day, Cake Accessories Decoration and Birthday Present.\nYour Satisfaction is Our Priority: If you aren't satisfied with our action figures toy quality and would like to return it, we will issue immediate refund.",
      "reviews": {
        "customerProfileNames": [
          "MichaelCiociola",
          "Berneal",
          "LazyArgon",
          "JarrettLyons",
          "ChristineTsinChiu",
          "lauraaarayyy",
          "AngelaSchlagenhaft",
          "KalibFisher"
        ],
        "customerProfilePictures": [
          "https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif"
        ],
        "customerRatings": [
          "5.0 out of 5 stars",
          "5.0 out of 5 stars",
          "5.0 out of 5 stars",
          "5.0 out of 5 stars",
          "5.0 out of 5 stars",
          "5.0 out of 5 stars",
          "5.0 out of 5 stars",
          "5.0 out of 5 stars"
        ],
        "customerReviewTitles": [
          "Daddy Wins Again",
          "Beautiful Memories",
          "Perfect for kids who love the game",
          "Amazing!",
          "Perfect birthday gift!",
          "Super cool/cute!",
          "9 year old loves them",
          "My little guy LOVES THEM"
        ],
        "customerReviewBodies": [
          "My two young kids have recently discovered \"Among Us\" video game. I hear them talking and laughing playing it, and thought this would be an easy win. These are decent sized figurines, with lots of colors and creative designs. NOT ELECTRONIC. It's a quiet toy they can bring along on car rides, or play quietly with in church or during other \"grown up\" meetings.\n\nThey gasped with delight seeing them last night, and brought some down to the breakfast table this morning, informing me how they had divvied them up between them, which they liked best, and where they would keep them in their rooms.",
          "I Loved Them Because They Brought Happinessc",
          "My kids love these. They were super excited about the colors and love how the pieces are interchangeable. They have been playing with them like crazy, doing missions and mimicking the game. Would definitely recommend.",
          "If you are looking for a gift for the kid who loves Among Us then look no further!! These little action figures are so cool and perfect for kids! Bought these for our 7 year old son and I literally can’t wait to give it to him! Worth every penny!",
          "You know how I know my kids love them? Each figurine has multiple parts and three months later, my boys have not lost one part. They are so careful with them and my boys aren’t careful with anything! I bought two sets just in case but haven’t needed to open the spare ones.",
          "If your kids love among us (my 5y/o does lol) this is perfect for them! They have soo many cute little pieces & their heads come off too. The ”hat” tops come off & can be changed. So many colors as well. Interchangeable, big & cool.",
          "My son was so excited for these and played Among Us with his legos for hours often. He keeps them displayed on his dresser when he’s not playing with them.",
          "Super good for the price and quality",
          "I got these for my son for Christmas. You get a lot of figurines for the price. He absolutely loved them.",
          "Bought this for birthday gift…nephew loved it…",
          "Great toys",
          "My son loved them and was so excited to open them all up. They are bigger than we thought which is nice and the plastic is nice and sturdy. They are good quality for what we paid.",
          "These were very expensive and there not even made properly. I gave this as a gift and I was embarrassed!!!"
        ]
      }
    },
    {
      "id": "rxmodyv",
      "title": "Among Us Plush Reversible Plushie Octopus Stuffed Animal Mood Double Sided Toy Happy Angry Pulpo Reversable Plushies Bear Toys Doll Game Flip Impostor Crewmate Fluffy 6 inch Best Gift 2022 (Red/Black)",
      "price": "$13.99",
      "image": "https://m.media-amazon.com/images/I/81isTDqv3ZL._AC_SY355_.jpg",
      "description": "About this item\nAS SEEN ON TIK TOK - Cute and soft among us plush doll with realistic expression. This reversible plushie among us toy is very popular because of the top trending game. The flippable Among Us plushie is perfect for kids, teens and adults who are looking for a mood plush to add to their collection or as a gift for friends and family. Available in many color: Yellow, Orange Grey, Red, Purple, Pink, etc. There's a suitable color for every mood!\nPERFECT GIFT FOR ALL AMONG US GAME FANS - Perfect for playing, collecting & cuddling. These plushies are the perfect gifts for birthdays, baby showers, Valentines day & more! Funny gift for any plushie lover! Among Us Toys are highly popular collectibles especially Among Us Plushies or Among Us Plush. This reversible plush toy mood plushie will never look sus!\nSUPER KAWAII AND SOFT - These super soft toys are perfect for playing, collecting & cuddling. This Among Us plush toy will never be voted out because of its kawaii overload feelings it gives you. This reversible plush is soft and super cuddly that will make you happy! Flipping toy for every mood you have. It has an angry alien face emoji on the other side and suspicious on the other.Get every color of this cute Among us toy!\nHIGH QUALITY AND WASHABLE - This double-sided flip plush doll is made of durable plush material and is filled with high-quality PP cotton material. Easy to clean, use a small amount of soap and water to remove stains, and dry naturally. This Among Us plushy is meant to last with proper care. Made with fabric that does not fade easily or change color over time. It's cuddly if it's clean and well-maintained.\nFOR EVERY OCCASION - Suitable for home, office, nursery bed, children's room, car and every place you like. The best gift for Among Us game fan. It's also a very cute decoration in the bedroom, living room, office desk. When you look at this moody plushie, you'll never get angry or frustrated because it's gonna soak up all the negative emotional vibes in the room. It's reversible body so it can fit almost any mood and emotion you have. So if you're feeling that someone's sus, buy one today!",
      "reviews": {
        "customerProfileNames": [
          "paulieclark",
          "Bella",
          "CynthiaWenMcKenzie",
          "NancyRhodes",
          "TinAZ",
          "Janhundeby",
          "CindyLBurke",
          "DJMorgan"
        ],
        "customerProfilePictures": [
          "https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif",
          "https://images-na.ssl-images-amazon.com/images/S/amazon-avatars-global/81d34c89-bd64-4a02-993c-767a47afa5c7._CR0,29.0,274,274_SX48_.jpg"
        ],
        "customerRatings": [
          "5.0 out of 5 stars",
          "5.0 out of 5 stars",
          "5.0 out of 5 stars",
          "5.0 out of 5 stars",
          "5.0 out of 5 stars",
          "5.0 out of 5 stars",
          "5.0 out of 5 stars",
          "5.0 out of 5 stars"
        ],
        "customerReviewTitles": [
          "beautiful color",
          "Exactly as shown.",
          "I bought this for my son",
          "Soft plush that my grandson loves",
          "Grandkids loved em(bought 3)",
          "Gift they loved it!",
          "My grandson",
          "Grandson's Christmas Gift..."
        ],
        "customerReviewBodies": [
          "I'm a big Among Us player and absolutely loved this product! Keep in mind it isn't lisenced by Innersloth but I absolutely love it! It sits right on my desk and it gives me good vibes when I play! good quality stitching, soft material I've recommended it to many friends that game too!",
          "Bought for my Among Us obsessed kids and they loved them. 100% would buy again.",
          " He loves this especially since among us is popular. He sleeps with this next to his bed. It's soft, washable and dryable.",
          "My grandkids are into among us and requested this gift. They really enjoy it.",
          "Bought as a gift for the grandkids. Their momma I said that they love them.",
          "Got a wonderful thank you",
          "My grandson loved it",
          "He loves it!",
          "Con envío a México costo más de $400 pesos mxn, y cuando vimos el paquete nos desconcertó; al abrirlo nos decepcionamos mucho por el tamaño tan pequeño del peluche, porque es mucho más pequeño de lo que te imaginas al verlo en la imagen, pero sabemos que nosotros tuvimos la culpa por no leer especificaciones. Aún así no lo regresaremos, pues lo habíamos comprado para regalar.",
          "",
          "Es el clásico caso de que está mejor la foto que el producto. Aguantó al final, le gustó al crio, pero llegó aplastado, es decir que no tiene volumen hasta que uno lo \"infla\" con la mano. Y una patita venía invertida, volteada.\nSé que puedo solicitar que me lo cambien, pero es más gasto, tiempo, y daño al planeta, contra que la abuela hizo el trabajo de costura en 20 minutos.\nYa se me hacía caro desde el inicio, más caro es aún, cuando no es lo que uno quiere y con defectos.",
          "",
          " El producto está súper pequeño, no tiene nada de relleno, está muy caro para lo que es, es un total engaño. No puedo creer que exista gente que te estafe con este tipo de publicidad que no es cierta. No lo recomiendo",
          "",
          "Precio muy elevado para el producto que es",
          "",
          "bonito y suave a mi hijo le encanta",
          ""
        ]
      }
    },
    {
      "id": "QxYCRl8",
      "title": "Among in Us Gift Sets Drawstring Bag 13 pcs",
      "price": "$17.99",
      "image": "https://m.media-amazon.com/images/I/81N-DCeM9yL._AC_SY355_.jpg",
      "description": "100% SATISFACTION PROMISE - We provide friendly after sale service, any quality problem will get replacement or 100% refund. Zero risk! Love it or take your money back!",
      "reviews": {
        "customerProfileNames": [
          "Kyle",
          "Blanca",
          "Customer",
          "Stephaniekeaton",
          "Customer",
          "Veronica",
          "Kristin",
          "Customer"
        ],
        "customerProfilePictures": [
          "https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif"
        ],
        "customerRatings": [
          "5.0 out of 5 stars",
          "5.0 out of 5 stars",
          "5.0 out of 5 stars",
          "5.0 out of 5 stars",
          "5.0 out of 5 stars",
          "5.0 out of 5 stars",
          "5.0 out of 5 stars",
          "4.0 out of 5 stars"
        ],
        "customerReviewTitles": [
          "Great gift bundle",
          "Very colorful",
          "Good.",
          "Great",
          "Simply the best",
          "Good",
          "My son loves it!",
          "My twins loved it"
        ],
        "customerReviewBodies": [
          "Everything in here was a pretty decent quality, people whining about facemask size should just look for another product. Tons of stickers, quality is good on them. My daughter is happy with everything thats in this bundle and is splitting them up for birthday bags. (Good stocking stuffer idea as well!)",
          "Ordered it for a friends daughter... She loved it!!",
          "Everything is super cute! Masks are a bit big for a child.",
          "Came on time and with everything it said it would have! My Son loves it!!",
          "Your grandchildren and children will love everything that comes in this set!\nI'm going to purchase another set for birthday party. All the young kids love Among Us.",
          "Love it",
          "Wish the mask was child sized, but awesome set!",
          "I got 2 of these for my twins 8th birthday and they loved everything! The pop socket only held up for 2 days before one lost its stick. The masks are on the larger side but all in all everything was fantastic!"
        ]
      }
    },
    {
      "id": "-El90yN",
      "title": "Werewolf Kill Games Building Blocks Toys,Space Alien Figures Peluche Game Model Kit Bricks Classic Kids Toy for Children Gift Mini Statues,Figures Game Mode(334-528PCS)",
      "price": "$26.88",
      "image": "https://m.media-amazon.com/images/I/51rLlwQtpCL._AC_SY355_.jpg",
      "description": "Brief Introduction\n\nMaterial:Abs Environmental Protection Material.\n\nPackaging:High-End Gift Packaging,With Instructions Inside. It Is Suitable As A Gift For Children.\n\nPlastic Building Block Type:Small Particles\n\nProduct Model List:\n\nModel:338-340PCS.\n\nModel:342-432PCS.\n\nModel:334-528 PCS.\n\nModel:99851-772PCS.\n\nModel:99861-357PCS.\n\nModel:D475-965PCS.",
      "reviews": {
        "customerProfileNames": [
          "MelissaGillette",
          "Krista",
          "Tiffany",
          "Tina",
          "Ghio",
          "Cassidy",
          "Alblav",
          "RebeccaL.Nance"
        ],
        "customerProfilePictures": [
          "https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif"
        ],
        "customerRatings": [
          "5.0 out of 5 stars",
          "5.0 out of 5 stars",
          "5.0 out of 5 stars",
          "5.0 out of 5 stars",
          "5.0 out of 5 stars",
          "1.0 out of 5 stars",
          "4.0 out of 5 stars",
          "4.0 out of 5 stars"
        ],
        "customerReviewTitles": [
          "It took me forever to put it together! Like 4 hrs",
          "Legos",
          "Great",
          "11 year old loves it!",
          "Very Good",
          "Not as Advertised",
          "My kid loved it.",
          "Christmas gift."
        ],
        "customerReviewBodies": [
          "It's really detailed and cool looking. My 9 yr old loves it. I just didn't like spending 4 hrs of my Xmas day to put it together. It Has alot of small pieces like guns and bones. Things I hope he won't lose but probably will in no time",
          "Grandson loved it! He is 7 and kept him busy for about 1/2 a day. He was happy with it.",
          "My son loved these.",
          "This was a Christmas gift for my Among Us obsessed 11 year old. He was very excited to open it and put it together. He was impressed with how close the set is to the game.",
          "Cute",
          "I ordered this Lego set as a birthday gift for my son who is obsessed with Among Us. Got it in the mail and opened it up just to find out it’s just the space ship….. no Among Us! I will be sending this back and ordering something different. Definitely not happy about it 🙄",
          "My kid loved this blocks. Some blocks where a little hard for him to put together, but he enjoyed them anyway.",
          "What's important is that my grandson loved it."
        ]
      }
    },
    {
      "id": "8CJjoVL",
      "title": "16 Colors 3D Night Lights with Remote Control and Smart Touch, Atmosphere Bedside Table Lamp for Kids Birthday Gifts Bedroom Decorataion Game Lovers",
      "price": "$16.99",
      "image": "https://m.media-amazon.com/images/I/612NbI0L3cL._AC_SX466_.jpg",
      "description": "About this item\n🎁🎁3D VISUAL EFFECT: 💝💝Novelty 3D illusion night light has a nice hologram effect, make your surroundings more lively. This 3d night light give you a perfect sense of 3D vision, amazing is that the night light lamp looks like floating, giving you more interesting, both for your room and your lives .\n🎁🎁16-COLORS 3D NIGHT LIGHT: 💝💝7 Single color light and 16 colors changing cycling: red, green, blue, yellow, cyan, purple, white; when pressing 8th times, it will automatic gradual changing for these 7 colors. 4 Flicker modes(Flash, Strobe, Fade and Smooth) and brightness adjustable. Multi colors and modes meet your different requirements. Comes with different styles that make more fun to play with, depending on your mood or surrounding.\n🎁🎁SMART TOUCH SWITCH: 💝💝3D ilusion night light is designed for children to play with, easy to use, one button operation, ideal gift for boys / girls to play with themselves.\n🎁🎁DURABLE AND SAFE FOR KIDS: 💝💝Easy to charge. Safe to touch. Sturdily constructure with toy-grade ABS base and high quality 3D light lamp doesn't get overheat. Two ways for power supply - 3 x AA Batteries (Not include) or USB cable.\n🎁🎁UNIQUE GIFT FOR BOYS OR GIRLS: 💝💝Creative and amazing night light unlike anything you've ever had. Perfect for gift giving, great present for boys girls baby; Decor lamp for your home, bedroom, child room, living room and any party. Also for festival gifts, such as birthday gift, Christmas gifts, and so on.\n› See more product details",
      "reviews": {
        "customerProfileNames": [
          "DavidD",
          "Chance",
          "AshleighM",
          "MeganMarieCraig",
          "Leo",
          "Cynthea",
          "Sweetheart85",
          "EstefanaZuniga"
        ],
        "customerProfilePictures": [
          "https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif"
        ],
        "customerRatings": [
          "5.0 out of 5 stars",
          "5.0 out of 5 stars",
          "5.0 out of 5 stars",
          "5.0 out of 5 stars",
          "5.0 out of 5 stars",
          "5.0 out of 5 stars",
          "5.0 out of 5 stars",
          "5.0 out of 5 stars"
        ],
        "customerReviewTitles": [
          "Amazing!",
          "This is very very bright",
          "Perfect gift for my 6 year old",
          "Great gift",
          "Perfect lighting",
          "Among us light",
          "AWESOME LIGHT!!!",
          "Love it!!!"
        ],
        "customerReviewBodies": [
          "Was hesitant to purchase this due to no reviews on this product. But I’m glad I did purchase it! Item is perfect and looks amazing! Remote and USB cable is an added bonus! Highly recommend, or is it sus..? ;)",
          "Super SUPER bright, like extremely so. Red and orange are the darkest colors, with the blue/white ones being the brightest. There's also brightness levels on the remote, and stuff like rainbow and strobe settings that are pretty neat. My daughter uses it as a night light so she's only allowed to do the darker colors, but the rest of them would be super cute in a computer room.",
          "It was the perfect gift for Christmas. My son uses it every night. Remote works great different colors and options for the light. Easy for him to use. Easy to accessible. No complaints here!",
          "Works as expected and my 8 year old son loves the remote feature",
          "Perfect size my kids love it and use it as a night light!",
          "My son loved this. Its super bright and you get to change its colors. Bigger than what I thought it was too!",
          "My 8 year old loves Among Us and since his 3 year old brother sleeps in the same room as him he didn’t want me getting a “baby night light”. This light is perfect for a night light and the boys also love to listen to music and have it change colors with the lights off so they can have a dance party. I’m honestly impressed with the quality and how well this works I would highly recommend.",
          "The kids love it"
        ]
      }
    },
    {
      "id": "OI39_pT",
      "title": "Official Among Us – Toikido Yume Mystery Capsules Impostor vs Crewmate (2pcs/ Pack)",
      "price": "$21.99",
      "image": "https://m.media-amazon.com/images/I/81coXsPv5zL._AC_SY450_.jpg",
      "description": "Continue the ultimate game of teamwork and betrayal AFK with the Among Us Mystery Capsules, will you identify the Impostor? First task – find the code card and use the heat of your thumb to reveal if you’re the deadly Impostor, or Crewmate open to sabotage. Next, unbox your 4-inch character figure and unique accessories. Crewmates will find a customizable hat and skin sticker, a side pet, location prop card and after-life bone. Impostor or Crewmate choose from 2 display modes, alive or deceased - you decide! Collect all 13 characters to customize over 130 combinations, including black, red, cyan, pink, yellow, orange, blue, green, purple, and glow-in-the-dark, but who’s done it?",
      "reviews": {
        "customerProfileNames": [
          "MichaelLopez",
          "J",
          "AmyR.Siino",
          "suhail",
          "Chelsey",
          "Dar",
          "AnnaFelicione",
          "NelsonAE"
        ],
        "customerProfilePictures": [
          "https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif"
        ],
        "customerRatings": [
          "5.0 out of 5 stars",
          "5.0 out of 5 stars",
          "5.0 out of 5 stars",
          "5.0 out of 5 stars",
          "5.0 out of 5 stars",
          "5.0 out of 5 stars",
          "5.0 out of 5 stars",
          "5.0 out of 5 stars"
        ],
        "customerReviewTitles": [
          "My grandson loved it!",
          "Good",
          "Nothing sus here",
          "Awesome gift for fans",
          "Items are in Seperate compartment at Bottom of Box",
          "Love it!",
          "My kiddo loved these!",
          "Super fun"
        ],
        "customerReviewBodies": [
          "Bought this as a gift for my 7yo grandson and he loved it! Has not stopped playing with it since he got it. I was pleasantly surprised and would buy again!",
          "I bought this product for a Christmas gift to my six year old he’s into among us… I thought they would be a little bigger there about 3 to 4 inches and come with a bunch of little mystery pieces if your child likes to put things in their mouth I do not recommend these….Overall product is OK",
          "I thought these were a little expensive but still got them for my son for Christmas. He loves them. They are durable and the mystery figure inside is amazing.",
          "My son absolutely loved it, very cool accessories. You get 2 crewmates with accesorios and pets. He was overjoyed!",
          "We thought these were really great! They come with stickers, a hat, a pet, a task and a bone for the inside. Super fun! I am wondering if the people who were missing items didn't open the bottom compartment of the box... there was a separate are in the box where some of the blind bags were.",
          "Our son enjoyed it!",
          "Great gift for an Among Us birthday party. My son went crazy over them",
          "Great gift for any among us fans"
        ]
      }
    },
    {
      "id": "qiLdKZX",
      "title": "Among Us Action Figures | Two of Four 4.5-Inch-Tall Collectibles | Among Us Toys and Playable Mini Toys | Green and Orange Crewmates with 6 Accessories: Hats and Hands | Kids’ Toys by P.M.I.",
      "price": "$29.99",
      "image": "https://m.media-amazon.com/images/I/81hWyPwtu3L._AC_SY355_.jpg",
      "description": "Two of a whole set of Among Us toys for kids to play with, start a collection, or throw an AmongUs theme party!\n\n✔ Two action figures in a window box:\n●the white crewmate wearing the folded (white origami paper hat) and the blue ghost wearing the chop-chop (shiny fake knife hat)\n●6.7-inch-tall\n●authentic, minimalistic design with the classic backpacks and visors\n●6 hats, hands, and accessories in the box\n●the accessories are detachable and replaceable\n●the accessories include the New Year cone and the Knighted helmet\n\n✔ These Among Us toys are collectibles:\n●collect the total of 4 characters\n●get the most character variations by applying different hats and hands\n●the playable items will look neat on the shelf as a collection, too\n\n✔ Use these toys as Among Us party favors\n●kids love to play with these Among Us toys for boys and girls together\n●organize an Among Us theme party by giving the kids an action figure each\n●these Among Us party supplies allow children to take on roles (crewmate vs. impostor) as they’re playing\n●create the atmosphere by assembling new characters with the available accessories\n●inspire children to have offline matches, figuring out which one is the impostor\n",
      "reviews": {
        "customerProfileNames": [],
        "customerProfilePictures": [],
        "customerRatings": [],
        "customerReviewTitles": [],
        "customerReviewBodies": []
      }
    },
    {
      "id": "jt98JVC",
      "title": "BAKIOYE Hot Game Figures Toys, PVC Action Figures Model Toys, Computer Desktop Decoration Toy Gifts Set, Collection Toys for Game Fans, Party Supplies Birthday Decor Character Figurines , 12PCS",
      "price": "$19.99",
      "image": "https://m.media-amazon.com/images/I/61xuKhpwFaL._AC_SY355_.jpg",
      "description": "Material: High Quality PVC\nSize: 3.25 x 1.2 inches\nStyle: 12 Different Costumes\nPackage Includes: 12PCS Action Figures\n",
      "reviews": {
        "customerProfileNames": [
          "TimothyPavlo",
          "Pattyreba",
          "Tracey",
          "Janai",
          "JohnCSimmonsJr",
          "AmanBagri",
          "B.Housley",
          "BrianStephanoZavala"
        ],
        "customerProfilePictures": [
          "https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif"
        ],
        "customerRatings": [
          "5.0 out of 5 stars",
          "5.0 out of 5 stars",
          "5.0 out of 5 stars",
          "5.0 out of 5 stars",
          "5.0 out of 5 stars",
          "5.0 out of 5 stars",
          "5.0 out of 5 stars",
          "5.0 out of 5 stars"
        ],
        "customerReviewTitles": [
          "Son loves these!",
          "These are fun little guys!",
          "Kids loved it",
          "There super cute",
          "Great Gift",
          "Awesome little toys!",
          "Satisfied",
          "Excelente Regalo 🎁buen juguete",
          ""
        ],
        "customerReviewBodies": [
          " My 4 year old son is into monsters and creatures (siren head, ink bendy, imposter, etc..) this were a great addition to his collection. There's a lot of them! I wasn't expecting such good quality toys for the price. I'm pleased. And, I won cool Mom brownie points! Very happy with this purchase",
          "My boys love these! They have been playing with them since we got them. They are basic enough to be easy to take apart and put together, but fun enough to keep them entertained.",
          "Super happy with the product. Kids love that you could disassemble and reassemble them to your liking. Very fun for toddlers and 8+",
          "I love the size",
          "I bought these for my daughter who is a big fan of Among Us. These little toys are hilarious. It seems almost like they are pieces to a game set. They can split open like they have been killed and they come with different types of hats and costumes.",
          "This was the perfect addition to my son’s birthday party! I was having a hard time finding an Among Us cake so I got an ordinary cake and put some of these toys and everyone absolutely loved it!! And now the kids have awesome toys to play with. Win win!",
          "Birthday gift for great grandson. He loves them. Each figure was individual wrapped, all in perfect condition. Good price.",
          "El mejor regalo para mi primo, le encantaron, es fan # 1 de Among us",
          ""
        ]
      }
    },
    {
      "id": "tvlYc9p",
      "title": "10 Pcs Among Action Figures Set Mini Game Figure Toys, Desktop Decoration Impostor Toy, Astronaut Crewmate Character Model for Children",
      "price": "$21.99",
      "image": "https://m.media-amazon.com/images/I/71A96LXjNCL._AC_SY355_.jpg",
      "description": "About this item\n🚀NOVEL APPEARANCE：These among figures show the crew characters in the game with lively expressions. A set of 10 game figure toys, each with a different shape.\n🚀HIGH QUALITY：These cute among figures are made of high quality PVC material, with bright colors and durable.\n🚀MULTIPURPOSE：Each of these funny action figures is 1.2 x 1.2 x 3 inches. These cute game toys can be used as room decor and cake decorations at parties.\n🚀WONDERFUL GIFTS：This among action figure is the best gift for kids and game fans. Use this crew character model to create beautiful memories with your kids or friends.\n🚀QUALITY GUARANTEE：If you are not satisfied with our action figures, please contact us promptly and we will provide you with a full refund/exchange.",
      "reviews": {
        "customerProfileNames": [
          "RedWineRoad",
          "amber",
          "DCL",
          "RachelMichelleGamble",
          "JenniferD.Rice"
        ],
        "customerProfilePictures": [
          "https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif"
        ],
        "customerRatings": [
          "5.0 out of 5 stars",
          "5.0 out of 5 stars",
          "5.0 out of 5 stars",
          "3.0 out of 5 stars",
          "1.0 out of 5 stars"
        ],
        "customerReviewTitles": [
          "Cute",
          "Perfect size for cake decorating",
          "These are good",
          "Removable parts",
          "Do not come apart"
        ],
        "customerReviewBodies": [
          "My grandson loves these. Good size, and they good quality",
          "My nephew loves among us and these were perfect for his birthday cake. Great price and good quality.",
          "They're well made. They're colorful, and my 6 year old LOVES them! I don't get it myself and I have had to endure several games and lengthy conversations about how wonderful they are.\nThis grandma is kicking herself for not being able to come up with such a simple concept myself that has these kids crazy about... Anyway, they're were the money...",
          "The product was ok. However, some of the pieces will not easily stay together.",
          "These do not come apart with the bone showing which is very disappointing. Will be returning! Boo"
        ]
      }
    },
    {
      "id": "chfTec-",
      "title": "Hot Figures Toys for hot game PVC Space Figures Model Toys Cake Topper Decorations Accessories Computer Desktop Dolls Gifts Figures Collection Toys Gifts Free 50pcs Stickers and Bag (12pcs Set B)",
      "price": "$24.85",
      "image": "https://m.media-amazon.com/images/I/612mBSoAjuL._AC_SY355_.jpg",
      "description": "About this item\n🌟【HOT GAME】 Refer to high quality figure toy action game figures. Touch to delicate, easy to hold and comfortable, non-toxic and eco-friendly PVC material.\n🌟【12pcs/24pcs Deluxe Edition】 12pcs/24pcs vivid figure toy sets are great for kids who love creating the best in giant-sized action figure battles! Different character is great for decoration.\n🌟【Perfect Size】: The figure toy is about 3.5 inch. Small size, easy to carry, you can take it anywhere and anytime.\n🌟【BEST GIFT】: This figure toy set is inspired by the famous game, which is a wonderful gift for this game fans, and they will surely fall in love with it. Each order will be throw in 50pcs stickers and Exquisite storage bag.\n🌟【Quality Guarantee】If you are not satisfied with the products, we will 24*7 hours customer service and full refund/ replacement. More than pleasure to meet your needs",
      "reviews": {
        "customerProfileNames": [
          "Brady",
          "Lovinmysunnylife",
          "RomanGarza",
          "MyrandaT.",
          "Joanna",
          "phoenix_ablaze",
          "sarahstrickland",
          "jenna"
        ],
        "customerProfilePictures": [
          "https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif",
          "https://images-na.ssl-images-amazon.com/images/S/amazon-avatars-global/4ad802bf-e1f1-4854-9e73-d168b523d6ed._CR0,0,375,375_SX48_.jpg",
          "https://images-na.ssl-images-amazon.com/images/S/amazon-avatars-global/ec218a5b-a1f3-47e7-98b5-e4f29b14cc4d._CR0,26.0,281,281_SX48_.jpg",
          "https://images-na.ssl-images-amazon.com/images/S/amazon-avatars-global/906d8797-a05c-4752-9871-6efbd0622bb5._CR0,0,368,368_SX48_.jpg"
        ],
        "customerRatings": [
          "5.0 out of 5 stars",
          "5.0 out of 5 stars",
          "5.0 out of 5 stars",
          "5.0 out of 5 stars",
          "5.0 out of 5 stars",
          "5.0 out of 5 stars",
          "5.0 out of 5 stars",
          "5.0 out of 5 stars"
        ],
        "customerReviewTitles": [
          "Perfect for the Among Us fans",
          "So fun!",
          "Two happy Parents",
          "Better than I had expected!!",
          "Happy Surprise",
          "Much better than expected!",
          "Love these",
          "OMG Outstanding"
        ],
        "customerReviewBodies": [
          "I normally am not a review writer, but felt like these deserved one. I was honestly expecting cheap breakable plastic, but these are surprisingly thick and durable. They’ve already taken quite the beating from our kids and are holding up very well. I was also hesitant on ordering since they ship from China (I didn’t want to have to wait forever for them to arrive) but they took 13 days from the day I ordered to get here and that is insanely fast for shipping all the way from China. I’ve had clothing store orders take longer to arrive. We also received a surprise Among Us drawstring storage bag that I don’t remember seeing in the listing. It’s very cute and perfect to keep the characters from getting lost when they’re not in use. Our package didn’t include the brown character, but we got two of the teal characters (so still 12 total). But our kids don’t mind so it wasn’t a huge deal. Overall very impressed and highly recommended.",
          "I ordered the 24 pc set. They are so cute!! About 3”-4” inches in height, hard plastic and their bodies can be taken apart and also the “hats” can be taken off and put on a different character. My 7 yr old loves them!",
          "I was so excited to see that my package was delivered as promised! They made the cake look fabulous. My husband and I love them because they allow my son to use his imagination and cut screen time.",
          "These were much bigger than I thought they were going to be. I was expecting hatchimal size, these are bigger and better!!! They each came individually wrapped. You can taken them apart and change out the top hats. It also came with a cute among us drawstring bag and 50 adorable among us stickers! Keep in mind these are made of some sort of hard plastic, but they’re super thick so their very sturdy! My 7 year and 9 year old loves these!!",
          "I’ll admit I didn’t read any reviews, I didn’t read about their size, and I don’t think I even looked at the rating - I just bought them. My two boys play pretend Among Us all the time so I thought ‘let’s get some figurines.’ To my happy surprise it came with a bag to keep the toys in, their innards, hats, and bodies are interchangeable (which is a total plus), and it came with stickers. What kid doesn’t love stickers?! Another bonus, they aren’t itty bitty and they’re made of durable thick plastic/rubber substance, which means they won’t crack down the sides like an Easter egg or bend in half like a McDonald’s toy. ⭐️⭐️⭐️⭐️⭐️",
          "A little long, but bear with me. So, since my child has been in elementary school I've given gift bags to the class and/or for the birthday party (usually very small and just close friends, so in no way birthdayzilla). So, this year I chose Among us, since during lockdown that became a favorite. But as with any parent who they thinks they know what their kid likes, only to find out that was so last week, I was worried because now Friday Night Funkin has been the flavor of the month, with next to no gift opportunities for parties, birthdays, or basically anything (and believe me I tried!). However, with a pandemic still bumbling along, I arranged with my youngster to have a party somewhere outdoors when it gets warmer...or so I thought. Young one informed me that they told all their friends about the party on Saturday (this was Wednesday) so I started scrambling. Well, it turned out the mouse house their heart was set on would enforce a full vaccination mandate for 5-11 on the day the party would happen. Try as I might, no vaccines before then, so I had to inform my beloved that the party would have to wait. Much disappointment! And I get it. My child really doesn't ask for much and weathered isolation as an only like a, very lonely, trooper. So, I really wanted to do something special at home to make up for it. So, the family decided on a video game treasure hunt for presents, with an Among us theme (since no FNF). So I searched frantically for decorations, and since we don't like balloons and stuff, choices were limited. I opted for a table cloth, a huge sign, and these figures of Among us characters around the table in all forms of Among us chaos (if you've played the game you know what I mean). Well, I was worried about timing, but they came when they said they would. They are about 2.5 inches tall, well made and open up to a little bone for when they are eliminated. I had fun decorating with that, lol. One was reading a book (a present), a few were in conversations, a couple eliminated...It looked great! I ended up not needing 24, but no worries because they became party favors for when the birthday party actually happened. They are good quality, larger than expected and didn't smell bad (you know what I mean). So these are great! Like really saved a hohum idea and made it more special.\nNow, just a few notes. They all come separately wrapped in plastic little baggies, which might be a deal breaker for you. Also, the 24 pieces were 2 x the 12, which was not an issue for us but may be for you. Finally, if you want the figurines, make sure that's what you order and not the candles. Ours came with a small backpack that I store them in. All on all, my tween played with them and thought they were really cool, so if your child is younger it would be an even bigger hit. I definitely recommend them if you have an Among us fan in the house (and even the adults were impressed, so I actually mean it). I don't write reviews often, but these figurines were worth my time. Hope this helps!",
          "I bought these for my Among Us obsessed child. He absolutely loves them! They seem well-made and they are a good size, not teeny-tiny & fit nicely in your hand. The pieces are all sturdy and it doesn't seem like anything will break. The hats and 'guts' are all interchangeable. Overall I am pleased with the quality and value. My kid has been playing with these toys instead of the video game all afternoon so I am very happy with my purchase!",
          "I just opened these- I set them aside for Christmas and hid them. These are AMAZING and my son is going to LOVE THEM. These are pretty big, and they cut if half just like in the game with the bone sticking out. Lots of colors and weird accessories. They came with a bag instead of in a box, so some creativity will be required from the North Pole, but everything was packed nicely, and the bag was a bonus. There was also stickers included. Absolutely wonderful : )\n\nUpdate- my son LOVED this for Christmas and played with it for hours. He even shared with his toddler sister. I got a little box for them and he went nuts when he opened it because he had never seen them in a store : )",
          "Es genial. Lo pedí el 16 nov y llegó el 30 al Edo. de México. Están las 24 piezas y la bolsa con los stickers. Solo abrí uno para verlo porque son para reyes para mis dos nenas, esta muy bonito y de buen tamaño para que no se pierdan.\nMi única observación es del rastreo del paquete, solo se actualizo hasta el despacho de aduanas y no cambio hasta que me llamaron y entregaron.",
          "",
          "I was shocked at their size they’re great, my kids will love them, might fight over the bag though which is super cute, stickers are a great bonus as well. 10/10 would recommend. I was skeptical at first, I thought it came from US, found out after purchasing that it came from China, but it came a week before my delivery date. Thank you 😃",
          "W",
          "I bought these Among Us figures for my 8 yr old and she loves them. They are pretty large and can take a lot of beating form being played with. It comes with a Among Us bag and a handful of vinyl stickers, which btw I'm keeping for myself. Anway, I would definite get more ...",
          "Compre el paquete de 12 piezas, todos están en buenas condiciones y el material se ve de calidad. Venia con una bolsa y stickers tal como dice la publicación.",
          ""
        ]
      }
    },
    {
      "id": "d-zC2ur",
      "title": "12 Inch Game US Plush, Hot Game Character Plushie Plush Doll Soft Plushie Big for Game Fans and Kids, Reddish Black",
      "price": "$15.99",
      "image": "https://m.media-amazon.com/images/I/7192IF6kqRL._AC_SY355_.jpg",
      "description": "About this item\nSOFT MATERIAL---Plush toys are made of skin-friendly soft plush material, and the inside is filled with elastic pp cotton, which is soft and durable, and the product is vacuum packed to protect the doll, after taking out the doll, pat it lightly or put it in the sun for a while Swell and plump.\nEASY TO CARRY---Plushie size: 12inch, light weight, super soft, easy to carry, you can play anytime, very decompressed. With 5 colors for you to choose, it can be placed as a decoration in your room, bedside, table top, sofa or car, etc.\nTHE PERFECT GIFT---Plush toys will be the perfect gift for children, children will be very happy to see plush toys as gifts, which can enhance the relationship between adults and children, and can also shorten the distance between children, suitable for Give as a gift at birthdays, events, parties, New Years and other festivals\nDESIGN INSPIRATION---The design inspiration of this plush toy comes from children, giving children more emotional snuggle, and accompanying children every day of their growth, it will be the ideal companion for children.\nACCOMPANYING GROWTH---Plush toys are very suitable for children to hug and fall asleep. It is not only a doll, but also a friend of children. It is the spiritual sustenance of children for a beautiful world, and can accompany children to spend every good night.",
      "reviews": {
        "customerProfileNames": [
          "Journey2FindKay",
          "Hannahp",
          "gerisweat",
          "Shawn&#47;Texas",
          "SarahDoēTara",
          "Customer",
          "Tacha",
          "PaulaG.Cannon"
        ],
        "customerProfilePictures": [
          "https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif"
        ],
        "customerRatings": [
          "5.0 out of 5 stars",
          "5.0 out of 5 stars",
          "5.0 out of 5 stars",
          "5.0 out of 5 stars",
          "1.0 out of 5 stars",
          "5.0 out of 5 stars",
          "5.0 out of 5 stars",
          "4.0 out of 5 stars"
        ],
        "customerReviewTitles": [
          "So soft and cute! Nephew loves it!",
          "Malformed and Low Quality but Cute As Heck",
          "<3 it!!!",
          "Well worth the money!!!",
          "Immediately started unthreatening",
          "Perfect! Love it!",
          "A fantastic gender neutral gift for all Among Us fans.",
          "Cute but very thin material"
        ],
        "customerReviewBodies": [
          "Came on time so cute. Nice and soft! my nephew could not put it down ever since he opened it on his birthday. I will definitely buy him the other colors and other variations as this was great. I also appreciated that it came vacuum packed made it easier to ship and was fun to open.",
          "Not the best made, has some stitches out of place. Low quality and very malleable in terms of fluff in wrong places and deformed on one side, but very cute. 20 year old boyfriend loved as birthday gift. Very cute/funny gift for a wonderful nerd in your life.",
          "<3 it!",
          "As expected. Very good purchase.",
          "Not even 10 min out of the packaging the threading at the seem started coming undone. I had to sew it shut again.",
          "My grand daughter loves it. It's so soft and the colors are beautiful 😍",
          "This 12 Inch Among Game US Plush was chosen for my 10-year-old son, who enjoys the Among Us game. As seen in the photo, it has found a home among his other plushies. This plushie arrived in a vacuum-sealed bag and immediately came to life when unwrapped. This plushie is approximately 12 inches long from head to toe and 6.5 inches deep from the most protruding points in the front and back.\n\nThis plushie does have a tad asymmetrical shape. For example, the right leg is more rounded than the left, what I assume is the eye is slanted at tad to the left, and the top of the head is lopsided. My son, on the other hand, doesn't seem to notice (or care), enjoys playing with this plushie, and gives it 5 stars. The stitching is lovely, and the fabric is extremely soft. When I opened it, there were no odors. My son likes how colorful and soft this plushie is. He also likes how big it is because it makes it easier to play with.",
          " I know this isn’t a dog toy but my 4 year old Boston Terrier loves to suck on stuffed animals, she’s done this since she was a baby. I knew she would love this, whatever it’s supposed to be, it has a minimal shape with a hump, perfect for sucking on. She went nuts for it and immediately claimed it as hers and sucked on it for 15 minutes. She wore a hole in it right away, the material is paper thin. It’s cute but really thin material, doubt it would stand up to much hard play."
        ]
      }
    },
    {
      "id": "-Anvag_",
      "title": "Among Us Crewmate Figures | 5 Among Us Toys Out of 16 Collectibles in 1 Pack | Among Us Merch Incl. The Peeled and The Clogged | 1 Hidden Impostor | Mini Toys with 3 Add’l Hats | Kids’ Toys by P.M.I.",
      "price": "$19.99",
      "image": "https://m.media-amazon.com/images/I/71AJjrjftlL._AC_SY355_.jpg",
      "description": "Get a whole set of Among Us figures to play with, start a collection, or throw an AmongUs theme party! ✔ Various selections of crewmates: 5 figures in 1 pack 3 accessories included 1 figure is hidden (the impostor!): open the pack to find out which character it is the figures come in different colors and with different hats one figure is the purple impostor with sharp teeth and the tongue sticking out you can even find the dead body (report it!) ✔ These mini toys are collectibles: collect the total of 16 characters find the characters wearing the coolest new and classic hats: the Vi King, the Peeled, the Clogged, and the Rammed find the four rarest crewmates: the crewmate wearing the Punkin (purple), the one wearing the Floaty Flamingo (cyan), the one wearing the Chop-chop (red), and the running one wearing the Great Goalie (or the Jason mask?) (lime) one figure in each pack is hidden, so collecting them is a quest! ✔ Use these toys as Among Us party decorations and supplies kids love to play with these Among Us toys / figures together inspire children to have offline matches, figuring out which one is the impostor",
      "reviews": {
        "customerProfileNames": ["HelenC.Feldman", "TamaraOBrien"],
        "customerProfilePictures": [
          "https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif"
        ],
        "customerRatings": ["5.0 out of 5 stars", "2.0 out of 5 stars"],
        "customerReviewTitles": ["Among Us figures", "Cheap"],
        "customerReviewBodies": [
          "Great service, many thanks, highly recommend. A+A+A+A+A",
          "The squish me is tearing after a few plays!"
        ]
      }
    },
    {
      "id": "DQn-W2m",
      "title": "FATIZONE 12Pcs PVC Toys Action Figures Set | Mini Game Figures Desk Character Model Toys, Cake Decorations Impostor",
      "price": "$23.99",
      "image": "https://m.media-amazon.com/images/I/611QFnpSlaL._AC_SY450_.jpg",
      "description": "About this item\nAction Figures: These action figure toys are inspired by the famous game, richly painted details bring them to life and help inspire creativity for kids or teens.\nPremium Quality: These game figures are made of high-quality pvc material, non-deformed, touch to delicate, easy to hold and comfortable, non-toxic and eco-friendly.\nSmall & Portable: The suit contains 12pcs PVC Action Figure model of different costumes, each of which can be disassembled and divided into 2 parts. These are small size(3.25inch tall), easy to carry, you can take it anywhere anytime.\nDedicated Gift: These mini astronaut figures toy set is a nice, enjoyable choice to give as a gift to children, friends, partners, and it also a good gift for Christmas, Valentine's Day, Cake Accessories Decoration and Birthday Present.\nYour Satisfaction is Our Priority: If you aren't satisfied with our action figures toy quality and would like to return it, we will issue immediate refund.",
      "reviews": {
        "customerProfileNames": [
          "AngPu",
          "William",
          "Customer",
          "maggiegypsy",
          "SallyM.",
          "Samantha",
          "Tony",
          "Ashleynicolegowen"
        ],
        "customerProfilePictures": [
          "https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif"
        ],
        "customerRatings": [
          "5.0 out of 5 stars",
          "5.0 out of 5 stars",
          "5.0 out of 5 stars",
          "5.0 out of 5 stars",
          "5.0 out of 5 stars",
          "5.0 out of 5 stars",
          "5.0 out of 5 stars",
          "5.0 out of 5 stars"
        ],
        "customerReviewTitles": [
          "Happy Happy Boy!",
          "Cute toys",
          "Buy these!!",
          "Great for Among Us fans/ kids",
          "Great set of realistic Among Us characters",
          "Great! If shipping to someone for their birthday - beware",
          "Love them",
          "Better then I expected!"
        ],
        "customerReviewBodies": [
          "Nice toy! My son loves them. I strongly advise not to let these toys sit outside under UV light as sun exposure could degrade paint and cause pvc leaching. Hot water in a bathtub over time could also result in leaching. There is always a risk playing with pvc toys. PVC is a toxic material. PVC (polyvinyl chloride) is a widely used plastic often containing harmful chemicals, including such known carcinogens as vinyl chloride, dioxin and phthalates, which are linked to asthma, allergies, and reproductive problems. Be careful not to allow young children chew on them. My son understands the risks and he just makes it where the characters exposure to sunlight or heat cannot be a part of the lifestyle for Among Us characters. Remember the gremlins? They could not be exposed to three things and they were sunlight, water or be fed after midnight or they would die. Wash with cold water and antibacterial detergent. Avoid alcohol and other paint stripping solutions for cleaning. Other than that, have fun and don't forget to do your tasks or YOU may be SUS!",
          "I’m actually surprised at the quality and details of these toys, they are the pricier among us toys but it was worth it. The sculpts are nice and the material is strong and thick, all the little hats and accessories are well detailed. I really can’t complain, the kids love them. It comes with an assortment of 12 little among us dudes so don’t let my picture confuse you, I just couldn’t fit all of them in my pics. The figures behind the among us are all roughly 7 inches tall to give you an idea of their size",
          "These figures are a great value! They’re fairly large. Some pieces like the hats and the insides are a painted plastic, and it looks like the paint will wear off eventually. I bought them for on a road trip for two boys ages 9 and 5 and they were thrilled! Lots of different creative games to play. Hats are removable and the bone inside comes out too. They will be well loved for a long time!",
          "My kids love the game and now they can have creative play with figures. They like the interchangeable pieces and the fact that they all open to reveal the signature AU bone inside. Really cute!",
          "If your kids play Among Us this is a great little set. They come a part and have the little bone inside just like when the Imposter kills someone in the game. I got these fir my grandkids 6&7 and they absolutely loved them. They are well made and super cute.",
          "My kids played with these for hours on christmas! However, the packaging is not flattering so if you are shipping these to someone just know that haha. But they are very cool and worth the buy for your among us loving little ones!",
          "My daughter was very excited and happy to see these. Every parents were asking me where I found them at the party. They were surprised when I told them the price. Well-made and good quality.",
          "The figures are bigger then I thought they would be and made of a hard plastic. I am very happy with the quality of the figures and how you can take off/trade the hats. After you pull them apart they fit back together nice and snug which will be great for long time use with the kids!"
        ]
      }
    },
    {
      "id": "2nBjazt",
      "title": "helu Space Kill Game Figures Toys Building Blocks,Space Alien Figures Peluche Game Model Kit Bricks Classic Kids Toy for Children Gift Mini Statues,Among Figures Game Model(82300-982pcs)",
      "price": "$35.99",
      "image": "https://m.media-amazon.com/images/I/81tlXnJEGfL._AC_SY355_.jpg",
      "description": "Products 🧩🧩Building Block Toys Material: ABS environmental protection material. Toy Packaging: High-end gift packaging, with instructions inside. It is suitable as a gift for children. Plastic building block type: small particles Product model list: Model 82295 -- 377 Pieces Model 82296 -- 379 Pieces Model 82300 -- 982 Pieces Model 82306 -- 692 Pieces Model 82295+82296 -- 756 Pieces",
      "reviews": {
        "customerProfileNames": [
          "Chris",
          "TimJ",
          "MarkSabin",
          "Customer",
          "Customer",
          "SantiagoA.",
          "ErinG.",
          "TamaraOBrien",
          "Disappointedcustomer"
        ],
        "customerProfilePictures": [
          "https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif"
        ],
        "customerRatings": [
          "5.0 out of 5 stars",
          "4.0 out of 5 stars",
          "3.0 out of 5 stars",
          "5.0 out of 5 stars",
          "3.0 out of 5 stars",
          "1.0 out of 5 stars",
          "1.0 out of 5 stars",
          "1.0 out of 5 stars"
        ],
        "customerReviewTitles": [
          "What a hit!",
          "Not official \"Among Us\" product",
          "Not suitable for kids under age 3",
          "Loved it 😍",
          "Hard to put together and missing some pieces",
          "Pieces are hard to put together and the instructions are not great.",
          "Disappointed",
          "Tail was broken on dinosaur! Cheap"
        ],
        "customerReviewBodies": [
          "My son loves the game, so this was a hit already. Then he built and it took time for him to complete, which was satisfying to me because it means it's a challenge for him. He expressed how thankful he was I got it for him.",
          "Bought this as a gift for an 8 yo. He's an Among Us fan. There isn't much Among Us merch out there so I went with this. It looks decent. Just be aware that it's not actually licensed Among Us stuff. I'm sure he'll like it.. he's 8. Box looks good.",
          "Christmas presents",
          " Very nice to be gifted",
          "It is a nice set but it is hard for a child to put together.\nIt is missing few pieces",
          "While trying to put the pieces together they kept falling apart making it almost impossible to build the structure.",
          "Pieces were missing, some didn’t fit properly",
          "Dinosaur tail broken when we received it!\nCheaply made!\nDo not purchase from this seller"
        ]
      }
    },
    {
      "id": "vInX7H4",
      "title": "Fundisinn 12pcs Game Figures Toy, Astronaut Crewmate Action Figures Model Toys,Computer Desktop Dolls Gifts Set Kids Toy,Cake Topper Party Supply (12Pcs-E)",
      "price": "$22.99",
      "image": "https://m.media-amazon.com/images/I/61sQXUPbUXS._AC_SY355_.jpg",
      "description": "About this item\n🌟【High Quality】High quality figure toy action game figures. Touch to delicate, easy to hold and comfortable, non-toxic and eco-friendly PVC material.\n🌟【12pcs Deluxe Edition】12 pcs vivid figure toy sets are great for kids who love creating the best in giant-sized action figure battles! Different character is great for decoration.\n🌟【Perfect Size】This figure toy is about 3.5 inch. Small size, easy to carry, you can take it anywhere and anytime.\n🌟【BEST GIFT】: A wonderful gift for this game fans, and they will surely fall in love with it.\n🌟【Quality Guarantee】If you are not satisfied with the products, we will offer 24*7 hours customer service and full refund/ replacement. More than pleasure to meet your needs",
      "reviews": {
        "customerProfileNames": [
          "April",
          "Cyndi",
          "Whitney",
          "SarahMarieLaviers",
          "Customer",
          "Sam",
          "Tykerea",
          "Angie"
        ],
        "customerProfilePictures": [
          "https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif",
          "https://images-na.ssl-images-amazon.com/images/S/amazon-avatars-global/ca54f2bb-3ff1-4756-9596-b1be0013bb57._CR0,0,376,376_SX48_.jpg"
        ],
        "customerRatings": [
          "5.0 out of 5 stars",
          "5.0 out of 5 stars",
          "5.0 out of 5 stars",
          "5.0 out of 5 stars",
          "5.0 out of 5 stars",
          "2.0 out of 5 stars",
          "5.0 out of 5 stars",
          "5.0 out of 5 stars"
        ],
        "customerReviewTitles": [
          "Love to play with",
          "Very pleased with this purchase! 😊",
          "my 5 year old’s favorite birthday gift…even over his iPad!",
          "Amazing! Definitely recommend",
          "Very good quality",
          "Not what I expected",
          "Great gift",
          "good buy!"
        ],
        "customerReviewBodies": [
          "The kids love playing with these figures! Decent size. Comes with an adorable Among Us bag to keep the figures in. Also came with a bunch of stickers! All stickers are different and funny, no repeats and around 50 of them! We ordered another different pack, too!",
          "I am very pleased with this purchase. 😀 I was quite happy to find the size of these toys was perfect, they are highly-interchangeable, and the plastic was of a nice quality and strength, appearing durable for young children. I bought this item for my nephew's birthday and it even came withe a free party themed drawstring bag and around 20 Among Us 2\" stickers! What a nice surprise. 🥳",
          "The head accessories are interchangeable & their heads too! There are even skeletons inside each one that come out. My 5 & 6 year old boys play with these multiple times a day.",
          "They are sturdy and well made! My son loved them and they are great for his birthday cake!",
          "The coolest toys ever. If your kid loves among us these are a MUST BUY!!!",
          "From the photos I expected all of these little guys to come apart at the waste, and that they would have the bone sticking up inside of them. Nope. Only one was able to be taken apart and only one has that little bone. I know this cause I took 2 others apart. I thought maybe they were just mashed together really well because it took a knife and a lot of force to get them apart. Definitely durable. What k didn't understand was why they all had a cut all the way around their middle, suggesting that they do come apart, if they really didn't? It just made me think I wasn't trying hard enough and I ended up tearing 2 of them up because of it. The hats do come off but they aren't interchangeable without some effort. The notches they fit in to on their heads are cut into odd shapes, so when switching between figures, you have to smash some of them down to make them stay and others are too big and just fall off. Also, their feet are not flat, so they don't stand up. They are so cut very oddly and some have rounded bottoms. They just fall right over. Regardless, my son was still happy to receive them. In the package they also sent us a little among us f\nDraw string bag and like 30 among us stickers which were extremely cute. I stole a few for myself. Lol.\n\nOverall I'm disappointed with the purchase and would have sent them back had I not tore two of them apart. The gifts were a nice addition but definitely didn't make it worth the money i spent. Live and you learn.",
          "Exactly what I’m looking for",
          "my son absolutely loved them!",
          "They are a thicker / heavier plastic than anticipated I am sure they will be a loved Christmas gift this year"
        ]
      }
    },
    {
      "id": "wd3BMPe",
      "title": "JUSHOO 9 Inch Blue Hedgehog Stuffed Plush Toy, Soft So-nic Plushie Doll for Game Fans, Kids Birthday Party Favor and Home Decor",
      "price": "$15.99",
      "image": "https://m.media-amazon.com/images/I/71vK4VPPqEL._AC_SY355_.jpg",
      "description": "Features: Inspired by a Famous Game: Giving you different character inspirations, bring you unexpected surprises High quality material: Comfortable to touch, elastic washable, and not easily deformed, will be a great kids playmate Great Gift Choice: Cute figure character, attractive to game fans and kids, bringing much imagination you, perfect as a birthday, role-playing gift and school rewards Specifications: Material: pp cotton Color: Blue Size: 22cm/9 inch Package Include: 1 x soft stuffed plush Note: Manual measurement, please allow slight difference on size The color may exist slight difference due to different screen displays Hand wash or machine wash, then dry it on cool place",
      "reviews": {
        "customerProfileNames": [
          "timl.",
          "Odessasullen",
          "TerraceLucydia",
          "Kailey",
          "TeresaRivera",
          "Jonathan",
          "Adam",
          "caseyj."
        ],
        "customerProfilePictures": [
          "https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif",
          "https://images-na.ssl-images-amazon.com/images/S/amazon-avatars-global/99b5df64-b946-41f3-ab65-372e153cb715._CR0,0,312,312_SX48_.jpg"
        ],
        "customerRatings": [
          "5.0 out of 5 stars",
          "5.0 out of 5 stars",
          "5.0 out of 5 stars",
          "5.0 out of 5 stars",
          "5.0 out of 5 stars",
          "4.0 out of 5 stars",
          "3.0 out of 5 stars",
          "1.0 out of 5 stars"
        ],
        "customerReviewTitles": [
          "Awesome",
          "Did Plush all I need is tails",
          "Sonamoungus",
          "i love it",
          "Very accurate from the picture.",
          "Well made but much smaller than described!",
          "Inaccurate Size Description",
          "It was not the size I thought it was"
        ],
        "customerReviewBodies": [
          "Love it",
          "It came in a day and it was Golden The plush has good stuffing everything is attached nothing is wrong with it I just wish there was a tails one I would order that too",
          "Perf, hes perf. Buy him",
          "I bought as a gift for my bf",
          "Such a cute and unique Among Us/Sonic the Hedgehog themed stuffed animal! Very soft and immediately enjoyable! I am disappointed with the exaggeration in size, I personally look ahead at those details before purchasing and this was WAY OFF.",
          "This is very soft, and adorable… But the size is very off in the description! As other reviews have stated, it is closer to 6.5 inches, very small for the price! Disappointed.",
          "It's soft but way too small."
        ]
      }
    },
    {
      "id": "4sdaI_0",
      "title": "6 pcs Plush Toys Crewmate Easter Astronaut Stuffed Plushie, Imposters Little Animal Game Figures with Squeak for Game Fans and Children for Fans (SIX)",
      "price": "$14.99",
      "image": "https://m.media-amazon.com/images/I/614BZCMc05L._AC_SY355_.jpg",
      "description": "Size of the plush: 3.3 x 2.5 x 4 inches",
      "reviews": {
        "customerProfileNames": [
          "mlg6504",
          "Sonicblast",
          "ShannonS.",
          "Susan",
          "Karly",
          "Pagessanctuary"
        ],
        "customerProfilePictures": [
          "https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif",
          "https://images-na.ssl-images-amazon.com/images/S/amazon-avatars-global/74922e16-95a6-48b9-867a-e141d38c59d5._CR0,0,355,355_SX48_.jpg"
        ],
        "customerRatings": [
          "5.0 out of 5 stars",
          "5.0 out of 5 stars",
          "5.0 out of 5 stars",
          "5.0 out of 5 stars",
          "5.0 out of 5 stars",
          "5.0 out of 5 stars"
        ],
        "customerReviewTitles": [
          "I bought these as prizes for a student",
          "These are very cute and I think they look very close to the Among us characters!!",
          "Adorable!",
          "Amazing",
          "Gift stuffers",
          "So cute! Such a good price"
        ],
        "customerReviewBodies": [
          "I bought these as rewards for a student. He loves working for them!! I wish they didn’t squeak though",
          "These little imposters are so cute and even have a built in squeaker.",
          "I think these are GREAT I love them and so does my dog. I hope the people who made them are happy and living a good life. This was a great price I feel almost like I scammed the creators love them! I highly recommend these for dogs kids and even parents. It couldn’t be any better!",
          "Perfect for bag fillers for gifts!",
          "These are even better in person! I was very hesitant to buy these since there were no reviews but I risked it for the good price and it was definitely worth it. They’re very small, about the size of my palm but I think they’re perfect. For $9.99 these were definitely the best price I could find for something like this. So cute! I can’t wait to give them to my friends who love Among Us!"
        ]
      }
    },
    {
      "id": "w1Haofr",
      "title": "Hot Mini Figures Toys for Game Figures Model Toys Cake Decorations Accessories Computer Desktop Dolls",
      "price": "$10.99",
      "image": "https://m.media-amazon.com/images/I/61Paz4jRNfS._AC_SY355_.jpg",
      "description": "12 set",
      "reviews": {
        "customerProfileNames": [
          "EJHANNA",
          "Angela",
          "Chris",
          "CindySue",
          "HumanPerson",
          "LZ",
          "DebUbaldini",
          "Danielle"
        ],
        "customerProfilePictures": [
          "https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif"
        ],
        "customerRatings": [
          "5.0 out of 5 stars",
          "5.0 out of 5 stars",
          "5.0 out of 5 stars",
          "5.0 out of 5 stars",
          "4.0 out of 5 stars",
          "2.0 out of 5 stars",
          "5.0 out of 5 stars",
          "5.0 out of 5 stars"
        ],
        "customerReviewTitles": [
          "Good",
          "Smaller then I expected.",
          "Cute",
          "Great for Among US themed birthday party",
          "They are good for what they are.",
          "They don't separate into two pieces",
          "Among Us is among us",
          "Worked out great"
        ],
        "customerReviewBodies": [
          "Bought them for my sons birthday party goody bags, it works for what we needed them for.",
          "Smaller then expexted",
          "Cute for kids, recommend",
          "Used as a birthday cake topper and party favor for kids who all had an opinion on which color character they wanted in their slice of cake. Was really cute and the right size. One of the \"hats\" would not go on because the attachment hole was not big enough, otherwise details and colors were great.",
          "I bought these to use in Easter eggs and they were perfect for it. Everyone loved them and the fact that the accessories are mix and match was very nice. They're decent quality but nothing fancy.",
          "The lines around the figurines are pointless and deceptive; the figurines are a single piece and do not separate into a \"dead body with a single bone sticking out\". The description does not claim this is the case, but it is written in bad English, so that plus the line around the figurines gave me hope that the pieces would separate. I'm highly disappointed. However, aside from that, they are cute, and the hats/headgear are game classics; for $12, it's not a bad deal.",
          "Grandson loves these. I had a 600 plus Easter Egg Hunt for the kids thus year and bought 2 sets to put in th plastic eggs. Nuce that ea h one was in an individual bag. This way the little add on piece didn't get lost in the grass during the hunt. Note: they are tiny. Not for little ones.",
          "I ordered these to go on my son's birthday cake. They are the perfect cake topper or cupcakes topper size, the best was my son could remove them and now has new toys."
        ]
      }
    },
    {
      "id": "iNxO2xy",
      "title": "Among Us Mini Figures",
      "price": "$9.79",
      "image": "https://m.media-amazon.com/images/I/617ANtfux3L._AC_SY355_.jpg",
      "description": "Surprise the biggest Among Us fans with the smallest mini figures. Each blind box comes with one random 2\" Among us mini figure. It makes opening each minifigure an exciting surprise. Collect all 18 Among Us mini figures. Each purchase is for ONE mini figure, not an entire set.",
      "reviews": {
        "customerProfileNames": [
          "Troy",
          "CindyLBurke",
          "Sarah",
          "LauraFunderburgh",
          "JuanMoreno",
          "Lex.DD",
          "Lin",
          "bri"
        ],
        "customerProfilePictures": [
          "https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif"
        ],
        "customerRatings": [
          "5.0 out of 5 stars",
          "5.0 out of 5 stars",
          "1.0 out of 5 stars",
          "5.0 out of 5 stars",
          "5.0 out of 5 stars",
          "5.0 out of 5 stars",
          "5.0 out of 5 stars",
          "1.0 out of 5 stars"
        ],
        "customerReviewTitles": [
          "Its only 1 figure",
          "Surprises",
          "Deceiving. You only get 1 figure.",
          "Grandson loves these Characters",
          "This item only comes with ONE figurine! READ the item description!",
          "Cake topper",
          "Grandsons birthday",
          "Not worth the $$$"
        ],
        "customerReviewBodies": [
          "Its only 1 random figure",
          "I thought you got all 18 figures and found out you only got 1 figure",
          "I ordered this for my sons birthday thinking it was multiple figures. Turns out it’s only one. Big disappointment. They need to change the advertising title.",
          "Felt the item is a bit pricey. But my grandson. Is enjoying his new toy.",
          "My figurines were delivered a bit late, but I guess it was worth the wait! Ignore the negative reviews because obviously people who gave it low stars didn’t read the item description! 😡😤 $7.99 for a whole set? That would be too good to be true in my opinion! Yes I agree that the price is a bit high for these little guys but honestly that’s what you pay for if you were to find them at the mall and at places such as Brad’s Toys & Collectibles. This item only comes with ONE figurine and it’s a complete mystery on what character you may receive! That’s what makes this item enjoyable and exciting to find out who you got! Overall, I’m happy with my purchase! 😊🤭🤭",
          "This was going to be used for cake decorating but I missed that it was just 1 minifig. We used as a topper. Expected quality.",
          "Grandson Loved them!",
          "The advertising picture is misleading; it shows many little charators and I only received ONE LITTLE about an inch high charactor for $10 was a joke. NOT WORTH IT!!! it looks like something that cost .05 to make. NEVER AGAIN will I order from this company!!!"
        ]
      }
    },
    {
      "id": "f5JjHi9",
      "title": "Among Us Neon Sign for Wall Decor, Cool Led Neon Lamp USB&Batteries Powered, Neon Lights for Bedroom,Game Room Decoration,Gamer Gift,Party,Club,Bar",
      "price": "$21.99",
      "image": "https://m.media-amazon.com/images/I/81DTLxve1kL._AC_SX425_.jpg",
      "description": "About this item\n[High-quality Neon Material] Neon lights are made of upgraded PVC materials, characterized by better lighting effects, lower temperature and strong light transmittance. After testing, neon signs have a much longer life than ordinary lights and can be used continuously for tens of thousands of hours!\n[Safer&Lower Energy Consumption] The excellent electrode system makes the neon light sign consume very little power even if it is turned on all day and all year. In addition, high-quality insulated cables are used to ensure the absolute safety of family and children.\n[Operation and Specifications] Size: 10.15inch*7.2inch. Powered by insert USB interface or 3 AA batteries (choose one). Equipped with long wires, holes and adhesive hooks to hung it on the wall more conveniently.\n[First Choice for Gifts and Decorations] neon lights signs are exquisite gifts for close friends and children on Christmas, birthdays, parties, performances, etc., creating an interesting, and relaxing environment. Very suitable whether it is for holidays, gifts or decorating your own beautiful room.\n[After-sales Guarantee] You can contact us for any questions about DIY neon sign, and we are guaranteed to give you a satisfactory result.",
      "reviews": {
        "customerProfileNames": [
          "Phaaam",
          "SKhan",
          "EmilyDavison",
          "Mariana",
          "LindaLee",
          "BrianP.",
          "MarieLove",
          "Unbroken"
        ],
        "customerProfilePictures": [
          "https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif"
        ],
        "customerRatings": [
          "5.0 out of 5 stars",
          "5.0 out of 5 stars",
          "5.0 out of 5 stars",
          "5.0 out of 5 stars",
          "4.0 out of 5 stars",
          "5.0 out of 5 stars",
          "5.0 out of 5 stars",
          "1.0 out of 5 stars"
        ],
        "customerReviewTitles": [
          "Good product",
          "Kids love it",
          "Awsome my kid loves it",
          "My daughter loves it",
          "Okay",
          "Lookin sus in a good way",
          "Nice and bright",
          "Dangerous and broken"
        ],
        "customerReviewBodies": [
          "Really amazing product. Came with adhesive piece so you don't need to put holes in your walls. Bright and vibrant color. Really helps set a comforting and relaxing atmosphere.",
          "This was the perfect gift for my son. This stays lit at night so it illuminates the room enough for not needing a night light.",
          "My child loves it gonna hang it in his new room at the house we just biught",
          "My daughter loves everything unicorn at the moment. She loves it",
          "Not as large as expected but cute",
          "Cute cute cute",
          "Kids love it\nIt’s super bright",
          "I was pretty excited getting this because it looked pretty good. When I got it, I tried putting batteries in it but It wasn't turning on. I even tried plugging it into my computer. It wasn't working at all and then smoke started to come out of it, this was really dangerous and really stupid."
        ]
      }
    },
    {
      "id": "7Pp4H7y",
      "title": "Among Us Plush Buddies | Four 1-Foot-Tall Huggable Among Us Plushie Collectibles | Playable Among Us Toys | Among Us Kids’ Toys by P.M.I. | 12 Inches - Knighted Knight - Orange",
      "price": "$29.99",
      "image": "https://m.media-amazon.com/images/I/71XKHtT05NL._AC_SY355_.jpg",
      "description": "A whole bag of Among Us plush toys is a great gift idea, especially if your or your friends’ children like the game. It will also come in handy if you’re looking for simple Among Us birthday party supplies, and it can even be used as Among Us party decorations. Get the right pack to help a young Among Us enthusiast complete their collection or start one from scratch. Perhaps, an adult Among Us plushies collector will appreciate the gift, too.",
      "reviews": {
        "customerProfileNames": [
          "NickOstrowski",
          "HeidiRaetzTedhams",
          "Flor",
          "SageL.Arnell"
        ],
        "customerProfilePictures": [
          "https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif",
          "https://images-na.ssl-images-amazon.com/images/S/amazon-avatars-global/c1afd56a-66eb-47a4-9979-c7de6c3584db._CR62,0,375,375_SX48_.jpg"
        ],
        "customerRatings": [
          "5.0 out of 5 stars",
          "4.0 out of 5 stars",
          "5.0 out of 5 stars",
          "5.0 out of 5 stars"
        ],
        "customerReviewTitles": [
          "Greatest toy ever",
          "Cute for my Amongus obsessed son",
          "It is a good plush. I love it and will probably get the whole collection for my son!",
          "Perfect collector or kid cuddly"
        ],
        "customerReviewBodies": [
          "Item will come in original packaging. Packaging will be damaged.",
          "This is the greatest toy ever!!!!! It’s so sus!!",
          "Cute and cuddly among us plush. My son easily ripped the hat off on the first day (only attached at two points) so I gave it 4 stars for quality there. Otherwise he loves it!",
          "Amazing quality! Highly recommend product!"
        ]
      }
    },
    {
      "id": "LmMkVME",
      "title": "Among Us Crewmate Figure with Stamper | 4.5-Inch-Tall Among Us Toy + 3 Hidden Accessories| Among Us Party Favors and Playable Collectibles | Unique Impostor with Teeth and Tongue| by P.M.I.",
      "price": "$19.99",
      "image": "https://m.media-amazon.com/images/I/71ZW8lzO4-L._AC_SY355_.jpg",
      "description": "One of a whole set of Among Us toys for kids / kids’ stamps to play with, start a collection, or throw an AmongUs theme party! ✔ A crewmate figure / stamper in a window box:purple impostor with the mouth open, showing the teeth and the tongue4.5-inch-tallauthentic, minimalistic design with the classic backpack and visorstamps on the bottom of each figure match the character on top of them3 hidden hats and accessories in the boxthe hats are detachable and replaceablethe accessories (depending on the box) may include the most iconic hats, like the cheese, the plunger, and the brain slug",
      "reviews": {
        "customerProfileNames": [
          "Ceci",
          "StephanieS",
          "Amanda",
          "Monica",
          "CatheanneLong",
          "Muffychan7",
          "almafuentes",
          "RhondaM.Westrup"
        ],
        "customerProfilePictures": [
          "https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif"
        ],
        "customerRatings": [
          "5.0 out of 5 stars",
          "5.0 out of 5 stars",
          "5.0 out of 5 stars",
          "5.0 out of 5 stars",
          "5.0 out of 5 stars",
          "5.0 out of 5 stars",
          "5.0 out of 5 stars",
          "5.0 out of 5 stars"
        ],
        "customerReviewTitles": [
          "Purple Amongus",
          "My kids loved them!!!",
          "Awesome figure",
          "Excellent",
          "",
          "Get toy",
          "My kid loves it",
          "Fue regalo",
          "",
          "Gift"
        ],
        "customerReviewBodies": [
          "This one was an affordable price.",
          "Bought as a gift for my kiddos, and they absolutely loved them! They liked the figures themselves, and then when I showed them they also were stampers, the excitement scale increased even more! I would definitely buy again!",
          "Got this for my nephew for Christmas and he absolutely loves it",
          "A mi hijo le encanto",
          "",
          "My son loved this it has the cheese so he could make his character just like what he plays with online.",
          "My kid loves Among Us and I'm glad it has been durable to last my child.",
          "Fue regalo para mi niño le encanto",
          "",
          "Hadn’t been give yet as a gift. Was a request",
          "I haven't opened them as they're a gift for my son but I am shocked at how big they are. Very cool, I'm excited to see how they stamp.",
          "My son loved it! Excellent quality and its bigger then I expected. Fast shipping 👍🏻",
          "Bought this for my son for Christmas and he loved it\n\nQuality is super nice. Good for kids that love among us",
          "Mon fils était très content",
          "",
          "In good condition and looks awesome."
        ]
      }
    },
    {
      "id": "iMpGQXR",
      "title": "UPD Black Among Us Fleece Blanket - Warm and Cozy Among Us Fleece Throw Blanket for Kids, Soft Among Us Plush Throw Snuggle Blanket for Girls and Boys Bedroom - Size 45x60 Inch, Multicolor",
      "price": "$14.80",
      "image": "https://m.media-amazon.com/images/I/61xSadH5CaL._AC_SX450_.jpg",
      "description": "Get comfy on the couch and have a good night's sleep with the Among Us Fleece Plush Throw Blanket! This warm fuzzy throw blanket would also be perfect to use for traveling and camping with its thick, fluffy soft fleece, and a great addition to your kids bedroom décor. The Among Us snuggle plush blanket is the perfect gift for your little player. Kids would enjoy naps and bedtime with the Among Us plush blanket. Among Us fans and players of the game would love to add this Among Us blanket to their themed bedroom. Snuggly, warm kids fleece blanket to cover them in cold weather and make them feel safe to have a good night's sleep. Snuggle with the soft plush fleece fabric of the Among Us throw blanket! The Among Us fleece kid blanket is perfect for your little player to curl up with on their bed and the living room couch or sofa. Throw on a Among Us plush chair. Everyone would love to add this fleece throw in their bedding, couch, sofa, and or baby's crib with its Among Us spaceship crewmember characters pattern. Comfortable soft fleece Among Us security blanket for your little kid to help them feel secure have a good night's sleep on their own bed. The Among Us Fleece Throw Blanket is made of premium quality fleece fabric with design that does not fade with gentle washing cycle. A fluffy soft, thick, and nice security and kids couch blanket they would enjoy cuddling with while watching TV or reading their bedtime stories. To maintain the fleece Among Us fuzzy blanket, line dry and wash in cold water and gentle cycle. Includes 1 Among Us Fleece Kids Throw Blanket that matches your Among Us bedroom or couch. Adorable black fleece blanket patterned with Among Us portly characters in spacesuits and small backpacks kids would treasure. The Among Us blanket measures 45x60 inches—the size fitting for kids to curl up to on the couch or the bed. The kids throw blanket is recommended for 3 years of age and above.",
      "reviews": {
        "customerProfileNames": [
          "Karisa",
          "VickiBurghen",
          "LeaJovanovski",
          "DerrickFrancis",
          "HollyDunn",
          "StephanieS",
          "KarenWebber",
          "AngelicaVela"
        ],
        "customerProfilePictures": [
          "https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif",
          "https://images-na.ssl-images-amazon.com/images/S/amazon-avatars-global/e03df7fc-778d-457d-8d6a-90bb3f4f3b38._CR0,93.0,497,497_SX48_.jpg"
        ],
        "customerRatings": [
          "5.0 out of 5 stars",
          "5.0 out of 5 stars",
          "5.0 out of 5 stars",
          "5.0 out of 5 stars",
          "5.0 out of 5 stars",
          "5.0 out of 5 stars",
          "5.0 out of 5 stars",
          "5.0 out of 5 stars"
        ],
        "customerReviewTitles": [
          "Nice",
          "It is lightweight but very nice!!",
          "My son is obsessed",
          "great gift",
          "Soft",
          "Cute and soft",
          "Nice Birthday Gift",
          "Used them as center pieces"
        ],
        "customerReviewBodies": [
          "My daughter brought this as a gift to a birthday party. It’s a kid size blanket and it’s not super soft. It’s more pretty to look at than anything.",
          " This is a very nice blanket. It is a little lightweight but it is a throw blanket, so I think its okay. I am gifting this to my friend, so I will edit and give her opinions on it soon.",
          "My 3 year old LOVES among us, he takes this blanket with him everywhere and sleeps with it every night",
          "son loves it",
          "Daughter loves it",
          "My kids love them. They’re lightweight and are throw blankets, so don’t expect a big bulky comforter. I would buy again. My kids love curling up with these on the couch for movie nights.",
          "Very nice blanket. The design is nice with the Among Us characters on it. Bought it for my son's birthday. He's definitely going to love sleeping with it.",
          "Everyone was asking if I had any left! They are soft and warm and pretty big in size. Absolutely worth it."
        ]
      }
    },
    {
      "id": "8g-dkrH",
      "title": "Garagadella Fleece Throw Blanket for Among Us Lover,330GSM 60inchx80inch Oversize Soft Warm and Cozy Flannel Throw Blanket for Girls and Boys Gifts (330GSM Flannel Throw)",
      "price": "$29.99",
      "image": "https://m.media-amazon.com/images/I/81GkEAW5SWL._AC_SY450_.jpg",
      "description": "1.60*80inchs(150*200cm) big size super soft and plush blankets suitable couch bed office, for adults and children.  2.This fleece throw blanket for kids is single-sided printing, super soft high-quality fabric on the outside, white on the inside is the best gift for family or friends. 3.The kids flannel blanket is Lightweight makes it easy to store and carry with.Suitable for sofa, bed, camping, cold movie theater or take it in the car for short or long road trips,available in all seasons.  4.Washing: machine wash, hand wash, quick drying, easy to take care of. 5.If you have any questions about our couch blankets, please contact us by email and we will fix them for you within 24 hours.",
      "reviews": {
        "customerProfileNames": [
          "Frances",
          "AshleyHolcomb",
          "Jen",
          "ZaroCelebrations",
          "MindyArnold"
        ],
        "customerProfilePictures": [
          "https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif"
        ],
        "customerRatings": [
          "5.0 out of 5 stars",
          "5.0 out of 5 stars",
          "1.0 out of 5 stars",
          "5.0 out of 5 stars",
          "5.0 out of 5 stars"
        ],
        "customerReviewTitles": [
          "Awesome",
          "Awesome blanket",
          "fabric pilling",
          "A favorite in our house!",
          "Really soft!"
        ],
        "customerReviewBodies": [
          " I brought this for my son birthday it came back seal and as you can see in the video it's huge he loves it and he's always cold so yeah so soft. Would recommend and buy again I wonder if they have others blankets other than among us.",
          "This blanket is awesome super good quality definitely worth the money.",
          "I bought this for my son’s birthday because he loves among us plush so much. But I was so disappointed in that because after I washed it, there’s lots of fabric pilling on it. Then I washed it again, it came up with much more fabric pilling. Won’t give it to him for sleeping.",
          "This blanket is so, so, so soft! Our kids love their new blankets. They also love among us characters. It’s absolutely perfect! I don’t mind saying that I steal one of them now and then when I’m on the couch and need a little bit of warmth. The super soft fabric is amazing!",
          "I bought this as a birthday present for a 7 year old boy. He loved it!!!!!"
        ]
      }
    },
    {
      "id": "0rFHJmU",
      "title": "Kids Blanket GRUSEMI Kids Blanket Gifts The Child Plush Travel Throw Blanket Bedding 40 X 50 Inch",
      "price": "$18.98",
      "image": "https://m.media-amazon.com/images/I/71K5hwXEyKL._AC_SY450_.jpg",
      "description": "About this item\nCrafted for comfort, this playful throw featuring will instantly become a bedtime favorite. The lightweight and easy-to-carry throw is the perfect companion for easy sleepovers, camping, traveling, and playing.\nSoft Flannel Fabric, Keeps You Warm and Cozy All Year Long. Features Blanket in reads \"Mihty\" \"Alii\", \"Wendell\" \"Eric\", Perfect gifts for teen girl and teen boy.\nThis 50* 40 inch blanket non-fading, the ultra-soft blanket that can be used as air-conditioning quilt, wearable blanket, sofa blanket, bed blanket, travel blanket, picnic mat and many other functional blankets.\nSurprise Gift: This stylish and innovative is a perfect gift for child, or someone you loved. Suitable for parties, camping, various festivals, various scenes.\nEasy Care: The throw can be tossed into the washer and dryer without worrying about the color fading or the need for ironing. The material is wrinkle-resistant making it a great choice for any child's room.",
      "reviews": {
        "customerProfileNames": [
          "jessicasamanie",
          "lynnprice",
          "SunshineMel",
          "T.Kulupka",
          "KFurr",
          "ChuchWestra",
          "RobinWilson",
          "MeghanElmore"
        ],
        "customerProfilePictures": [
          "https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif"
        ],
        "customerRatings": [
          "5.0 out of 5 stars",
          "5.0 out of 5 stars",
          "5.0 out of 5 stars",
          "5.0 out of 5 stars",
          "5.0 out of 5 stars",
          "5.0 out of 5 stars",
          "5.0 out of 5 stars",
          "5.0 out of 5 stars"
        ],
        "customerReviewTitles": [
          "Absolutely LOVE it",
          "Soft & Cozy",
          "Cuddly soft and adorable",
          "Soft",
          "So soft!!",
          "\"Merch\"",
          "So soft",
          "Well Made"
        ],
        "customerReviewBodies": [
          "My grandson loved this blanket. It is so soft and very bright in colors. He takes it every where he goes and has a fit if he forgets it. I may have to order a second one as back up just in case.. :)",
          "My grandson, is an Among Us fanatic. I bought this for his 6th birthday and he absolutely loves it.\nHis response to the gift was priceless! “This is the best gift ever, thank you Oma ! (Grandma in Dutch)”",
          "Best blanket ever. I admit that I am completely obsessed with baby Yoda. I could not resist this adorable blanket. It is super soft and has baby Yoda all over it. The colors are as expected and it is the right size for keeping in the front room to cover my legs and feet.",
          "Surprisingly soft and not like what I was expecting. I want to steal it from my 7yo.",
          "Perfect gift for my 8 yr old",
          "It was a perfect gift for a fan!",
          "10 yr old birthday girl loved it. Was the envy of all the girl Scouts.",
          "Well made and extremely soft. Very pleased!"
        ]
      }
    },
    {
      "id": "p_I6Mky",
      "title": "Among U& Us Game Plush Crew Toys(12 Packs)-Built in Sound Toy,Game Figures Plush Animal Toy Merch Gift for Adult Kids",
      "price": "$29.99",
      "image": "https://m.media-amazon.com/images/I/71ssaeujkLL._AC_SY355_.jpg",
      "description": "About this item\nQUALITY GUARANTEED:This toy is made of high-quality soft short plush, filled with PP cotton, good resilience and feels comfortable, skin-friendly and fluffy.\nSOUNDER DESIGN:All small toys have a built-in plastic BB sounder, no battery is needed, just a light pinch will make a \"chirp\" sound.\nSMALL & PORTABLE:The size of this plush toy is about 3.93 inches, small and exquisite, mini cute, very easy to carry, you can put it by your side and enjoy the fun it brings to you anytime, anywhere.\nWIDELY USED:It can be decorated in the bedroom, living room, car,office, adding a warm atmosphere to your space, or as a decompression doll, when you are upset, pinch this little plush toy to release stress.\nIDEAL GIFT:This plush toy is very cute. Its design is inspired by famous games, It is an ideal gift for game fans, and it is also the best choice for children and friends as a holiday party gift.",
      "reviews": {
        "customerProfileNames": [
          "DANNYV",
          "Rodrick",
          "Tacha",
          "bernadette",
          "ChristopherWells",
          "Brian\"SpookYouLaterz\"Lubecki",
          "Omnicess",
          "LawyerMom"
        ],
        "customerProfilePictures": [
          "https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif",
          "https://images-na.ssl-images-amazon.com/images/S/amazon-avatars-global/17f8bc3d-96ea-44f0-bd49-46c1011ece7f._CR109,0,281,281_SX48_.jpg",
          "https://images-na.ssl-images-amazon.com/images/S/amazon-avatars-global/ac936a7c-186e-4c21-9277-7c31d1d2ab5e._CR16,0,467,467_SX48_.jpg"
        ],
        "customerRatings": [
          "5.0 out of 5 stars",
          "5.0 out of 5 stars",
          "5.0 out of 5 stars",
          "5.0 out of 5 stars",
          "5.0 out of 5 stars",
          "5.0 out of 5 stars",
          "5.0 out of 5 stars",
          "5.0 out of 5 stars"
        ],
        "customerReviewTitles": [
          "Muy bien",
          "Fun set!",
          "Big pack to divide - liked by a wide age range",
          "Awesome mix",
          "The whole crew!",
          "So cute, and they squeak!",
          "Fantastic Little Toys",
          "Adorable"
        ],
        "customerReviewBodies": [
          "Excelente",
          "Anybody who is a fan of Among Us! will love this set. It comes with (I think) every color of the in game characters. This is great for both collecting and even for handing out at a party so each guest can be their favorite color character. The are small and cute and a great size that can easily be held in your hand. They look just like the ones from the game. When you squeeze them and make the sound exactly like a dog‘s squeaky chew toy.",
          " When these arrived, my kids fought over who would get these. Somehow, these little plush crew toys captured the imagination of my 10, 11, and 14-year-old. Luckily, there's plenty in the bag and the fight was limited over who would get which color. They are small-sized plushies (they fit in the palm of my hand) and are great for pretend play. Everybody has their own crew. The squeeking drives me crazy, but at least I know they are being played with. Check out the video I uploaded to hear the noise these plushies make. These plushies are quite soft. It seems they used a good quality of materials and did a good job on the stitching. I just had to cut of the little white tags and they were good to go. These would work well as party favors for birthdays.",
          "The are adorable and the colors are so vibrant. Took a couple of hours to full expand since they do come vacuumed, but the squeaky noise works just great. Perfect for fans of all ages.",
          "My oldest daughter is 7y and is in love with all things among us. For this whole set for her and she pretends with them 24/7. Finding the \"sus\" one and who killed who lol",
          "These mini plush Among Us crew mates are so cute! They are soft, and they squeak too! My kids think these are so funny and even my dogs love them!",
          "I don't know why I missed it but I didn't know these came with their own squeaky noises, like a pet toy.\n\nThe sound they make is fun and my kid loves it.\n\nThe construction/material used to make these is great..\n\nI like the aesthetic of these and the overall value here is obvious to me.",
          "The little squeeze sound inside each plushie is pretty lame — sounds like the sound from a rubber duck or a dog chew toy. But the plushies are a good size, about the size of my fist, the sewing and fabric look well done and god quality. The colors are vibrant, and although a couple of the greens are close in shade, they are all different colors from one another. I would definitely purchase this item again.\n\nIf you have questions or found this review helpful, please let me know!"
        ]
      }
    },
    {
      "id": "kLNakFR",
      "title": "Pop Bubble Fidget Toys, 5PCS Pop Pop Fidget Sensory Push Toy for Boys and Girls, Stress Relief and Anti-Anxiety Tools for Kids and Adults",
      "price": "$6.99",
      "image": "https://m.media-amazon.com/images/I/81UJ+9+KXKS._AC_SY355_.jpg",
      "description": "We're just trying to get a little relief in these crazy years of 2020 and 2021. When we press the bubbles down, they make a slight popping sound, then flip over and start all over again.",
      "reviews": {
        "customerProfileNames": [
          "JPT",
          "RQ13",
          "Shilafamily",
          "alyssa",
          "B.B.",
          "SavannahTakhtay",
          "Jaime",
          "SuzanneSarhan"
        ],
        "customerProfilePictures": [
          "https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif"
        ],
        "customerRatings": [
          "5.0 out of 5 stars",
          "5.0 out of 5 stars",
          "5.0 out of 5 stars",
          "5.0 out of 5 stars",
          "5.0 out of 5 stars",
          "5.0 out of 5 stars",
          "5.0 out of 5 stars",
          "5.0 out of 5 stars"
        ],
        "customerReviewTitles": [
          "Great quality, awesome price",
          "Bizarre packaging, but great Pop It’s",
          "10/10 purchase",
          "great for kids",
          "Among Us Pop fidget",
          "Great product, quick delivery",
          "Fun",
          "Nice colors"
        ],
        "customerReviewBodies": [
          "Love these! Big hit at my son’s party in the kids’ treat bags. I bought Among Us pop it’s for my other son’s party 6 months ago for the same price and these are much nicer! Double the size of the other ones too! I was surprised at how big they are! Couldn’t be happier with these.",
          "These are definitely really sturdy pop it’s! The only thing that caught me off guard was how it shipped. It was put in a zip tight bag that was see-through and that was so bizarre because anybody could have just opened this and stole it. Other than that, great quality!",
          "🙌love the pop it. my niece also loved it but I had to keep one for myself.",
          "my daughter loves amoung us and fidget toys thought id try these and she always has 1 with her",
          "I got them for gift bags for my class. They love fidgets and Among us. Very sturdy. Great bubble pop.",
          "Cannot complain about anything. Order arrived quickly. Each item was separately wrapped and came in great condition",
          "My son really likes these and they are great quality",
          "Fun and colorful"
        ]
      }
    },
    {
      "id": "t6jDP6U",
      "title": "Talking Plush Toys, 7 Inch Walking Singing Plushies, Repeating and Recording, Cute Bulging Eyes Figure Gifts for Game Fans and Kids Birthday Christmas Party Supplies (Red)",
      "price": "$17.99",
      "image": "https://m.media-amazon.com/images/I/717mHM6MtQL._AC_SY355_.jpg",
      "description": "About this item\n❤️ Talking plush toy: The recording and talkback feature allows the toy to imitate what you say with a cute voice, whether you are laughing, singing or talking to anyone. Speaking close to it, the repetition will be clearer and the phrase will repeat better.\n❤️ Singing Stuffed Animals: The plush toy can sing up to 60 children's song, making them the perfect interactive educational toy for kids. The buttons are designed to be easy to use, even children can easily operate this singing plush toy.\n❤️ Healthy and Safe Material: The Plush toys are made in China, using high-quality short plush, pp cotton filling, non-toxic and harmless, hand-sewn high-quality plush toys, soft and comfortable. The size of plush music toy is also is also tailored to children, it is about 7in tall and weighs about 0.3 lbs, which is perfect for kids to play with.\n❤️ The Perfect Gift for Kids: The plush toy has a cute among us image, and has many functions such as walking, singing, talking, etc. This toy will bring endless joy to your children and is perfect friend to accompany your children's growth. Moreover, it is the perfect Christmas and Birthday Gifts for Boys Kids Babies and Teens.\n❤️ After-sale service: You will get Talking Plush Toys (Batteries are not included) and up to 6 months no reason to return or exchange goods, if you have any quality problems, please feel free to contact us and we will reply you within 24 hours and provide a satisfactory solution so that you can buy with confidence.",
      "reviews": {
        "customerProfileNames": [
          "CherylHaury",
          "kelvynArielGuzman",
          "Logan",
          "MonetA.",
          "Rickey",
          "Hi",
          "S",
          "Claudia"
        ],
        "customerProfilePictures": [
          "https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif"
        ],
        "customerRatings": [
          "5.0 out of 5 stars",
          "5.0 out of 5 stars",
          "4.0 out of 5 stars",
          "5.0 out of 5 stars",
          "5.0 out of 5 stars",
          "5.0 out of 5 stars",
          "5.0 out of 5 stars",
          "5.0 out of 5 stars"
        ],
        "customerReviewTitles": [
          "My grandson loves it. We sit together and play and laugh and laugh",
          "Excelente,, descripción",
          "Amazing Product",
          "Toddler LOVES mom needs a DRINK",
          "Super cute",
          "I Lived",
          "Cute unicorn",
          "AMAZING LOVE IT (SUPER SUSSSY"
        ],
        "customerReviewBodies": [
          "It is used to play with and it is so much fun.",
          "Excelente",
          "This product is wonderful and was changed my life for the better. However there is no volume control and it is extremely loud. I would not buy for young children because of this reason.",
          "This was gifted to my baby yoda loving 3 year old. It’s cute and she loves it but it’s very loud and needs to be manually shut off under the shirt or it will repeat everything it hears. Also lots of Christian songs which is good for us but maybe not everyone.",
          "My niece loved it. Has many different songs. Walks great. Definitely child friendly. Arrived early. Needs batteries.",
          "Before seeing this, I was about to off myself. I didn't want to live anymore, and had no reason to. Then, I found this. Talking Among Us Plush Toys with Battery was the greatest thing I have ever saw. After seeing this, I knew I had to keep going. I got in shape, got a gf and life is overall happy now thanks to Talking Among Us Plush Toys with Battery.",
          "It wabbles as it repeats what you say. Best on a hard surface. If you push the foot it can play several different songs for you. My daughter loves her unicorn. Fun toy, batteries not included.",
          "I LOVE IT AMONG US SUSSY"
        ]
      }
    },
    {
      "id": "f94UMX0",
      "title": "Among U& Us Game Plush Crew Toys(6 Packs)-Built in Sound Toy,Game Figures Plush Animal Toy Merch Gift for Adult Kids",
      "price": "$19.99",
      "image": "https://m.media-amazon.com/images/I/71OH3fvPtQL._AC_SY355_.jpg",
      "description": "About this item\nQUALITY GUARANTEED:This toy is made of high-quality soft short plush, filled with PP cotton, good resilience and feels comfortable, skin-friendly and fluffy.\nSOUNDER DESIGN:All small toys have a built-in plastic BB sounder, no battery is needed, just a light pinch will make a \"chirp\" sound.\nSMALL & PORTABLE:The size of this plush toy is about 3.93 inches, small and exquisite, mini cute, very easy to carry, you can put it by your side and enjoy the fun it brings to you anytime, anywhere.\nWIDELY USED:It can be decorated in the bedroom, living room, car,office, adding a warm atmosphere to your space, or as a decompression doll, when you are upset, pinch this little plush toy to release stress.\nIDEAL GIFT:This plush toy is very cute. Its design is inspired by famous games, It is an ideal gift for game fans, and it is also the best choice for children and friends as a holiday party gift.",
      "reviews": {
        "customerProfileNames": ["LarryRaddatz", "L", "Nicole"],
        "customerProfilePictures": [
          "https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif"
        ],
        "customerRatings": [
          "5.0 out of 5 stars",
          "5.0 out of 5 stars",
          "5.0 out of 5 stars"
        ],
        "customerReviewTitles": [
          "They're like dog toys with a squeaker.",
          "Kid loved it",
          "Small but Cute"
        ],
        "customerReviewBodies": [
          "I bought for birthday treat bags. I didn't realize they were like dog toys.",
          "Kid loved it, good enough for me man",
          "They’re a little smaller than I was expecting but my kid loves them. Also, likes to throw them as well. Feels like you’re being hit with balled up socks.",
          "Los imaginaba más pequeños pero están de buen tamaño y calidad",
          ""
        ]
      }
    },
    {
      "id": "xcgUvgt",
      "title": "IUTOYYE 9.8 Inch Axolotl Plush Astronaut Among Stuffed Animal Cute Pink Wing Plushie Doll Toy Cosplay Prop Merch for Game Fans (Pink)",
      "price": "$19.99",
      "image": "https://m.media-amazon.com/images/I/61bzd2YKjJL._AC_SY355_.jpg",
      "description": "About this item\n【Product Size】Salamander doll size is 9.8inch/25cm, it is very suitable for hugging, You can take it to any place you want, and it will accompany you like a friend. (there may be an error of 0.5-1inches).\n【High Quality Material】This cute pink plush doll is made of high quality short plush material, which is soft to the touch, safe, odor-free and skin-friendly. The interior is filled with elastic PP cotton, which has strong resilience and is not easy to deform.\n【Unique Design】The unique design with pink fabric makes the doll more cute. Soft touch, let people put it down.\n【Multiple Uses】Not only can be used as a plush toy, but also can be used as a sleeping pillow, a baby's soothing doll, and accompanying children to play.\n【Gift】This doll is perfect as decoration in office, library, bedroom and living room. Dolls with unique shapes are also the best gifts for birthdays, parties, Halloween, Christmas, Valentine's Day.",
      "reviews": {
        "customerProfileNames": ["Customer", "Sandra"],
        "customerProfilePictures": [
          "https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif"
        ],
        "customerRatings": ["5.0 out of 5 stars", "5.0 out of 5 stars"],
        "customerReviewTitles": [
          "My son loves it.",
          "Great quality, worth the money"
        ],
        "customerReviewBodies": [
          "Loves it because it is soft -and size.",
          "My son absolutely loves his plusses, very well made, will definitely be ordering more"
        ]
      }
    },
    {
      "id": "TOjGiYs",
      "title": "Among Us Official Toikido Yume Inflatable Cosplay Costume Crewmate - Adult One Size Fit All - Red,19471",
      "price": "$78.99",
      "image": "https://m.media-amazon.com/images/I/71n-m2+2+pS._AC_SY355_.jpg",
      "description": "Introducing The Official Branded Cosplay Of Hit Multiplayer Game Among Us. Create A Big Impact With This Inflatable Bean-Shaped Crewmate Or Impostor Costume. Available In 4 Colors: Red, Yellow, Pink And Black. The Suit Self-Inflates In Minutes, Using The Included Battery-Operated Fan. One Size Unisex Costume Fits Adults Up To 5Ft 9In / 180Cm Tall, With Slits In The Side Of The Suit For Hand Movement And An Easy-To-Use Zipper. Made From Breathable And Comfortable Polyester Material, The Suit Includes The Iconic Crewmate Visor In Metallic Pvc Material, With Clear Visibility Out, And Mirrored Effect So Crewmates Will Not Be Able To Identify You. The Ideal Cosplay For Gaming Fans. Surprise And Delight For All Funny Holidays: Christmas, Halloween, Easter, Thanksgiving, Cosplay Party, April Fools' Stag, Bachelor Party. The Among Us Costumes Also Make Great Holiday Gifts. Batteries Not Included 4 X Aa Batteries Required. Spot Clean Only.",
      "reviews": {
        "customerProfileNames": [
          "GavinNickolas",
          "IsaiahKittles",
          "CaylaSteeples",
          "PrimeShopperIN",
          "Wolf",
          "DerrickSpearman",
          "Taaliyah",
          "Jason"
        ],
        "customerProfilePictures": [
          "https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif",
          "https://images-na.ssl-images-amazon.com/images/S/amazon-avatars-global/de1b01b3-0cc1-462f-b3f5-a5297f4911ac._CR31,0,437,437_SX48_.jpg"
        ],
        "customerRatings": [
          "5.0 out of 5 stars",
          "5.0 out of 5 stars",
          "5.0 out of 5 stars",
          "5.0 out of 5 stars",
          "5.0 out of 5 stars",
          "5.0 out of 5 stars",
          "5.0 out of 5 stars",
          "5.0 out of 5 stars"
        ],
        "customerReviewTitles": [
          "Sus",
          "when the imposter is sus 😈😈",
          "Sus",
          "Super fun",
          "Wore this to a convention 10/10 best thing ever",
          "Stole the show with this one",
          "Awesome!!!",
          "It's exactly what they say it is."
        ],
        "customerReviewBodies": [
          "Sus\nSus",
          " This costume is awesome. I wore it all night and had no problems. Didn’t even have to change the batteries once. Lots of people complain about the zipper breaking. It is a small zipper so that it isn’t visible so you have to be easy with it. That’s costume 101! Easy to wash with a damp washcloth. Easy to store. I can’t wait for the next event. 10/10! AMONG US",
          " Super fun costume! My kid has an autism diagnosis and he thought it was great. Stays in place though my kid says walking at a normal pace makes it shake a lot & that adds to the fun. It’s not easy to see they person inside and he had no problem looking out of it. There are zipper slots for your hands but you’ll lose a bit of inflation if you use them. It’s really big & tall! If I had to guess, it’s maybe 7’ tall inflated.",
          "You may want to order the battery spring connector thing AA batteries use cause mine was missing one but I managed to salvage or borrow one out of something else I had around the house and then it worked just fine. Also when you wear this, I highly recommend you bring a towel with you and maybe a spare pair of AA batteries just for back up. You'll sweat in 60F weather in this in broad daylight cause your body heat will heat up the inside and cause the visor or window you look out to see to fog up like your windshield does when its cold outside and hot inside your car. Other than that, it was a blast to wear around.",
          "This had everyone cracking up. My 14 year old loved it! Its really big too so I could fit it too. Only this is the material isn’t that thick so she walked by a mailbox and ripped a hole in it.",
          " We love it! So funny.",
          "I'm 6'4\". It fit okay, kids love it. You gotta pay attention where the fan is or you might block the air flow. Well worth the money.",
          "Me gusto mucho pero no me gusto que no puedes sacar las manos",
          ""
        ]
      }
    },
    {
      "id": "Kkof4Sp",
      "title": "Among Us Stamps for Kids | 12 Among Us Stampers + 8 Accessories | Among Us Party Favors and Playable Collectibles | Among Us Toys for Boys and Girls | Mini Toys for an Among Us Party | by P.M.I.",
      "price": "$34.99",
      "image": "https://m.media-amazon.com/images/I/81AVkcCqewL._AC_SY355_.jpg",
      "description": "Get a whole set of stampers: Among Us toys for kids to play with, start a collection, or throw an AmongUs theme party!✔ Various selections of characters:12 figures in 1 deluxe box8 accessories included 3 figures are hidden (the impostors!): open the pack to find out which characters those arestamps on the bottom of each figure match the character on top of themthe figures come in different colors and with different hats and masksyou can even find the dead body (report it!)✔ These mini toys are collectibles:collect the total of 20 characters find the characters wearing the most iconic hats: the flower, the devil horns, the egg, and the toilet paperfind the six rarest crewmates: the cheese one, the crowned one, the one in a double top hat, the one with the brain slug on the head, the one wearing a plunger, and the unique impostor with the mouth wide open, showing huge sharp teeth and the spear-like tongue that crewmates are killed with!✔ Use these toys as Among Us party favorskids love to play with these Among Us toys for boys and girls togetherinspire children to have offline matches, figuring out which one is the impostor",
      "reviews": {
        "customerProfileNames": [
          "Rusty",
          "MontanaTracer",
          "TerryEllis",
          "TinaLamontagne",
          "Jeremy",
          "Customer",
          "JohanaGonzalez",
          "CARMENGARCIA"
        ],
        "customerProfilePictures": [
          "https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif"
        ],
        "customerRatings": [
          "5.0 out of 5 stars",
          "5.0 out of 5 stars",
          "5.0 out of 5 stars",
          "5.0 out of 5 stars",
          "3.0 out of 5 stars",
          "5.0 out of 5 stars",
          "4.0 out of 5 stars",
          "4.0 out of 5 stars"
        ],
        "customerReviewTitles": [
          "Totally Sus bro",
          "Was the perfect Christmas gift!",
          "Elf scavenger hunt",
          "Amazing value",
          "Read Carefully",
          "Love ❤️",
          "Lindos",
          "",
          "Cute"
        ],
        "customerReviewBodies": [
          "Comes with many mini accessories stamps work well",
          "He absolutely loved it and it was a bonus that they were also stamps!",
          "I had my elf hide these and my son had to find the imposter. He was sooooo thrilled. Cute cheap idea",
          "My son was so happy!",
          "The pros are that they are very detailed and a good size for kids to play with. Good quality construction.\n\nThe cons are...\n1) The accessories are NOT interchangeable. This was very disappointing to my son who wants to change their hats/masks around.\n2) The loose accessories are very tiny and basically useless other than to look at. Easy to lose.\n3) You can buy both packs so you have all the figures BUT there are duplicates so you're paying for some of them twice.\n4) Horribly overpriced. As if there weren't already overly expensive, after reading the cons listed above, it feels even more like a rip off.",
          "My son was trying to collect these. They were expensive every time I would take him to the mall. Found these online has all the characters he wanted. Wish I had this before I went and bought them individually. Son loves them. Great quality, price, arrived on time. All in all outstanding service.",
          "Fue regalo para mi sobrino en navidad, a el le encanta Among Us, parecía encantado con ellos, la verdad no se que tan bien funcionen los sellos pero el se veía feliz.",
          "",
          "This are cute. They r gonna be for my daughters birthday and the thing i didnt like was that the package was all squished. Other than that its good.",
          "Mi sobrino es fan de este juego y le fascinó el regalo. Las figuritas son de buena calidad. Los sellos están “okay” pero definitivamente fue un gran regalo",
          "",
          "The kids love them. The ink color matches the color of the crew mate which is cool.",
          "Lo buscaba para un regalo especial pero la caja llegó muy dañada.",
          ""
        ]
      }
    },
    {
      "id": "XboUzEo",
      "title": "12 Inch Miner Game US Plush Toys, Cute Stuffed Pillow Animal Room Decor Soft Stuffed Plushie Toy Kids Birthday Party Favor Gifts for Game Fans",
      "price": "$19.99",
      "image": "https://m.media-amazon.com/images/I/81H0gtZdlCL._AC_SY355_.jpg",
      "description": "About this item\n【Cute Plush Doll Toys】This newly designed stuffed animal doll is derived from the union of two famous games, give you a chance to get close to the characters in the game. It has became a beloved toy for game fans and kids, so you can embrace or squeezing your favorite character.\n【Quality Material】The plush pillow filled with high quality PP cotton, featured with elastic, not easy to deform, comfortable to touch. It perfect kids of almost every age. Made of non-toxic and harmless soft plush, giving you a better skin touch. As a home decoration, make your home full of love and warmth.\n【Wide Application】The doll is a very cute plushie, which would be easy to carry. You can place it on your desk ,bedside, shelf, tabletop, counter and sofa as cute ornaments. Also you can use as nap pillow, hug pillow, office noon break nap pillow, which can reduce work fatigue and let you relax. Also you can hug or throw it as a stress relief plush toy. It will be a good partner.\n【Designed for Fans】We believes that anyone has no resistance to this novel miner plush toy, it's character replicas of popular social deduction game. When you need to clean them, just use a small amount of soap and water to remove stains and wait for them to dry naturally. It will bring you and your family great times of joy and fun.\n【Great Gift for Kids】This cuddly stuffed animal plush toy is is very soft, suitable for babies to hug and fall asleep, comfortable to embrace with while watching movie, long car or plane ride, relaxing and sleeping, which is very suitable for game fans collection and kids birthday gift.",
      "reviews": {
        "customerProfileNames": [
          "LaurenceJBuell",
          "TP13",
          "NikkiLee",
          "Julia",
          "Tacha",
          "A.Mom",
          "SiarheiandMaryna",
          "joshyjosh00"
        ],
        "customerProfilePictures": [
          "https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif",
          "https://images-na.ssl-images-amazon.com/images/S/amazon-avatars-global/befc2cf3-51db-47b2-8097-27a607421729._CR62,0,375,375_SX48_.jpg"
        ],
        "customerRatings": [
          "5.0 out of 5 stars",
          "5.0 out of 5 stars",
          "2.0 out of 5 stars",
          "2.0 out of 5 stars",
          "5.0 out of 5 stars",
          "5.0 out of 5 stars",
          "5.0 out of 5 stars",
          "5.0 out of 5 stars"
        ],
        "customerReviewTitles": [
          "Zombie Miner Plushy",
          "Better than expected",
          "Ships compressed in plastic!",
          "Not 12\" as stated. Disappointed",
          "A great present for Minecraft players",
          "Super cool!!!",
          "This toy has taken a worthy place in the collection.",
          "Great Plush Toy!!!"
        ],
        "customerReviewBodies": [
          "My 8-year-old grandson ordered this and was quite pleased with it! It fit right in with the many other plushy creatures he owns. I only hope they all continue to get along....",
          "My son loves to play Minecraft and Among Us games, so this plush toy is nice combination of both worlds for him.",
          "Plushie came compressed in plastic. When I cut the plastic from around it the fabric was full of wrinkles and the figure was slightly deformed.",
          "This was a birthday gift\nDescription stated it was 12\" but only measured 9\". Too late to return as I needed gift now. Was disappointed.",
          "This Miner Game Plush Toy is for my 10-year-old son, who is a huge Minecraft fan. This plushie arrived in a vacuum sealed bag and quickly came to life after being unwrapped. This plushie is molded into a seating position and measures approximately 9 inches from top of head to seating surface. The legs still add about 2 inches to the length. The stitching is beautiful, and there were no odors when I opened it. My son likes it, says it looks cool, and that it is soft.",
          "F",
          " I ordered this toy for my son who collects things related to Among us. The toy is made of high quality and looks good, the fabric from which it is sewn is very soft and pleasant to the touch. The toy is quite well stuffed, it is not too dense, but at the same time it does not look empty. This toy has become a great addition to my son's already existing collection.",
          "This was an instant favorite. The second it came out of the box the kids were fighting over it and who was going to get sleep with it that night. The quality and colors are great. Stitching is good and it's stuffed well so it's quite firm to hold it's shape. Great for a fan of Minecraft and Among us."
        ]
      }
    },
    {
      "id": "vXMsRgw",
      "title": "Werewolf Kill All Among in Us Hot Game 13 Alien Figures Imposter Building Blocks Toys Space Kill Characters Model Kit Bricks Desktop Dolls Gifts Cake Decoration for Fans Children Kids (195pcs)",
      "price": "$18.99",
      "image": "https://m.media-amazon.com/images/I/7165150kL4L._AC_SY355_.jpg",
      "description": "About this item\n【13 Space Kill Game Figures】This 13 vivid minifigures inspired by a popular game are assembled from 195 pieces of building blocks. They can not only improve the children's hands-on ability, but also experience the joy of the game. The hats of the thirteen Characters can be replaced at will to increase your imagination ability.\n【How to Play】You can define any one as an impostor, then start among in us game with your kids. also, can use your imagination to bring to life any building toy you want with these colorful toys, fostering kids’ playtime and building creativity throughout the process.\n【Usage】This figure toy is about 3cm / 1.2inch (without the hat). Small size, easy to carry and can be assembled anywhere. It is suitable to use with cake decoration decorations, birthday gift collection, Doll decoration, capsule gifts, car dolls, micro landscape ornaments.\n【Perfect Gifts】Among in us figures building block toys were inspired by the popular game, which will be an ideal gift for games fans. Great choices for for boys and girls between the ages of 6 and 99 years old.\n【High Quality】All our products are makes of high-quality ABS material and undergone rigorous testing and screening process. Compatible with other major brands, so you can mix use our bricks for LEGO sets. If you have lost a piece or there seems to be a missing piece, please reach out and we would be happy to replace it for you.",
      "reviews": {
        "customerProfileNames": ["Customer"],
        "customerProfilePictures": [
          "https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif"
        ],
        "customerRatings": ["2.0 out of 5 stars"],
        "customerReviewTitles": ["missing pieces"],
        "customerReviewBodies": [
          "We bought this for a child and he was very excited to put the pieces together. They look cute, but there are several pieces missing in the package. As you can see many people also reviewed that the package missed pieces. We are one of those people who received missing pieces package, too. This is a Knock off lego pieces and they have very bad Q.A so no one check on the pieces if they have enough pieces or not. We had to be creative and used some real lego pieces for replacement even though it is not perfect but it works. Also the pieces don't stay tight together and randomly dropped out easily."
        ]
      }
    },
    {
      "id": "3bNGm8k",
      "title": "Among Us Official Toikido Yume LED Light-up Crewmate with Hand & Bag Strap - Red & Cyan (2pk), Assorted",
      "price": "$19.99",
      "image": "https://m.media-amazon.com/images/I/714sSahonsL._AC_SY355_.jpg",
      "description": "Introducing the official branded toys of hit multiplayer game Among Us. Show your fandom with the LED Light-up Crewmate with Hand & Bag strap, available in 4 colors: Red, Cyan, Yellow and Purple. Each 3.5-inch (9 cm) figurine features 2 display options: switch between (1) Neon Glow Mode and (2) Dark Stealth Mode with the on/off button. Attach your Crewmate to your wrist or backpack with the fabric strap, gaming or AFK, your Crewmate can always be by your side. Character toys of popular social deduction game Among Us. The perfect gift for gaming fans, kids, girls and boys.",
      "reviews": {
        "customerProfileNames": ["KK", "Jstar269"],
        "customerProfilePictures": [
          "https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif"
        ],
        "customerRatings": ["5.0 out of 5 stars", "4.0 out of 5 stars"],
        "customerReviewTitles": [
          "Really cool!",
          "Cute af, but wish it was rechargeable."
        ],
        "customerReviewBodies": [
          "Got one for my 12 year old and 4 year old. They are solid not soft. It has on, off, and timer settings. It has a hanging loop and clip. It's a perfect little gglowing gift",
          "I love the cuteness factor of these little crew members! I just wish it ran off of a rechargeable battery instead of ones I have to replace. Would have paid a bit extra for the convenience."
        ]
      }
    },
    {
      "id": "Z-aI2uk",
      "title": "Among Us Action Figures | Two of Four 4.5-Inch-Tall Collectibles | Among Us Toys and Playable Mini Toys | Blue Ghost and Red Crewmate with 5 Accessories: Hats and Hands",
      "price": "$24.99",
      "image": "https://m.media-amazon.com/images/I/81qM2qx4KcL._AC_SY355_.jpg",
      "description": "Two of a whole set of Among Us toys for kids to play with, start a collection, or throw an AmongUs theme party!\n\n✔ Two action figures in a window box:\n●the blue ghost wearing the cap-tain hat and the red crewmate wearing the hooded figure hat\n●4.5-inch-tall\n●authentic, minimalistic design with the classic backpacks and visors\n●5 hats, hands, and accessories in the box\n●the accessories are detachable and replaceable\n●the accessories (depending on the box) may include the most iconic hats, like the Floaty Flamingo and the My Name Chef\n\n✔ These Among Us toys are collectibles:\n●collect the total of 4 characters\n●get the most character variations by applying different hats and hands\n●the playable items will look neat on the shelf as a collection, too\n\n✔ Use these toys as Among Us party favors\n●kids love to play with these Among Us toys for boys and girls together\n●organize an Among Us theme party by giving the kids an action figure each\n●these Among Us party supplies allow children to take on roles (crewmate vs. impostor) as they’re playing\n●create the atmosphere by assembling new characters with the available accessories\n●inspire children to have offline matches, figuring out which one is the impostor\n",
      "reviews": {
        "customerProfileNames": ["JOANG"],
        "customerProfilePictures": [
          "https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif"
        ],
        "customerRatings": ["5.0 out of 5 stars"],
        "customerReviewTitles": ["Cool among us toys"],
        "customerReviewBodies": ["Ghhgggg"]
      }
    },
    {
      "id": "cvxxA_b",
      "title": "Among U&S Plush Toys 12 Pcs Stuffed Animal Plushie Toy, Funny Little Animal Gifts for Children and Super Game Fans Young 1",
      "price": "$28.99",
      "image": "https://m.media-amazon.com/images/I/717XbCq4DhL._AC_SY355_.jpg",
      "description": "Among U&s Plush Set 12 Pcs\nSize: 4.3 inch | Color: 12\nCollect this unique plush toy. This will be the perfect gift for your child.\nMade of super soft materials, plush fabric and PP cotton, cute appearance can win the love of children.\n",
      "reviews": {
        "customerProfileNames": ["ACE", "lreich"],
        "customerProfilePictures": [
          "https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif",
          "https://images-na.ssl-images-amazon.com/images/S/amazon-avatars-global/7c721bdb-91ee-4cd4-a717-07deff0b377f._CR0,0,375,375_SX48_.jpg"
        ],
        "customerRatings": ["5.0 out of 5 stars", "2.0 out of 5 stars"],
        "customerReviewTitles": ["Cute among us plushies", "Cheap"],
        "customerReviewBodies": [
          "My kid loved these among us plushies ! Not too big not too small .\nPerfect size for 6yr old.",
          "My son ordered a large lot of among us and they were much better quality than this order. These are very cheaply made"
        ]
      }
    },
    {
      "id": "VGCIs5a",
      "title": "Among Game US 8-in-1 Building Set with 10 Mini-Figures Includes Instruction & Box",
      "price": "$18.99",
      "image": "https://m.media-amazon.com/images/I/71hapoSuwSL._AC_SY355_.jpg",
      "description": "8 in 1 Building KIT with Figure B",
      "reviews": {
        "customerProfileNames": ["Bryan", "Jennifer", "Liz"],
        "customerProfilePictures": [
          "https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif"
        ],
        "customerRatings": [
          "5.0 out of 5 stars",
          "4.0 out of 5 stars",
          "1.0 out of 5 stars"
        ],
        "customerReviewTitles": [
          "Sturdy building set for fans of Among Us!",
          "Fun Figures and set",
          "Box of junk"
        ],
        "customerReviewBodies": [
          "My seven year old loves this set! He plays Among Us and was so excited to see there were many characters! He had a good time putting the set together and the instructions were pretty easy. There are many “tasks” that we built, and my child was excited when he recognized each one as we built them. We were also surprised that the bricks were of good quality, almost like legos! This is a must-have playset for anyone who likes Among Us!",
          "My son really liked the figures this came with. He's been coming up with all sorts of fun imposter games. The individual sets were difficult to put together because the instructions were very simple. Some of the pieces were mixed into other bags but overall it wasn't a big deal. WE just looked for the peice we needed and were good, vs looking in a specific bag.",
          "My nephew opened this and said it was a box of junk"
        ]
      }
    },
    {
      "id": "Eit73qb",
      "title": "Space Kill Game Figures Toys Building Blocks,Space Alien Figures Peluche Game Model Kit Bricks Classic Kids Toy for Children Gift Mini Statues,Among Figures Game Model(338-340PCS)",
      "price": "$18.88",
      "image": "https://m.media-amazon.com/images/I/81cc0Zeg6rL._AC_SY355_.jpg",
      "description": "Products \n\nMaterial: Abs Environmental Protection Material. \n\nPackaging: High-End Gift Packaging, With Instructions Inside. It Is Suitable As A Gift For Children. \n\nPlastic Building Block Type: Small Particles \n\nProduct Model List: \n\nModel: 338 -- 340 Pieces \n\nModel: 342 -- 432 Pieces",
      "reviews": {
        "customerProfileNames": ["AshleyErvin", "CL", "Danielle"],
        "customerProfilePictures": [
          "https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif"
        ],
        "customerRatings": [
          "5.0 out of 5 stars",
          "1.0 out of 5 stars",
          "5.0 out of 5 stars"
        ],
        "customerReviewTitles": [
          "My son loves them and step mom was very impressed!",
          "Embarrassing gift idea!!!",
          "Great Gift"
        ],
        "customerReviewBodies": [
          "These are so cute! I was worried when i ordered them because it wasn't the big name brand i was looking for but the quality is fantastic! There are lots of little intricate details like the little guys break in half to look the way they do in the game when you find the bodies. My kiddo loves them!",
          "Packaging looks tawdry. I bought it as a birthday gift for my son's classmate (not a close friend. ) The packaging and size are totally not presentable.\n\nFor $20 bucks, it sounds perfect for a birthday gift. I thought this will be something special other than toys at Target. This turned out to be too shameful as a gift. Had to return and got Kinetic Sand for a cheaper but better packaging, but boring gift idea.",
          "This was a birthday gift for my son and he loves it.\nThe directions are easy to follow and each set comes with 2 Among Us.\nI highly recommend this!"
        ]
      }
    },
    {
      "id": "eAeEu8u",
      "title": "3D Game Night Light, 16 Colors Table Lamp with Remote Control Bedroom Decoration for Kids, Creative Lighting Gifts for Christmas Birthday",
      "price": "$16.99",
      "image": "https://m.media-amazon.com/images/I/61z9m--wsdL._AC_SX466_.jpg",
      "description": "About this item\n【INCREDIBLE】- Using a creative laser engraved optical acrylic plate,3d night light looks like a 3D etched line when lit at night and The three-dimensional illusion effect makes your room more unique and warm, helping your kids to sleep better!\n【4 Patterns】- Different from others with just one , OMGGMO's lamp has 4 different acrylic plates with a base. It is bigger and brighter. You and your kids will have more choices of the lights which are more perfect ornament for room, bedroom, office, bathroom, etc.\n【Multicolor and Remote-Controlled】 - Fully color customizable by remote control with 7-color display: red, green, blue, yellow, cyan, pink, white, color changing. Remote control device,can adjust the brightness at regular intervals. It’s easy to control the Night Lights for Kids even when you are lying in the bed.\n【Excellent Gift】- Perfect for displaying in bedroom, child room, living room, backyard, bar, shop, cafe, restaurant and more as decorative light or night light. Best gift for your kids, friends, relatives or your lovers.\n【Easy Carry & Convenient to Use】-Two power modes: 3*AA batteries (not included) and USB connection. High quality LED light is soft and harmless to children's eyes. Please remove the protective film and wipe fingerprints before using.OMGGMO offer one year warranty. If you have any questions, please feel free to contact us. 100% MONEY BACK GUARANTEE.\n› See more product details",
      "reviews": {
        "customerProfileNames": [
          "Yarlidislopez",
          "Customer",
          "Jessalyn",
          "TV",
          "AnnieBonz",
          "Tarah",
          "MadROMAD",
          "GarrettZecker"
        ],
        "customerProfilePictures": [
          "https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif",
          "https://images-na.ssl-images-amazon.com/images/S/amazon-avatars-global/593171e0-962e-43ad-b986-7b1e7328c38d._CR0,0,500,500_SX48_.jpg"
        ],
        "customerRatings": [
          "5.0 out of 5 stars",
          "2.0 out of 5 stars",
          "5.0 out of 5 stars",
          "5.0 out of 5 stars",
          "5.0 out of 5 stars",
          "5.0 out of 5 stars",
          "5.0 out of 5 stars",
          "3.0 out of 5 stars"
        ],
        "customerReviewTitles": [
          "Excelente",
          "",
          "Doesn’t switch off, cable doesn’t power",
          "My 10 year old loves this light",
          "Grandson sez give it 10 Stars !!!",
          "Daughter Loves it!",
          "Works great!!!",
          "Niece Love It",
          "A good little lamp, but not quite worth the price to me."
        ],
        "customerReviewBodies": [
          "Muy buen producto....super recomendadoóo",
          "",
          "Maybe I got a dud, but the power button doesn’t work, and the cable doesn’t power it up. Sooooo, I guess it’s going back.",
          "My son is really into among us right now and has wanted to re-decorate his whole room with among us decor. This light was the perfect addition and he has it turned on every night! I am happy with this purchase!",
          "Grandson loves the changing colors, that it has 2 crewmates to choose from, and that it can run on batteries as well as from an AC outlet. Perfect gift for a young one that likes Among Us.",
          "We are thrilled with all of it. The size is perfect for her night stand and the color changing remote is awesome. Love it.",
          "This is just what my kid wanted. Works great! Colors and light are bright!",
          "My nieces are into anything that is about Among Us. It's there favorite game right now. So, this lamp was the best thing ever, I won the best aunt award for this. Its a lamp with one of the Among Us guys on it. It has 16 color changing lights on it with a remote control. It's made of good quality material and for an amazing price. Now, there fighting over it so, I guess will just have to get another one. Love it.",
          "The 3D Game Night Among Us Lamp that I got for my son who is heavily into gaming has been a great little addition to our home. He loves the design of the product as well as the fact that it comes with a remote that allows it to have a ton of cool preset colors and options. Right now, it is in his bedroom, but it is small enough to be taken anywhere, and is easy to assemble and disassemble. Not quite sure what makes the product “3D” except that it sort of has the effect like the LED-bordered signs you see at restaurants for neon special boards. It is a cool little light, compact with a lot of features, and it can be changed to colors for a party or for using as an energy efficient night light assuming you can plug it in to a USB thing somewhere. BUT it also takes batteries, which makes it a relatively dynamic little nightlight that can be taken camping in a tent and last quite a while on a few batteries. Is it worth the price point of $18 that it is currently at? Not sure about that, except the licensing / illustration appears to be genuine while the box is somewhat unbranded. If anything, that is what you are paying for, but if you are just in the market for a light you can get the same thing a lot cheaper, I am sure – the craftsmanship feels a little cheap even though it looks great in the room. It is up to you if the price is right."
        ]
      }
    },
    {
      "id": "CqqMG0p",
      "title": "Samsung Galaxy Tab 4 10.1in 16gb WiFi Black (Renewed)",
      "price": "$149.99",
      "image": "https://m.media-amazon.com/images/I/61XUQJONWuL._AC_SX385_.jpg",
      "description": "This pre-owned or refurbished product has been professionally inspected and tested to work and look like new. How a product becomes part of Amazon Renewed, your destination for pre-owned, refurbished products: A customer buys a new product and returns it or trades it in for a newer or different model. That product is inspected and tested to work and look like new by Amazon-qualified suppliers. Then, the product is sold as an Amazon Renewed product on Amazon. If not satisfied with the purchase, renewed products are eligible for replacement or refund under the Amazon Renewed Guarantee.",
      "reviews": {
        "customerProfileNames": [
          "SonjaJohnson",
          "SaraS.",
          "BevFredette",
          "69brrrd",
          "DianaNorthway",
          "Naih",
          "DavidGranovitz",
          "DavidM.Calaman"
        ],
        "customerProfilePictures": [
          "https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif"
        ],
        "customerRatings": [
          "5.0 out of 5 stars",
          "5.0 out of 5 stars",
          "5.0 out of 5 stars",
          "5.0 out of 5 stars",
          "5.0 out of 5 stars",
          "5.0 out of 5 stars",
          "5.0 out of 5 stars",
          "5.0 out of 5 stars"
        ],
        "customerReviewTitles": [
          "Invaluable tool",
          "Love this tablet",
          "Great Basic Tablet (my 3rd one )",
          "Great deal! Sim card ready!",
          "Good buy",
          "Great tablet at a great price",
          "Great for Just Hanging",
          "Good deal"
        ],
        "customerReviewBodies": [
          "I bought this item to help me in my small business. Now, I realize that it's not just helping me in business concerns, it's become a third hand of sorts for my whole life. I can track everything - perhaps not a revolutionary idea these days. But for me, this is the first touch-screen \"smart\" device I've ever owned. I've had to learn a lot, but this device made that process much easier. Some devices (or their designers) seem to think that you should have a degree in rocket science to understand and use their tech; Samsung wants people to be able to integrate the device into what they do so that they don't have to THINK about it, just use it, as effortlessly as they do a regular notepad and pen or any other tool.\n\nAnd that is what this is for me now. An invaluable tool.\n\nThough I did break down and put one or two games on it. :P",
          "Love this tablet! I have had it for about a month now and am very happy with it. I have had samsung galaxy phones for the past few years and am always happy with them, this is no different. I like that i can have access to any android app I want and they run nicely on it. The screen size is perfect for reading, exploring apps, etc. The speakers are much louder than I anticipated. I plugged a bluetooth speaker into it to play music outside, but the tablet's speakers were twice as loud as my speaker was! If you want a tablet with a decent camera, this is not it. I use it every once in a while for snapchat, but it isn't even good enough for that. Overall, the quality is great and can't beat the value for the price!",
          "This is my 3rd Samsung Tab 4 10.1 I love it. But it is not long lasting as the tablet sides start separating and light shines thru\nthe sides. 3 1/2 yrs first time 2yrs. next. Now this new tablet is a newer and slightly different. This one has just WIFI no 4G Lte.\nThe settings are a little different but just the way they are setup. So basically this is the same great tablet I love. Maybe this one\nwill stay longer.",
          "Great little tablet and as good as new, only much cheaper! It was originally an AT&T version and asked for a sim card when booting up but it was easy to ignore the notice and keep going if you don't want to add a sim card to make calls. AT&T customers can add a sim card for almost nothing, make calls from it and use data when away from wifi.",
          "Bought this to replace a tablet that had died. First we bought a new tablet of a different model because a new replacement was not available. After 5 days,and tech help,we gave up and returned it. Then we purchased this used tablet and are very pleased. It did not come with instructions, but we were able to set it up in a few hours. Would have been nice if it had come with a charger.",
          "Clear display, responds quickly. Bought as gift for my daughter, so I didn't want to put as much money into a tablet as I would for myself. Works just as well as my Samsung tablet that I purchased new for over $600. Very pleased and will be purchasing another for myself since my son shattered the screen on mine 🤦‍♀️",
          "Samsung Galaxy Tab 4 is the perfect sized tablet for lounging in bed & reading a book, playing games, watching movies, just checking email etc. I love the option of adding a micro SD card to increase storage space when needed. The android OS is perfect & has all my favorite apps! I would highly recommend the Samsung Galaxy Tab 4 for anyone looking for a perfectly sized tablet that's reasonably priced with all of the great features one would want from a tablet.",
          "I bought 3 of these refurbished units. The only problem i had was one of them had charging issues. Rather than sending it back, i spent the 7 or so dollars for a new internal charging ribbon cable. Easy to install and it fixed the problem"
        ]
      }
    }
  ]
}
