[
  {
    "id": "G_IEoZqWL1eZBU5pOr2ja",
    "title": "Gnveub Women's Lapel Button Up Cropped Shacket Flannel Shirt Short Jacket",
    "imageUrl": "https://m.media-amazon.com/images/I/71Ys7s2769L._AC_UX342_.jpg",
    "price": "$29.98",
    "description": "",
    "reviews": [
      {
        "name": "Jennifer Morrow",
        "pictureUrl": "https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif",
        "rating": "5/5",
        "reviewTitle": " Jacket is better than I expected",
        "review": "Exactly as pictured, I love it!"
      }
    ]
  },
  {
    "id": "1G-_eAfavZErRnzNdjI41",
    "title": "chouyatou Women's Casual Corduroy Open Front Hooded Color Block Shirts Shackets Jacket",
    "imageUrl": "https://m.media-amazon.com/images/I/71UkVdUR1fL._AC_UY445_.jpg",
    "price": "$41.89",
    "description": "",
    "reviews": [
      {
        "name": "JylC",
        "pictureUrl": "https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif",
        "rating": "4/5",
        "reviewTitle": " Fun jacket",
        "review": "Cute light weight jacket. Bought a medium first which fit okay but returned for a large. It is more baggy which is what I wanted but still could be a bit longer. Haven’t washed yet but look forward to wearing it soon."
      },
      {
        "name": " Customer",
        "pictureUrl": "https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif",
        "rating": "5/5",
        "reviewTitle": " Love this jacket! Feels nice! Cozy!",
        "review": "I like everything about this jacket. At first I thought it was going to be too small but omgosh it was perfect. I love how it feels on, and it's cozy. The colors are beautiful. Whoever designed this jacket has a good eye!"
      },
      {
        "name": "Bran Ahr",
        "pictureUrl": "https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif",
        "rating": "3/5",
        "reviewTitle": " Horrible smell!",
        "review": "I finally got the smell out after washing & lots of febreeze. It isn't nearly as long as in the pic- comes up to top of the waist. Other than that good quality & looks like the picture.5"
      },
      {
        "name": "Alexzanderia",
        "pictureUrl": "https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif",
        "rating": "5/5",
        "reviewTitle": " Love love love",
        "review": "Everything about this I love! True to size"
      },
      {
        "name": "Lauren",
        "pictureUrl": "https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif",
        "rating": "5/5",
        "reviewTitle": " Love it",
        "review": "It’s definitely not as long as it’s pictured, it hits just above the waist and i actually perfer it that way. And the colors are perfect for fall"
      },
      {
        "name": "Kasey",
        "pictureUrl": "https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif",
        "rating": "3/5",
        "reviewTitle": " It’s not this long it actually hits just below my waist not long at all",
        "review": "Not as long as the picture"
      },
      {
        "name": "Emily Wilhite",
        "pictureUrl": "https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif",
        "rating": "1/5",
        "reviewTitle": " DO NOT ORDER! Not as described!",
        "review": "I ordered this jacket specifically for the colors. In the pictures it’s dark orange and dark purple. What arrived is a light pink and a weird brown color I will be returning this and would not recommend buying this is you think you’ll get the right colors."
      },
      {
        "name": "Linda",
        "pictureUrl": "https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif",
        "rating": "2/5",
        "reviewTitle": " Short",
        "review": "Super cute but more like a crop style. Definitely isn’t as long as it is in pictures which is disappointing. I ordered a XL for a little baggier look."
      }
    ]
  },
  {
    "id": "tb3dmSE_hSRNe7o0B-EgQ",
    "title": "Yanekop Womens Fleece Button Down Shacket Long Sleeve Shirt Jacket Casual Boyfriend Blouse Top",
    "imageUrl": "https://m.media-amazon.com/images/I/61E9JldzvZL._AC_UX342_.jpg",
    "price": "$32.99",
    "description": "100% Polyester\nButton closure\nComfortable and skin-friendly fabric, suitable for windy and cold days, makes you have a cute look, easy to match and wear it comfortable\nThis loose fit long sleeve button down shirt shacket that can be worn open as a jacket or closed as a top. It can be tied at the waist or wrapped around waist, wear as 3/4 sleeves or full sleeve\nFeatures: Front fake bust button pockets, roll up blouse, solid color fleece shirt jacket, drop shoulder, button down, boyfriend style, chic turn down collar design, loose fit shirts\nThe button up shirt jacket can be perfectly matched with various tops and bottoms, such as skirts, suspenders, leggings, and even sportswear and is good for over a shirts in Fall/spring or warm climates in winter\nSuitable for a casual everyday look and any occasions especially at work, around the houses, walking your dog, doing yoga, because it is very light and portable",
    "reviews": [
      {
        "name": "Mac",
        "pictureUrl": "https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif",
        "rating": "4/5",
        "reviewTitle": " if you want it oversized get the size you would normally order",
        "review": "if you want it oversized get the size you would normally order"
      },
      {
        "name": "SaraM",
        "pictureUrl": "https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif",
        "rating": "5/5",
        "reviewTitle": " So Very Soft and Warm",
        "review": "For being so thick it is light weight. It is comfortable, soft and warm. It is not tight anywhere and fits very well. It has nice large buttons and has good seams."
      },
      {
        "name": "Amanda Anderson",
        "pictureUrl": "https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif",
        "rating": "5/5",
        "reviewTitle": " Love it!!",
        "review": "Fit perfect!! Soft, and HAS POCKETS! Will definitely be buying more. I’m usually between sizes XL and XXL. But XL fit perfect. And its perfectly oversized. Plenty of room to fit a hoodie underneath in cooler weather, and thin enough to be comfy in springs warmer weather."
      },
      {
        "name": "Kandace",
        "pictureUrl": "https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif",
        "rating": "3/5",
        "reviewTitle": " Missing buttons",
        "review": "This is very comfortable and perfect for what I needed it for. Feels like a fleece blanket. Oversized and matches well with many of the items in my closet. The only issue is that there are no buttons on the sleeve cuffs. It also do not come with extra buttons"
      },
      {
        "name": "Lisa M",
        "pictureUrl": "https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif",
        "rating": "5/5",
        "reviewTitle": " Very oversized",
        "review": "I wanted a fleece shirt like this for cooler days when I want to layer.\nThis meets my expectations in just about every way, except that it runs very big.\nBeing a 'boyfriend' shirt, I was expecting a larger, looser fit, but I ordered my normal size for items of this type, not realizing just how large it would be.\nIt fits well, overall, with even the sleeves hitting just right.\nMy only issue is the length and being only 5 feet tall, I fight this battle all the time.\nThis falls longer than I'd hoped. I wanted it to hit about mid thigh, but at the longest point hits at my knees. It really fits me like a dress.\nI'm hoping after washing, it might shrink up just a bit and I will try to update this review when I find out.\n\nThis is a nice warm shirt, that would be best for layering, or worn as a light jacket.\nIf you don't want a really oversized fit, order one size down.\nThank you for reading my review."
      },
      {
        "name": "Cortny Joy",
        "pictureUrl": "https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif",
        "rating": "5/5",
        "reviewTitle": " Soft, Oversized, Cozy",
        "review": "This shacket arrived exactly as pictured. I'm 5'6\", 120 lbs. The small fits me as I'd like...oversized without completely swallowing me. It's oversized to the point of being very casual. I don't feel right wearing it to work on a casual Friday, but it makes a great jacket for a grocery run or to wear with leggings if you want your inseam covered. The sleeves are a little short (though I'd consider my arms a little long). Plenty of room to wear something underneath. A sweatshirt would even fit. I love the hemline and length. Material is very soft without being a thick sherpa. Chest pockets are not real...just a flap and button. Color and design true to images."
      },
      {
        "name": "Anita as No Diva",
        "pictureUrl": "https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif",
        "rating": "3/5",
        "reviewTitle": " Soft & comfy but sloppy looking",
        "review": "This is a OK jacket. It is Soft & comfy fleece but the lack of finishing makes it a bit sloppy looking. I suppose that is part of the \"boyfriend\" style but I'm not a big fan. It is lightweight fleece so warm without feeling heavy. The sleeves are a little short and the cuffs are tight - makes for a puff bell shape which I'm not a fan of. The buttons are large and nice style but almost impossible to get thru the button holes. The chest pockets are small and kind of useless - do not even hold my ID, a Chapstick only. The side pockets are OK size, just fits my iPhone 13. It problem is with the finish - the side pockets are not attached so they flop around and warp the fall of the jacket. The front seams are not flat locked so flap around when you wear the jacket open. It is almost impossible to button up the jacket because the buttons are to big for the holes. I kept it to wear around the house when it gets cold in the evenings - not a going out shirt/jacket/Shacket or whatever."
      },
      {
        "name": "Douglas C. Meeks",
        "pictureUrl": "https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif",
        "rating": "5/5",
        "reviewTitle": " Looks Great, Easy To Care For",
        "review": "Just a beautiful and stylish jacket that can be worn from fall to spring.\nWith a loose fitting boyfriend cut, this jacket is sure to please just about\neveryone. I got the khaki and I can't think of any color this would not\ncompliment. It can be worn with jeans to a dress and look absolutely\nadorable as an ensemble. Warm, skin friendly fleece accented with perfectly\nmatched buttons, this jacket has a casual/tailored style with topstitching\nall over from collar, yoke, pockets, to the placket. The buttonholes are\nconstructed very professionally and the garment has all serged seams to\nprevent raveling. I found nothing to dislike about this jacket. It would\nmake a wonderful gift for birthdays, Christmas, or just to let someone know\nthat you are thinking of them present."
      }
    ]
  },
  {
    "id": "wXoeQ8h0r_2upPn3eVRPT",
    "title": "Kalssior Womens Plaid Oversized Shacket Button Down Shirt Flannel Turndown Collar Jacket Coats",
    "imageUrl": "https://m.media-amazon.com/images/I/71X07ZS2GrL._AC_UY445_.jpg",
    "price": "$29.99",
    "description": "Wool Blend\nButton closure\nMachine Wash\nMaterial - The plaid shacket womens flannel jacket is made by high quality wool blend fabric, it is very soft and breathable, the shacket jacket women is very comfortable against skin. This flannel jacket women is the perfect choice for autumn, winter and early spring\nFeature - This plaid shirts for women with two flap chest pockets on the front, the jacket plaid shacket with oversized boyfriend style, women plus size flannel jacket is an essential item in every fashion girl or women wardrobe\nDesign - The color block plaid jackets for women is designed with a turn down collar, long sleeve with button cuffs and slit side hem. Flannel shacket women is made with thick wool blend fabric suitable for late autumn, winter and early spring. This plaid piece make you look very fashion and cute\nOccasion - Oversized shacket jacket women suit for work and casual daily wear. This plaid shirts for women is the perfect choice for daily, outdoor activities, business, party, dates and any other occasion in spring, fall and winter\nMatching - This casual flannel shirts is suitable for matching shorts or jeans, tights or sandals. The classic plaid shirt jacket can be worn normally, or the fashion button down coat is tucked into the trousers to look very slim. It can also be knotted at the hem to look very young, cute and energetic",
    "reviews": [
      {
        "name": "Jennifer",
        "pictureUrl": "https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif",
        "rating": "5/5",
        "reviewTitle": " I love the Jacket",
        "review": "I love the jacket. Overall, the jacket is too large (I ordered one size up -Large), because I read the reviews and ordered off of the review comments. All the reviews I read mentioned that that sizing was small and ‘recommended’ to size up when ordering. Therefore, I ordered a size large (I wear a size medium). The large is HUGE (wears like an XL). Although, the jacket is large, I still love the print, it’s super soft, love the side pockets, and it’s warm. I will still wear the item as an oversized jacket."
      },
      {
        "name": " Customer",
        "pictureUrl": "https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif",
        "rating": "2/5",
        "reviewTitle": " not good",
        "review": "it said it was over size. I wear a 3x so I thought a 2x would fiiit. Boy was I wrong. Why don't this shirts come in a 3x or 4x , I would love to have some."
      },
      {
        "name": "WS",
        "pictureUrl": "https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif",
        "rating": "5/5",
        "reviewTitle": " Great quality shacket! Love it!",
        "review": "I bought this shacket for a 90s grunge party and ended up really loving it for everyday wear. I received a lot of compliments. I bought the same color as the main photo. I wear it all the time, it’s thick and good quality material, a wool blend. Very warm and stylish, fits perfect. Definitely recommend!"
      },
      {
        "name": "Cindella",
        "pictureUrl": "https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif",
        "rating": "3/5",
        "reviewTitle": " Cute, but scratchy",
        "review": "This jacket is cute, but the material is scratchy and there is no content label inside the garment to identify what exactly is causing it to be so scratchy."
      },
      {
        "name": "Hsjunker",
        "pictureUrl": "https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif",
        "rating": "1/5",
        "reviewTitle": " It's been three months. I haven't even received it.",
        "review": "It's been three months. I haven't even received it. .\nChina product. Which means it's going to be too small."
      },
      {
        "name": "Jueniper",
        "pictureUrl": "https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif",
        "rating": "3/5",
        "reviewTitle": " Small",
        "review": "Looks and feels great but runs pretty small"
      },
      {
        "name": "capnhook22",
        "pictureUrl": "https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif",
        "rating": "4/5",
        "reviewTitle": " Cute top runs big",
        "review": "Top is good quality and very cute. It runs big though. I bought a small and could have used an xs"
      },
      {
        "name": "Toni Jones",
        "pictureUrl": "https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif",
        "rating": "4/5",
        "reviewTitle": " Nice Shacket",
        "review": "Very nice, soft and nice fit. Love the color. The side pockets are nice but sit too high on the garment. Around stomach height."
      }
    ]
  },
  {
    "id": "UIINIe_I1LM1cc7h_wD8s",
    "title": "Womens Summer Jumpsuits Striped Short Sleeve Button Down Shirt Shorts Rompers with Belt",
    "imageUrl": "https://m.media-amazon.com/images/I/81qwINGTlvL._AC_UX342_.jpg",
    "price": "$23.99",
    "description": "Polyester,Spandex,Cotton\nImported\nButton closure\nMachine Wash\nMaterial- Skin-friendly fabric is soft and comfortable, it is also lightweight and breathable and more suitable for summer\nFeatures- Summer Jumpsuit for women, Short Roll Sleeve , Sexy V Neckline, Button Closure, Front Tie Knot, Adjustable Belt, High Waist, Wide Leg,Relaxed Fit , Casual One Piece, Striped Shirt Shorts Rompers Casual Jumpsuit for Beach\nOccasions- Stylish romper Perfect to pair with high heels, sandals, sneakers for beach, dating, club, travel, outdoor, school, office, work, party, casual, weekend, honeymoon, holiday, vocation, etc\nShow more",
    "reviews": [
      {
        "name": "Heather Shipman",
        "pictureUrl": "https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif",
        "rating": "4/5",
        "reviewTitle": " Size up 2-3 to get look on model",
        "review": "While I love the material and the thought behind this I have 2 suggestions. Make it large enough so that we can order TTS and not size up 2-3 sizes to re create the model look.....also, add pockets. Otherwise, this is a great prouct."
      },
      {
        "name": "Cindy Parker",
        "pictureUrl": "https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif",
        "rating": "4/5",
        "reviewTitle": " Compliments",
        "review": "I loved how this outfit looked at the beginning of the night. I received quite a few compliments. I did not like how easily it wrinkled throughout the night."
      }
    ]
  },
  {
    "id": "G_W_W9eVgCVWz0o_ndAlA",
    "title": "Timberland Men's White Ledge Mid Waterproof Hiking Boot",
    "imageUrl": "https://m.media-amazon.com/images/I/91c919JN0UL._AC_UY395_.jpg",
    "price": "$79.92",
    "description": "Uppers made with 100% premium waterproof leather from an LWG Silver-rated tannery. Seam-sealed construction. Rustproof, speed lace hardware with lace hooks at top. Fully gusseted tongue. EVA footbed. EVA midsole. Solid rubber outsole with multi-directional lugs. You're sure to have an outdoor positive experience when you have these waterproof boots on your feet. They're comfortable, durable and great looking. Timberland set new industry standards for craftsmanship, durability and protection when it introduced an authentic, waterproof leather boot in 1973. A global leader in design, engineering and marketing of premium footwear, Timberland values consumers who cherish the outdoors and their time in it. Timberland has been an industry leader in the use of both sustainable and recycled materials in its shoes, as well as its footwear packaging. The Timberland Company believes in corporate responsibility and supports numerous civic and social projects throughout the year. Because Timberland is unable to control the quality of products sold by unauthorized sellers, unless otherwise prohibited by law. Proof of purchase is required. For complete terms, limitations. please visit the Timberland website.\n\nTimberland set new industry standards for craftsmanship, durability and protection when it introduced an authentic, waterproof leather boot in 1973. A global leader in design, engineering and marketing of premium footwear, Timberland values consumers who cherish the outdoors and their time in it. Timberland has been an industry leader in the use of both sustainable and recycled materials in its shoes, as well as its footwear packaging. The Timberland Company believes in corporate responsibility and supports numerous civic and social projects throughout the year.",
    "reviews": [
      {
        "name": "Vanns40",
        "pictureUrl": "https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif",
        "rating": "5/5",
        "reviewTitle": " One year update 11/12/18",
        "review": "I needed a pair of hiking boots to replace the Keene boots that were only 1 1/2 yrs old but not only lost their waterproofing in the first six months but had a weed stalk in the field go right through the side and almost break my skin. This was the second pair of Keene’s that had gone bad in just over a year and, at $130 I was getting tired of replacing them.\n\nStarted looking at reviews and found these. They have a large toe box with plenty of room. Before I took them out I took another reviewers advice and put a coating of Mink Oil on them. They were comfortable but I knew they’d take a little break in. I now have about three or four miles of walking through the fields and surprisingly they seem to be breaking in rather quickly. I usually put on about 500-700 miles a year.\n\nOne note, if you’re looking for hiking boots that will give you really good ankle support these ARE NOT for you, look elsewhere. These are for easy hiking, fields and roadway. When I got them I first put in a pair of Dr. Scholls and that went a long way toward making them immediately comfortable.\n\nIf I remember I’ll give an update in three or four months.\n\nUPDATE: Jan. 6, 2018 - I’ve now had a chance to wear these for a while including the recent snow storm and frigid temps (at least for us). We got 5” of snow, temps this morning, when I took the dog out, we’re 4 or 5 degrees with a windchill of -8. I had been wearing wool socks with these and my feet have stayed warm and dry on a 25 to 35 min. walk through the fields. This time, with the snow and frigid windchill I decided to try just summer cotton socks. Bear in mind I’m a 70 year old with diabetes, which does affect circulation, so I’m pretty sensitive to cold and heat and the comfort of my foot wear. (I walk approximately 3 miles a day with my dog, even in the snow and cold unless it’s too much for her.) So, the results of a 20 minute walk were still warm and dry feet. I could have gone much further but Harley was getting snow turning to ice between her toes every few minutes and we’d have to stop and I’d have to remove it.\n\nBottom line: When I received these boots I put in my Dr. Scholls insoles from my previous pair, rubbed in three coats of mink oil on dry days (which I think was key to waterproofing) and started walking. I’ve found them to be far more comfortable than the Keen’s I was previously wearing. I don’t walk as much as a lot of people, about 25 miles a week, but they’re doing well for me for field and neighborhood walking.\n\n2/9/18: I like to keep folks updated on important stuff: If you want a pair of boots to wear, every day, and forget when you take them off, look elsewhere. Because these are leather they require a LOT of care. If they get soaking wet do NOT continue to wear them the next day, you’ll ruin them. I’ve found that when mine get soaked from walking in the pouring rain, in the field with my dog, I wipe them clean with an old towel, put shoe trees in them to keep the leather from shrinking and set them aside where there’s a flow of air to let them air dry. Do not try and force dry them with hot air, you’ll ruin the leather. Putting them a few feet away from a fan seems to work okay or just let them sit. While they’re drying I use an old pair that I kept. After they have dried completely I retreat every inch of leather, paying particular attention to seams and around grommets, with mink oil, let it sit and dry then retreat again.\n\nIs the above a pain? Yes it is but these appear to be quality boots and you need to take care of them, not let them get muddy and wet and toss them in the corner for the next day.\n\nUpdate: 11/12/18 I’ve now had these boots a year and for the money they were a good buy but I’ll repeat a couple of points I made previously.\n1. They are not, in any way, shape or form waterproof.\n2. If you get them soaked do NOT simply take them off and leave them in a dark hallway. If you do they’ll be ruined. Put them on a towel in front of a fan blowing room temperature air on them. Do not, under any circumstances, place them on a heated surface or someplace where hot air blows on them, you’ll ruin the leather.\n3. Once completely dry polish your boots. This is how I do it: I put a match to the polish (in the can) and let it flame and liquify, then take a rag and dip it into the liquid polish and rub it into the leather. Then I take a clean cloth and further rub the polish in and finally use a brush to buff the polish to a shine. Yes, it takes time and effort but if you wear leather hiking boots and walk through wet fields you should take the time to take care of the leather.\n\nIn wet weather I don’t wear these two days in a row. If you’re looking for that type of boot you’re also looking at three times the price."
      },
      {
        "name": "Tim27407",
        "pictureUrl": "https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif",
        "rating": "1/5",
        "reviewTitle": " Made in Vietnam vs China",
        "review": "I have an old & new pair of identical style/size boots. The 5 year old pair were and still are very comfortable all day on concrete floor, no break-in required.\nExcept for a couple of quick-lace eyelet failures, the old pair have stayed together & decently waterproof. They were made in Vietnam.\nThe new pair, again same size & style were made in China. After wearing less than an hour the inside of by heels began to burn and on the way to blistering. I compared dial caliper measurements of the heel width & found the Chinese model heel 1/8\" more narrow than the old pair & explains a correspondingly smaller upper.\nOutsourcing to the cheapest manufacturer isn't always the best option if you want to maintain your reputation. If I wanted cheap, there's a wally world on every corner, same boot at half price, minus the label. But hey, they cut that corner too, no Timberland embroidery stitching in the tongue! Anything to save a buck! Disappointed..."
      },
      {
        "name": "Chickenlittlefarm",
        "pictureUrl": "https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif",
        "rating": "1/5",
        "reviewTitle": " Toe area can not hold up to daily use.",
        "review": "I want to preface this review by saying I do not usually review items unless I am extremely impressed either positively or negatively. For the Timberland White Ledge boots the feeling is the latter. These boots might be ok for a casual hike or two but CAN NOT hold up to daily repetitive use. I purchased these boots on Nov 8th 2017 for daily use at work, I am on my feet 8 hours a day walking and interacting with customers and wanted something a little more supportive than \"running shoes\" In that area these boots are great, comfortable, supportive and my feet were not sore or tired at the end of a day.\nBut after less than 2 weeks of use the front toe area where the leather upper meets the thicker rubber part of the sole started to separate. Within 4 weeks the boots were completely unusable due to the worsening of the separation. Thinking I might have gotten a pair with weak glue, I purchased another pair but after 2 weeks the new pair is also doing the same. This is happening on both feet with daily use, just walking, I am not in construction or hiking on rough rocks yet the toe area can not stay together.\nI have heard Timberland has a 1-year warranty if the boots fail during normal use but considering this has happened to two pairs both within a month of daily use I would not recommend unless you potentially want to be replacing your boots every month."
      },
      {
        "name": "Mark Huselid",
        "pictureUrl": "https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif",
        "rating": "1/5",
        "reviewTitle": " Disappointed Again",
        "review": "I have blown more money over my lifetime buying into the Timberland product line, always with the anticipation the newest and greatest model would make up for the inadequacies of the one I recently purchased.... I believe I am at the point of fool you once... fool is you Twice this time around....I purchased these shoes this summer and complained within two weeks about the eyehole of the boot coming loose; and didn't ever hear from the company or anyone representing the product. These shoes have been worn minimally but even after I reinserted the eye hole and tried to avoid any strain while tying them, they continue to be a problem. This is now my 22nd pair, but first in the last 15 years; and it is very disappointing to see the same old quality issues plague the company; and I have come to expect the quality of Lowa and Merrell; which this company is unable to emulate. I've attached a picture for you to review and allow you to form your own opinions...."
      },
      {
        "name": "Farrenn",
        "pictureUrl": "https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif",
        "rating": "1/5",
        "reviewTitle": " Must be fake",
        "review": "I have worn Timberland boots in the past and loved them but bought these 3 months ago, waited a month for them to arrive from USA which was a bit annoying but I got over it. I’ve worn them for 2 months and as you can see in the pictures the soles are coming apart. I wore the previous pairs in the same way, for work 5 days a week and didn’t have this happen. You can see in the 4th picture that the sole is hardly worn but it’s coming apart from the boot in several places. I’m so disappointed and especially with how it’s been dealt with! Having only been offered a 15% refund I decided to warn people off."
      },
      {
        "name": "Mark",
        "pictureUrl": "https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif",
        "rating": "3/5",
        "reviewTitle": " Blisters",
        "review": "Bought these to replace a pair of Merrells that are now falling off my feet after two years of heavy use. First time out in them they seemed brilliant. They grip well, feel light and look good. Slight discomfort didn't bother me too much at first because I knew they'd need broken in since they're leather. I now have the mother of all blisters on my big toe after three trips out with them. The crease that forms over the toes has dug in to form a lovely gaping hole on the top of my big toe and I'm back wearing my Merrells until it heals.\n\nHopefully once they've been broken in they stop being foot killers but so far all I can say is they haven't been great.\n\nThe right boot is also tighter than the left and the way they lace up makes it hard to get a tight fit further down your feet.\n\nThey have potential but I won't be able to use them again for a week or two due to the damage they've already done.\n\nAs far as being waterproof goes, they've held up against wet grass, puddles and rain with the only moisture coming from my sweaty feet.\n\nI'll update when I get the chance to wear them for more than a few days and hopefully they live up to the hype."
      },
      {
        "name": "Salvador Méndez",
        "pictureUrl": "https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif",
        "rating": "1/5",
        "reviewTitle": " Los PEORES pares de botas que he comprado",
        "review": "Unos PÉSIMOS Zapatos, de terrible calidad, compre este par de botas Timberland esperando recibir articulo de calidad y/o nuevos, pero creo que ni una ni otra. Totalmente DECEPCIONADO de este modelo en específico y de la marca en general.\n\nNo se aprecia totalmente en las fotos, pero las botas llegaron y parecían que tenían semanas o hasta meses de uso, por lo que el material con los que están elaborados son de pésima calidad que se rallan con la mas mínima facilidad o bien este par de botas ya habían sido utilizadas anteriormente y no fui al único que le dio esa clara impresión de uso/desgaste.\n\nTengo una botas Jeep desde hace 4 años y unas Caterpillar recientemente y ninguna de las 2 presentó este tipo de problemas, por lo que pueden ahorrar y comprarse unas Jeep que son más económicas o invertir un poco más y mejor en unas Caterpillar.\n\nEn conclusión y definitiva NO gasten inútilmente este modelo o similares a estas !!!"
      },
      {
        "name": "Kai",
        "pictureUrl": "https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif",
        "rating": "5/5",
        "reviewTitle": " Timbo's on the toes & That's the way it goes!",
        "review": "Timberland have always been the front runner in footwear (see what I did there?) These are no exception. Fit like you had gloves on your feet. Comfort and warm toes all in the same place. Even in the snow (Tested' and they passed) Waterproof and deceivingly light in weight! About as heavy as Nike Airs' True Story' Smart as' If they're to be used for night's down the pub, in your chinos or combats! I got them for the English weather and dog walking... I love them! A wipe and they are clean (Not that I go around jumping in puddles like a loop case) Just the splashes and such that I have had on them, came straight off with a wipe 'Juan Sheet' They are a 'Proper Tidy Bit of Kit' Don't take my word for it, I'm off me swede mate lol Looking good in my boots though!"
      },
      {
        "name": "Rick",
        "pictureUrl": "https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif",
        "rating": "4/5",
        "reviewTitle": " Comfortable but not true to size.",
        "review": "As this is advertised as a wide shoe, I expected it to fit easily with a bit of room to spare out of the box (I ordered a shoe half a size bigger than I normally buy for anything else as I will be doing lots of long walks in them). When i tried the shoe on, my foot only just fit and after walking 6 miles, I had issues, my feet were hurting a lot. I had to replace the shoes and miss out the second set of eyes to get them comfortable. They are fine with the relacing and are very comfortable, but beware, they are not true to size at all, I should have gone for a full size bigger."
      }
    ]
  },
  {
    "id": "JJ1KiPousVEF1OFwV2S92",
    "title": "Liengoron Women Flannel Shacket Casual Plaid Shacket Clothing Button Down Long Sleeve Shirt Jacket Shakcets Coat",
    "imageUrl": "https://m.media-amazon.com/images/I/71+cyEX1zNL._AC_UX342_.jpg",
    "price": "$29.99",
    "description": "Fabric: Polyester\nButton closure\nLine Dry\nMaterial: Polyester, soft and comfy womens plaid shacket to wear in spring ,autumn or early winter\nFeatures: Our loose shirt-jackets feature plaid print, lapel, long sleeve, two chest pockets and two side pockets, button down closure\nMatch: The boyfriend style button up shacket jackets are easy to match with skinny jeans, classic jeans, pants, leggings, heels, etc\nOccasion: The casual flannel shacket are suitable for many occasions like daily wear, casual, work, school, date, street, travel, vacation, etc\nWashing introduction: Wash shackets with cold water and hang or line dry, do not bleach, please carefully refer to the womens plaid jacket size chart in the product description",
    "reviews": [
      {
        "name": "AshP22",
        "pictureUrl": "https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif",
        "rating": "5/5",
        "reviewTitle": " Absolutely love!",
        "review": "Alright yall I'm so surprised ain't nobody snagged this flannel up yet, I took the plunge and so glad I did this is so cute! Fits as expected (oversized shacket) the color is amazing and its comfortable. I think its a great product, and a good addition to my closet."
      },
      {
        "name": "Alex & Liz Guardado",
        "pictureUrl": "https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif",
        "rating": "5/5",
        "reviewTitle": " Worth it for the price",
        "review": "I’m about 5’3 135 lbs (curvy) & the small fit well. I’m usually a medium but since it’s oversized, I decided to go with the small & it’s perfect. I’m short so too oversized doesn’t look well. It looks just like my Zara shacket & feels similar with the exception that it’s not scratchy like my Zara one. It’s good quality. My only complaint is that the buttons aren’t as sturdy. I don’t think they’ll fall off but they look a bit on the cheapy side...not that anyone will probably notice. For the price, it’s worth it & it’s thick so definitely a shacket not just a flannel shirt."
      },
      {
        "name": "Kevin",
        "pictureUrl": "https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif",
        "rating": "3/5",
        "reviewTitle": " Nice material but small sleeves",
        "review": "I got this in the green color, size small. I really wanted to keep this shacket because the material is very thick on both sides. It is very well made. Sadly the arms were really short where if you were to wear any long sleeve underneath it, you can see the huge length gap. So, I returned it. Looking at the size chart I decided to go with another buyer seeing that the sleeve length for a medium is just as short. But the material was much thicker than the other buyer I purchased from."
      },
      {
        "name": "WordGirl",
        "pictureUrl": "https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif",
        "rating": "5/5",
        "reviewTitle": " I love this shacket!",
        "review": "The fabric is soft and cozy...a perfect \"middle\" between flannel and fleece. It is so comfortable, and I love that it has pockets. I've received so many compliments on it. It's just long enough to cover my bottom, so I can wear it with leggings or jeans."
      },
      {
        "name": "MDS",
        "pictureUrl": "https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif",
        "rating": "1/5",
        "reviewTitle": " I’m Returning",
        "review": "This does not fit like a shacket. It needs to be longer, and I’m only 5’2. This is just an oversized shirt, so the fit is too boxy. There is also no lining, so I can’t justify the price.\n\nReturning."
      },
      {
        "name": "Rebekah Perea",
        "pictureUrl": "https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif",
        "rating": "5/5",
        "reviewTitle": " Get it!",
        "review": "Super cute and perfect thickness. Definitely not as thin as a flannel, more like a thin jacket but that’s exactly what I was looking for. If you’re considering it, BUY IT!"
      },
      {
        "name": "Christine Higgins",
        "pictureUrl": "https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif",
        "rating": "5/5",
        "reviewTitle": " Omg !!",
        "review": "I was totally shocked I didn’t know what to expect. but when it came it fits perfect the fabric is heavy and I absolutely love and adore plan on getting another one in a different color!!!"
      },
      {
        "name": "Amber Santiago",
        "pictureUrl": "https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif",
        "rating": "3/5",
        "reviewTitle": " Way to rough and scratchy",
        "review": "I gave 3 stars for the features, cut and colors was great. But there's no way to wear this comfortably without a long sleeve underneath and I usually wear a tank top because it would just be to hot with two layers for myself."
      }
    ]
  },
  {
    "id": "A7em_fqerEUNsOKYUm6u1",
    "title": "DOBULO Women's Crew Neck Beach Rompers Half Sleeve Elastic Wasit Dots Keyhole Summer Jumpsuit",
    "imageUrl": "https://m.media-amazon.com/images/I/71Bdit8KSIL._AC_UY445_.jpg",
    "price": "$35.99",
    "description": "Polyester\nImported\nHook and Eye closure\nHand Wash Only\n♡ Material: The soft, comfy, stretch fabric makes this off the shoulder playsuit comfortable to wear and look fashion, chic, sexy and cute.\n♡ Feature: Crew neck, puff half sleeve, elastic waist, ruched, dots.\n♡ Occasion: Wear it for daily casual, evening, party club, night out, clubwear, vacation clothes.\nShow more",
    "reviews": [
      {
        "name": "Jensen",
        "pictureUrl": "https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif",
        "rating": "5/5",
        "reviewTitle": " Underrated",
        "review": "I don’t know how there aren’t more reviews for this item. It’s super cute and the shorts make it practical for travel. I can wear it with white sneakers or dress up with a wedge or heels for summer. It’s a very flattering fit. The material is thin, but it’s not see through and in hot weather I think this is a positive."
      },
      {
        "name": "Ynnaile",
        "pictureUrl": "https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif",
        "rating": "4/5",
        "reviewTitle": " Cute romper",
        "review": "This romper is cute and looks like the pictures. I got the red and the color is nice and vibrant. The fabric is lightweight and feels very cool on my skin which is great for the hot summer weather. I normally wear an xs but small was the smallest size available. I think the overall fit would be better on my petite frame if this was an extra small as the small makes me look very shapeless. I also wish this had pockets to make it more convenient."
      },
      {
        "name": "_Consumer",
        "pictureUrl": "https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif",
        "rating": "4/5",
        "reviewTitle": " Love this but darker",
        "review": "I love the style of this romper! I ordered my usual size and it fits perfectly. The fabric is soft and lightweight. It doesn’t show wrinkles and is easy to care for. I deducted one star because the color brown is darker than the khaki color shown in the model photos. Otherwise this is a nice romper. Thanks so much for taking the time to read this review. I hope the information that I've provided makes your decision a little easier."
      },
      {
        "name": "Deva",
        "pictureUrl": "https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif",
        "rating": "5/5",
        "reviewTitle": " super cute!!",
        "review": "This romper is really cute. The material is so soft and feels great on my skin. You can dress it up with sandals or down with gym shoes. I love this romper."
      },
      {
        "name": "Breona",
        "pictureUrl": "https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif",
        "rating": "5/5",
        "reviewTitle": " Love!!",
        "review": "Vibrant colors that look just like the picture. Lightweight material but I don’t think it’s very see-through, especially because of the pattern. The sleeves have elastic towards the bottom so they stay on your arms and for style. The zipper is great because it is very long, which made it easy to put on by myself. The waist elastic isn’t too tight either, which adds to how comfortable this is."
      },
      {
        "name": "Shar Taylor",
        "pictureUrl": "https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif",
        "rating": "4/5",
        "reviewTitle": " Comfortable.",
        "review": "Comfortable. Fits perfect. Elastic waist and arm. Great for summer. Size large. Would purchase again"
      },
      {
        "name": "Crafts and More with Christina!",
        "pictureUrl": "https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif",
        "rating": "5/5",
        "reviewTitle": " Nice romper.",
        "review": "This romper is pretty and fit good. I do wish it was just slightly loose but not that big of a deal. Material is nice and soft. Do recommend."
      },
      {
        "name": "beth c godfrey",
        "pictureUrl": "https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif",
        "rating": "4/5",
        "reviewTitle": " FIT TO SIZE, super cute",
        "review": "These Beach Romper have been perfect for my summer trip, they fit perfect."
      }
    ]
  }
]
