{
  "jewelry": [
    {
      "id": "_GTvrdT",
      "title": "Betsey Johnson Woven Mixed Multi-Colored Bead Flower Heart Illusion Necklace",
      "price": "$48.00",
      "image": "https://m.media-amazon.com/images/I/714BWOnwhZS._AC_UY695_.jpg",
      "description": "Betsey Johnson illusion necklace featuring mixed faceted beads, delicate stone accents, lovely flowers and heart embellished with woven mixed multi-colored charms. Necklace is set in gold-tone metal with a lobster clasp closure.\n\n\n\n\nNew York designer Betsey Johnson has built her long-standing career in fashion by following her own set of rules. Known for her celebration of the exuberant, the embellished, and the over the top, Betsey has been rocking the fashion industry with her unique and original designs since the 1960’s. Her commitment to remain true to her one-of-a-kind vision has afforded Betsey continued success in an industry known for its fickleness. Her ability to change with the times while keeping her designs pure has not gone unnoticed. At the 1999 CFDA Awards, Betsey was presented The Timeless Talent Award created especially for her, which recognized her influence on fashion throughout her career.\n\nBetsey was born in Connecticut and spent her childhood in dance classes. Her aspirations to be a dancer and her love for costumes laid the foundation for Betsey’s creativity and inspiration, which is still evident in her designs today. In 1964, Betsey officially entered the New York fashion scene by winning Mademoiselle magazine’s “Guest Editor Contest.” One year later, she landed the top designer position for Paraphernalia, a clothing boutique that at the time housed the hottest young London designers, including Mary Quant and Paco Rabanne, among others. What would soon become known as Betsey’s trademark look began its formulations here: sexy silhouettes, hippie inspired flowing fabrics, whimsical detailing and, most importantly, a fabulous fit.\n\nNow firmly part of what was considered the “Youth Quake,” Betsey soon found herself in the unforgettable 1960’s Warhol scene. Edie Sedgwick was her house model, while the Velvet Underground’s John Cale took to wearing her designs both on-stage and off. In 1969, Betsey began her foray into retail by opening a new boutique called Betsey Bunki Nini. Directly following the opening store Betsey was offered a job from Alvin Duskin in San Francisco and thus began living a bi-coastal life for the remaining years of the 60’s.\n\nAlong with the new decade came new career opportunities for Betsey and in the early 1970’s, she came into creative control of the label Alley Cat, a label which set the trends for the 70’s rock n’ roll clothing, with bohemian and ethnic styles. In 1972, along with Halston, Betsey won the coveted Coty Award becoming the youngest designer to ever receive the honor.\n\nAfter a decade of designing for other labels, Betsey decided to make a dramatic change in her life and in 1978, she formed a partnership with Chantal Bacon and started the Betsey Johnson label, as it is known today. Designing for herself allowed Betsey the creative freedom to execute her vision to its fullest potential. The same year Betsey and Chantal launched their first retail store in the heart of Soho. In the early 80’s, they were one of the first to open a store on Melrose Avenue in Los Angeles, helping the street to gain its worldwide recognition as one of the best shopping areas of the 1980’s. Today there are over sixty-five Betsey Johnson stores worldwide. International expansion came in 1998 with the opening of the wildly popular London store. In 1999 the Vancouver store opened marking the company’s first move into Canada, where there are now four locations in various provinces. In September 2006, the first Betsey Johnson store opened in Japan. Betsey Johnson clothing is also available in better department stores as well as in specialty stores throughout the United States and numerous countries around the world.\n\nThe year 2003 marked some exciting licensing endeavors for the company, taking Betsey’s signature prints and whimsy to new audiences with categories including handbags and lingerie. She continued this trend and has since added footwear, belts, eyewear, watches, jewelry, swimwear, legwear, outerwear and a fragrance thus effectively emerging as not only a clothing designer but a top American Lifestyle brand.\n\nIn late 2002, Betsey was honored with an induction into the Fashion Walk of Fame, honoring her contribution to American fashion. A bronze and granite plaque containing an original sketch, signature and biography was embedded into Seventh Avenue sidewalk in early 2003. In March 2005, the Signature Awards and NAWBO-NYC committee honored Betsey with the 2005 Lifetime Achievement Award. And following that, Betsey received the Lifetime Achievement Award from the Accessories Council in November 2005. Betsey Johnson was also honored with the Designer of the Year Award at the annual Fashion Accessories Benefit Ball (FABB) in May 2007 and was recently honored with the National Arts Club Medal of Honor for Lifetime Achievement in Fashion in October 2009.\n\nA survivor of breast cancer, Betsey continues to be a strong advocate in the fight against the disease, making public appearances, participating in numerous fund raising events and creating one-of-a-kind items that have been auctioned off to raise funds for many charities. In 2003, the CFDA asked her to be an Honorary Chairperson for the Fashion Targets Breast Cancer initiative, which she graciously accepted. In April of 2004, she was awarded another honor by the National Breast Cancer Coalition (NBCC) for her continuous fight against Breast Cancer at a prestigious ceremony hosted by Ron Perelman. In Spring of 04, she teamed up with Geralyn Lucas, the author of the book “Why I Wore Lipstick...to my Mastectomy,” designing an accompanying t-shirt which was launched in Betsey Johnson stores nationwide in October 2004 at a series of events called “Courage Nights.” Courage Night continued for its second year in October 2005 where CFDA Fashion Targets Breast Cancer and SELF Magazine joined the cause. Johnson continues to support, hosting a charity event each October in her boutiques nationwide and internationally, as well as creating limited edition products from which a portion of the proceeds are donated to various breast cancer related charities.\n\nBetsey Johnson, both the woman and the label, is constantly moving forward and continues to keep a strong foothold in the fashion industry with no signs of letting up anytime soon. Her love of detail and design is evident in everything she does in life and in business. Her enthusiasm, creativity and boundless talent that have kept her at the forefront of fashion for the past 45 years will keep Betsey going for years to come.\n\n“Making clothes involves what I like…color, pattern, shape and movement…I like the everyday process…the people, the pressure, the surprise of seeing the work come alive walking and dancing around on strangers. Like red lipstick on the mouth, my products wake up and brighten and bring the wearer to life…drawing attention to her beauty and specialness…her moods and movements…her dreams and fantasies.” – Betsey Johnson\n\nAs one journalist recently quoted, “If Betsey Johnson didn’t exist, we would have to invent her, simply to remind ourselves that fashion can be fun. She’s the original wild child and set to paint the town pink!”",
      "reviews": {
        "customerProfileNames": [
          "DellaHall",
          "FLGirl",
          "Belledajour",
          "KindleCustomer",
          "WendyS.",
          "Susie",
          "MaryW.",
          "JeniferVogt"
        ],
        "customerProfilePictures": [
          "https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif",
          "https://images-na.ssl-images-amazon.com/images/S/amazon-avatars-global/002c5815-9829-4211-a5a5-21b1da27d524._CR62,0,375,375_SX48_.jpg",
          "https://images-na.ssl-images-amazon.com/images/S/amazon-avatars-global/9ab4ac81-d8c8-4ac1-b8e4-12c8fa18c77a._CR0,0,371,371_SX48_.jpg"
        ],
        "customerRatings": [
          "3.0 out of 5 stars",
          "3.0 out of 5 stars",
          "2.0 out of 5 stars",
          "3.0 out of 5 stars",
          "5.0 out of 5 stars",
          "4.0 out of 5 stars",
          "5.0 out of 5 stars",
          "5.0 out of 5 stars"
        ],
        "customerReviewTitles": [
          "No packaging",
          "Very pretty, but dimensions are off",
          "Gorgeous and NOT like anyone Elses! I spoke to soon!",
          "Pretty necklace, but awful packaging",
          "Photo doesn't do it justice",
          "Love! But beware of quality.",
          "The Girliest Thing I Own and I LOVE It.",
          "In Love With This Necklace"
        ],
        "customerReviewBodies": [
          "I love Betsy Johnson. Necklace is much prettier in person & good quality. Only gets 3 stars because when it came it wasn't even really packaged. They just wrapped a small piece of bubble wrap around it & stuffed it in a little ziplock baggie. It was a tangled mess when I opened it. Took me about 15 minutes or so of unraveling the strands from each other.",
          "This is a very pretty, unique, multi-strand necklace. Unfortunately, the dimensions are off on the one I received. The longest strand, with the heart pendant, is 20\" long without the 3\" extender, + 1\" for the pendant itself, whereas the Q&A had a measurement of 16\" plus 3\" extender. This makes a big difference in where the pendant lands (too low). The two other strands lay on top of each other, whereas in the picture the smaller pendant strand sits up higher. This makes the proportions of the necklace off, because the two smaller strands blend together and lay as one sort of jumbled mess, and then the heart pendant hangs underneath, but with more of a gap in between. Returning for these reasons, unfortunately.",
          "Betsey has always done things the way I like to buy them. Unique, quirky and show stoppers. I love multi tier necklaces but this one is my favorite. It adjusts and it is piece that will get attention. I may buy another for my sister!\nThis is very sad for I LOVED THIS NECKLACE, It busted open with no chance of being fixed, I have read other stories about Betsy Johnson new merchandise being made cheaply and falling apart and it breaks my heart for I love her stuff. I have been compensated. Thank you for your prompt and fair response,",
          "I have bought Betsey Johnson necklaces before. This is the first time that I have seen this type of packaging. It was half wrapped in a rectangle piece of bubble wrap. It took me 10-15 minutes to untangle. It doesn't even have a pouch to give as gift. I am very disappointed. Even cheaper necklaces come in beautiful packages which you can directly give as gifts.",
          "I'm a jewelry addict; loving fine things and fun things equally. And, I was impressed by this necklace when I received it. The photo doesn't do it justice. The stones and beads are so much prettier in person. The beads have an iridescent shimmer that can't be captured in the photo. Also, the beading isn't just glued to the heart centerpiece. They are strung and wired on. I wore it with a baby blue cashmere sweater. I received compliments all day on the necklace and no one even noticed the cashmere sweater. My $300 sweater was upstaged by a $30 necklace! Now, I'm looking online for more jewelry by Betsy Johnson.",
          "I love this necklace! It hangs just right and can be adjusted with the bottom heart right at the cleavage. Tres sexy. The two round red and blue ornaments on each side hit right at the collar bone. It's very whimsical and light, but it does look a little cheap and I don't have much faith that the clasp will last very long.",
          "Must have patience as three-strand necklace can get tangled (it looks cool “messy” and overlapping, too). Definitely giftable to girls and women. Wears well, doesn’t look cheap, pieces are strung and have movement and the colors are pretty. It is adjustable so top strand will fit virtually any neck size and the bottom (depending on where on the chain you clasp it in the back) drops to cleavage depth for me at 5’7”. A sweet piece of costume jewelry.",
          "I highly recommend you buy this necklace. The photos here barely do it justice. It’s really beautiful and well-made for such a reasonable price. I’ve gotten compliments for it!",
          "I",
          "Terrible Packaging. They basically throw it at you in cheap plastic bag like you just bought it at a garage sale. Hopelessly all tangled up of course and took over 20 minutes to get it untangled. Luckily it did not break in the process but we needed tools to get it done.",
          "Está súper bonito el collar, el diseño lo hace resaltar de cualquier otro accesorio, lo agarré en oferta pero aún creo que es algo caro, no viene con estuche, o bolsa de la marca, solo en una bolsa de plástico envuelto en un huele espuma, a mí me llegó bien, no estaba enredado, espero que me dure porque lo siento un poco frágil, se debe cuidar bastante",
          "",
          "Tres jolie, delicat et ensemble parfait. Elle l`a aimer du premier coup d`oeil. Merci pour elle. MAINTENANT pour moi une explication serait demise, j`ai payer $62.40 + tx = $71.74 quand l`etiquette accrocher au collier affichait $48.00. Une explication SVP. Merci.",
          "",
          "Returned it the day after it arrived, should have been pretty but it looked cheap and damaged. It came in a ball in plastic wrap and was tricky to untangle.\nNo worth the money and certainly did not look as advertised."
        ]
      }
    },
    {
      "id": "S0QyvIg",
      "title": "Amazon Collection AGS Certified 14k White Gold Diamond with Screw Back and Post Stud Earrings (J-K Color, I1-I2 Clarity)",
      "price": "$273.80",
      "image": "https://m.media-amazon.com/images/I/31XpHS6xqVL._AC_.jpg",
      "description": "Classic solitaire studs featuring diamonds nestled in four-prong settings and screw-on backings",
      "reviews": {
        "customerProfileNames": [
          "KenD",
          "Bruce",
          "B.Harris",
          "WilliamE.Purdy",
          "RFDL55",
          "C&HBlair",
          "Quiltgrrl",
          "DoreenStearns"
        ],
        "customerProfilePictures": [
          "https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif",
          "https://images-na.ssl-images-amazon.com/images/S/amazon-avatars-global/2eaaf00c-c0cd-46d6-99c3-3b48491d0514._CR109,0,281,281_SX48_.jpg"
        ],
        "customerRatings": [
          "2.0 out of 5 stars",
          "1.0 out of 5 stars",
          "1.0 out of 5 stars",
          "1.0 out of 5 stars",
          "1.0 out of 5 stars",
          "5.0 out of 5 stars",
          "5.0 out of 5 stars",
          "5.0 out of 5 stars"
        ],
        "customerReviewTitles": [
          "Side by side with the Houston district studs",
          "Not real!",
          "Posts are junk!",
          "Appraised twice as \"Worthless\"",
          "Very dull looking",
          "I finally did good",
          "Lovely Christmas gift.",
          "Diamond earring Studs!"
        ],
        "customerReviewBodies": [
          "I",
          "Mountings fell apart and the \"diamonds\" were CZ. How embarrassing when I took them to a jewelry store to have the mountings replaced and they tell me they are not real diamonds",
          "Bought these for my wife. The screwback on one of the posts is junk. The back keeps falling off! Lost the back and bought a replacement, it then fell off again!! For $400 I expected much better quality. We are very disappointed and not recommend.",
          "Took them to 2 different jewelers to have them appraised for insurance purposes. Both agreed that they were worthless. You don't have to have any gem experience to look at the stones and see the multiple large black inclusions and realize that these stones are garbage.",
          "These earrings are very dull looking and have absolutely no sparkle. You can definitely see a tint of yellow-brown. For the price I was expecting a whole lot more! I have cubic zirconia diamonds that look nicer than these.",
          "I finally did good!! My wife loves jewelry and I hardly ever buy her any because she’s really really picky about what she wears. This was the one time that she open the box, she looked at me… And a little bit of tears , a big hug.. and I love you!!!",
          "I bought these in 14K yellow gold, 1/3 carat. The color and sparkle were beautiful but they were a little too small so I exchanged them for 1/2 carat in 14K white gold. The larger stones are perfect as a gift for Christmas. The color: G-H and the Clarity: I1. I think they were a very good value at $299.",
          "I bought these earrings for my eight-year-old granddaughter she loves them I thought that they were very good quality just looking at them very sparkly and you get a card with the clarity and everything on it so you know if the diamonds are good or if they’re not so good but yeah I was very pleased and my granddaughter was to thank you!",
          "G",
          "Bought these on a whim when they were priced under £50. Thought they were too good to be true. But they are perfect. In fact I have worn these everyday since they arrived. Absolutely love them.",
          "Wrong type.",
          "N",
          "Loved the earrings but one of the backs wouldn’t stay on. I had to check every day to make sure that it was still on and one day it was gone. Thank goodness my earring was still there."
        ]
      }
    },
    {
      "id": "fr-76zl",
      "title": "Kendra Scott Ari Heart Adjustable Length Pendant Necklace for Women, Fashion Jewelry",
      "price": "$60.00",
      "image": "https://m.media-amazon.com/images/I/41irWTkGh1L._AC_UY500_.jpg",
      "description": "Manifest love in the Kendra Scott® Ari Heart Short Pendant Necklace. Subtle necklaces features stone centers with etched edges.\n14K gold, 14K rose gold, rhodium - all plated over brass.\nLobster claw closure with extender.\nImported.\nMeasurements:\nChain Circumference: 14 in\nAdjuster Length: 2 1⁄2 in\nPendant Height: 1⁄2 in\nPendant Width: 9⁄16 in\nWeight: 0.01 oz",
      "reviews": {
        "customerProfileNames": [
          "RyanThompson",
          "Jan",
          "Brittany",
          "VelmaJLaird",
          "Noa",
          "Twiggy",
          "TinaS.",
          "TopShelf"
        ],
        "customerProfilePictures": [
          "https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif"
        ],
        "customerRatings": [
          "1.0 out of 5 stars",
          "3.0 out of 5 stars",
          "5.0 out of 5 stars",
          "5.0 out of 5 stars",
          "5.0 out of 5 stars",
          "5.0 out of 5 stars",
          "5.0 out of 5 stars",
          "5.0 out of 5 stars"
        ],
        "customerReviewTitles": [
          "Presentation is horrible in plastic bag!!",
          "Two different necklaces as gifts to siblings, one came with box and one without",
          "Love!",
          "Arrival",
          "Adorable!",
          "Glad I got it",
          "Tiny but pretty.",
          "Nice looking piece"
        ],
        "customerReviewBodies": [
          "The description of this necklace says that it becomes in a beautiful jewelry bag and Kendra Scott box. However, it comes in a plastic bag that could easily damage the necklace. Not only does this look horrible for a piece of jewelry by making it look cheap I was giving it as a gift and now I have to go find a box to put it in. If you were going to state in your description of how it will arrive please make sure you do this. Obviously I did not read the reviews before I purchased this but I wish I had because I seem to not be the first person. Please send item correctly!!",
          "O",
          "I wear this necklace everyday! It hasn’t changed colors in the shower or at the beach! Super cute and dainty looking",
          "This is a birthday gift for my oldest grand daughter she has not seen it yet so I hope she likes it. I am very satisfied with delivery cost and the necklace thank you",
          "Such a cute and simple piece! I receive so many compliments every time I wear this necklace. It also never tarnished, I wore it in the shower for weeks!",
          "Almost passed on buying because some reviews said not original and not packaged well. NOT TRUE. Pretty box, all sealed and nice, and very pretty chain. So glad I got it.",
          "Great for a teenager or young 20ish old. Only a 16” to 17” chain. Tiny heart. Would be a great necklace for a young lady’s first Kendra Scott piece of jewelry.",
          "Great mother's day gift for my daughter to give her mom. She loves it",
          "Haven’t taken it off since I’ve bought this necklace! Probably my favourite necklace! It matches with everything! Danity, which I love as well"
        ]
      }
    },
    {
      "id": "QLjpRjh",
      "title": "1/2 Carat TW Three Stone Diamond Ladder Pendant in 10k White Gold (K-L Color, I2-I3 Clarity)",
      "price": "$312.00",
      "image": "https://m.media-amazon.com/images/I/51FENcjBDvL._AC_UY395_.jpg",
      "description": "A beautiful three stone pendant crafted in 10K white gold. Diamonds weigh a total of 1/2 carat. Symbolizing your past, present, and future, this 3 stone pendant features a unique setting design that is sure to be treasured forever. A great value for a 1/2 carat tw three stone pendant crafted in 10K white gold.\nCRAFTED BY EXPERIENCED JEWELERS - With over 20 years of experience supplying diamond and precious metal jewelry, Szul boasts a team of jewelry industry experts. We source the best value material from around the world and combine it with top-of-the-line manufacturing services. Stones are hand selected by seasoned jewelers to ensure the utmost attention to setting craftsmanship and detail. All items are quality assured by a GIA Graduate Gemologist and come with our full 100% money back guarantee.\nCELEBRATE LIFE'S MOST PRECIOUS MOMENTS - Szul offers a wide variety of fine jewelry perfect for your wife, daughter, niece, grandmother, best friend, girlfriend, husbands, boyfriends and most importantly - yourself! Whether is for a birthday, anniversary, Christmas, Valentine's Day, Mother's Day, Father's Day, an engagement, wedding, or bridal party gifts - Szul offers a huge selection of diamond rings, wedding bands, bracelets, earrings, pendants, and necklaces to choose from.\nCONFLICT FREE DIAMONDS - At Szul, ensuring ethically sourced material is a top priority. All the raw material suppliers and connected mines we work with globally are required to abide by strict labor, trade, and environmental laws so that precious stones can be bought knowing they are conflict free.",
      "reviews": {
        "customerProfileNames": [
          "SRT",
          "Fox",
          "Tazbat33",
          "shawngouldthread",
          "J.Kroh",
          "JohnAnderson",
          "susiec",
          "Cindi"
        ],
        "customerProfilePictures": [
          "https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif"
        ],
        "customerRatings": [
          "5.0 out of 5 stars",
          "5.0 out of 5 stars",
          "5.0 out of 5 stars",
          "5.0 out of 5 stars",
          "3.0 out of 5 stars",
          "4.0 out of 5 stars",
          "5.0 out of 5 stars",
          "4.0 out of 5 stars"
        ],
        "customerReviewTitles": [
          "Family unit",
          "Special gift",
          "Love the diamond pendant",
          "Great deal and very beautiful",
          "Pendant is pretty, chain and clasp not so much!",
          "Is it real",
          "Pure quality!",
          "Pretty but had to customize a new chain"
        ],
        "customerReviewBodies": [
          "Bought this for a family unit gift. It looked good on my daughter.",
          "My wife loved it",
          "Necklace was beautiful chain a little thin but worth the money",
          "Very beautiful",
          "The necklace was a gift from my husband for our anniversary. The pendant itself is very pretty but I’m unable to wear it because the clasp is so tiny and pretty flimsy, it’s impossible to use! I will need to purchase a chain with a more substantial clasp in order to wear it!",
          "The description said it was solid white gold and half carat diamonds they are so shiny we need to take it to a jeweler to make sure it’s real other than that the chain was garbage that will be replaced it was small money so some to be expected but also purchasing some thing you should be able to trust the description of what you’re buying",
          "This necklace is BEAUTIFUL! It’s exactly as described, and I couldn’t be happier-a gorgeous necklace at a decent price!! The quality is top notch-you won’t be sorry you bought it❤️",
          "This is beautiful. I didn’t give it 5 stars because the chain and clasp are very dainty. One tug from a grandchild and it will break. Unwanted to change the chain and clasp but the holes in the pendant are so small I had to go to\nA custom jeweler to make it right. Spent more to make it wearable"
        ]
      }
    },
    {
      "id": "8ExYhiT",
      "title": "Leafael Infinity Love Heart Pendant Necklace, Crystal Necklaces for Women, Silver Tone Jewelry Gifts for Women, 18-inch Chain & 2-inch Extender",
      "price": "$39.99",
      "image": "https://m.media-amazon.com/images/I/619SvHpLNnL._AC_UY395_.jpg",
      "description": "Elegant Necklaces - Our birthstone necklace for women is designed in Boston and features a precious Austrian crystal. Embellished with a love heart stone, our premium jewelry for women is a luxurious display of love.\nDelicate Aesthetic Jewelry that Lasts - This necklace pendant is adorned with a 0.75 x 0.88-inch Emerald Green birthstone crystal for May. It is silver plated and designed with an 18-inch chain, 2-inch extender, and a lobster claw clasp.\nFor Goddesses Like You - Honor your inner goddess with this unique crystal heart pendant. Presented by Miss New York - Nicole Kulovany, this heart necklace is a regal, symbolic statement piece that unveils your feminine spirit.\nStrict Safety Standards - These birthstone charms and jewelry gifts for her meet rigid safety standards. Our silver tone dainty necklace selections also adhere to European REACH Regulations. They don’t contain lead, nickel, or allergens.\nA Thoughtful Gift for Women - Looking for exceptional birthday, holiday, or Mother’s Day gifts? Each Leafael necklace for women is stored in an elegant white, silver-embossed gift box and bag, making it an ideal present for the special women in your life.",
      "reviews": {
        "customerProfileNames": [
          "T.Prentice",
          "RobertoR.",
          "SnarkyTexan",
          "Andrew",
          "Jorge",
          "stacyjenkins",
          "Customer",
          "Customer",
          "JEFF"
        ],
        "customerProfilePictures": [
          "https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif",
          "https://images-na.ssl-images-amazon.com/images/S/amazon-avatars-global/194124ae-1468-44f0-9e75-44107e11924c._CR83,0,333,333_SX48_.jpg"
        ],
        "customerRatings": [
          "1.0 out of 5 stars",
          "1.0 out of 5 stars",
          "1.0 out of 5 stars",
          "1.0 out of 5 stars",
          "1.0 out of 5 stars",
          "5.0 out of 5 stars",
          "5.0 out of 5 stars",
          "5.0 out of 5 stars"
        ],
        "customerReviewTitles": [
          "Leafael Infinity Love Heart Crystal Stud Earrings for Women, Silver Tone Fashion Earrings, Gifts for Women, Statement Earrings for Any Occasion\nLeafael Infinity Love Heart Crystal Stud Earrings for…",
          "Leafael Infinity Love Heart Link Bracelets, Birthstone or Healing Stone Crystal Bracelet for Women, Silver Tone Jewelry Gifts for Her, 7-inch Chain and 2-inch Extender\nLeafael Infinity Love Heart Link Bracelets, Births…",
          "Leafael Infinity Love Women's Adjustable Crystal Heart Ring with Birthstone Crystals Healing Stones, Jewelry Gifts for Women, Birthdays Valentine's Day Mother's Day, Silver-Tone, Open End, Size 6.5-8\nLeafael Infinity Love Women's Adjustable Cryst…",
          "My necklace turned green",
          "It Does not worth a dollar",
          "Buyer Beware",
          "I received nothing",
          "No sirve",
          "",
          "Valentine's day gift",
          "My Birthday gift to myself",
          "good product"
        ],
        "customerReviewBodies": [
          "I strongly advise NOT to purchase this necklace. Within 6 weeks of wearing the necklace it tarnished and turned an ugly green color. It was a gift to my mom for her birthday. I was completely embarrassed. Do not purchase this for yourself and DEFINITELY NOT for a loved one.",
          "After 2 weeks of use my girlfriend send this pictures to me, I feel so bad because I give her this necklace as a gift and I know it will not be the finest necklace, how ever I certainly hope that It will last longer than 2 weeks, nothing on this necklace worth the shame.\n\nI've learn my lesson... never buy jewelry online!",
          "M",
          "I purchased this for mothers day as a gift for my mother. When I opened it imagine my surprise when inside there was a little plastic bag with 2 broken metal pieces, no heart, nothing. Very upsetting. Idk what happened but I'm doing a return",
          "No sirve duro una semana",
          "",
          "It was a Valentine's day gift and she loves it. Told me she got compliments from everybody who saw it!",
          "This is my birthstone and my favorite color. I get the most compliments on this necklace. I wear it almost every day",
          "very good，my mom very like it，me too. thats a goodidea for Mother's Day gift.",
          "A gift to my wife for a wedding anniversary which she was delighted to receive. Not the sort of thing I would normally buy online because it’s the kind of gift that you need to see touch and feel but was pleasantly surprised at the quality of the product… lots of house points for me",
          "Bought this pendant necklace for my friends birthday and she was very pleased.",
          "Great colour and lovely quality pendant. The chain is flimsy, I threw that away.",
          "What great present to get it comes in great sealed box.",
          "I love this necklace its beautiful"
        ]
      }
    },
    {
      "id": "GVTPAW9",
      "title": "PAVOI 14K Gold Plated 3mm Cubic Zirconia Classic Tennis Bracelet | Gold Bracelets for Women | Size 6.5-7.5 Inch",
      "price": "$15.45",
      "image": "https://m.media-amazon.com/images/I/61a6A1NgYUL._AC_UY395_.jpg",
      "description": "",
      "reviews": {
        "customerProfileNames": [
          "MikeSeymour",
          "LanaRhee",
          "Brooke",
          "MercedesMom",
          "Tara",
          "Nicole",
          "Queen",
          "SuzieQ"
        ],
        "customerProfilePictures": [
          "https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif",
          "https://images-na.ssl-images-amazon.com/images/S/amazon-avatars-global/e3c4b8fc-a55b-48c3-837a-981736aa126e._CR0,0,667,667_SX48_.jpg",
          "https://images-na.ssl-images-amazon.com/images/S/amazon-avatars-global/2cb9e156-bc8e-469a-86d0-70dddfb63421._CR0,0,500,500_SX48_.jpg",
          "https://images-na.ssl-images-amazon.com/images/S/amazon-avatars-global/e46876b5-9260-40ae-aa9f-e1f9816a2c5b._CR0,0,400,400_SX48_.jpg",
          "https://images-eu.ssl-images-amazon.com/images/S/amazon-avatars-global/d1955252-9b53-415f-bda3-3ac2762a4648._CR81,0,338,338_SX48_.jpg",
          "https://images-eu.ssl-images-amazon.com/images/S/amazon-avatars-global/default._CR0,0,1024,1024_SX48_.png"
        ],
        "customerRatings": [
          "5.0 out of 5 stars",
          "5.0 out of 5 stars",
          "5.0 out of 5 stars",
          "5.0 out of 5 stars",
          "5.0 out of 5 stars",
          "5.0 out of 5 stars",
          "4.0 out of 5 stars",
          "3.0 out of 5 stars"
        ],
        "customerReviewTitles": [
          "🔥",
          "Makes me feel like a million bucks",
          "Surprised",
          "Beautiful bracelet!",
          "Great Clarity Prong Set Tennis Bracelet - Matches my real Diamonds",
          "GORGEOUS!!!",
          "Really Nice!",
          "Sparkly, but not durable"
        ],
        "customerReviewBodies": [
          " This thing is so bomb, especially for the price!! A little tip- for amazing sparkle use a disposable mascara wand and Jo Malone hand soap and gently scrub the CZ/diamonds. And then to keep costume jewelry from tarnishing, spray it with a polyurethane clear coat. Thank me later :)",
          "Beautiful! I feel like a princess when wearing this. Such great quality at affordable prices. Absolutely recommend",
          "I bought this to start stacking with my smartwatch. I'm very glad I did. It hasn't faded, no stones have come out, and hasn't turned colors.",
          "This tennis bracelet is amazingly realistic looking. I have a 6 carat REAL diamond tennis bracelet and in a way this \"imitation\" is prettier because the stones are more like PERFECT diamonds which are not found in the average diamond tennis bracelet. I purchased this inexpensive bracelet to wear in situations in which I would not feel comfortable wearing my REAL diamond bracelet. I am interested to see how long this bracelet remains nice looking and holds up to normal wear since it is such an affordable price. I hope the gold plating and construction of the bracelet will hold up. But for now, I can say the bracelet is beautiful and very believable if a diamond tennis bracelet of this size is within your budget range.",
          "Such a beautiful piece! Was contemplating buying a real tennis bracelet during a sale at my jewelers... Stumbled upon this and saved myself thousands. It really does look like a real tennis bracelet with true clarity diamonds. Not like a regular tennis bracelet though, but exactly like those set on prongs so that even though it’s a small CT count, the diamonds look extremely large. A really nice optical illusion. this bracelet nails it! Matches my real diamond bracelet and doesn’t dull down the clarity of the real diamonds - making for a perfect match that no one can tell apart. Definitely going to buy a few more so they can look like stackables! Absolutely buy if you’re contemplating!!",
          "Absolutely GORGEOUS!! I have really small wrists so I ordered the 6.5\" in white gold, and it fits PERFECTLY!!!! I can't wear this bracelet enough. It's so pretty! Doesn't look cheap and can be casual yet classy at the same time. I'm definitely happy with my purchase. It looks just like the product picture shown, and has zero defects.\n***If helpful, please click 'Helpful'*** :)",
          "Tennis bracelet is nice, worth the price. Has a nice shine to it, I kinda wish the gold was a little darker; just my preference. It is really nice otherwise.",
          "This bracelet really sparkles, and I love the size of the stones, but I fear it will not hold up to much wear. My biggest concern is the stiffness the bracelet. Other tennis bracelets I own lay flat on the dresser. But this one has to lay on its side, curled up. If I were to force it to lay flat it would definitely break. The links also kink and \"catch\" on each other and if I don't work them loose careful, again, I am sure it would break. I decided to keep the bracelet and just take extra care, but I'm not expecting it to last long.",
          "Read lots of good reviews about this bracelet and decided I need it also. It's very very sparkly! Not sure though about it looking like read diamonds as one lady wrote about silver one...\nOn photos I took on Pandora bracelet for comparison, as for me smaller stones would look better on this bracelet. It's bit not my taste so presented to my sister and she loves this bracelet!",
          " Stunning! I’ve been searching high and low for a tennis bracelet but didn’t want to break the bank plus these often come in very big sizes and my wrists are small, this one fits me perfectly (6,5 inch) hope it holds up nicely over time :)",
          " Excellent quality, well made and very sparkly. Looks sparkly and complements my jewellery",
          "Very pleased with this pretty bracelet. Nice quality cubic zirconias but not too flashy to wear every day. Good strong clasp which is easy to fasten.",
          "I thought this bracelet was excellent value for the cost. It is very good quality compared to others i have bought, small and sparkly, it looks like the real deal!"
        ]
      }
    },
    {
      "id": "bLxHVgT",
      "title": "Fossil Women's Riley Stainless Steel Crystal-Accented Multifunction Quartz Watch",
      "price": "$68.72",
      "image": "https://m.media-amazon.com/images/I/81wpXBry22L._AC_UY500_.jpg",
      "description": "From classic chronographs to the newest smartwatches, we’ve got the watch styles you love. The best part is that our wide selection of timepieces comes in enough styles, colors and designs to keep your style fresh and fun for years to come. Whether you’re looking for an everyday watch, something for a special occasion or a gift for loved ones, you’ll find it here. We’ve got the leather strap watches, stainless steel, mesh and silicone for whatever material suits you best. With a classic shape and sporty features, Riley is a style that transcends the season, Riley plays with proportion in a sophisticated way Signature D-links interlock with a skinny bone leather strap and bold, round dial for a stylish look all its own.",
      "reviews": {
        "customerProfileNames": [
          "MichelleOsman",
          "AmandaMichelleHolmes",
          "LorenaMerino",
          "AandS",
          "OkinawaMeow",
          "RUmossy",
          "SarahJohnson",
          "RobinBullard"
        ],
        "customerProfilePictures": [
          "https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif",
          "https://images-na.ssl-images-amazon.com/images/S/amazon-avatars-global/e9a7c836-114b-4acf-a1cd-aa6c95dc394c._CR0,0,500,500_SX48_.png",
          "https://images-na.ssl-images-amazon.com/images/S/amazon-avatars-global/c8ae0602-cc91-4ff7-815c-bebacf3c5958._CR19,0,394,394_SX48_.jpg",
          "https://images-na.ssl-images-amazon.com/images/S/amazon-avatars-global/82d9b219-6198-4640-a8b2-d50241f55c05._CR0,0,500,500_SX48_.jpg",
          "https://images-na.ssl-images-amazon.com/images/S/amazon-avatars-global/9bdc55e6-5e18-49df-bc41-00d71d5a8e8e._CR28,0,443,443_SX48_.jpg",
          "https://images-na.ssl-images-amazon.com/images/S/amazon-avatars-global/5fb18011-6cb0-4c58-81dc-05ca3f39924b._CR0,0,375,375_SX48_.jpg",
          "https://images-eu.ssl-images-amazon.com/images/S/amazon-avatars-global/default._CR0,0,1024,1024_SX48_.png",
          "https://images-eu.ssl-images-amazon.com/images/S/amazon-avatars-global/9b5c2713-1fbf-4e46-b7e1-60700216fe27._CR62,0,375,375_SX48_.jpg",
          "https://images-eu.ssl-images-amazon.com/images/S/amazon-avatars-global/a57b0e57-35f5-4f80-9f64-fa9699a70874._CR0,0,500,500_SX48_.jpg"
        ],
        "customerRatings": [
          "5.0 out of 5 stars",
          "5.0 out of 5 stars",
          "5.0 out of 5 stars",
          "5.0 out of 5 stars",
          "5.0 out of 5 stars",
          "5.0 out of 5 stars",
          "5.0 out of 5 stars",
          "5.0 out of 5 stars"
        ],
        "customerReviewTitles": [
          "My favorite watch",
          "The Fossil you'd expect!",
          "I love it and I hope it lasts forever",
          "Love LOVE This Watch!",
          "If you need reading glasses....",
          "IN LOVE",
          "High quality...",
          "It's a great timepiece!"
        ],
        "customerReviewBodies": [
          "I love everything about this watch! Love the color, the size, the fit! It is easily my favorite watch! And I love that I can wear it dressed up and dressed down!",
          "It's a stunning watch. Large bezel with 3 chronographs. Has a nice weight like a real watch should. The movement is exceptionally well made just as you'd expect from a Fossil. As usual it came in a classic Fossil tin. I did need to order an extra link because I like it to move on my wrist, but it's perfect! (Which can be ordered directly from Fossil. First 3 are free, just pay S&H)",
          "Edit**\nI still have the watch and is in perfect condition, I plan to order the silver one. (2019)\n\nI got this watch and I have been using it one a week for over 3 months. The rinestones have not fallen down and the color has not faded. I really like it it is very elegant and not too big, not too small. So far so good and I take a good care of it. I would have love it for it to come in a different box, more elegant of something but it's ok.\nUpdate!: It's been a bit over 6 months and the color has faded a lil bit, like it's peeling. :( but the rihnestonea are good",
          "This watch is beautiful! It took me a few days to get used to the size because it's almost as big as a man's watch. But, now I'm loving it and I don't have to squint to see the time! I've gotten tons of compliments and it truly goes with any outfit.",
          "If you need reading glasses I wouldn’t expect to read the small numbers (which I didn’t think about when I purchased this), but I can read the main dial. Otherwise... this watch is solid and beautiful. I am 5’10” so most watches look puny on me. I wanted something with a bigger dial that wouldn’t look too masculine. The rhinestones around the edge are a feminine touch that makes it clear it’s mine, not one I borrowed from my husband. I have showered and swum with it and have had no issues. Great quality.",
          "I’ve been watching this watch for a long time and I finally got it when it was on sale here. I could not be happier. It is GORGEOUS. I get compliments every time I wear it, from men and women both. It’s an eye catcher. I love that it has the dials for the date, day of the week, and second hand, too. I love the color. It’s not too pink like some rose golds can be but it’s definitely rose gold. I saw where some reviews stated they had problems with the rose gold color wearing off, but I’ve been wearing mine for a while now and I haven’t had any problems with it whatsoever. This was a great investment and I think it will be a classic that never goes out of style.",
          " High quality 🤩🤩🤩🤩🤩\nMy first purchase was an authentic gold but on my second purchase the color was slightly different, was more greenish gold but beautiful",
          "I just love it. I got it at a steal! Lowest price I've ever seen and I actually had money!!! I've been watching this for a couple years, and I'm so glad I got it.\nI need a link out, but otherwise, perfect! So timeless and classy.\n\nI'm adding to my review, some months after wearing my watch constantly 🙃. I still need a link out but it never pinches me. It Cleans up beautifully. Keeps excellent time. It's an excellent timepiece. Love it.",
          "J'adore cette montre, elle va avec toutes les tenues, aussi bien habillée que sportive.\nIndique l'heure, la date. Possibilité de retirer des maillons suivant la taille de votre poignée. Possède un film discret sur le verre. Après plusieurs semaines d'utilisation, il ne bouge pas et permet de protéger la montre.\nSi ce commentaire vous a été utile pourriez-vous svp l'indiquer. Merci",
          "",
          "Brought this for my wife’s 40th birthday as I wanted something that looked and felt amazing for my wife (she’s worth it! Don’t tell her)\n\nDelivery was fast, and genuine fossil product\n\nAbsolutely beautiful! Exactly as pictured. well made, The rose gold colour was a must have for the wife\n\nThe dial is a nice size and very clear, the other dials day, date and seconds are very clear and easy to read.\n\nThe strap does need adjusting and once this lockdown is over I will get it done at a store, i don’t recommend doing it yourself unless you know what your doing as it is easy to mark the strap",
          "Bell'orologio da donna. Sembra un Mihael Kors... che costano almeno il doppio. I brillantini anche dopo un anno non si sono staccati.\nMia moglie è rinasta soddisfattissima!\n\nVisto che è un prodotto da me acquistato e che utilizzo, se avete domande o dubbi sull'articolo contattatemi.\nSe ritenete utile la mia recensione cliccate su UTILE.\nGrazie mille!",
          "",
          "This is far the best watch that i have ever bought, it came beautifully packaged and the watch looks stunning,Its heavy in weight, it looks really expensive and it really does wow in certain lights. I have to say the photos doesnt show the true wow factor of this watch",
          "Purchased as a Christmas gift for my girlfriend and she is very pleased with it. She wears her Fitbit daily, but wears this if we're going out for the evening.\n\nIt's a smart, glamorous ladies watch. The size is just right in my opinion, and has the aesthetic of a \"blinged up\" chronograph watch, although it lacks any sort of chronograph (stopwatch) functionality. The cut glass gemstones are nice and sparkly, complimenting the polished and brushed steel well.\n\nYou'll need to adjust the bracelet to size, and this involves removing links. So, for most people this will involve a trip to a jeweller or your local Timpsons store. I collect watches and have the tools to do it myself, so it only took me a few minutes. If you don't have the tools, be careful not to scratch your new watch whilst trying.\n\nWith my \"watch collector\" head on, you could argue that it has a cheap quartz movement or that the locking clasp for the watch is a bit disappointing, but it works perfectly for my girlfriend and she's very pleased with it. I'm sure that you will be pleased with it too."
        ]
      }
    },
    {
      "id": "sOOZHtJ",
      "title": "Trendsmax Initial A-Z Letter Pendant Necklace Mens Womens Capital Letter Yellow Gold Plated Stainless Steel Box Chain 22inch",
      "price": "$12.99",
      "image": "https://m.media-amazon.com/images/I/61cKZ3eQ5KL._AC_UY395_.jpg",
      "description": "Material: Gold Plated Pendant Stainless Steel Box Link Chain\nMeasurement: Pendant Length:20mm Width:16mm Chain Length:22inch\nThe pendant is made of environment and human friendly cooper, Nickel free.the Chain is Stainless Steel.\nPerfect for daily wear and for special occasions.Letter Necklace is a good Necklace Gift let Her know she's the most important one for you like these Letter Name\nSpecial gift for Christmas Day, Birthday, Valentines Day, Anniversary, Thanksgiving Day, etc.",
      "reviews": {
        "customerProfileNames": [
          "MichaelRatliff",
          "AlexisLeon-Melendéz",
          "AlexandraH.",
          "Lillian",
          "Mea",
          "Bonnie",
          "Tracybeth",
          "LiaDuque"
        ],
        "customerProfilePictures": [
          "https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif",
          "https://images-na.ssl-images-amazon.com/images/S/amazon-avatars-global/09ace877-b9b8-467d-b3c4-e14a9962c483._CR0,41.0,251,251_SX48_.jpg",
          "https://images-na.ssl-images-amazon.com/images/S/amazon-avatars-global/e3866ad3-a67b-4a92-a10c-e7f02ff24401._CR0,0,400,400_SX48_.jpg",
          "https://images-na.ssl-images-amazon.com/images/S/amazon-avatars-global/9790e9bd-a1d2-45bd-ac27-a3059f7702bb._CR0,26.0,281,281_SX48_.jpg",
          "https://images-na.ssl-images-amazon.com/images/S/amazon-avatars-global/471e6af5-fe07-411a-b51e-35a811be9232._CR0,26.0,281,281_SX48_.jpg"
        ],
        "customerRatings": [
          "5.0 out of 5 stars",
          "5.0 out of 5 stars",
          "5.0 out of 5 stars",
          "5.0 out of 5 stars",
          "3.0 out of 5 stars",
          "5.0 out of 5 stars",
          "4.0 out of 5 stars",
          "5.0 out of 5 stars"
        ],
        "customerReviewTitles": [
          "Pendant is identical to Bracha one.",
          "STUNNING!",
          "So trendy",
          "Good necklace",
          "Purchase the pendant ONLY!",
          "Beautiful!!!!!",
          "Cute and reasonably priced",
          "Beautiful accessory, wore the whole trip to Tulum and color stay the same"
        ],
        "customerReviewBodies": [
          "T",
          " Bought this last Wednesday as a birthday present for my stepson and he absolutely loved it. It was fast delivery, chain was in two small ziplock bags and then inside the black bag that came include to store the chain inside. It’s actually very stunning in person, I would definitely recommend this product!",
          "I wish the chain was a tad shorter, but overall this is such a great trendy peice. It doesn't look or feel cheap and I've gotten plenty of compliments on it. It's definitely an on trend peice but I think it will last a long time. I've worn it almost every daily and have had no issues with tarnishing or color transfer.",
          "I like this necklace! I can and have been wearing it in the shower and no issues. It’s made well!",
          "The initial pendant itself is adorable and looks amazing and very real. The necklace/chain it comes with however is horrible. I took a picture of it next to my real gold chain. As you can see, the charm.. beautiful.. the necklace.. the color for one is comparable to a penny and the sturdiness is questionable.. dainty and looks like it came from the dollar tree..\nHowever, I WOULD purchase this product again but next time only the charm and find a chain elsewhere! It’s still very giftable and worth the price for the charm alone. The ONLY reason I gave 3 stars instead of 5 is because of the chain! Otherwise if I had purchased the pendant only, I would have gave it 5!",
          " Delivery was so fast, I couldn’t believe it. The chain is so beautiful. I have no complaints. I will be ordering again.",
          "My son loves his new chain with his initial. He immediately started wearing it as soon as it arrived. Looks like the real thing but doesn’t have the weight like the real thing. All in all, it is a nice accessory as a gift. Hopefully it doesn’t start changing colors."
        ]
      }
    },
    {
      "id": "dyAfCtf",
      "title": "5 Pairs Stud Earrings Set, Hypoallergenic Cubic Zirconia 316L Earrings Stainless Steel CZ Earrings 3-8mm, Rose Gold",
      "price": "$12.99",
      "image": "https://m.media-amazon.com/images/I/61Bo7RLeiTL._AC_UX385_.jpg",
      "description": "",
      "reviews": {
        "customerProfileNames": [
          "AJM",
          "Bobbi",
          "Coastiewife",
          "AmintaFunicello",
          "Ali",
          "Margot",
          "Colin",
          "Abigail"
        ],
        "customerProfilePictures": [
          "https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif"
        ],
        "customerRatings": [
          "5.0 out of 5 stars",
          "5.0 out of 5 stars",
          "5.0 out of 5 stars",
          "5.0 out of 5 stars",
          "5.0 out of 5 stars",
          "5.0 out of 5 stars",
          "5.0 out of 5 stars",
          "5.0 out of 5 stars"
        ],
        "customerReviewTitles": [
          "Gorgeous and comfortable!",
          "Pretty and no irritation!",
          "Great for sensitive ears.",
          "Great earrings.",
          "Amazing and actually are hypoallergenic!",
          "Great product",
          "Depends what you are looking for.",
          "Great earrings!!! No tarnish"
        ],
        "customerReviewBodies": [
          "These are absolutely gorgeous and super comfortable. I haven’t had them long enough yet to know for certain that they won’t irritate my sensitive ears in the long run, but my hopes are high. So far I’m super impressed, great quality for the price.",
          "I hadn't been able to wear earrings in so long even sterling silver ones. These stainless steel rose gold studs are just what I needed. I put them in and had a little discomfort since my holes were almost closed, but I have had them for weeks now without taking them out. There is no redness, swelling, or discoloration from these earrings and they look very nice.",
          "Perfect for my 8 year old daughter. She had the smallest set in her ears 24/7. They are just slightly bigger then the studs she got her ears pierced with. She has really sensitive ears and can’t wear anything from the mall stores. Glad to find these.",
          "They don't turn black",
          "They are hypoallergenic!!!!",
          "Didn’t have an allergic reaction to these. Would buy again",
          "I like the earings and I use them for my own personal use. I wanted something that look nice but not expensive. I work with public so if for some reason I get robbed while at work it would not be costly for me.",
          "These earring are great! I think I’ve had them for over a month and I haven’t taken them out. They get wet in the shower and when swimming and they still haven’t changed their color one bit. Definitely recommend",
          "Much cheaper than store bought～～l likeeee",
          "Really pretty",
          "They look and feel very cheap. I put them in and they quickly hurt my sensitive ears - they still hurt days after taking them out. You could probably get same quality at Ardennes or Claire’s",
          "Turned my ears green in just a day of wearing them. Do not recommend.",
          "Was not rosegold as pictured"
        ]
      }
    },
    {
      "id": "ylgqNhQ",
      "title": "LANTAI 16-20 Pairs Trendy Acrylic Earrings Rattan Earrings for Women-Summer Beach Straw Woven Earrings Resin Leaf Dangle Drop Earrings Geometric Statement Earrings Vacation Jewelry",
      "price": "$19.99",
      "image": "https://m.media-amazon.com/images/I/71Cjr-ryvpS._AC_UY395_.jpg",
      "description": "Product Specification\n\nMetal:Alloy\nMaterial:Acrylic and Rattan\nColor:Gold\n\nPackage Contains:\n\n16 Pairs Rattan Earrings and Tassel Earrings\n1 Packing BOX\n\nWonderful Gift\n\nGive This Earring As A Unique Present to Your Loved Ones, Like Lover, Girlfriend, Wife, Fiancee, Mother, Mother in Law, Daughter, Friend or Yourself for Valentine's day, Mother's day, Christmas Day And So On. Express Your Love to Them and Make Them Feel Special and Happy.\n\nCOMPLETELY VERSATILE\n\nThis earring fit all your dress, like jeans, dress, coat ect. You Can Wear It for Birthday Party, Wedding, Anniversary, Festival Celebration, Concert. Just Get It and Show Your Own Style In the Crowd.\n\nMaintenance Tips:\n\nAvoid Chemicals. Please take it away from cleaning agents,perfumes, body moisturizer, ect. It can take off the finish and change color\nAvoid Contact with Water, No Baths, Pools, Sea Water, etc. If it gets wet that can leave dark water spots which are difficult to remove\nPlease Don't Wear It When Sleeping. To keep your gorgeous jewelry looking like new, take it off at the end of the day and give it a quick wipe down with a microfiber cloth\nAvoid Violent Collision. It is easy to deform your jewelry\nTake it off when you sweating a lot, avoid prolonged wear. It can cause erosion\nPlease store them in zippered plastic bags, squeeze air out to limit the oxygen that gets to jewelry\n\nPlease note:\n\nSince this earring back is small, please keep it away from children and pets, beware swallowed\nPlease clean it with soft cloth before your wear it every time, if you feel uncomfortable, just stop to wear it.\n\n100% SATISFACTION GUARANTEE\n\nWe Promise 90-Days Exchange and Money Back Guarantee.If You Have Any Problems on Our Earring,Contact us We Will Reply You within 24 Hours",
      "reviews": {
        "customerProfileNames": [
          "dpayne1973",
          "KristinP",
          "Pat",
          "MichelleBrown",
          "WWAD",
          "SunniHart",
          "KimberlyDavis",
          "Juliejkirk"
        ],
        "customerProfilePictures": [
          "https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif"
        ],
        "customerRatings": [
          "5.0 out of 5 stars",
          "5.0 out of 5 stars",
          "5.0 out of 5 stars",
          "5.0 out of 5 stars",
          "5.0 out of 5 stars",
          "5.0 out of 5 stars",
          "5.0 out of 5 stars",
          "5.0 out of 5 stars"
        ],
        "customerReviewTitles": [
          "As described, good value",
          "Best gift to give",
          "Lovely Statement Earrings",
          "These are so cute",
          "Earnings earnings and more earnings",
          "Earrings go with every outfit!",
          "Buy this!!",
          "Super cute and doesn’t matter if you lose one!"
        ],
        "customerReviewBodies": [
          "For the price you pay, it's a good value. 9 earrings, which I will probably wear all of them. The ones I might not wear are the ivory rattan/tassels, because the posts are bright white. I may paint them to match, it just doesn't look right together, imo. A lot of reviews say the rattan doesn't match on the sets, mine does. Or that they break easy, so time will tell. For what you pay, even if you wore 2-3 pairs, it's worth it.",
          "I bought this gift for a friend who loves to dress up and go on vacation. These are such a great variety and quality with small plastic packaging for each set and enclosed in a perfect plastic hard case for traveling. I think I’m gonna have to buy some for myself now too I love them.",
          "I love these so much I bought my best friend a set for Xmas. The value, quantity, and quality is amazing for the price.",
          "I didn’t know what to expect for 20 bucks, but these are so cute. A very nice variety and they come in a little plastic box to keep them all in there. With what I paid",
          "Totally worth the money. So fun for vacations, trips with other girls and being able to share and style a new pair every night!!!",
          "I absolutely loved this product! I’ve never been a dangling earring person but these earrings are just awesome to wear! These are a must buy!",
          "Such a great purchase! I love wearing earrings to dress up an outfit and this is a great deal. Lots of variety and seems like pretty good quality so far for an amazing price. Would definitely recommend buying.",
          "These are fun + colorful, great variety. They make a great stocking stuffer or a gift add on… Quality is comparable to the price, but I give a 10/10 based on this. Perfect for dressing up a casual outfit or a beach day, etc."
        ]
      }
    },
    {
      "id": "VARKwVu",
      "title": "SWAROVSKI Women's Stone Crystal Pierced Hoop Earring Collection",
      "price": "$69.00",
      "image": "https://m.media-amazon.com/images/I/71qTKoyibQL._AC_UY500_.jpg",
      "description": "",
      "reviews": {
        "customerProfileNames": [
          "MotherNature'sFriend",
          "Ayesha",
          "supercómodoslindos😍",
          "Mepn",
          "Charissa",
          "Riverwind",
          "Guido101",
          "CustomerMarion"
        ],
        "customerProfilePictures": [
          "https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif"
        ],
        "customerRatings": [
          "5.0 out of 5 stars",
          "5.0 out of 5 stars",
          "5.0 out of 5 stars",
          "5.0 out of 5 stars",
          "5.0 out of 5 stars",
          "5.0 out of 5 stars",
          "5.0 out of 5 stars",
          "4.0 out of 5 stars"
        ],
        "customerReviewTitles": [
          "I HAVEN'T TAKEN THEM OFF, SINCE I RECEIVED THEM.",
          "Lovely so cute",
          "Que me encantaron y eran lo que yo buscaba 🥰",
          "",
          "Hermosos",
          "",
          "Authentic",
          "Super awesome",
          "To the woman I love ❤️",
          "They were smaller than I expected. But pretty."
        ],
        "customerReviewBodies": [
          "So comfortable! Was eyeballing genuine diamond earrings but knew, in my heart, that home maintenance came first. Then I spotted these. What a lovely discovery! Happy with my purchase.",
          "My son gave me for mothers day and i absolutely love em",
          "Me encantaron y era lo que yo buscaba una calidad excelente …🥰",
          "",
          "Se ven hermosos puestos",
          "",
          "This is an authentic product and matched beautifully with a similar chain from swarovski. Thank you!",
          "I cannot express how much I love it when I receive the little earrings. They are shinny, elegant, and timeless. It goes well with my ring, which I believe is from the same series of Swarovski jewelry.",
          "She loves them. She wears them to bed with no problem. I made the right decision.",
          "I wish they had been a little longer.",
          "It took me a little while to find these earrings, I had been bought them before from the actual shop, and they were beautiful - I was bought them a few times from the actual store. When I lost both my pairs I decided to purchase them online when in lockdown. When I received them they were terrible, they were nothing like the ones we had purchased in the shop, they dont sparkle, are alot smaller and really arent worth ten pounds as costume jewellery never mind nearly 50 pounds. Not worth the money - highly disappointed - total waste of money - I havent worn at all and wont be.",
          "The labelling is for the wrong products (says necklace when these are earrings) and the receipt is for a bracelet! I contacted the seller over a week ago to ask them to confirm the product is genuine and have had no reply. The metal bar that is put through the ears is also bent. They have come from Asia, and the bag they came in is also not authentic. Beware.",
          "The first package arrived with the box intact but no earrings in it - just the card they had been attached to. Clearly theft & not a mistake. The package itself was VERY poorly packed & totally insecure with the seal only just touching the seal of the envelope. Customer service was extremely helpful & sent a replacement next day. This time it was properly sealed & goods intact. The earrings themselves were acceptable but had been photographed to appear much larger than they were, a practice I find deceptive in the extreme.",
          "Mum loved them and said they were a great size and very comfortable to wear.",
          "These are pretty and fit just right"
        ]
      }
    },
    {
      "id": "zbDtJCN",
      "title": "Dainty Layered Initial Necklaces for Women, 14K Gold Plated Paperclip Chain Necklace Simple Cute Hexagon Letter Pendant Initial Choker Necklace Gold Layered Necklaces for Women",
      "price": "$14.99",
      "image": "https://m.media-amazon.com/images/I/513jmV-V1aL._AC_UX385_.jpg",
      "description": "SIZE: Size of the gold paperclip chain initial necklaces is 18\"+2\" extension, and the layering paperclip chain necklace is 14\"+2\" extension, perfect dainty layered necklaces initial necklaces for women girls wear.\nMATERIAL: Made of high quality brass material, 14K real gold plated, nickel free and lead free, no harm to skin.\nLAYERING INITIAL NECKLACES: Gold layered paperclip chain letter initial necklaces set with hexagon charm, engraved with initial and heart in back and front, large initial pendant dainty necklaces for women teen girls jewelry.\nPERFECT GIFTS: Comes with an elegant free gift necklace box, perfect gifts jewelry for women girls teen girls wear....\nAFTER SALE SERVICE: 180 Days after sales service and exchange, reply you within 24 hours to solve your problem.",
      "reviews": {
        "customerProfileNames": [
          "ErinNicole",
          "amandaj",
          "Kalypso",
          "Mike",
          "Ladii",
          "enterbackspace",
          "EmM.",
          "jazwa"
        ],
        "customerProfilePictures": [
          "https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif",
          "https://images-na.ssl-images-amazon.com/images/S/amazon-avatars-global/a096696e-0c20-4994-b7b3-83f30a0f0d6a._CR0,26.0,281,281_SX48_.jpg",
          "https://images-na.ssl-images-amazon.com/images/S/amazon-avatars-global/dcca61f8-9b7b-4652-80b0-21a74f844b3c._CR0,26.0,281,281_SX48_.jpg"
        ],
        "customerRatings": [
          "5.0 out of 5 stars",
          "5.0 out of 5 stars",
          "5.0 out of 5 stars",
          "5.0 out of 5 stars",
          "3.0 out of 5 stars",
          "2.0 out of 5 stars",
          "5.0 out of 5 stars",
          "5.0 out of 5 stars"
        ],
        "customerReviewTitles": [
          "Get Em!",
          "Love",
          "Beautiful! True to picture!",
          "SO CUTE BUY THIS!",
          "Didn’t hold up :(",
          "Gum-ball Machine Trinket",
          "Trendy and super cute",
          "Very nice necklace set"
        ],
        "customerReviewBodies": [
          "O",
          "Great quality for the price!",
          "It’s so beautiful and feels sturdy. I love Dainty gold jewelry. This is my first day wearing it. Mom loved it.",
          "Soooo cute and comes with a little gold chain as well! They even sent a little note card which came so in handy because i forgot a card for this gift! Love this, ending up buying in 2 other initials as well :) Great gifts!",
          "So initially upon opening the package it’s absolutely beautiful. Everyone noticed it and complemented it. However, not even 5 minutes of wearing it a piece broke off of the end before I could even make it out of the door. I had to to take it off for fear that it would continue coming apart once I left the house. I wasn’t tough with it at all literally just had to put my shoes on and walk out the door and it broke :( , which is unfortunate because it’s gorgeous.",
          "I",
          " Loved the material and that is sweat resistant, at least to me. Looks so trendy and eye catching when using both necklacea. Only con I would say is that you have to untangle them when using both.",
          "I'm so glad I purchased this set, I will definitely purchase more jewelry pieces from this company on the near future.",
          "Love this necklace set, seems to be lasting well without discolouring so far",
          "As advertised. Looks like the pic provided. Good quality and came nicely packed. Will be great as gift. A lot of details put into this precious handmade Jewelry.",
          "I love love love these necklaces!",
          "So lovely, great quality.\nWorth the money have bought more necklace's from this collection.",
          "Me encanto el collar, me lo lleve a la playa con el puesto tanto en alberca y playa, y sigue conservando brillo, color",
          ""
        ]
      }
    },
    {
      "id": "RUOLEMo",
      "title": "Kendra Scott Ever Short Pendant Necklace for Women, Dainty Fashion Jewelry",
      "price": "$19.99",
      "image": "https://m.media-amazon.com/images/I/41+w9X-P8jS._AC_UY395_.jpg",
      "description": "",
      "reviews": {
        "customerProfileNames": [
          "cathysams",
          "Customer",
          "jennshair",
          "Brian",
          "AmandaWitkowski",
          "Customer",
          "CarolineSchrems",
          "Tumbleweed7"
        ],
        "customerProfilePictures": [
          "https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif"
        ],
        "customerRatings": [
          "1.0 out of 5 stars",
          "1.0 out of 5 stars",
          "1.0 out of 5 stars",
          "5.0 out of 5 stars",
          "1.0 out of 5 stars",
          "5.0 out of 5 stars",
          "5.0 out of 5 stars",
          "3.0 out of 5 stars"
        ],
        "customerReviewTitles": [
          "Tarnished very quickly",
          "It’s a fake.",
          "Fraudsters",
          "Dainty...",
          "Will not recommend",
          "Favorite",
          "Quality",
          "Pretty but MADE in China - not U.S."
        ],
        "customerReviewBodies": [
          "Bought this for my daughter and very quickly it was tarnished and discoloring her skin. Not happy with this purchase especially for the price.",
          "It’s a fake. This is definitely NOT a real Kendra Scott! I bought one and the packaging was wrong, the chain was not gold, and the stone was definitely not like my real Kendra Scott pieces.",
          "This was going to be a High School Graduation gift but the pendent has missing stone and I paid $85 but the price tag on the package says $65. I just can't believe this is how Kendra Scott INC would do business. Very disappointed",
          "So pretty. If you want it to be a little longer go ahead and order a necklace extender while you're on here. I'm not a big girl, but I did get one for it and I'll be wearing it with that from now on. I got the black drusy. 🖤",
          "Here is my full review : part 1 .. this item was delivered to my house supposedly and was gone by the time I got home, I believe It was never delivered. Part 2: I got Item and the pendant is very small but since I always Wanted a Kendra Scott necklace I decided To keep it . I wore It once and it looked very small on my chest . When I took It off it was tarnished and the stone looked yellow. I also Did not get a bag like everyone description to store the jewelry . Really disappointing in this purchase and her jewelry",
          "One of my favorite necklaces!",
          "My granddaughter selected this necklace for her birthday. We were very pleased with the quality and luster. Very good choice. Very pleased. She loves it.",
          "The necklace is fine. The setting seems secure and straight - not crooked. What I am really disappointed to see is that it was made in China.\n\nHer website states pieces are designed in Austin, TX but it is clear that they are manufactured in China. I understand that it's probably cheaper but I really hope that she eventually has her pieces manufactured in the states.\n\nHaving said that, it is a pretty necklace and I am sure our daughter will enjoy it."
        ]
      }
    },
    {
      "id": "K8D8lBC",
      "title": "Lucky Brand Turquoise Hoop Earrings, Silver, One Size",
      "price": "$20.00",
      "image": "https://m.media-amazon.com/images/I/715vmQP01qL._AC_UY500_.jpg",
      "description": "Traditional hoop earrings with a touch of Southwestern flair. These hoops from Lucky Brand flaunt turquoise-colored plastic stones set in silver-tone mixed metal. Approximate drop: 1 inch.",
      "reviews": {
        "customerProfileNames": [
          "KrisMoore",
          "jess",
          "AndrewDurand",
          "Customer",
          "Customer",
          "Lisa",
          "AnnGurian",
          "Lynne"
        ],
        "customerProfilePictures": [
          "https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif"
        ],
        "customerRatings": [
          "5.0 out of 5 stars",
          "5.0 out of 5 stars",
          "5.0 out of 5 stars",
          "5.0 out of 5 stars",
          "5.0 out of 5 stars",
          "5.0 out of 5 stars",
          "1.0 out of 5 stars",
          "2.0 out of 5 stars"
        ],
        "customerReviewTitles": [
          "They were priced right and made very well. Sterling with genuine turquoise 💕",
          "Beautiful!",
          "Perfect little earrings",
          "Good",
          "Beautiful",
          "LOVE",
          "Yukky",
          "Pictured larger than actual size"
        ],
        "customerReviewBodies": [
          "The price was great the prodict is made very well",
          "Great purchase! Beautiful and great quality!",
          "These are perfect earrings for me. I talk on the phone all day for work and they don’t stab my neck. They stay in, are comfortable, and I get tons of compliments on them. They are like the little black dress of earrings.",
          "Good",
          "Beautiful",
          "absolutely love these earrings. I put them in the day I received them and have had them in ever since. comfortable to sleep in, and look very good with my other earrings.",
          "Not what I expected. They broke right away",
          "R",
          "Loved the earrings but 3 out of 6 stones fell out within 3 months. Don't wear them to bed. Can't handle contact with pillows, I guess. V. Disappointed",
          "nice quality and fair price",
          "As advertised. Satisfied."
        ]
      }
    },
    {
      "id": "cV7w0AW",
      "title": "Kendra Scott Fern Pendant Necklace for Women",
      "price": "$50.00",
      "image": "https://m.media-amazon.com/images/I/61KJW1OOJyL._AC_UY500_.jpg",
      "description": "",
      "reviews": {
        "customerProfileNames": [
          "KindleCustomer",
          "Customer",
          "CB",
          "Customer",
          "TylerBray",
          "Dj",
          "MarkJ",
          "Customer"
        ],
        "customerProfilePictures": [
          "https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif"
        ],
        "customerRatings": [
          "5.0 out of 5 stars",
          "5.0 out of 5 stars",
          "1.0 out of 5 stars",
          "5.0 out of 5 stars",
          "5.0 out of 5 stars",
          "1.0 out of 5 stars",
          "5.0 out of 5 stars",
          "5.0 out of 5 stars"
        ],
        "customerReviewTitles": [
          "Beautiful",
          "lovely",
          "Scammers",
          "Love this",
          "Perfect simple gold necklace",
          "Very Disappointed!",
          "My wife loved it!",
          "Really pretty! Love it"
        ],
        "customerReviewBodies": [
          "Love this necklace. So very pretty.",
          "I",
          "Horrible! Horrible!! Do not order! This was a ripoff! It was a fake Kendra Scott piece of jewelry!! Don’t be scammed!",
          "It is so pretty",
          "Loved it!",
          "This item arrived scratched! I can't possibly gift this to my granddaughter it's unlikely there is enough time to replace it before Christmas Eve. The crystals are near invisible, as well. This was the first thing on her list and I'm incredibly disappointed I won't be able to give to her.",
          "Purchased as a Christmas gift for my wife - she loved it and wears it al the time. A great value.",
          "The picture doesn’t do it justice pretty this is a really pretty and flattering necklace. The chain itself is really beautiful. It is a shorter necklace. My daughter loved it."
        ]
      }
    },
    {
      "id": "VyK2tGu",
      "title": "Swarovski Angelic Crystal Jewelry Collection, Rhodium Tone Finish, Blue Crystal, Pink Crystal, Clear Crystal",
      "price": "$119.89",
      "image": "https://m.media-amazon.com/images/I/61h9YdvFmLL._AC_UY500_.jpg",
      "description": "",
      "reviews": {
        "customerProfileNames": [
          "E.Bourgeois",
          "Customer",
          "MarniG",
          "Ashley1026",
          "Jpaul",
          "Rhon",
          "MrJoelMason",
          "AlexB."
        ],
        "customerProfilePictures": [
          "https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif",
          "https://images-na.ssl-images-amazon.com/images/S/amazon-avatars-global/43861f06-776a-4c6b-96e7-bcaf6672ebc0._CR0,0,500,500_SX48_.jpg",
          "https://images-eu.ssl-images-amazon.com/images/S/amazon-avatars-global/default._CR0,0,1024,1024_SX48_.png"
        ],
        "customerRatings": [
          "1.0 out of 5 stars",
          "5.0 out of 5 stars",
          "5.0 out of 5 stars",
          "5.0 out of 5 stars",
          "1.0 out of 5 stars",
          "5.0 out of 5 stars",
          "5.0 out of 5 stars",
          "5.0 out of 5 stars"
        ],
        "customerReviewTitles": [
          "WARNING: Cancer and reproductive harm",
          "Beautiful and strong",
          "Gorgeous!",
          "MUST BUY- NICKLE ALLERGY",
          "Absolutely beautiful but poorly made",
          "So beautiful!!",
          "Perfect size",
          "Great everyday earrings!"
        ],
        "customerReviewBodies": [
          "pretty bracelet. Causes cancer.",
          "Gorgeous! Got a whole lot of compliments on this as a bridesmaid in a wedding. Now one of my daily bracelets! I’m rough with jewelry and this bracelet hangs in there. Looks gorgeous and real next to real diamonds. Absolutely love it.",
          "T",
          "I have a Nickle allergy and can never wear earrings. I was inform this band does NOT have Nickle. I gave it a try and fell in LOVE!! I can go 12 hours and wear these earrings without pain or irritation. MUST BUY",
          "The reviews are correct, these earrings are stunning! However after a year of use (not every day mind you) I noticed the pave crystals began falling out. Out of the two earrings I've lost 11 all together and they are now unusable. At that price I would hope to get more than a year out of these beauties. Beautiful but poorly made. Don't purchase.",
          "I am a hairstylist and have been admiring these earrings in one of my clients for some time. I’m so glad I ordered them. They are stunning and very comfortable they are big but classy. I wear them just about everyday!! Out of the box they were a little dull but after a little windex WOW!!",
          "I bought these for my wife as a Christmas present. She loves them, which is saying lot because she's very fusy about earrings.",
          " Had these same earrings for 3 years & recently lost them & I loved them so much decided to buy them again they are legit Swarovski. They look great with any outfit & are the perfect size. Highly recommend!",
          "è un falso\nsono andato in un centro Swarovski\ne la collanna è fatta bene ma è un falsissimo\ntra l'altro arriva in cinfezioni e autocertificazioni Swarovski\n(questo per la merce che arriva da hong kong)\nda denunciare!!",
          "",
          "Overly large, these earrings look unwieldy on small ears, especially if you don't have large lobes. They don't come in a gift bag or wrap as previous reviews have mentioned but a small gift box with a large sticker on them which leaves adhesive residue. Nice enough but not worth £50",
          "Really disappointed in this item. Was not cheap but rather than make others green with envy, all it did was proceed to make my wife’s wrist green. Not a brand of jewellery I would ever buy again.",
          "These earrings really are huge, I wanted a larger style and these definitely fit the bill. They are really pretty and sparkly, they are a perfect gift for someone or yourself.",
          "They were a \"welcome home\" pressie for my wife after a spell in hospital and really did tick all the boxes.\nNicely boxed and nice quality (as far as I know about earrings!) and the memsahib was over the moon.\nNot expensive but at the same time not as expensive as those worn by Judge Judy nonetheless looked good."
        ]
      }
    },
    {
      "id": "mWsnMR7",
      "title": "Kendra Scott Elisa Pendant Necklace for Women, Fashion Jewelry, 14k Gold-Plated",
      "price": "$55.00",
      "image": "https://m.media-amazon.com/images/I/61UnDywSfxL._AC_UY500_.jpg",
      "description": "Add a splash of color to your look with this gorgeous necklace!\n14K gold plated over brass necklace with stationary pendant.\nLobster-claw closure.\nDue to the one-of-a-kind nature of the medium, exact color patterns may vary slightly from the image shown.\nImported.\nMeasurements:\nChain Circumference: 15 in\nAdjuster Length: 2 in\nPendant Height: 3⁄8 in\nPendant Width: 3⁄4 in\nWeight: 0.1 oz",
      "reviews": {
        "customerProfileNames": [
          "lowil",
          "Joy",
          "Nana",
          "ALKinPHX",
          "Morris",
          "DC'sCookiesnCrumbs",
          "GED",
          "MyAcct"
        ],
        "customerProfilePictures": [
          "https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif"
        ],
        "customerRatings": [
          "5.0 out of 5 stars",
          "5.0 out of 5 stars",
          "5.0 out of 5 stars",
          "5.0 out of 5 stars",
          "5.0 out of 5 stars",
          "5.0 out of 5 stars",
          "5.0 out of 5 stars",
          "5.0 out of 5 stars"
        ],
        "customerReviewTitles": [
          "Beautiful authentic Kendra Scott necklace",
          "My daughter loves it!",
          "Granddaughter Loved!",
          "Great for young teens!",
          "Beautiful necklace",
          "Granddaughter's Request",
          "Her favorite graduation gift!",
          "Great Gift"
        ],
        "customerReviewBodies": [
          "A",
          "I purchased this as a gift for my teenage daughter and she just loves it! It came packaged only in a plastic bag with labeling and a small Kendra Scott booklet. Thankfully I had a yellow Kendra Scott box that I slipped it in to make it more presentable as a gift. It did have Kendra Scott labeling, so it did look legit and not a knock off.",
          "My granddaughter picked this out for part of her birthday gift. I ordered it, came within couple of days and she loved it. It came quick enough she got to wear it to Costa Rico on vacation. Which made her very happy!",
          "I bought this as a gift for my granddaughter’s 14th birthday. It was No.1 on her wish list. It is very pretty, and to say she loves it would be an understatement. She also got matching earrings as a gift.",
          "My 14 year old daughter bought this necklace for herself and absolutely loves it! It’s great quality and beautiful on!",
          "My 15 year old granddaughter asked for this specifically in the rose quartz. It's a bit worth teens.",
          "I have purchased four necklaces from Kendra Scott for family and friends, always the perfect gift.",
          "Nice quality gift. Great value for the money. Gave as a Christmas gift to my daughter-in-law. She loved it!",
          "Beautiful necklace!!"
        ]
      }
    },
    {
      "id": "OCrCHsb",
      "title": "ManRiver Sunflower Rings for Women - I Am Enough Letters Carving Flower Promise Rings Jewelry Accessory Gifts Size 5-11 (Yellow, 10)",
      "price": "$2.50",
      "image": "https://m.media-amazon.com/images/I/61xC1XerB6L._AC_SY450_.jpg",
      "description": "WELCOME To ManRiver Online Store ! women rings ring gold silver wedding sterling silicone engagement nose diamond women's toe steel rose stackable band men stainless 14k jewelry knuckle thin vintage birthstone finger clearance anxiety ring sterling silver ring spinner bead ring Features:     100% brand new, high quality.     Size: as shown in figure     Unique skull design, show your unique charm     Style: Fashion    Material:Alloy Package contents:     1 x ring",
      "reviews": {
        "customerProfileNames": [
          "ShellB",
          "SandraS.",
          "CandyBrown",
          "Kimberly",
          "Kayci",
          "kimspink",
          "Karencarter",
          "madukes44"
        ],
        "customerProfilePictures": [
          "https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif"
        ],
        "customerRatings": [
          "5.0 out of 5 stars",
          "5.0 out of 5 stars",
          "5.0 out of 5 stars",
          "5.0 out of 5 stars",
          "5.0 out of 5 stars",
          "5.0 out of 5 stars",
          "5.0 out of 5 stars",
          "5.0 out of 5 stars"
        ],
        "customerReviewTitles": [
          "Far exceeds",
          "Very pretty ring",
          "Nice",
          "Great Quality for the price.",
          "Love this ring",
          "Love this ring",
          "Gift",
          "It’s beautiful!❤️"
        ],
        "customerReviewBodies": [
          "I didn’t pay much for this ring as you can see but after receiving it I must say I’m amazed at its beauty and quality… Totally exceeded my expectations! I definitely recommend this product, you won’t be disappointed. One shortcoming is that it took very long to get here but it was worth the wait :-)",
          "This is a very pretty ring and looks well made. Size is perfect. I really like it.",
          "Details are a little smaller than the picture, but it is nice and worth the price paid.",
          "I was surprise this ring was so detailed and solid.\nI was thinking it would be a cheap metal but to my surprise it is solid. Great for a teenager and with the message.. I am enough.. great find.",
          "Super cute and comfortable not cheap looking",
          "Ring fit true to size absolutely gorgeous",
          "I gave this to my sister. She loves it.",
          "I get soo many complaints!❤️ Good quality!"
        ]
      }
    },
    {
      "id": "9G19OO0",
      "title": "Top Plaza 7 Chakra Healing Crystal Necklace Tree of Life Wire Wrapped Pendant Necklaces Reiki Stone Gemstone Quartz Jewelry for Womens Girls",
      "price": "$14.99",
      "image": "https://m.media-amazon.com/images/I/71u5j39ggsS._AC_UX385_.jpg",
      "description": "Top Plaza 7 Chakra Healing Crystal Necklace Tree of Life Wire Wrapped Pendant Necklaces Reiki Stone Gemstone Quartz Jewelry for Womens Girls\n\nAbout Top Plaza:\nFocuses on providing stylish and excellent quality healing crystal necklaces for customers.And you can click our brand name which on the top of the title; you can find more different style crystal necklaces.\n\nSpecification:\nTree of Life pendant: 65mm*50mm Chain length: 24\".\nMaterial: natural healing crystals & metal.\n\nProtect your healing crystal necklace:\n√Please take it off when take a bath, wash your hair, swim in the pool or sea, soak in the hot springs, do housework, the chemicals in shampoo, the salt water in sea, the chlorine water in the pool, the detergent used in household chores will have a corrosive effect on jewelry.\n√crystal necklaces that is not worn normally should be stored in a special storage box or jewelry sealed bag for storage and storage, and should not be placed in a wet or exposed place for a long time.\n\n★If you are not completely satisfied with the product, please contact us through buyer seller message.",
      "reviews": {
        "customerProfileNames": [
          "DH",
          "PamelaGartrell",
          "LYNDSEY",
          "BeverlyJGraziani",
          "DonnaBertrand",
          "lindaventura",
          "GaryLeonSeager",
          "BaerbelFlores"
        ],
        "customerProfilePictures": [
          "https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif"
        ],
        "customerRatings": [
          "5.0 out of 5 stars",
          "5.0 out of 5 stars",
          "5.0 out of 5 stars",
          "5.0 out of 5 stars",
          "5.0 out of 5 stars",
          "5.0 out of 5 stars",
          "5.0 out of 5 stars",
          "5.0 out of 5 stars"
        ],
        "customerReviewTitles": [
          "I get compliments when I wear it.",
          "Beautiful tree of life!",
          "Very Beautiful and big size too 😍",
          "Pretty Necklace",
          "The quality. Very nice",
          "Stunning necklace",
          "Detailed and beautiful craftsmanship. My wife loves it.",
          "Beautiful"
        ],
        "customerReviewBodies": [
          "This wasn't very expensive when I bought it. I wondered if it would be made very well. When it arrived it was packaged very well, and I was impressed at the craftsmanship of the piece. This is quite large. I tend to wear smaller jewelry, so it is nice to have a larger necklace sometimes. With Chakra stones also, you can't go wrong. Buy it for yourself or a friend.",
          "Looks amazing...you will need to get a different chain to go with it...it will change colors quickly",
          "Loved how big the product was and the stones are very beautiful and the wiring is well crafted. it is a beauty and a great gift for yourself or others. Definitely get this one it's the best one out there in my opinion.",
          "Better than expected.",
          "The workmanship",
          "Everyone loves this",
          "This was a Christmas gift for my jewelry conscious wife. She loves it.",
          "It's beautiful,I gave it away as I present.",
          "I'm very happy with my necklace, I think it's beautiful. The stones seem real. The only other way it could possibly be improved is if it was made out of S925. I'm extremely happy with mine though. I just bought a second one.",
          "ce pendentif arbre de vie de guérison des 7 chakras est vraiment très beau, je suis très satisfaite de mon achat et la livraison était dans son temps. Merci",
          "",
          "nice just hope when it come to pin they pin bread off and I still haven't found a place for my other that broke off so hope this on won't",
          "Love the necklace, and Spirit tree. But clasp was broken. I do not do returns. So was very dissatisfied with the chain it came with. Very cheap chain.",
          "Larger than expected! It’s stunning"
        ]
      }
    },
    {
      "id": "mvU9LGc",
      "title": "Swarovski Ginger T Bar Necklace, Rose Gold Tone Finish, Clear Crystals",
      "price": "$51.00",
      "image": "https://m.media-amazon.com/images/I/71RxPJo1myL._AC_UY395_.jpg",
      "description": "About Swarovski Founded in Austria in 1895, Swarovski has become the world's premier jewelry and accessory brand, renowned for their reliably sparkling products. Founder Daniel Swarovski set out to achieve his goal of creating a \"diamond for everyone\" when he invented a machine that cut crystals more precisely than was possible by hand. After centuries of creative collaboration and expertise, Swarovski has become the leader of crystal cut creations and is proud to deliver extraordinary everyday style to people around the world.",
      "reviews": {
        "customerProfileNames": [
          "Dixie",
          "aurorasanchez",
          "AprilAlaspa",
          "Jay",
          "SOHYUN",
          "Janet",
          "jesuszarut",
          "JL"
        ],
        "customerProfilePictures": [
          "https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif"
        ],
        "customerRatings": [
          "5.0 out of 5 stars",
          "5.0 out of 5 stars",
          "5.0 out of 5 stars",
          "5.0 out of 5 stars",
          "5.0 out of 5 stars",
          "5.0 out of 5 stars",
          "5.0 out of 5 stars",
          "3.0 out of 5 stars"
        ],
        "customerReviewTitles": [
          "Beautiful and excellent quality",
          "Exquisito",
          "",
          "Very pretty",
          "Love this style!",
          "wife loved the color",
          "Beautiful!",
          "Increíblemente bello..!",
          "",
          "too small"
        ],
        "customerReviewBodies": [
          "I got this for my daughter and she absolutely loves it. Can wear it on either side to dress up or down. High quality and beautiful.",
          "Muy buena calidad y se ve muy elegante, el único pero que le pondría es que me gustaría que la cadena fuera unos 5cms más largo",
          "",
          "Got this for myself. I wear it all the time.",
          "I love this pendant. It is sophisticated and simple. It was a gift from my husband for my birthday.",
          "she loved the color and way it buckles",
          "Product was a gift. My daughter loved it!",
          "A mí esposa le quedó perfecto y bello en su cuello..!",
          "",
          "Nice necklace, its very small good for a teenager.",
          "The product was fine. The chain was far too short and there was no way you could extend - or even replace - the chain. The image of the chain on the model did not give the impression it was so short. We have found the same problem with many of Swarovski’s products which in all other respects are extremely good.",
          "Love this necklace.",
          "Sieht sehr edel aus, perfekt zum verschenken.",
          "",
          "Leider verliert die Kette schnell die Farbqualität",
          "",
          "J'aime bien cette boucles d'oreilles. Sont petit par rapport au photo, mais très élégant",
          ""
        ]
      }
    },
    {
      "id": "rftZkQZ",
      "title": "SONGMICS 6 LEDs Mirror Jewelry Cabinet, 47.2\"H Lockable Wall/Door Mounted Jewelry Armoire Organizer with Mirror, 2 Drawers, White UJJC93W",
      "price": "$139.99",
      "image": "https://m.media-amazon.com/images/I/71bE76YTMHL._AC_SY450_.jpg",
      "description": "About this item\nSpecialized Jewelry Cabinet: You deserve this well-constructed and designed jewelry cabinet from SONGMICS. The solid MDF body is for long-term use and the full-length mirror is framed to avoid leaving fingerprints on it every time you use the cabinet\nAuto LED Lights: The 6 LED lights inside the cabinet emit cozy, soft lighting when you open the cabinet door, helping you pick out the right jewelry easily without waking up your loved one (the LED lights are powered by 3 AAA batteries, not included)\n47.2\" Tall, Large Storage Capacity: This spacious jewelry armoire keeps all your jewelry in one place for easy access with 1 large ring cushion, 1 bracelet rod, 2 bottom drawers, 5 shelves, 32 necklace hooks, 48 stud earring holes, and 90 earring slots\nFull-Length Glass Mirror: The full-length mirror offers a head-to-toe view of your outfit, and the real glass helps avoid the \"fun house\" effect to provide better viewing angles—go ahead and admire your beauty in the mirror\nWall or Door-Mounted: You can mount the jewelry organizer on the wall with the provided screws or hang this jewelry cabinet over the door using the brackets included—you’ll save your precious floor space either way",
      "reviews": {
        "customerProfileNames": [
          "A.McKnight",
          "Mamabonz",
          "F.S.Bruce",
          "Erika",
          "Linnette",
          "Private"
        ],
        "customerProfilePictures": [
          "https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif",
          "https://images-na.ssl-images-amazon.com/images/S/amazon-avatars/default._CR0,0,1024,1024_SX48_.png",
          "https://images-na.ssl-images-amazon.com/images/S/amazon-avatars-global/a71f7505-7d57-48ed-82e9-95f617ef329d._CR0,0,498,498_SX48_.jpg"
        ],
        "customerRatings": [
          "5.0 out of 5 stars",
          "5.0 out of 5 stars",
          "5.0 out of 5 stars",
          "5.0 out of 5 stars",
          "5.0 out of 5 stars",
          "5.0 out of 5 stars"
        ],
        "customerReviewTitles": [
          "Simple modifcation of earring section makes this beyond perfect!",
          "Great buy! So excited to own this!",
          "Lights don't work. p.s. Now they do.",
          "FABULOUS!!!",
          "This is probably the best purchase I have ever made on amazon",
          "Loved it!!!!!"
        ],
        "customerReviewBodies": [
          "Item will come in original packaging. Packaging will be damaged.",
          "I absolutely love this cabinet! I will admit though that I made some modifications to it. I mainly wear post/stud earrings and the earring section of this cabinet is mainly designed for French hook earrings. I completely removed their earring section and replaced it with a photo frame that I had stapled a screen mesh to. I hinged the frame to the cabinet so the frame will swing open allowing me to easily remove the back of the earrings. This design will accommodate both post and French hook earrings. Perhaps the manufacturer will take note. After my alteration, I love this cabinet! It is big enough to hold all my jewelry and then some! I now have an excuse to buy more earrings! It is very sturdy yet I was surprised at how light it felt when I was hanging it. Ideally, I wouldn't have had to modify it but it was a quick and easy change. I could have gone the extra step and painted the frame white to match the cabinet but I didn't feel it was necessary. So, if you are like me and mainly wear post/stud earrings...this cabinet will work for you with a quick and easy upgrade. :)\nUPDATE- Almost 3 years later and I still loving this cabinet and I'm still loving my modification. There is no way the original cabinet could hold all these earrings. I've also added a photo of what the cabinet looks like today.",
          "S",
          "Cabinet is nice enough, but the lights don't work. This and the fact that the screw for the battery door is missing lead me to believe I may have received an item that was previously opened and returned. The only reason I'm keeping it is because my wife likes the cabinet and has stated she can make do without the lights. I would exchange it, but that option isn't offered.\n\n12/27/2016\n\nI am updating my review because I have been contacted by customer support and they have offered to send me a new LED assembly. Once I get this thing lit up I will most likely be adding another star as my wife really likes this cabinet.\n\n2/2/2017\n\nThe lighting assembly was delivered within a few days of my conversation with customer support. Replacing it was a lot easier than I thought it was going to be. My wife is now in love with it. Life will never be the same.",
          "I love, love, LOVE this jewelry cabinet!! It is perfect in EVERY way! There is a ton of space for all sorts of various styles of jewelry, and the LED lights in the top are super helpful to light up the inside. There is an odor inside when you first get it which I assume is the glue used to assemble the cabinet and attach the felt backing but my jewelry can't smell it, and it isn't offensive enough for me to dock this review even 1 star because the cabinet is SO awesome! I have had the cabinet for 2-3 months now, and the odor no longer exists...not sure when it went away, but I don't notice it anymore now. Hope the attached pics help...this is a MUST BUY in my opinion!",
          " ",
          "Loved it, now I have ALL my jewerly in one place! Highly recommend this product!!!",
          "This product is compact and quite easy to assemble. The mirror in the front is a great feature if any thing. Although, designed to hold quite a lot of items, this cabinet will not close with jewelry hanging (bangles on the rod on the door) on either side (necklace by the hooks in the inside of the cabinet). As a result I have been able to put in only select pieces of jewelry that would allow me to close the cabinet by actually locking it. Yes it will open unless locked! A few more inches of depth might have solved this issue.",
          "It was a pain to install on the wall but once we figured it out, I love it. Unfortunately after having it for 6 months or so, some of the veneer on the bars on the inside of the cabinet has flaked off in pieces the size of a quarter. I will be patching it up myself as it would be a huge pain to take it down and return it now.\n\nThe lights on the inside are helpful and the mirror on the outside is good quality - no distortion. I wish the veneer had not flaked off on a few of the inside bars. I am not rough with things and there is no way the veneer should have fallen off. Despite how annoyed I am with the veneer, I still like it a lot. Very well designed and offers lots of room for jewelry removing clutter from my dresser.",
          "Es muy buena idea de tener todos tus accesorios juntos, tiene suficiente espacio para guardar aretes, pulseras, collares, relojes, lentes, etc. Ocupa muy poco espacio atrás de la puerta y al mismo tiempo está oculto, también otra cosa buena es que tiene llave para mantener tus cosas seguras",
          "",
          "I really love this. I have a lot of jewelry as I used to sell it part time and obtained quite a collection over the years. It holds a lot of items nicely and for the most part I am satisfied. I wish it was a little deeper because I used the bracelet rack for all my bangles but then I couldn't close the door. So I had to put soft beaded bracelets only. I also had thicker stone necklaces that could only go in one place or else you couldn't close the door. The ring slots fit most ring sizes well and the earring slots hold both hooks and studs. I love the interior lighting. It is made for organization and security from say, your own children. But the door could easily be opened with a screwdriver or any tool, and the cabinet can just be lifted right off the mounting screws.",
          "Estoy encantada con mi espejo joyero. Mi esposo me ayudo a instalarlo en la pared y se ve muy bien. No ocupa mucho espacio así que no sientes que sea un mueble que bloquea el paso. Por dentro tiene muuucho espacio y puedes organizar muchas cosas de manera que todo queda visible y a la mano. Me encanto. Además la cerradura me parece adecuada y así puedes dejar tus cosas bajo llave de manera más cómoda. Super recomendable compra.",
          ""
        ]
      }
    },
    {
      "id": "7Ed6O5-",
      "title": "Amazon Collection Platinum or Gold Plated Sterling Silver Infinite Elements Zirconia Antique Ring Set",
      "price": "$38.10",
      "image": "https://m.media-amazon.com/images/I/81zDhLc-2nL._AC_UX395_.jpg",
      "description": "An Amazon brand - Sparkling antique-style ring with asscher-cut Swarovski zirconia and band with prong-set faceted rounds",
      "reviews": {
        "customerProfileNames": ["ErnestEAllen", "FelicitaA.", "RebeccaM"],
        "customerProfilePictures": [
          "https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif",
          "https://images-eu.ssl-images-amazon.com/images/S/amazon-avatars-global/default._CR0,0,1024,1024_SX48_.png",
          "https://images-na.ssl-images-amazon.com/images/S/amazon-avatars-global/48f85dab-8828-4827-8c2b-0c6225a2484b._CR0,0,500,500_SX48_.jpg"
        ],
        "customerRatings": [
          "1.0 out of 5 stars",
          "5.0 out of 5 stars",
          "5.0 out of 5 stars"
        ],
        "customerReviewTitles": [
          "Totally disappointed!!!",
          "This Wedding Set Makes a Statement of Beauty and Elegance",
          "Beautiful for any occasion!!"
        ],
        "customerReviewBodies": [
          "I",
          "I used to own a Jewelry store online. I sold VVS1, VS1 diamonds. I retired from this business in 2003 but still own great quality items that are kept safely in a vault. I decided to give Swarovski CD a try because I want an everyday set to wear without worrying that my good jewelry can get lost. I bought this wedding set. When I received this set (I bought the matching earrings and pendant necklace too), I could not believe my eyes. I was always accustomed to wearing good, expensive jewelry and this set blew me away. When I opened up the box this set took my breath away. The center stone looks just like a VVS1 clarity, D color diamond. Every facet catches the light and it does not look like some see through glassy looking CZ. The quality cut of this Ascher cut stone is so perfect that the light bounces all around the steps around the entire stone and you cannot see through the stone. The quality and workmanship is so high end, that I fell so in love with it. I received the set 3 days ago and wore it to the doctors office because I have a case of tennis elbow. I received compliments from the doctor and the doctors assistant on how beautiful my \"diamond ring\" is. The wedding band is so dainty and I love the small stones and the delicate detail all around D the entire band. I love the believable size of the stones on the engagement ring. I have long fingers and the stone sizes are not too small and not too large so it is quite believable. As someone who has worked as a professional who once sold fine jewelry I have never see such clean lines, beautiful migraine work and brilliant stones that rival the finest diamonds. This is a very high end look in rhodium plated sterling silver. The Platinum finish caps it so beautifully. I will never tell anyone I am wearing CZ but, I wanted to share here that if you want to replace your old or lost rings with something that looks high end because of the beauty of the design and the fine detail, get this set. It looks beautiful and believable and I never thought I would enjoy the Ascher cut, because I didn't know how well a dispersion of light it had and or how high the refractive index would be. Well, I got it and don't need to measure the fire, refractive index and dispersion, because my eyes are witness to the fire, brilliance and beauty of this set and also because on the first day I wore the set, today, I got compliments and it showed in the delighted wide eyed reactions of these two people. It's stately, elegant design says that I the wearer has fine, discriminating taste in jewelry.",
          "I originally purchased this ring because I lived in a section of a large city that felt rather unsafe, so I didn't want to wear my original diamonds while walking the dogs and draw attention. (It's not that my wedding set is worth $1M nor anything remotely close, but call me sentimental. I would be heart-broken if I lost it or someone forced me to give the rings up.) However, I never realized that this Asscher cut-style ring actually looked real due to its specific cut of the stone. I was happy to sport my little ring and chuckled, well, if I did get robbed, I would only lose $40, although the trauma of it all would certainly be lasting. The thing is, my husband and I were walking back with the dogs, and as we passed the train station, one guy came out from behind the wall and began to follow me. He got too close for my comfort, so I swirled around and stopped in front of him, and in a VERY loud voice asked if I could help him. It must have broken his pattern of thinking because he stopped, looked at me, and then abruptly crossed the street. Later, I realized that it must have been the ring. Needless to say - I decided that NO ring was worth being robbed over, even if it was only $40! I never wore any rings again until I moved from that area.\n\nI said all of that to say this - the cut is beautiful and the stone is beautiful - and I am glad I trusted the other reviews to make my purchase. I have had this ring for more than 3 years now and have banged it and it still looks great. We moved to the suburbs, so now I do feel comfortable wearing my wedding ring set and wear this one (without the band) on my right hand because it's just too pretty to leave at home.\n\nI am definitely no curator of fine jewelry, so if someone else wore this ring, I would be thinking, \"Bling, bling, baby - bling, bling!!\" Apparently my friends are not curators of fine jewelry either because a friend of mine who was visiting from out of town couldn't take her eyes off of it during lunch. I finally just told her where I bought it - I didn't want her to think I was making all kinds of money and be on the hook for dinner, too!! :D",
          "T",
          "Absolutely breathtaking beautiful\nLove it x",
          "Absolutely Great product",
          "As you can see, I need one size bigger?",
          "P"
        ]
      }
    },
    {
      "id": "FoGpMft",
      "title": "Amazon Collection 925 Sterling Silver 6mm Cushion Cut Gemstone Pendant Necklace for Women with 18 Inch Box Chain",
      "price": "$82.50",
      "image": "https://m.media-amazon.com/images/I/71GvrXWQmzL._AC_UY575_.jpg",
      "description": "",
      "reviews": {
        "customerProfileNames": [
          "Jacy",
          "DanielMG",
          "wronghonk",
          "jacque",
          "Skinner",
          "Amy",
          "BrendaSteedman",
          "SR"
        ],
        "customerProfilePictures": [
          "https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif"
        ],
        "customerRatings": [
          "5.0 out of 5 stars",
          "5.0 out of 5 stars",
          "5.0 out of 5 stars",
          "5.0 out of 5 stars",
          "5.0 out of 5 stars",
          "5.0 out of 5 stars",
          "5.0 out of 5 stars",
          "5.0 out of 5 stars"
        ],
        "customerReviewTitles": [
          "Brilliant sparkle",
          "Beautiful lab created emerald, swap out chain.",
          "It would have been a shame topaz up this deal.",
          "Love it!",
          "Nice gift, little small",
          "Delicate and pretty",
          "Beautiful lab creative stone",
          "Five Stars"
        ],
        "customerReviewBodies": [
          "Note that I only just received this necklace so I cannot say anything about its durability yet, but I can say that I was pleased upon opening. The stone (London blue-Dec) is the perfect size (6m), catches the light, the color is rich and true to the photo. The chain seems to be well made (unlike some I’ve purchased from other dealers here) and has a sturdy feel despite its delicacy. I think it would make a perfect gift for someone special.\nAlso note that I am not one to review products favorably if at all and, I have only owned it for a few hours, but so far, Love It.",
          "With the price, I wasn't sure what to expect. The 8mm lab-created emerald looked stunning when I opened the box. This was a gift to my wife, and she really did not like the flimsy chain that came with it. a quick purchase of a slightly thicker chain left us quite happy.\n\nHonestly, they should upgrade chain. I see others complaining about it. Otherwise, just order a new chain at the same time to avoid the issue.",
          "Quite a lovely piece, especially considering what I paid. The London blue topaz is a nice shade of blue and catches light well, especially outside. The chain is dainty, but doesn't seem flimsy or cheap.",
          "I love this! I’m a teeny bit afraid of the chain as it’s a little more dainty than I usually wear. Update: I’ve gotten a lot of compliments on this necklace and it has held up well with my hectic life!",
          "I did look at the length when I bought it but the chain is still shorter than expected. However, it is gorgeous, still exactly what I asked for and of quality. Very elegant, perfect for your spouse or partner",
          "This necklace was just what I was looking for, delicate but sturdy enough for me to wear. I hope it holds up over time",
          "Very nice Sterling silver lab created ruby.\nWe are very happy with our purchase.",
          "Beautiful. Shines so well!",
          "Looks good from far, but far from good!!! This item is made very cheaply. The clasp is tiny and came broken. The chain is short. The necklace itself came in a little plastic bag. NO gift box provided!!! Do not recommend!!",
          "yes, this necklace is beautiful and classic.....it will last her well into her grownup years. For now, I ordered a separate shorter chain for her until she she's older, then will switch to the original chain.....I would highly recommend this ....it's looks expensive, it's plain, but elegant....",
          "Par contre, la chaîne je n'aime pas! Je vais en acheter une à mon goût pour le pendentif",
          "",
          "Beautiful. GF Loves it. Its beautiful and very elegant looking. Stone is a good size. Looks like good quality",
          "Chain broke suddenly. It costs more to mend the chain than to replace the necklace. It's in a drawer now."
        ]
      }
    },
    {
      "id": "acBD51P",
      "title": "PAVOI 14K Yellow Gold Colored Lightweight Chunky Open Hoops | 30mm Yellow Gold Hoop Earrings for Women",
      "price": "$13.95",
      "image": "https://m.media-amazon.com/images/I/51kL9JyNtNL._AC_UX395_.jpg",
      "description": "PAVOI 4.5mm Thick 30mm / 1.2 Inch Diameter Yellow Gold Colored Small Hoop Earrings. A perfect gift! These Hoop Earrings are always Best Sellers!\nThis thick hoop earring is crafted to be lightweight for easy all-day wear. They are Hypoallergenic; Nickel and Lead-Free with Stainless Steel Post\n✦ MADE WITH LOVE ✦ This unique and heartfelt product is beautifully packaged and ready for giving. Makes a sentimental surprise for any awesome lady. Great gifts for Mom or Grandma on Mother's Day, anniversary, birthday, or wedding celebration.\n✦ 90 DAY GUARANTEE ✦ To Ensure Your Complete Satisfaction, We Offer a 90 Day No-Questions-Asked Money Back Guarantee. All the metals we use are lead free, nickel free and hypoallergenic. Excellent customer service. PAVOI 100% guarantees your satisfaction.\n✦ PROUDLY AMERICAN OWNED ✦ We are an American owned and operated company! Please search PAVOI on Amazon for more of our designs!",
      "reviews": {
        "customerProfileNames": [
          "ISV",
          "LizWindle",
          "LeslieR",
          "Katie",
          "MariaMarin-Mendez",
          "Rachel",
          "WrattPack",
          "Abigail"
        ],
        "customerProfilePictures": [
          "https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif",
          "https://images-na.ssl-images-amazon.com/images/S/amazon-avatars-global/43fa8818-d45e-4c84-828c-8065c76303d1._CR0,0,374,374_SX48_.jpg",
          "https://images-na.ssl-images-amazon.com/images/S/amazon-avatars-global/910e3584-e346-4157-8fd3-970242d12443._CR0,0,375,375_SX48_.jpg",
          "https://images-na.ssl-images-amazon.com/images/S/amazon-avatars-global/10703c25-26e7-457f-be8c-f32974a01550._CR0,0,826,826_SX48_.jpg",
          "https://images-eu.ssl-images-amazon.com/images/S/amazon-avatars-global/default._CR0,0,1024,1024_SX48_.png"
        ],
        "customerRatings": [
          "1.0 out of 5 stars",
          "5.0 out of 5 stars",
          "5.0 out of 5 stars",
          "1.0 out of 5 stars",
          "1.0 out of 5 stars",
          "5.0 out of 5 stars",
          "5.0 out of 5 stars",
          "5.0 out of 5 stars"
        ],
        "customerReviewTitles": [
          "VERY poor quality",
          "Perfect!",
          "Great quality, perfect size",
          "Tarnished So Fast!",
          "Do not buy!!!!",
          "Good quality fashion jewelry",
          "Lovely earrings!!",
          "Worth every penny. 🤙"
        ],
        "customerReviewBodies": [
          "Do NOT buy! Yes, these earrings are very cute but the quality is definitely not cute! The other reviews voice the same concern: these earrings tarnish and get ruined VERY fast. The first time I ordered them, I thought it was my fault that they got ruined (maybe perfume fell on them or something) so, Pavoi sent me a replacement. I was MUCH more cautious with the replacement and AGAIN, the earrings peeled, tarnished, and turned green!! The customer service told me that the earrings had a reaction with my skin and thats why the turned green...lol... ok...Simply put DO NOT BUY. The quality is VERY VERY poor and your money is better spent elsewhere. In my pictures I have a before (what they looked like when I received them) and after 2 weeks use. The first pair I got are the white background and the replacement the black background. DONT be a fool, DO NOT BUY!",
          "I got the silver hoops and LOVE them. Very light and don’t even notice them!",
          "This is probably the 4th piece of Pavoi jewelry I’ve purchased now, and it will definitely not be the last. I continue to be extremely happy with their products.\n\nThese are such a great size, the width of the hoop is really nice and substantial. Overall the quality is great, they honestly look like they are gold rather than gold plated, and have a nice weight to them (they don’t feel flimsy). They also are very elegant looking, and can definitely be worn for more dressy occasions as well as casually. It’s so pleasantly surprising each time to see the quality is so great given the price point is so affordable.\n\nThese are fun, and a perfect addition to my jewelry collection just in time for summer!",
          "I literally love the way these look that I bought them twice but both times they tarnished SO FAST! So upsetting because they are so perfect otherwise.",
          "Definitely not 14k gold. I have 14k good jewelry and it’s amazing but these earrings tarnished within a week and I didn’t get them wet at all. They turned green, the coating started to peel off and they’re just all around awful and I can’t wear them anymore. Not worth the price at all. Maybe mine were defective? Either way I can’t return any longer but am still looking for earnings like this to wear.",
          " Impressed with these gold earrings. They feel sturdy but not so heavy that they would pull on your ears at all. Definitely bigger than my usually stud earrings but I think I’ll get used to them and love them.",
          "EDIT 7/15/21: I still have not had a color change! I stopped keeping them in the original baggy and have not noticed any surface change at all. I still absolutely love these earrings and I have to share this item page all the time because everyone wants them!\n\nI purchased these at the recommendation of a youtuber. Before I purchased I went through the comments and saw that a lot of people had issues with the earrings as a whole changing colors. I wanted to just give them a try so I purchased anyway and thought I would gamble and try. First of all, I love these earrings. Very light weight and beautiful. I have received many compliments on them. Second, this is such a great price! Lastly, due to the previous reviews of the color changing I anticipated it to happen to my pair. In an effort to avoid it I made sure to replace my earrings at the end of every day into the small resealable plastic bag they came in.\nI have not encountered a change in the appearance of the earrings in color or texture and I’ve had and worn these everyday for more than a month. I highly recommend these earrings and would repurchase them!",
          "10000x’s YES. At first review I was hugely skeptical about these. I saw them in a fellow YouTube Faves video and had to try them out for myself. I was really nervous, but as soon as I opened the packaging I was relieved. They’re not at all heavy and you’ll almost second guess the quality, but just wait until you put them on. They’re absolutely darling! A classic touch. Have you seen Niagara starring Marilyn Monroe? I honestly feel just as stunning as she, and the earrings she’s got are not at all like these. I’m actually waiting for another(different) pair in the mail as I type this up! 🥰💯",
          "I have very sensitive skin and these earings are perfect so long as you take them out as advised",
          "I like it. It looks great",
          "It was packaged in a very little clear bag and too tight to take out. When out, i saw it compressed flat on one side and some dents were seen due to being too tight and possibly rubbed on eachother in the little bag.",
          "I love them. I wear them with anytning. Really good quality too and no irritation on the ears. Recommend!",
          "Gorgeous"
        ]
      }
    },
    {
      "id": "DdydZGk",
      "title": "Betsey Johnson Flower Rectangle Stone Drop Earrings",
      "price": "$28.00",
      "image": "https://m.media-amazon.com/images/I/71qlbLY8jNL._AC_UY395_.jpg",
      "description": "Betsey Johnson drop earrings featuring iridescent rectangle-shaped stone embellished with flower and mixed stone cluster. Earrings are set in rose gold-tone metal with a fish hook closure.",
      "reviews": {
        "customerProfileNames": [
          "K.",
          "RamonaCharity",
          "Fran",
          "ZZ",
          "QueenSweetHonie78",
          "Joy-MarieS.",
          "StaceyK",
          "AnnGillespie"
        ],
        "customerProfilePictures": [
          "https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif",
          "https://images-na.ssl-images-amazon.com/images/S/amazon-avatars-global/d2aaac75-5b76-43e8-b62a-610c9c4ce778._CR0,0,379,379_SX48_.jpg",
          "https://images-na.ssl-images-amazon.com/images/S/amazon-avatars-global/d01f36f2-d2b7-460e-b6ca-6bcb0c4a668b._CR21,0,458,458_SX48_.jpg",
          "https://images-na.ssl-images-amazon.com/images/S/amazon-avatars-global/76ea636d-0be5-4584-8c36-79062c2a1ae1._CR0,0,375,375_SX48_.jpg"
        ],
        "customerRatings": [
          "5.0 out of 5 stars",
          "5.0 out of 5 stars",
          "5.0 out of 5 stars",
          "5.0 out of 5 stars",
          "5.0 out of 5 stars",
          "5.0 out of 5 stars",
          "5.0 out of 5 stars",
          "5.0 out of 5 stars"
        ],
        "customerReviewTitles": [
          "Adorable Earrings!",
          "I LOVE BETSY JOHNSON",
          "Love these flowers and sparkles!",
          "Compliments galore",
          "Im in love",
          "Just beautiful!",
          "Gorgeous!",
          "Very complimentary"
        ],
        "customerReviewBodies": [
          "Super adorable! I love them and so glad to have something to make my outfits pop. A little shine never hurts anyone especially in the current pandemic. I feel so pretty with them. I have larger lobes, so I use a plug to wear them. Cute, comfortable and brings style to any outfit!",
          " Purchased earrings to match my cute BETSY JOHNSON shoes that 'm wearing to my Grandsons wedding with a black and white Sundress. PERFECT!",
          "Very versatile…I get compliments wherever I go…so pretty!",
          "I get oodles of compliments on these earrings. I don't know if it's the little detail of the flower or the dazzling glitter of the Swarovski crystal but it's something for sure. I love them. I just keep looking at the crystal, it's beautiful. I did have a problem with one of the flowers:; after a while, one popped off and I put a little glue on it. Good as new. For the price, I shouldn't have had to do that and it's good I found it immediately but I think it was a fluke as all of my BJ earrings have stayed together.",
          "Absolutely stunning i love them.",
          "Gorgeous! A little heavier than some earrings but still wearable. Very versatile, can be worn with many outfits! Beautiful light catchers. Other reviews here have said they are fragile, I don’t agree. They look exactly as pictured. I love these!",
          "These are absolutely gorgeous. Sometimes things don't look like the photos and you don't know what you're getting, well these are every bit as beautiful as the photos. I think they were great value for what you get. They are big enough to be seen easily but not too big. My ears are sensitive and I was able to wear these without any itching or problems.",
          "Loved these earrings. Enough bling but not over the top. Received lots of compliments and my friend loved them so much, she decided to buy Betsey Johnson earrings for herself"
        ]
      }
    },
    {
      "id": "8BnF6gY",
      "title": "Disney Minnie Mouse Crystal Birthstone Stud Earrings, Silver Plated, Gold Plated",
      "price": "$19.99",
      "image": "https://m.media-amazon.com/images/I/71VZ9eEvnIL._AC_UX385_.jpg",
      "description": "Officially Licensed Disney Jewelry: Dazzling Minnie Mouse inspired earrings, complete with signature bow, are adorned with beautiful August birthstone crystals\nOfficially Licensed Disney Jewelry: Dazzling Minnie Mouse inspired earrings, complete with signature bow, are adorned with beautiful August birthstone crystals\nClean, Elegant Design: Enchanting studs exceptionally crafted with sparkling birth month crystals offer a fun yet sophisticated look\nSuperb Silver Plating: Exquisitely crafted with an appealing silver plated finish and Peridot Green crystals for August birthdays\nReady to Gift: Delivered in an authentic Disney gift box, the pretty August birthstone crystal earrings make the perfect present for bridesmaids, bridal showers, birthdays, Sweet 16s, graduations, Christmas, Mother's Day, anniversaries, Valentine's Day, Easter, or any occasion\nDedicated to Quality & Style: Founded in 1977, New York-based SallyRose, a premier designer and curator of cross-generational and timeless brands, offers an array of affordable, yet always finely crafted on-trend and classic jewelry as well as gift items for the entire family",
      "reviews": {
        "customerProfileNames": [
          "Kristin725",
          "KirkJ.Gomez",
          "Kimme",
          "ThomasLee",
          "AbbeyGood",
          "SherryT",
          "JustAskFrancie",
          "Customer"
        ],
        "customerProfilePictures": [
          "https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif",
          "https://images-na.ssl-images-amazon.com/images/S/amazon-avatars-global/e007cbb8-5580-4dd6-8bc4-fa32c2499078._CR62,0,375,375_SX48_.jpg"
        ],
        "customerRatings": [
          "1.0 out of 5 stars",
          "1.0 out of 5 stars",
          "5.0 out of 5 stars",
          "5.0 out of 5 stars",
          "5.0 out of 5 stars",
          "5.0 out of 5 stars",
          "5.0 out of 5 stars",
          "5.0 out of 5 stars"
        ],
        "customerReviewTitles": [
          "Most disgusting package. Truely appalled.",
          "lacking quality and service",
          "Perfect for 7-year old",
          "The wife loved them!",
          "Beautiful little gems!",
          "So pretty!",
          "Disney Earrings made the perfect gift for my princess granddaughter!",
          "Love Mickey Mouse?"
        ],
        "customerReviewBodies": [
          "I just ordered these earrings for my three year old daughter. I opened the plastic wrap and the Mickey box was soaking wet, and filled with mold. The odor coming from the package is disgusting. Who does or doesn’t do a quality check?!?! The box was also completely soaked; with what god knows, and has tons of mold. I don’t even want to give these to my daughter who knows where they have been or what has been on them.",
          "They looked very nice BUT the stone feel out after wearing only a few times. I have tried to contact the company but they don't respond. Would NOT recommend using this company.",
          "I gave these to my granddaughter for Christmas; she will be 7 in January. They came in a nice box with Minnie Mouse on it, which is nice for gift giving. I was surprised at how small they were, however, so don’t think I’d get them for an adult as I’d want something bigger. While I know the garnet stone is dark, these seem very dark to me. However, when I told my granddaughter they were birthstone earrings, she asked what a birthstone was, so I’m guessing the color wasn’t all that important to her. She does like the earrings though!",
          "The wife is a huge disney fan and totally loved these earrings!! They are well made with brilliant color and look awesome on her ears! Highly recommend these earrings from this seller.",
          "I purchased these for my mom for Christmas to wear on our upcoming disney trip. They were perfect through the trip, and she continues to wear them even after! They are stunning, high quality, and haven't turned her ears a rainbow of colors. They also come in a sweet little box. Highly recommend as a more affordable option!",
          "I bought these for my daughter for our trip to Disney World. She loved them and they were so cute on. They are prettier in person. The perfect complement to your Disney wardrobe.",
          "We all know about the “other famous blue box” for jewelry gifts but these Minnie Mouse “Disney” earrings came in style with a satin Disney pouch & box with gold embellishments! There was no doubt these blue Crystal stud earrings were the real deal & my six year old granddaughter is learning about quality!",
          "I recently purchased these earrings for my 8- year- old granddaughter as her family is going to Disney soon! She absolutely LOVED them and hasn't taken them off! They really cute, well made and sparkly!",
          "Prodotto di alta qualità, prezzo ottimo, consigliato",
          "",
          "Quality product that arrived before estimated time and of good quality."
        ]
      }
    },
    {
      "id": "7IF8mA_",
      "title": "Amazon Collection Sterling Silver Black and White Diamond Infinity Pendant Necklace (1/3 cttw), 18\"",
      "price": "$134.90",
      "image": "https://m.media-amazon.com/images/I/719OapKYSgL._AC_UY675_.jpg",
      "description": "Sterling silver necklace featuring two-tone twisted infinity pendant set black and white diamond rounds\n\nThe Amazon Curated Collection\n\nDiscover the Amazon Curated Collection of fine and fashion jewelry. The expansive selection of high-quality jewelry featured in the Amazon Curated Collection offers everyday values that range from precious gemstone and diamond pieces to the latest fashion designs.\n\nThis hand-selected assortment features an array of diamond, gemstone, and precious metal designs that receive a quality inspection, including from Amazon’s staff graduate gemologist, to ensure they meet Amazon’s high standards. All diamonds featured in the Amazon Curated Collection are certified by our suppliers to be conflict free, and IGI, GIA, or AGS certifications are provided on white diamonds of .75 carats or larger on all stud earrings, rings, and pendant necklaces.\n\nPieces from the Amazon Curated Collection come packaged in a custom box, making them wonderful gifts. In addition, we offer free one-day shipping within the continental U.S. on items over $500. International shipping options for friends and family overseas are available for an additional fee.\n\nThe Amazon Curated Collection offers a specialized customer service team that is available seven days a week to answer any product questions before, during or after the purchase. If you’re not satisfied for any reason, you will receive a full refund and free return shipping within the U.S. if you return your purchase within 30 days.\n\nFind a special gift for a loved one or a beautiful piece that complements your personal style with jewelry from the Amazon Curated Collection.\n\nDiamond Clarity:\n\nNo two diamonds are alike. A diamond's most distinguishing characteristics are its inclusions, marks that are often invisible to the naked eye. However, under a jeweler's magnifying loupe or microscope they can look like crystals, tiny rivers, or clouds. A diamond's clarity is determined by the presence or absence of inclusions--fewer inclusions mean better clarity--and how visible they are. The greater a diamond's clarity, the greater its brilliance and value. A diamond categorized as internally flawless will have no inclusions, but this is extremely rare.\n\nDiamond Color:\n\nThough diamonds come in a wide range of colors, colorless diamonds have traditionally been considered the most valuable. Most diamonds are graded on a scale using the letters of the alphabet, from D (colorless), the best grade, through Z (a light yellow). It is difficult for the untrained eye to notice such variations in color unless stones are being compared side by side.\n\nDiamond Carat Weight:\n\nA diamond's weight is measured in carats, with one carat being equivalent to 100 points. You will often see a diamond referred to as a 3/4-carat stone or a 75-point diamond. Larger stones are often more highly valued, but size should not be the only consideration--high brilliance, which varies according to clarity, cut, and color grade, is highly desirable in a diamond.\n\nDiamond Certification:\n\nA diamond certificate represents independent verification that the stone purchased has all the qualities of cut, color, clarity, shape, and weight expected. It is a further indication of the condition and value of that diamond as represented on our site. Such certificates are issued by several agencies employing highly trained gemologists and provide an unbiased and accurate evaluation of the diamond. These gemologists scrutinize each stone to analyze its dimensions, clarity, cut, color, finish, symmetry, and other details.\n\nDiamonds purchased from the Amazon.com Collection may be certified by the Gemological Institute of America or the International Gemological Institute. The type of certificate provided will be noted in the product specifications of your jewelry purchase; if you do not see a certificate type noted, one will not be provided.\n\nOur Diamond Policy:\n\nAmazon.com sources high-quality diamonds from some of the world's largest suppliers. All our diamond suppliers certify that to their best knowledge their diamonds are not conflict diamonds.\n\nDiamond Care:\n\nDiamonds, as the hardest substance on earth, are resistant to damage. However, diamond jewelry is set in different metals, and care will vary from piece to piece. Diamonds should be cleaned in a solution of one part ammonia to six parts water, using a gentle scrubbing brush to remove any dirt. It is a good idea to have them cleaned once a year by a professional jeweler, at which time the security of the setting can be checked as well. Diamond jewelry should be stored in a soft cloth pouch to ensure that the stone will not scratch other jewelry.",
      "reviews": {
        "customerProfileNames": [
          "ReginaMcClendon",
          "MikeW.",
          "DiBAngel",
          "JasonGammon",
          "Kennneth",
          "LeeWilkinson",
          "Zach",
          "N.B."
        ],
        "customerProfilePictures": [
          "https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif"
        ],
        "customerRatings": [
          "5.0 out of 5 stars",
          "5.0 out of 5 stars",
          "5.0 out of 5 stars",
          "5.0 out of 5 stars",
          "4.0 out of 5 stars",
          "5.0 out of 5 stars",
          "5.0 out of 5 stars",
          "5.0 out of 5 stars"
        ],
        "customerReviewTitles": [
          "Very pretty and elegant",
          "my wife loves it!",
          "Beautiful necklace",
          "Perfect just as described",
          "Better luck than me",
          "Wife was very happy",
          "Perfect for a newer relationship or gift for a daughter of to college. Very modern.",
          "Nice design"
        ],
        "customerReviewBodies": [
          "It’s exactly as I expected. I am wrapping it for myself for Christmas. Ha! I can’t wait to wear it.",
          "good value\nlooks great\nmy wife loves it\na good length---doesn't hang too low, which she likes",
          "small and delicate, lovely piece",
          "excellent gift for my wife. perfect and just as described.",
          " ",
          "The quality and look were on par. Wife loves it",
          "My gf seems to love it\nI do, it looks great on her\nThe necklace is perfect suisse and beautiful not flashy or anything like that. But kind of perfect. In every way. Yes it'd all real.\nL",
          "Bought this for my wife Beautiful Has earrings and a ring that matches this Maybe a little pricey but a very nice item"
        ]
      }
    },
    {
      "id": "61N49MX",
      "title": "Kendra Scott Elisa Necklace",
      "price": "$55.00",
      "image": "https://m.media-amazon.com/images/I/51y+SK-EzvL._AC_UY395_.jpg",
      "description": "",
      "reviews": {
        "customerProfileNames": [
          "Beth",
          "AwaisShah",
          "DoctorWhoFanatic",
          "CarolB.",
          "MyrnaJ.Dennis",
          "ElamieBall",
          "jazzmen",
          "Deborah"
        ],
        "customerProfilePictures": [
          "https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif",
          "https://images-na.ssl-images-amazon.com/images/S/amazon-avatars-global/7ef62d11-985f-404d-94d0-fdb5a1b08085._CR0,20.0,292,292_SX48_.jpg"
        ],
        "customerRatings": [
          "5.0 out of 5 stars",
          "5.0 out of 5 stars",
          "1.0 out of 5 stars",
          "5.0 out of 5 stars",
          "5.0 out of 5 stars",
          "5.0 out of 5 stars",
          "5.0 out of 5 stars",
          "5.0 out of 5 stars"
        ],
        "customerReviewTitles": [
          "Real Deal",
          "Thankful for this...",
          "Buy from the actual Kendra Scott store!",
          "Kendra Scott jewelry is a great gift.",
          "Lovely petite necklace in the recognizable look of Kendra Scott.",
          "My lucky Peridot",
          "Lovely",
          "Wonderful!"
        ],
        "customerReviewBodies": [
          "I am always skeptical when buying name brand jewelry from places other than the official website. But I was pleasantly surprised when I received this necklace, it was the real deal. It came with the Kendra Scott box and dust bag and the necklace had the Kendra Scott brand in the correct place. I will definitely buy from this seller again because they are not only honest but I received my item sooner than expected.",
          "K",
          "I was so excited to get this. Imagine my surprise when I found out that it was not authentic!!! I had read the reviews, but thought that I would be lucky and get a real one. I was wrong! :( You will be better off buying an authentic one from the actual Kendra Scott store.",
          "I like Kendra Scott jewelry because it is simplistic but classy. It makes the perfect gift when nothing else seems to be appropriate. It can be worn with jeans or something formal—it is that versatile. The price is right.",
          "This is the perfect companion to the earrings, both available in various colors. I like the beautiful look of the abalone shell, so this had to be part of my Kendra Scott treasures. I love wearing it often.",
          "I love it. This is my second necklace. The only thing I wish is to have options for the lengths...this is OK but almost like a choker.",
          "Great gift! Bought for my 14 year old and my 54 year old mother….both loved",
          "Grandson bought for his GF, she loved it. Came in a small box ready to gift, just be sure to pull the price tag off the necklace! Shipping was fast!",
          "Keep flipping on the neck.",
          "pretty"
        ]
      }
    },
    {
      "id": "z4M5MZI",
      "title": "Swarovski Crystal Jewelry Sets, Necklace and Earring Collection, Clear Crystals",
      "price": "$94.37",
      "image": "https://m.media-amazon.com/images/I/71brEUZ3SRL._AC_UY500_.jpg",
      "description": "",
      "reviews": {
        "customerProfileNames": [
          "Taajer",
          "NazaninMoradinik",
          "Halina",
          "JoshuaLBeers",
          "MIGUELDARZE",
          "TaliaVega",
          "KindleCustomer",
          "simonwuas"
        ],
        "customerProfilePictures": [
          "https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif",
          "https://images-eu.ssl-images-amazon.com/images/S/amazon-avatars-global/default._CR0,0,1024,1024_SX48_.png"
        ],
        "customerRatings": [
          "5.0 out of 5 stars",
          "5.0 out of 5 stars",
          "5.0 out of 5 stars",
          "5.0 out of 5 stars",
          "5.0 out of 5 stars",
          "5.0 out of 5 stars",
          "3.0 out of 5 stars",
          "2.0 out of 5 stars"
        ],
        "customerReviewTitles": [
          "As advertised",
          "Lovely",
          "Great",
          "Absolutely loved it",
          "My wife loved",
          "Simply Stunning ✨",
          "Smaller than you would think.",
          "too small"
        ],
        "customerReviewBodies": [
          "It looks same as on the screen. Very nice finish and rich look. Very pleased.",
          "Lovely",
          "Looks gorgeous.",
          "My fiancé absolutely loved it",
          "My wife loved.\nPerfect gift for her and high quality product",
          "I bought this on sale on a Lightning Deal. It came in a timely fashion and was a perfect gift for someone very close to me. Very well polished and a perfect thing to give someone as an everyday piece of jewelry.",
          "These would fit better on a child or a very small woman. They should show them against a ruler so you can see how really small they are. They would have to be twice the size to be regular size!",
          " really small and expensive. it does not look like the same as it showin phote",
          "This pendant should be proud to be of use to my Divine Grace and Holy Trinity and Guiding Guardian Angel..The value of this product is enhanced after it had the opportunity of being worn by the Greek and Egyptian Goddess of Beauty and Kindness..The name Angelic square gets its due justification after being worn by my Christmas Fairy..",
          "A",
          "",
          "Great quality but deceptively small and so have a second thought",
          "Bought for a Christmas present for my wife who absolutely loves swarovski,, she was well pleased",
          "The jewellery was missing. The box came empty.\nI returned it and was refunded, but now I have been charged again.\nI ordered the same item and the 2nd one came and is lovely, but I can’t find a way to get in touch to sort out the problem,"
        ]
      }
    },
    {
      "id": "V-Jk8Op",
      "title": "Chargances Bohemia Gold Moon and Stars Necklace for Women Fashion Gold Choker Necklace Delicate Moon Stars Jewelry for Women and Girls",
      "price": "$8.98",
      "image": "https://m.media-amazon.com/images/I/61o0GWQJ8TL._AC_UX385_.jpg",
      "description": "❤Material: Rhinestone, Alloy Wire in a very high quality.\n❤ Handmade: Perfect workmanship, We use the traditional craftsmanship to create your unique, subtleties show the ingenuity.\n❤Unique and fashionable design works well with your daily outfit,Can wear it with many things go to many occasions.Such as Valentine’s Day, Christmas’ Day, Mother’s Day,Thanksgiving Day,Birthday, wedding, party, anniversary, prom and casual days.Acrylic Acetate Drop Earrings ,give you charming look and win more compliments\n❤Best gift choice for family, friends, and your girlfriend,or any girls you love on any thoughtful date that you want to keep in memory\n❤100% satisfaction and money back guarantee. If you have any questions, contact us at any time.",
      "reviews": {
        "customerProfileNames": [
          "CharlesStansell",
          "X~tinaD",
          "Customer",
          "TiffanyBesserman",
          "laneyyoung",
          "Rhonda",
          "Customer",
          "Pat"
        ],
        "customerProfilePictures": [
          "https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif",
          "https://images-na.ssl-images-amazon.com/images/S/amazon-avatars-global/1ce87047-3588-464e-86fa-c67ad5aea612._CR0,0,498,498_SX48_.jpg"
        ],
        "customerRatings": [
          "5.0 out of 5 stars",
          "3.0 out of 5 stars",
          "5.0 out of 5 stars",
          "3.0 out of 5 stars",
          "2.0 out of 5 stars",
          "5.0 out of 5 stars",
          "1.0 out of 5 stars",
          "2.0 out of 5 stars"
        ],
        "customerReviewTitles": [
          "Good quality",
          "2 peice necklaces : (",
          "Very unique",
          "Cute for the money, top layer won't sit right.",
          "Doesn't fit right",
          "Nice",
          "Waste of money",
          "Actual items look cheap"
        ],
        "customerReviewBodies": [
          "Quick delivery and gold quality.",
          "I was disappointed when I received this. I thought it would have more \"sparkle\" to it. You have to make the chocker very tight in order for it to not fall forward. That would be too warm for the Summer months I bought 2 but I'm returning both. Their not what I thought they would be. I was going to gift one, but I don't think my friend would like it either :( sorry.",
          "This comes in two pieces so you can wear them separately. Very unique and nice looking. I’m pleased with this item",
          "Cute design but the top layer doesn't lay right. It ALWAYS turns upside down.",
          "It got delivered right on time amd doesn't look or feel as cheap as i expected it to be. I'd give it 5 stars if the choker parrt wasn't waaaay to big. I was able to take it apart and fix it to where it fits like it should now though.",
          "Looks nice",
          "Broke immediately",
          "I chose this set because I love the design, the looks. But upon arrival, the material looks so cheap, something I could have picked up at a dollar store! I don't know how long it will last before it turns green. I would be willing to pay more for better quality."
        ]
      }
    },
    {
      "id": "eq8VJez",
      "title": "Amazon Collection Sterling Silver Diamond Accent Knot Pendant Necklace , 18\"",
      "price": "$30.40",
      "image": "https://m.media-amazon.com/images/I/719wDSECRBL._AC_UY675_.jpg",
      "description": "",
      "reviews": {
        "customerProfileNames": [
          "VenusS.",
          "J.Gray",
          "JerrTheHooman",
          "AlishaandRobert",
          "Lacey",
          "Floridagalsal",
          "GiFine",
          "yliana"
        ],
        "customerProfilePictures": [
          "https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif"
        ],
        "customerRatings": [
          "5.0 out of 5 stars",
          "5.0 out of 5 stars",
          "5.0 out of 5 stars",
          "5.0 out of 5 stars",
          "5.0 out of 5 stars",
          "5.0 out of 5 stars",
          "5.0 out of 5 stars",
          "5.0 out of 5 stars"
        ],
        "customerReviewTitles": [
          "Bought for Birthday gift",
          "Perfect for my wedding",
          "Great gift!",
          "Stunning",
          "Great for me",
          "Beautiful!!!",
          "Beautiful Birthday Gift",
          "Perfect... Bling and very happy... Petite & Classy"
        ],
        "customerReviewBodies": [
          "I bought this necklace as a birthday gift for my boss. I choose the Rose Gold, NOT knowing that is her favorite color. A couple hours after giving it to her, at work, she came and said how she loved it. At the end of the day, as I walked by her office, she informed me that it was her favorite gift of all. She even showed me she was wearing it. Today, 4 days later, she was still wearing it.\nThe necklace does not look cheap at all. It was well made, well designed. It truly does look more expensive then the price. I am considering buying her the matching earrings for Christmas.",
          "My husband and I wanted something for his daughter to include her in our wedding. She loved how it looked like three rings symbolizing the three of us. That is exactly what we were trying to achieve when we picked the necklace! She absolutely loved it and so did everyone else at the wedding. Definitely recommend buying it.",
          "Bought it for my mom a few months back and she absolutely loves it. Still going strong. Hasn't tarnished. Her coworkers have been complimenting her on it",
          "This is truly a gorgeous piece of jewelry. It is delicate looking but sturdy in feel. It draws the eye but is not ostentatious. It is a beautiful piece to add to your collection or to gift to a friend or family member. I love mine for my business or date night attire.",
          "I'm honestly really happy with it. Isn't tarnished at all, it's stamped and really pretty.",
          "I’m so happily surprised at the quality of this necklace! It looks like the more expensive, jewelry store type! Don’t hesitate I mean seriously, wouldn’t you rather have a fake if you are as absent minded (I misplace my keys and phone all the time) as I am or have thieves in your family like me? If it’s gone you are only out $30, not $230!!",
          "I",
          "Love it. For the price.... Hellooooo! Don't think twice if you like this style pendant. I went to Macy's and looked at the same one and it was double or more in price! To top it off, it was no where near the quality and well made as mine. The stones are shiny and the 'knot' flows. You do not see the connection of the knot in the back so it doesn't matter if the necklace flips. The chain sits right just below the collar bone - Perfect. At Macy's you could see the metal fused together at the back. A great buy! For real!",
          "The necklace is very nice and so is the colour but it itches me a lot when it is on. It could also be because I have sensitive skin. The packaging doesn’t really look nice but overall it is okay",
          "Nice pendant but a little smaller than I pictured. Works well with my aesthetic.",
          "Bought as a Mother's Day gift, was an instant hit with my wife. That's all you need to know.",
          "Got this for my mom for mothers day, it's beautiful except Chain is smaller than I thought.",
          "My girlfriends birthday is coming up, she loves rose gold jewelry. The pendant is perfect size and the chain is pretty good! Was better overall quality than I was anticipating."
        ]
      }
    },
    {
      "id": "Wnt8ifK",
      "title": "Kendra Scott Tess Pendant Necklace for Women, Fashion Jewelry",
      "price": "$70.00",
      "image": "https://m.media-amazon.com/images/I/61WsIXSm5CL._AC_UY500_.jpg",
      "description": "Enjoy your classic Kendra Scott® Tess Necklace.\nLink chain features outstanding stone pendant.\nPlease refer to color selection for stone detail.\n14K Gold, 14K Rose Gold, or rhodium - all plated over brass.\nLobster claw closure with extender. Spring ring closure with extender. Drawstring closure with extender.\nImported.\nMeasurements:\nChain Circumference: 16 in\nAdjuster Length: 2 3⁄4 in\nPendant Height: 2⁄5 in\nPendant Width: 1⁄2 in\nWeight: 0.1 oz",
      "reviews": {
        "customerProfileNames": [
          "Customer",
          "Grady",
          "Tanya",
          "Michael",
          "LindaDerby",
          "Customer",
          "Johnc.",
          "KadieVanceGriffin"
        ],
        "customerProfilePictures": [
          "https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif"
        ],
        "customerRatings": [
          "1.0 out of 5 stars",
          "5.0 out of 5 stars",
          "5.0 out of 5 stars",
          "5.0 out of 5 stars",
          "5.0 out of 5 stars",
          "5.0 out of 5 stars",
          "5.0 out of 5 stars",
          "5.0 out of 5 stars"
        ],
        "customerReviewTitles": [
          "Fraudulent necklace",
          "Little disappointed",
          "Percet!",
          "Love this",
          "Quality",
          "Very pretty",
          "This is a very nice necklace for the price",
          "Love it"
        ],
        "customerReviewBodies": [
          "This is a fraudulent necklace!!! After months of wearing it. It turned my skin green. My sister n law who ordered one from the Kendra Scott website wears hers all the time and hers doesn’t do this. I’m so upset About this. And don’t want to wear it anymore.",
          "She loved it til it turned her neck green sadly because it was beautiful",
          "Bought this for my niece's birthday and she loves it, great quality!",
          "Love this and now I will buy more of her products next time maybe in person🙂❤️🙂",
          "Daily wear",
          "Very nice",
          "Gave it as a Christmas gift to my daughter and she loves it",
          "Love it! Just as described"
        ]
      }
    },
    {
      "id": "EPkUtu9",
      "title": "Amazon Collection Platinum or Gold-Plated Sterling Silver Infinite Elements Zirconia Asscher-Cut Antique Drop Earrings",
      "price": "$42.20",
      "image": "https://m.media-amazon.com/images/I/71CE4Wrv0ML._AC_UY395_.jpg",
      "description": "An Amazon brand - Asscher cut drop earrings set with Swarovski Zirconia in cushion-shape halos set beneath trios of bezel-set rounds",
      "reviews": {
        "customerProfileNames": [
          "Kristin",
          "Rms61",
          "SuzyQ",
          "SueWilson",
          "Wendy",
          "CindyDavis",
          "Violet",
          "MelissaCordova"
        ],
        "customerProfilePictures": [
          "https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif"
        ],
        "customerRatings": [
          "3.0 out of 5 stars",
          "5.0 out of 5 stars",
          "5.0 out of 5 stars",
          "1.0 out of 5 stars",
          "5.0 out of 5 stars",
          "5.0 out of 5 stars",
          "5.0 out of 5 stars",
          "5.0 out of 5 stars"
        ],
        "customerReviewTitles": [
          "Not Swarovski as stated",
          "Buy these earrings now",
          "Perfectly stunning and look just like a $1300 pair at Jared!",
          "Pretty but TOO FRAGILE",
          "Elegant and Trendy",
          "These are magnificent earrings!",
          "Gorgeous earrings",
          "Perfect for gifting!!"
        ],
        "customerReviewBodies": [
          "These are absolutely gorgeous, however these ARE NOT Swarovski. I have Swarovski jewelry and this isn't it. The box is generic. Swarovski is not. It shouldn't be advertised as such when its clearly not.",
          "Love these - exactly what I was looking for at a great price. Lean forward and tilt down slightly, like most drop earrings, but that can easily be fixed with putting plastic earring backs on before you close the back. I have worn these everyday for 2 weeks and they are pretty sturdy, even in the pool, working out, and nursing shifts.\n\n10/10 recommend 👌",
          "A",
          "These broke in less than a month and wearing them maybe 4 times. The post just broke off. Disappointed these pretty earrings did not hold up. Of course there is no where on the Order to report problems. Frustrating!",
          "These earrings are elegant and beautiful. The Swarovski crystals do not disappoint: They sparkle and glitter in any light level. The rose-gold, vintage-looking setting makes them a very stylish, on-trend accessory. They are perfect for church, parties, or a night on the town. They are not too heavy, but they have enough weight so they do not feel cheap. They aren't humongous, but they are easily noticed by others, so the wearer will receive many compliments.If the wearer chooses to let others think they are real diamonds, they are perfectly believable. They come in a very classy-looking presentation box, which is perfectly suited for gift-giving. They are a good value for the price. Besides, who doesn't love sparkly things?",
          "Honestly, I wasn't expecting such fine jewelry when I ordered these. Costume diamonds can look tacky, but I'm addicted to the bling! These earrings are classy, well-crafted, sophisticated. I love wearing them. They go well with dressy clothes and great with jeans. I highly recommend them to bling lovers!",
          "I couldn't be happier with these earrings. They look exactly as pictured online. Lightweight, well made, and best of all...sparkly!!!! I love them. They go with any outfit. If you've been looking at them, go ahead and buy! You won't regret your purchase.",
          "I bought this to go with a matching necklace for my daughter's wedding gift from mom. She wore them on her wedding day because they matched her engagement ring, so score for mom! They were beautifully packaged and came in quickly, Thank you.",
          "Beautiful",
          "The earrings are very nice to look at but they are very heavy to wear.\nI think with the \"plating\" and the under core of the earring, this adds to the weight and the thickness of the\njewelry. I have found the hook itself is very thick at point of entry and hard to get through the piercing.\nI would love to give you a \"5\" but you aren't there yet.",
          "I bought the yellow gold colour. They are beautiful and shiny and I like to keep them in my ears all day long.\nA little con is that they are heavier in the front. In the ear, they hang slightly tilted toward the ground rather than facing forward.\nAnother thing that I would recommend to the producer is to make a bigger version of them. For me, they are a little bit small.",
          "These earrings are beautiful. They are not that heavy and have a slight sparkle to them under the light. They are the perfect size. They are not small but not overly large either. They look expensive too. Received lots of compliments.",
          "Sterling Silver Swarovski Zirconia Asscher-Cut Antique-Style Drop Earrings are just what I ordered. They are beautiful. I wear them non-stop. I am happy with my purchase."
        ]
      }
    },
    {
      "id": "eMyK3vM",
      "title": "Michael Kors Women's Silver-Tone Brass Hoop Earring (Model: MKJ7311040)",
      "price": "$50.00",
      "image": "https://m.media-amazon.com/images/I/81sZyspQqqL._AC_UY395_.jpg",
      "description": "These earrings feature silver-tone brass and post closures.",
      "reviews": {
        "customerProfileNames": [
          "L.E.Spencer",
          "tallgal",
          "CharlieSwaffer",
          "JamesRoss",
          "Anonymous",
          "jamie",
          "milly",
          "OllieRussell"
        ],
        "customerProfilePictures": [
          "https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif"
        ],
        "customerRatings": [
          "5.0 out of 5 stars",
          "5.0 out of 5 stars",
          "5.0 out of 5 stars",
          "4.0 out of 5 stars",
          "5.0 out of 5 stars",
          "5.0 out of 5 stars",
          "5.0 out of 5 stars",
          "5.0 out of 5 stars"
        ],
        "customerReviewTitles": [
          "Really beautiful!",
          "WOW! WOW! WOW!",
          "Very nice earrings.",
          "Looks like diamonds",
          "Great!!",
          "Exactly what I expected",
          "Beautiful",
          "Great timing on arrival and they look better in person"
        ],
        "customerReviewBodies": [
          "Look better in person",
          "These are amazing! These have good size stones that have an incredible amount of sparkle. These will definitely be standouts, even across the room, and will get you noticed. I love everything about these. There is an extra detail of a metal MK, along with the stones toward the top of each earring. What a unique feature. Also, another feature which makes an impressive gift presentation is a bag and a box. I got these for my daughter's Birthday, and I can't wait to see her face, when she opens them.",
          "The item pictures Do not do the earrings justice. When I opened the package I was absolutely satisfied with my purchase",
          "Very nice looking only drawback was that the posts were rough and not up to the quality of the rest of the earring. Still a good value, they look real diamonds.",
          "I bought these as a birthday gift for my friend and she absolutely love then. They are really gorgeous.",
          "Exactly what I wanted",
          "It stands out a lot and many people will comment how beautiful this Earrings look",
          "My wife loves them"
        ]
      }
    },
    {
      "id": "4mGxZnk",
      "title": "Amazon Collection 14K Gold Round-Cut Diamond Stud Earrings (1/4-2 cttw, J-K Color, I2-I3 Clarity)",
      "price": "$403.00",
      "image": "https://m.media-amazon.com/images/I/71LJMHvcWJL._AC_UX500_.jpg",
      "description": "",
      "reviews": {
        "customerProfileNames": [
          "JSM",
          "Weagle99",
          "davidmazzilli",
          "BradO",
          "ElizabethJackson",
          "BrianCaceda",
          "CEmons",
          "RebeccaSharpless"
        ],
        "customerProfilePictures": [
          "https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif",
          "https://images-na.ssl-images-amazon.com/images/S/amazon-avatars-global/99a78449-e94d-403a-9480-03fe8e83bfb6._CR0,0,335,335_SX48_.jpg"
        ],
        "customerRatings": [
          "5.0 out of 5 stars",
          "1.0 out of 5 stars",
          "5.0 out of 5 stars",
          "5.0 out of 5 stars",
          "5.0 out of 5 stars",
          "5.0 out of 5 stars",
          "5.0 out of 5 stars",
          "5.0 out of 5 stars"
        ],
        "customerReviewTitles": [
          "Great Little Studs",
          "The left earring looks like it’s half diamond half quarts rock fused together",
          "Great Value and Great Quality",
          "Very impressed!",
          "Sweet small studs for second piercing",
          "... got these earrings for my girlfriend's birthday and she loved them. Perfect gift for any special occasion",
          "Nice earings for the price",
          "Just right for me"
        ],
        "customerReviewBodies": [
          "I ordered the .25 ct pair. I am not experienced in the world of diamonds honestly, but they are as pictured. I think they’re beautiful and better than I’d hoped actually. They were a gift to myself, so thank you, me!!",
          "Received item today, returning tomorrow. The left earring looks like it’s half diamond half quarts rock fused together. I am extremely disappointed and can’t for the life of figure out how someone would look at these earrings and think they were worthy of selling. The left earring is beautiful, but I didn’t order this for one earring. I will update this when the issue is resolved; for now 1 star only and that’s because I have to click at least one.",
          "I bought these earrings for my wife. I was not 100 percent sure about ordering earrings online but I have never been so happy with a purchase. There couldn’t have been better quality earrings purchased anywhere else. I would 100 percent recommend these to anyone interested in buying earrings. One of the best purchases I have made in jewelry in a long time and I will definitely purchasing from this collection again!",
          "I bought these for my wife for her birthday, replacing a pair she had lost several years ago. Having been in the jewelry business for the first 20 years of my adult life, I was prepared to be disappointed. I must say, when they arrived and I looked them over, I was very impressed! They are a least as good a quality as represented if not better. No flaws visible to the naked eye and no noticeable hint of color. I didn’t measure them, but they seem a little “thick”, making them a little smaller in diameter then they should be. For the price, you have to expect to give up something, but overall I still say five stars. They brought my lovely wife to tears.",
          "Love these and leave them in the second piercing pretty much all the time. Classy, very nice looking and I wanted a small diamond stud just for this purpose-perfect! I did lose one right away and read that someone else did too so make sure they’re screwed on the back well. My pet sitter actually found it on the bathroom floor-I was shocked but it’s shiny!",
          "I got these earrings for my girlfriend's birthday and she loved them. Perfect gift for any special occasion, very reasonably priced, and great quality. The diamond is perfectly sized, the sparkle is brilliant, and the earrings look great on her ears.",
          "I bought the 1/4 carat earrings for my wife for Christmas. They arrived on Christmas eve, just in time for her to open. The 1/4 carat were a bit too small for her so I returned for the 1/3 carat studs which she liked much better. The threaded stud takes a bit getting used to but hopefully will prevent them from falling off.",
          "I",
          "These maybe 1/3 ct, the size is what I expected, but the quality is bad. That and there's no AGS number, just a made in USA sticker.\n\nYou can see one stone (right side) has two big 'bubbles' right in the center. The inclusions were big enough I could see them with the naked eye, the loup confirmed how big it was\nThe second has smaller specs and the both look pretty yellow.\n\nIf it was certified I may have kept them but will be returning.",
          "These earrings are so pretty. Very sparkly and good quality. Cannot tell the difference between them and my \"Jeweler's diamond pendant\". These same size earrings at my jeweler's were priced at $1300.00!!. Great color and they have screw on backs so you won't be losing them. I will most certainly be buying another size of these.",
          "They are beautiful. No obvious mistake or colour. To my husband and I they are perfect.\nAnyone who says they are yellow, too small.....do not trust these comments, they are beautiful diamonds. Thank you",
          "I am happy with this purchase..I was not expecting them to be quite this nice...with a 10 times magnifyer you can see the clarity is not the best but that is normal for earrings..the flat surface of them looks colorless...so a more expensive colorless diamond would not look much different.....for the price these are a good buy",
          "I really love these earrings but I dropped a star because the posts are so thin and the butterfly stops are really tiny so they are rather difficult to put on without the risc of loosing the tiny pieces. Plus these diamond earrings come without any documentation/certificate, so how can you be sure they are really 2x25k diamonds."
        ]
      }
    },
    {
      "id": "BJeS2_G",
      "title": "Swarovski Women's Tennis Bracelet and Earring Collection, Rhodium Finish, Clear Crystals",
      "price": "$92.94",
      "image": "https://m.media-amazon.com/images/I/71xebxPwn8L._AC_UY395_.jpg",
      "description": "",
      "reviews": {
        "customerProfileNames": [
          "Songbirdbutler",
          "L.W",
          "CarolinaGirl",
          "LBD",
          "Lindsay",
          "RachelJ.Hall",
          "GothamKnight",
          "Annwhite"
        ],
        "customerProfilePictures": [
          "https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif",
          "https://images-eu.ssl-images-amazon.com/images/S/amazon-avatars-global/default._CR0,0,1024,1024_SX48_.png"
        ],
        "customerRatings": [
          "5.0 out of 5 stars",
          "5.0 out of 5 stars",
          "5.0 out of 5 stars",
          "5.0 out of 5 stars",
          "5.0 out of 5 stars",
          "5.0 out of 5 stars",
          "5.0 out of 5 stars",
          "5.0 out of 5 stars"
        ],
        "customerReviewTitles": [
          "GORGEOUS!!!!!",
          "Very sparkly and durable",
          "Really pretty - and durable",
          "Perfect gift",
          "Beautiful Bracelet",
          "Very nice, on the small side though.",
          "Can't go wrong with Swarovski",
          "Perfect size. Sparkly."
        ],
        "customerReviewBodies": [
          "Stunning! Beautiful! Great value. Looks like real diamonds. So very sparkly. Even has a crystal on the latch itself. Packaging was excellent as well. Very happy with purchase.",
          "I have had this bracelet for over a year. I get so many compliments on it. I wear it every day - yes all day, even in the shower. It still looks brand new. One friend always comments on it and could not believe it wasn't white gold and diamonds - I ended up buying one for her for Christmas. She loves it too!",
          "Got these for my granddaughter and she felt so grown up with her diamond earrings. Were well made and looked expensive. Definitely worth buying.",
          "This bracelet is beautiful. I was so happy with my purchase.",
          "Earrings are very cute and look great. They are just a dash on the small side.",
          "Shines brighter than her real diamonds. She loves it.",
          "Beautiful. Love them.",
          "The bracelet received did not match the advertised picture. I already have one of these bracelets and ordered this one as a gift. See pictures - top bracelet is my Swarovski bracelet and bottom one is the bracelet received. The difference is shocking, looks completely wrong with no Swarovski marking and even has a stone missing, loose in the box.",
          "Premetto che colleziono gioielli Swarovski da tanti anni e quindi li conosco piuttosto bene. Ho fatto questo acquisto perché particolarmente attratta dal prezzo molto basso. È arrivato anche in anticipo rispetto ai tempi previsti, ma ho dei seri dubbi sull’autenticità. La confezione è sicuramente originale, ma il braccialetto non era stato fermato nella scatola con la solita protezione in plastica trasparente e morbida, bensì infilato in una bustina trasparente e fermato con la spillatrice. Inoltre come si può vedere dalle foto sia il logo che il marchio non sono ben definiti. Credo che sia una buona imitazione ma che non sia originale",
          "",
          "L",
          "W",
          "",
          "Excellent quality and looks so lovely and sparkly. Purchased for my mum and she was over the moon with it. Got it when it was reduced in price which made it even better value for money. Looks very classy and although quite big fitting it won’t come off of the wrist and sits nicely. Feels secure and not too delicate that you would be worried about loosing or breaking it."
        ]
      }
    },
    {
      "id": "G0WA-cm",
      "title": "4PCS 925 Sterling Silver Jewelry Set for Women Teardrop Pendant Necklace Earrings Bracelet Ring Fit with Party Meeting Dating Wedding Daily Birthday Gift",
      "price": "$12.99",
      "image": "https://m.media-amazon.com/images/I/51Igzv8R+vL._AC_UX385_.jpg",
      "description": "【FASHION DESIGN 】—Jewelry sets for women and Wedding Dress Special teardrop design. This jewelry suit are the perfect statement pair for day and night wear, will make you charmer and elegant, beautiful and attractive.\n【COMFORTABLE TO WEAR】—Jewelry sets for girls.We design is not only a ornaments but also art for art exquisite workmanship fine detail each step after complete professionals You can wear it in any occasions and it makes you eye catching Cool It is a good gift for your family friend and coworkers\n【PERFECT GIFT】—Christmas Fashion Jewelry Gifts.mothers day jewelry sets for women.Very popular with women and girls packaged in a velvet bag, a wonderful gift giving mom, wife, girlfriend, best friend, girls, teen girls or a special treat for yourself, as Mother's Day Gift, Christmas present, Birthday Gifts, Anniversary Gifts, Wedding Gifts or other Holiday Gifts.Package Content: 1 x Jewelry Set (1 x Necklace, 1 x Ring, 1 x Bangle, 1 Pair Earring)\n【MATCH TO MOST OCCASIONS】—Special teardrop design works well with your daily outfit,Can wear it with many things go to many occasions.Such as Valentine’s Day, Christmas’ Day, Mother’s Day,Thanksgiving Day,Birthday, wedding, party, anniversary, prom and casual days.Acrylic Acetate Drop Earrings ,give you charming look and win more compliments\n【High Quality Materials】--Silver+Brass. 100% BRAND NEW .Environmentally friendly material, Lead-Free & Nickle-Free & Cadmium-free, passed SGS Inspection Standard, no harm to health. Beautiful,Elegant,Fashionable Water Drop Shape Design, Very Popular You will be more charming and attractive with it.\n【Eye-Catching】-- The ultimate jewellery trend for 2022, statement 4PCS 925 Sterling Silver Jewelry Sets are the perfect way to highlight your Spring/Summer wardrobe.Wear our fashion statement pieces to a holiday party, prom, date night, or any special occasion and shine! this stunning piece that moves beautifully when worn.",
      "reviews": {
        "customerProfileNames": [
          "KlausHWolter",
          "CAR_MT",
          "ColinPatrick",
          "Mel",
          "KindleCustomer",
          "Shopaholic",
          "phyllis",
          "Diana"
        ],
        "customerProfilePictures": [
          "https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif",
          "https://images-na.ssl-images-amazon.com/images/S/amazon-avatars-global/bb8671f5-92fc-4df0-af71-724904cc150d._CR0,0,375,375_SX48_.jpg"
        ],
        "customerRatings": [
          "5.0 out of 5 stars",
          "5.0 out of 5 stars",
          "5.0 out of 5 stars",
          "5.0 out of 5 stars",
          "5.0 out of 5 stars",
          "5.0 out of 5 stars",
          "5.0 out of 5 stars",
          "5.0 out of 5 stars"
        ],
        "customerReviewTitles": [
          "Best gift for my mother",
          "So elegant! Very pretty! Good quality! Perfect gift!",
          "Love the earrings",
          "Don’t waste your $$",
          "Beautiful",
          "Darling Set",
          "Beautiful",
          "Too beautiful to be true.....love it! Buy it ladies"
        ],
        "customerReviewBodies": [
          "The gift for my mother's birthday are very beautiful,Espical the necklace and ring,very light and fashion,Mom became the star in the birthday party，it's a perfect birthday, Highly recommend this Jewelry Sets",
          "I receive compliments everywhere I go when I wear this set! The price is incredible! This set comes with a clear, square-shaped container that holds every piece in one place. This was very convenient when traveling! I could take out my earrings, take off the necklace and bracket, and place them in that slim, clear box, on the nightstand and easily find them the next morning! That box, which resembles a clear, square, coaster, can also easily slide into a purse pocket. When traveling it is nice to have a set of jewelry that goes with everything! From casual jeans to a dinner ensemble, this set is perfect!",
          "I feel like I need to chime in because so many people comment led on the earrings, but I love them. The posts are probably a tiny bit thicker than most earrings, but certainly not enough so that I had any problem. They were 80% of why I ordered the set I was pleased with them.\n\nLove the set. Good value for the price. Nice, simple, classic pieces.",
          "This is not sterling silver!!! Very poorly made. The bracelet was bigger than I expected and once I wore it a handful of times and then it just broke in half!\n\nThe ring and necklace turned black after I wore it for about a week. I didn’t even shower with these. Wish I could get a refund. The set it really pretty and dainty but not worth the money.",
          "My daughter loves it. She was bummed that the ring broke after about 2weeks of using it only occasionally. Fortunately it's affordable enough for me to buy another set and i can use the new chain and earrings.",
          "Love it and have had many compliments. The earrings are different to put in and takes a little patience.",
          "My daughter love this set. She has a small build and loves the adjustable ring and bracelet. She says it gets wet and still looks good.",
          "Wow, wow! Just got it, dont know where to start, its above and beyond my expectations. Just as advertise I love it very much. Beautiful set.....dont wear yet will write about durability ......"
        ]
      }
    },
    {
      "id": "rShMTsp",
      "title": "Napier Women's Pierced Earrings Pearl Drop Leverback",
      "price": "$12.74",
      "image": "https://m.media-amazon.com/images/I/81pDSGqUgHL._AC_UY575_.jpg",
      "description": "",
      "reviews": {
        "customerProfileNames": [
          "NoraM.",
          "JeanMarieAblett",
          "Ruby",
          "JP",
          "MSher",
          "GeniseDenton",
          "KindleCustomerKathiLedoux",
          "Bikermom29"
        ],
        "customerProfilePictures": [
          "https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif"
        ],
        "customerRatings": [
          "5.0 out of 5 stars",
          "5.0 out of 5 stars",
          "5.0 out of 5 stars",
          "5.0 out of 5 stars",
          "5.0 out of 5 stars",
          "5.0 out of 5 stars",
          "5.0 out of 5 stars",
          "5.0 out of 5 stars"
        ],
        "customerReviewTitles": [
          "Stone not centered in one earring.",
          "Would make a lovely gift 🎁",
          "Classy earrings",
          "Nice earrings",
          "Perfect size.",
          "Cute and dainty",
          "I have always loved the Napier jewelry",
          "Bikermom29"
        ],
        "customerReviewBodies": [
          "Lightweight, attractive earrings but the stone was not well placed , it was not centered , so I gave them to my g'daughter who has long hair and it's not noticeable.",
          "These earrings are very lightweight, elegant, dainty and very pretty. They would also make a great gift for someone who loves rose gold and pink. I know if someone gave them to me as a gift I would be pleased.",
          "These are very pretty earrings. Look nice worn casually or dressy. Light weight, secure closure. Look more expensive.",
          "Great value for a pair of gorgeous earrings. They are perfect to coordinate with work outfits but lightweight enough to be comfortable all day long.",
          "I love the look, size, weight and secure fit of these earrings.",
          "Love these earrings. Easy to put on and looks appropriate with any outfit.",
          "I have 2 pairs of these earrings. They are lightweight and very comfortable. Good value for the money and quite attractive.",
          "I get many complements on these earrings.",
          "These are gorgeous earrings!!!! I have had more compliments on them, the rose gold with the crystal compliment each other beautifully, They are perfect for sensitive ears I have had zero irritation what so ever! You can literally wear them with anything dress them up or down anything goes!! Perfect for a gift they come in a sweet little box. No one believes me when I tell them what I paid for them!!!",
          "The earrings are comfortable and although they finish off one particular outfit of mine, they would work with everything I have in my wardrobe.",
          "These are very lovely earrings - I bought the tanzanite, blue and the gold/turquoise opal. They look much more expensive than the price paid; however, I do agree with the other reviewers regarding the hooks - the hooks are very cheap and rough, not smooth, so I will probably change those out. Still worth it for the price. I took one star off because of this.",
          "very pretty, good quality and comfortable. I can keep them in and sleep in them no problem. Everything I hoped for.",
          "I love lever back earrings- and these are beautiful! They are perfect for me as I do not like large or heavy earrings- I hardly know I have them on except for the lovely compliments I receive ALL THE TIME!"
        ]
      }
    },
    {
      "id": "fpEIwpi",
      "title": "PAVOI 14K Gold Plated 3mm Cubic Zirconia Classic Tennis Bracelet | Gold Bracelets for Women | Size 6.5-7.5 Inch",
      "price": "$15.45",
      "image": "https://m.media-amazon.com/images/I/61a6A1NgYUL._AC_UY395_.jpg",
      "description": "",
      "reviews": {
        "customerProfileNames": [
          "MikeSeymour",
          "LanaRhee",
          "Brooke",
          "MercedesMom",
          "Tara",
          "Nicole",
          "Queen",
          "SuzieQ"
        ],
        "customerProfilePictures": [
          "https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif",
          "https://images-na.ssl-images-amazon.com/images/S/amazon-avatars-global/e3c4b8fc-a55b-48c3-837a-981736aa126e._CR0,0,667,667_SX48_.jpg",
          "https://images-na.ssl-images-amazon.com/images/S/amazon-avatars-global/2cb9e156-bc8e-469a-86d0-70dddfb63421._CR0,0,500,500_SX48_.jpg",
          "https://images-na.ssl-images-amazon.com/images/S/amazon-avatars-global/e46876b5-9260-40ae-aa9f-e1f9816a2c5b._CR0,0,400,400_SX48_.jpg",
          "https://images-eu.ssl-images-amazon.com/images/S/amazon-avatars-global/d1955252-9b53-415f-bda3-3ac2762a4648._CR81,0,338,338_SX48_.jpg",
          "https://images-eu.ssl-images-amazon.com/images/S/amazon-avatars-global/default._CR0,0,1024,1024_SX48_.png"
        ],
        "customerRatings": [
          "5.0 out of 5 stars",
          "5.0 out of 5 stars",
          "5.0 out of 5 stars",
          "5.0 out of 5 stars",
          "5.0 out of 5 stars",
          "5.0 out of 5 stars",
          "4.0 out of 5 stars",
          "3.0 out of 5 stars"
        ],
        "customerReviewTitles": [
          "🔥",
          "Makes me feel like a million bucks",
          "Surprised",
          "Beautiful bracelet!",
          "Great Clarity Prong Set Tennis Bracelet - Matches my real Diamonds",
          "GORGEOUS!!!",
          "Really Nice!",
          "Sparkly, but not durable"
        ],
        "customerReviewBodies": [
          " This thing is so bomb, especially for the price!! A little tip- for amazing sparkle use a disposable mascara wand and Jo Malone hand soap and gently scrub the CZ/diamonds. And then to keep costume jewelry from tarnishing, spray it with a polyurethane clear coat. Thank me later :)",
          "Beautiful! I feel like a princess when wearing this. Such great quality at affordable prices. Absolutely recommend",
          "I bought this to start stacking with my smartwatch. I'm very glad I did. It hasn't faded, no stones have come out, and hasn't turned colors.",
          "This tennis bracelet is amazingly realistic looking. I have a 6 carat REAL diamond tennis bracelet and in a way this \"imitation\" is prettier because the stones are more like PERFECT diamonds which are not found in the average diamond tennis bracelet. I purchased this inexpensive bracelet to wear in situations in which I would not feel comfortable wearing my REAL diamond bracelet. I am interested to see how long this bracelet remains nice looking and holds up to normal wear since it is such an affordable price. I hope the gold plating and construction of the bracelet will hold up. But for now, I can say the bracelet is beautiful and very believable if a diamond tennis bracelet of this size is within your budget range.",
          "Such a beautiful piece! Was contemplating buying a real tennis bracelet during a sale at my jewelers... Stumbled upon this and saved myself thousands. It really does look like a real tennis bracelet with true clarity diamonds. Not like a regular tennis bracelet though, but exactly like those set on prongs so that even though it’s a small CT count, the diamonds look extremely large. A really nice optical illusion. this bracelet nails it! Matches my real diamond bracelet and doesn’t dull down the clarity of the real diamonds - making for a perfect match that no one can tell apart. Definitely going to buy a few more so they can look like stackables! Absolutely buy if you’re contemplating!!",
          "Absolutely GORGEOUS!! I have really small wrists so I ordered the 6.5\" in white gold, and it fits PERFECTLY!!!! I can't wear this bracelet enough. It's so pretty! Doesn't look cheap and can be casual yet classy at the same time. I'm definitely happy with my purchase. It looks just like the product picture shown, and has zero defects.\n***If helpful, please click 'Helpful'*** :)",
          "Tennis bracelet is nice, worth the price. Has a nice shine to it, I kinda wish the gold was a little darker; just my preference. It is really nice otherwise.",
          "This bracelet really sparkles, and I love the size of the stones, but I fear it will not hold up to much wear. My biggest concern is the stiffness the bracelet. Other tennis bracelets I own lay flat on the dresser. But this one has to lay on its side, curled up. If I were to force it to lay flat it would definitely break. The links also kink and \"catch\" on each other and if I don't work them loose careful, again, I am sure it would break. I decided to keep the bracelet and just take extra care, but I'm not expecting it to last long.",
          "Read lots of good reviews about this bracelet and decided I need it also. It's very very sparkly! Not sure though about it looking like read diamonds as one lady wrote about silver one...\nOn photos I took on Pandora bracelet for comparison, as for me smaller stones would look better on this bracelet. It's bit not my taste so presented to my sister and she loves this bracelet!",
          " Stunning! I’ve been searching high and low for a tennis bracelet but didn’t want to break the bank plus these often come in very big sizes and my wrists are small, this one fits me perfectly (6,5 inch) hope it holds up nicely over time :)",
          " Excellent quality, well made and very sparkly. Looks sparkly and complements my jewellery",
          "Very pleased with this pretty bracelet. Nice quality cubic zirconias but not too flashy to wear every day. Good strong clasp which is easy to fasten.",
          "I thought this bracelet was excellent value for the cost. It is very good quality compared to others i have bought, small and sparkly, it looks like the real deal!"
        ]
      }
    },
    {
      "id": "tIm0vPn",
      "title": "GUESS Women's Toggle Logo Charm Necklace, Silver, One Size",
      "price": "$30.00",
      "image": "https://m.media-amazon.com/images/I/61I2w8sKHDL._AC_UY535_.jpg",
      "description": "",
      "reviews": {
        "customerProfileNames": [
          "Kelly",
          "Twilli",
          "EcaterinaOnceanu",
          "Sarah",
          "AdaliaGonzales",
          "Susan",
          "MaryBoykin",
          "LeaClausing"
        ],
        "customerProfilePictures": [
          "https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif",
          "https://images-eu.ssl-images-amazon.com/images/S/amazon-avatars-global/default._CR0,0,1024,1024_SX48_.png"
        ],
        "customerRatings": [
          "5.0 out of 5 stars",
          "5.0 out of 5 stars",
          "5.0 out of 5 stars",
          "5.0 out of 5 stars",
          "5.0 out of 5 stars",
          "5.0 out of 5 stars",
          "5.0 out of 5 stars",
          "5.0 out of 5 stars"
        ],
        "customerReviewTitles": [
          "Chic",
          "Love it!",
          "Amazing",
          "Best \"cheap\" necklace I've ever bought",
          "So precious!",
          "Wear all the time.",
          "Looks good 👍",
          "So cute!"
        ],
        "customerReviewBodies": [
          "I am living my cheap Tiffany life with this necklace",
          "Beautiful, it's exactly what I wanted! Lots of sparkle and great quality. Perfect for every day.\n\n2 years later and I still love it! It's hard to find a picture of me not wearing it. Love it so much I just ordered another one in gold.",
          "Very very beautiful! Better then picture !",
          "I get compliments constantly. I love this necklace I think I'm going to buy a couple more when the metal inevitably changes (it's been about 2 months of daily wear and it's still holding it's color) so maybe it never will",
          "T",
          "I love this necklace! I wear it to work & many people have commented on it. Great value. Pretty durable.",
          "I loves this necklace also got the bracelet. To wear to a wedding it was looks very good with my outfit.",
          "I love this necklace, it's a little bit big. But I love it",
          "This item is very nice. Even the toggle has gems either end of it. A pretty piece of costume jewellery, although it's a very bright silver colour and to me does seem a bit fake, not genuine guess but a nice copy.",
          "is very nice",
          "Definitely not original",
          "Really pretty",
          "Yuk so angry"
        ]
      }
    },
    {
      "id": "sy27N4T",
      "title": "MEVECCO Layered Heart Necklace Pendant Handmade 18k Gold Plated Dainty Gold Choker Arrow Bar Layering Long Necklace for Women",
      "price": "$13.59",
      "image": "https://m.media-amazon.com/images/I/71ONSnzw9RL._AC_UX385_.jpg",
      "description": "lobster claw closure\nLength of the first layer:13.5\"+2\"extender, second layer length:14\"+2 inches extender.\nMaterial of the cute karma choker necklace:18K Gold Plated over brass.Never faded.Lead and nickel free,Hypoallergenic.\nOur dainty necklace is suitable many occasions, etc party, wedding, ceremony, graduation, dating and vocation.\nOur tiny beaded necklace packaged with a delicate gift box and exquisite card.\nMevecco provided 100% satisfaction. If there are any problems with the purchase, please feel free to contact us, we will help to fix the problem or make the full refund.",
      "reviews": {
        "customerProfileNames": [
          "N.J.",
          "JamieSacilowski",
          "Amanda",
          "reid",
          "JACLYNBELLIZZIROBERT",
          "TonyaHarvey",
          "Jtaylo",
          "Beav"
        ],
        "customerProfilePictures": [
          "https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif",
          "https://images-na.ssl-images-amazon.com/images/S/amazon-avatars-global/34f2e4f6-3955-4fd5-9874-03a2b49c7d59._CR109,0,281,281_SX48_.jpg",
          "https://images-na.ssl-images-amazon.com/images/S/amazon-avatars-global/4a0d36b5-db7a-4843-b578-c72f2cb81c3f._CR0,32.0,268,268_SX48_.jpg",
          "https://images-na.ssl-images-amazon.com/images/S/amazon-avatars-global/ec6ace70-8add-43ef-bb9c-f5722b5d8cd3._CR0,0,375,375_SX48_.jpg",
          "https://images-na.ssl-images-amazon.com/images/S/amazon-avatars-global/2c3f1d8f-c25b-4287-9771-50627c899600._CR0,0,500,500_SX48_.jpg",
          "https://images-na.ssl-images-amazon.com/images/S/amazon-avatars-global/eaec1a92-78f2-49cd-bbad-c1d03d63b938._CR0,0,375,375_SX48_.jpg"
        ],
        "customerRatings": [
          "5.0 out of 5 stars",
          "5.0 out of 5 stars",
          "4.0 out of 5 stars",
          "5.0 out of 5 stars",
          "5.0 out of 5 stars",
          "5.0 out of 5 stars",
          "5.0 out of 5 stars",
          "5.0 out of 5 stars"
        ],
        "customerReviewTitles": [
          "Absolutely love it!",
          "Nice packaging. Arrived fast. Is delicate and looks nice",
          "Still Going Strong",
          "Perfect and Elegant",
          "SOOOO PRETTY",
          "Great necklace!",
          "Really nice set of necklaces",
          "Looks Real"
        ],
        "customerReviewBodies": [
          "I ordered the double chain lock necklace and it is soooo pretty and dainty! Really nice quality straight out of the box; wearing over time will be the true test. I don't shower or sleep in jewelry ever so I think this necklace will be good for a while. I took pictures with and without flash and I took pictures trying to show the scale of the lock. I really wish this came in silver also.",
          "Im unsure how it will hold up. I have only worn it for the day . But its beautiful 😍 Exactly what I wanted.\n\nSo far .. I'd reccomend! ♥",
          "I bought this in Dec. and it is now the end of April this necklace is still shiny, zero tarnish, and is stick intact. I have VERY sensitive skin and I've worn this to bed and showered with it on and had no reaction to it. It is dainty but I have snagged it pretty hard (being clumsy) a couple of times and it hasn't snapped. The only reason I gave it 4 stars is because the chains kind of wrap around each other sometimes. Otherwise, this was a great buy.",
          "This necklace has become a staple! I wear it with almost everything! It is the perfect basic jewelry piece that completes any outfit. I think it looks higher end and you can’t beat the price!",
          " Love it! So dainty and just really pretty & simple. Doesn't look cheap. I wear them together or separately. Super cute and compliments any outfit. Great for when you're dressed down or up.",
          "Loved this! The cross was a little bigger that what I expected.. but still a good value... comes with a cleaning cloth.. very shiny.. hope it don't fade.. but I loved this.. and the choker was separate from the cross necklace which I liked, so if I only wanted to wear one I could.. the choker isn't just plain.. but a cute design on it as well.. definitely would buy as a gift.. very pleased",
          "I really like this set. At first I thought it was one necklace but it's actually two separate necklaces. The longer necklace has a circle on it. The shorter necklace is more of a decorative chain. The shorter necklace is a little tighter on me than i like, but I have a necklace extender so with that added on its really nice.",
          "Beautiful necklace - comes as two separate chains. Each can be worn separately or together. Very sparkly, dainty and looks like solid gold. Highly impressed with how good it looks. Have been wearing for a week now, no issues. I take it off to shower, so not sure how that would affect the finish. Price was great too.",
          "Lovely design and weight, looked great for a couple of months with constant use (never took it off). After a while some links turned grey/black and the gold rubbed off the hoop. Often the weight of the clasp was so heavy it would move forwards, so you’re always readjusting. Loved it, but it’s in the bin now. Shame.",
          "Do not recommend. The chain completely tarnished after only a couple wears. Do not waste your money. By the second time I wore this I started noticing the chain darken. But the fourth time my neck was completely blue and the chain was almost black.",
          "Came patched together, didn’t realize it until had wore it half a day. Took it off after work day and it was tarnished and gold finished rubbed off . Unimpressed and cutting my losses. Thank goodness didn’t pay a lot of it",
          "Mine didn’t come in a box it came attached to a fashion jewelry piece of cardboard thank god I never sent this as a gift the chain tarnished after wearing it a few times",
          "The moment I put it on my neck there was a disgusting metallic odour coming from it. Immediately the round pendant started to tarnish. I know it wasn’t expensive but the description makes it sound much nicer and better quality. Would not recommend!!"
        ]
      }
    },
    {
      "id": "f0PRV9t",
      "title": "Anne Klein Women's Bangle Watch and Premium Crystal Accented Bracelet Set",
      "price": "$49.99",
      "image": "https://m.media-amazon.com/images/I/81x8mjmCZrL._AC_UX385_.jpg",
      "description": "Scratch resistant mineral crystal lens and Japanese quartz movement.",
      "reviews": {
        "customerProfileNames": [
          "Customer",
          "Anonymous",
          "MarySharp",
          "LorenaOrtizJara",
          "Rufus",
          "Malkia",
          "HaninAlJabari",
          "Anthony"
        ],
        "customerProfilePictures": [
          "https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif"
        ],
        "customerRatings": [
          "5.0 out of 5 stars",
          "5.0 out of 5 stars",
          "5.0 out of 5 stars",
          "5.0 out of 5 stars",
          "5.0 out of 5 stars",
          "5.0 out of 5 stars",
          "5.0 out of 5 stars",
          "5.0 out of 5 stars"
        ],
        "customerReviewTitles": [
          "Anne Klein Women's Bangle Watch and Premium Crystal Accented Bracelet Set",
          "Absolutely gorgeous",
          "Looks great",
          "Realmente es hermoso",
          "",
          "Great value, feels solid",
          "Cute, adorable expensive looking watch!",
          "Amazing",
          "Nice fit and finish."
        ],
        "customerReviewBodies": [
          "This item is good to gift her an excellent present. Is very elegance and convenient due to is a complete set. The price if very affordable.",
          "For the price I thought maybe it would be a few cheap freebee bangles, turns out they're actually high quality clasp back bracelets. Now I want a few more sets so I can mix and match! Much more lusterous and beautiful than I expected.",
          "Looks pretty my neighbor stole my package I was at hospital I will buy it again wish I had it hope she needed it bad",
          "Sin palabras ‘ hermoso",
          "",
          "Wife loved it which is mostly subjective. But I can tell you the weight feels good, the clasps are solid, and I expect they'll last for years. Great for the price. Quality.",
          "I bought this as a gift, the giftee absolutely loved it..\nVery classy and looks much more expensive than it's really is.",
          "I’m in love with this item, way more beautiful than the picture",
          "Purchased as a stocking stuffer. She loved it. Looks and feels very nice.",
          "Wife has nothing bad to say about her valentine's gift and I think they look nice.\n\nThe disappointment comes from the fact that the product case arrived damaged, which rendered it useless for displaying purposes; that's the only reason for four stars.\n- see the photos I've attached.",
          "El reloj es más pequeño que lo que muestran en la imagen.\n\nLa carátula es un círculo pequeño, fino, yo lo imaginaba más grande.\nUna de las pulseras llegó raspada.\n\nEn general se ve bonito juntando todas las pulseras con el reloj.",
          "",
          "Tal cual viene en la descripción. Todos los brazaletes tiene un eslabón ajustable para adaptar el tamaño a tu muñeca.",
          "",
          "My mother loved these! She is still thanking me after a month lol !",
          "Llego en tiempo y el reloj está muy bonito, lo único malo fue que la caja llegó defectuosa",
          ""
        ]
      }
    },
    {
      "id": "luzD0Iv",
      "title": "ManRiver 26 Letters Rings for Women - Diamond Rhinestone Studded Zirconia Open Adjustable Rings Jewelry Accessory Gifts (K, Adjust)",
      "price": "$4.50",
      "image": "https://m.media-amazon.com/images/I/51NZqK1YW+L._AC_SY450_.jpg",
      "description": "WELCOME To ManRiver Online Store ! women rings ring gold silver wedding sterling silicone engagement nose diamond women's toe steel rose stackable band men stainless 14k jewelry knuckle thin vintage birthstone finger clearance anxiety ring sterling silver ring spinner bead ring Selling point:     Simple and stylish     High quality metal     Inlaid rhinestones make you more outstanding     Suitable as a gift for mom, girlfriend and good friends     Suitable for all occasions. Like weddings, parties description:     Size: adjustable     Material: Alloy     Color: golden Attention. The product is open style, can be adjusted by yourself, the product picture is a kind of effect There is no fixed inner diameter for openings like this.     When you break it, try not to break the joint, although it is not so easy to break, but that is the most vulnerable place. contain:     1 x ring",
      "reviews": {
        "customerProfileNames": [
          "i_just_adopted_a_dinosaur",
          "Rachael",
          "RitaL",
          "cathys",
          "MariaHitt",
          "Ginnett",
          "ncaridadtejera",
          "Shopaholic"
        ],
        "customerProfilePictures": [
          "https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif"
        ],
        "customerRatings": [
          "1.0 out of 5 stars",
          "5.0 out of 5 stars",
          "5.0 out of 5 stars",
          "5.0 out of 5 stars",
          "5.0 out of 5 stars",
          "5.0 out of 5 stars",
          "1.0 out of 5 stars",
          "2.0 out of 5 stars"
        ],
        "customerReviewTitles": [
          "If you like green fingers this is the ring for you!",
          "Daughter loved the rings! Thank you!",
          "Very nice ring",
          "runs a little big",
          "Great",
          "Cute and comfy",
          "Beautiful ring",
          "It’s enough"
        ],
        "customerReviewBodies": [
          "See headline.",
          "Daughter loved the rings! Thank you!",
          "Exactly what it's supposed to be",
          "inexpensive cute",
          "It was great",
          "Fits good",
          "Nice ring but have not received yet since ordered 2 weeks ago!!!",
          "I like the style but not the quality"
        ]
      }
    },
    {
      "id": "TaM5xKr",
      "title": "Butterfly Stretch Necklace Little Girl Toddler Necklace Bracelet Set, Little Princess Jewelry Kids Play Necklaces Butterfly Rings for Kids",
      "price": "$8.99",
      "image": "https://m.media-amazon.com/images/I/61jDxqOFWTL._AC_UX385_.jpg",
      "description": "",
      "reviews": {
        "customerProfileNames": [
          "CraftyMom1329",
          "LonnetteSeabrook",
          "ZoicaRascol-Stroe",
          "KadiGainey",
          "JudithPurdom",
          "JudithKirkland",
          "CarolMiller",
          "CristianE."
        ],
        "customerProfilePictures": [
          "https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif"
        ],
        "customerRatings": [
          "5.0 out of 5 stars",
          "5.0 out of 5 stars",
          "5.0 out of 5 stars",
          "5.0 out of 5 stars",
          "5.0 out of 5 stars",
          "5.0 out of 5 stars",
          "5.0 out of 5 stars",
          "5.0 out of 5 stars"
        ],
        "customerReviewTitles": [
          "Necklace set - so cute!",
          "All dressed up!",
          "Very cute and cheap to make a girl happy.",
          "Cute",
          "Really cute.",
          "Stretchable and durable",
          "My Granddaughter loved it!",
          "Nice Gift"
        ],
        "customerReviewBodies": [
          "Perfect for my 2 1/2 year old granddaughter. She had the biggest smile when she opened it. Ring & bracelet a hit too. She gives the ring to Mom or Dad to hold when she takes it off",
          "Purchased for my granddaughter. She loves it!",
          "Very colorful. Pastel colors.",
          "Perfect age appropriate gift for little girls!!",
          "Pretty, sparkly. Hope the elastic bands are sturdy. Time will tell!",
          "Good item for a toddler",
          "My Granddaughter loved it!",
          "Nice and beautiful gift for my 3 yrs. old daughter, she's very happy with it."
        ]
      }
    },
    {
      "id": "mFQg-rY",
      "title": "SWAROVSKI Infinity Heart Jewelry Collection, Rose Gold & Rhodium Tone Finish, Clear Crystals",
      "price": "$99.80",
      "image": "https://m.media-amazon.com/images/I/71QeqYwodHL._AC_UY500_.jpg",
      "description": "Link adoration in the Swarovski® Infinity Heart Necklace. Pave heart pendant is highlighted by a rose-gold infinity pendant and link chain.\nLobster claw closure provides an adjustable length.\nImported.\nMeasurements:\nChain Circumference: 14 1⁄2 in\nAdjuster Length: 2 in\nPendant Height: 7⁄12 in\nPendant Width: 1 0⁄1 in\nWeight: 0.1 oz",
      "reviews": {
        "customerProfileNames": [
          "Martino",
          "MichaelLMoore",
          "Customer",
          "Customer",
          "ChuckDobner",
          "Square_1",
          "JodiBrito",
          "A.J.L",
          "itzallgood"
        ],
        "customerProfilePictures": [
          "https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif",
          "https://images-eu.ssl-images-amazon.com/images/S/amazon-avatars-global/default._CR0,0,1024,1024_SX48_.png",
          "https://images-eu.ssl-images-amazon.com/images/S/amazon-avatars-global/629a1b22-9e7b-42e8-a753-b1d6c98e7e39._CR0,16.0,300,300_SX48_.jpg"
        ],
        "customerRatings": [
          "5.0 out of 5 stars",
          "5.0 out of 5 stars",
          "5.0 out of 5 stars",
          "5.0 out of 5 stars",
          "5.0 out of 5 stars",
          "1.0 out of 5 stars",
          "5.0 out of 5 stars",
          "5.0 out of 5 stars"
        ],
        "customerReviewTitles": [
          "Absolutely stunning necklace.",
          "beautiful and great price from a great brand",
          "Infinity sparkle!",
          "Beautiful",
          "So worth every penny",
          "Birthday gift gone bad",
          "Valentine's Day Gift for My Wife",
          "Absolutely Beautiful!"
        ],
        "customerReviewBodies": [
          "Absolutely stunning! The simplicity and beauty of this necklace is beautiful. This necklace is perfect for any wife, mom or girlfriend.",
          "the brand is stellar and known for great jewelry. my girlfriend loves it and gets many compliments on it.",
          "This was a birthday gift to my seventeen year old granddaughter. It’s definitely for a small delicate wrist, beautifully crafted. She loved it and that’s what’s important!",
          "I gave this to my girlfriend as one of our monthly anniversary presents. She absolutely loves it. It looks beautiful on her! The only thing I could see people complaining about is how delicate the actual string of the necklace is. It’s very thin. But if you’re looking for an elegant gift, this is the one. Awesome!",
          "This necklace is a little pricey but so worth it! It is gorgeous and sparkles and shines!",
          "I was very excited to give this bracelet to a co-worker for her 50th birthday. She loved the bracelet. Unfortunately she told me today that is already broke, she only had the bracelet for a month.....I was going to return the bracelet for another one today and see that the return date is closed already....very poor quality and customer service. I will NOT buy from here again with this kind of quality and customer service.",
          "UPS lost this which was annoying but I finally got it straightened out. She loves it and it looks great. Would buy again.",
          "The crystals are stunning! Absolutely gorgeously and elegant necklace! Highly recommended!",
          "Vorsicht Fake Artikel von Swarovski siehe Bilder",
          "",
          "Paid £49.99 and the bracelet looks to be worth about £10. Very flimsy, cheap and nasty. Very poor quality for the price. Returned the item for a refund and heard nothing. Not had a reimbursement. and not reimbursement and still trying to get my money back. PLEASE DO NOT BUY!",
          "I wanted a thin small bracelet to wear everyday its beautiful and doesn't seem to be breakable the only thing is the pull chain gets tangled together in nots which is annoying so may not be best for everyday use",
          "This pendant is really lovely.. only thing is that it's actually way smaller than what we can see in these photos. I suggest you put a picture of a model actually wearing the necklaces so we know exactly how it looks in real life when it comes to size. Other than that it looks great I really love it and it's for a gift.",
          "The 'Swarvoski' items I purchased are counterfeit and not real Swarovski like promoted. This became particularly clear when I unboxed my items, the tags weren't on the product, the crystals were fake and there were numerous grammatical errors in the booklet provided."
        ]
      }
    },
    {
      "id": "XkdYYKh",
      "title": "NINE WEST Women's Boxed Necklace/Pierced Earrings Set, Silver/Blue, One Size",
      "price": "$20.00",
      "image": "https://m.media-amazon.com/images/I/81M9zZH2xwL._AC_UY500_.jpg",
      "description": "",
      "reviews": {
        "customerProfileNames": [
          "Cara",
          "RogerH.",
          "MaryBeth",
          "TammyWilson",
          "Tina",
          "NaeeNaee",
          "katherinekurgan",
          "FranM.Reece"
        ],
        "customerProfilePictures": [
          "https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif"
        ],
        "customerRatings": [
          "5.0 out of 5 stars",
          "5.0 out of 5 stars",
          "1.0 out of 5 stars",
          "5.0 out of 5 stars",
          "5.0 out of 5 stars",
          "5.0 out of 5 stars",
          "5.0 out of 5 stars",
          "5.0 out of 5 stars"
        ],
        "customerReviewTitles": [
          "Very pretty but",
          "Nice!",
          "Don't waste your money!",
          "Beautiful and worth the money",
          "Beautiful",
          "Perfection",
          "Super bright and pretty",
          "Love it"
        ],
        "customerReviewBodies": [
          "Packaging was great. Value for money was great. The necklace set was so pretty",
          "Very sparkly and very well priced for the money. Quite attractive -- both the necklace and the earrings.",
          "This necklace earring set was totally cheap craftsmanship. The color of the set, and size was accurate. But it was so poorly made that the pendant couldn't even slide on the necklace chain, and the added length \"notches\" (for adjusting the size of the necklace) were SO BIG you could see them from afar! HONEST!\n\nTo summarize: DON'T WASTE YOUR M0NEY!",
          "Absolutely gorgeous set!!!",
          "Beautiful,and look expensive",
          "This was a perfect addition to my daughter's prom glam!! She loved it and it looked amazing.. it was well crafted for the price and was exactly as described!",
          "This necklace earring set is very pretty! I wore it as bridesmaids jewelry and it did not disappoint! Very worth it",
          "This is beautiful. This will be for my 14 yr. old Granddaughter.",
          "Really cheaply made. Looks like its spray painted silver. Looks good from far. No where near worth the price its at. Returning to get something better.",
          "Son un bonito regalo o auto-regalo. Ojo: no son de oro, ni tampoco tienen piedras preciosas. Pero se ven muy bonitos, y son ligeros. Por el precio, están súper bien. Además, son duraderos: no se les caen las piedras ni se rompe la cadena.",
          "",
          "Lo compre a muy buen precio y lo utilizaré para un regalo",
          "",
          "Stones look darker on site than in person but beautiful",
          "Just as on the picture"
        ]
      }
    },
    {
      "id": "NKfKz_p",
      "title": "Amazon Collection Sterling Silver Black and White Diamond Angel Wings Pendant Necklace (1/2 cttw), 18\"",
      "price": "$193.10",
      "image": "https://m.media-amazon.com/images/I/8132KPLCd4L._AC_UY695_.jpg",
      "description": "Sterling silver necklace featuring angel wings pendant studded with sparkling black and white diamonds\n\nAngel-wing pendants are a popular pendant style, often worn as the representation of security and protection. The pendant reveals a modern combination of black and white sparkle at the base of an 18-inch rolo chain. The layered wings are coated in a display of black and white diamonds for a sparkling finish. The diamonds reveal I-J color and I2-I3 clarity, making up 1/2 cttw.\n\nSee more",
      "reviews": {
        "customerProfileNames": [
          "Weedie",
          "Mstesa",
          "Jessica",
          "Phil0sophic",
          "Joker",
          "Glenna",
          "jennywiseman",
          "C.Fox"
        ],
        "customerProfilePictures": [
          "https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif"
        ],
        "customerRatings": [
          "5.0 out of 5 stars",
          "5.0 out of 5 stars",
          "5.0 out of 5 stars",
          "5.0 out of 5 stars",
          "5.0 out of 5 stars",
          "5.0 out of 5 stars",
          "5.0 out of 5 stars",
          "5.0 out of 5 stars"
        ],
        "customerReviewTitles": [
          "STUNNING!",
          "Beautiful pendant but the chain sucks",
          "Thanks!",
          "Be careful how you describe this to recipient.",
          "Worth every penny",
          "Five Stars",
          "i think she will swap out the chain for something a little more sturdy. the charm is a decent size",
          "Beautiful!"
        ],
        "customerReviewBodies": [
          "I usually do not purchase jewelry on line but needed to get something special for my soon to be daughter in law. I saw this and figured I would try it.. (if I didint like it I could send it back) ! It is beautiful!! The picture does not do it justice! The diamonds, although small. sparkle and pair very well with the sterling sliver. The wings are quite large too,very noticeable when worn! It really is a beautiful piece!!",
          "I love the pendant! But the chain was very cheap and in knots. I bought the perfect chain for $25 sterling silver. For this price why can't the sell do this??",
          "T",
          "Told wife wife this was a perfect representation of her, mostly angelic somewhat demonic...Fail.\nAppears well made, looks great, the chain, meh.",
          "My wife absolutely loved it.",
          "This is one of my favorite \"go to\" necklaces. I've had so many compliments on this piece. Love it!",
          "got this for a gift to give to a friend. i think she will swap out the chain for something a little more sturdy. the charm is a decent size, however the chain is dainty.",
          "I",
          "Nice quality. Wifey thought it was biker chick jewelry. I told I thought of her Danish ethnicity and Valkyrie’s came to mind.",
          "Very nice... delicate though, could use a nicer chain for the price.",
          "Was what was advertised",
          "My wife loves the necklace!"
        ]
      }
    },
    {
      "id": "bvx4QMV",
      "title": "Amazon Collection Platinum-Plated Sterling Silver Infinite Elements Zirconia Cushion Halo Ring Set",
      "price": "$47.70",
      "image": "https://m.media-amazon.com/images/I/71rL1q4h-GL._AC_UY395_.jpg",
      "description": "An Amazon brand - Cushion halo ring set adorned with round brilliant cut Swarovski Zirconia, each ring features two Swarovski Zirconia set bands",
      "reviews": {
        "customerProfileNames": [
          "Annette",
          "Roy",
          "veronica2311",
          "TedEzee",
          "txmere",
          "NicoleFernandez",
          "HeatherEvans",
          "JenniferBeck"
        ],
        "customerProfilePictures": [
          "https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif",
          "https://images-na.ssl-images-amazon.com/images/S/amazon-avatars-global/bb367a9c-55ba-4fbc-ba2c-cb9957582d4a._CR0,74.0,1344,1344_SX48_.jpg",
          "https://images-na.ssl-images-amazon.com/images/I/41d3mN1GIGL._CR0,0,483,483_SX48_.jpg",
          "https://images-na.ssl-images-amazon.com/images/S/amazon-avatars-global/11cda5a7-2374-4390-a24c-2aa79c3b5aea._CR0,26.0,281,281_SX48_.jpg"
        ],
        "customerRatings": [
          "5.0 out of 5 stars",
          "5.0 out of 5 stars",
          "5.0 out of 5 stars",
          "5.0 out of 5 stars",
          "5.0 out of 5 stars",
          "5.0 out of 5 stars",
          "5.0 out of 5 stars",
          "5.0 out of 5 stars"
        ],
        "customerReviewTitles": [
          "Almost 4 years of full time wear",
          "Looks REAL! Fits true to size!",
          "Sooooo gorgeous",
          "A great way to try a new design.",
          "Impressive!",
          "It’s beautiful!",
          "I've already returned this. Take it off my try before you buy account",
          "Absolutely beautiful!!!"
        ],
        "customerReviewBodies": [
          "I",
          "I",
          "I have been buying cheap rings from Wish... and while they are pretty enough, they usually end up sooner or later turning my finger green. I had been looking for an alternative without spending a ton of money. This ring set is PERFECT. It's absolutely gorgeous, and obviously won't turn your finger green. I've gotten lots of compliments :)",
          "I am very happy with this ring. My antique wedding ring had gotten a little tight and this was a great way to try a new design before buying a more expensive ring. I am very pleased with fit and look forward to trying out this size and shape before a diamond commitment. This ring was very true to size and has a lovely profile.",
          "Very sparkly, very eye-catching ring. The pics helped me a lot. I was worried the band would be omitted, but both parts of the set arrived and I'm extremely pleased. This set is really comfortable and nothing gets caught on it. Go for it!",
          "Bought the ring to try on and i loved it ! It’s super comfortable and it was just my size . My husband refused to get this ring simply because he wanted to pick it himself and got a ring somewhere else. But i do recommend this ring set for anyone looking for something stunning that looks expensive for less.",
          "T",
          " I love this ring! Not too big to not look real and it is so stunning. It even sparkles in the dark. I couldn’t be happier with my choice for replacing my wedding ring.",
          "Ich habe den Ring bereits das 2. Mal bestellt und jedes Mal war der schmale Ring verborgen. Den jetzigen behalt ich mir, weil ich mir das nochmalige Zurücksenden ersparen möchte!",
          "",
          "I wore this ring for 1 week and the stones are already coming out which is very disappointing.",
          "Did not get 2 rings as described... just the main one... not the other one that fits into it",
          "Although the ring looks a lot smaller than the picture I really like it.",
          "me encanto la combinación",
          ""
        ]
      }
    },
    {
      "id": "LPWDl7h",
      "title": "Oval Necklace with Natural Sunflower, 18\" Sterling Silver, TAMI, Floral Jewelry",
      "price": "$32.95",
      "image": "https://m.media-amazon.com/images/I/7100hL+Mv1L._SY500_.jpg",
      "description": "Sterling Silver - TAMI - Jewelry for women.\n\nOval pendant made in sterling silver with NATURAL SUNFLOWER encased in resin with transparent background.",
      "reviews": {
        "customerProfileNames": [
          "crystal",
          "HaymanSilberberg",
          "Bee",
          "NancyMorrison",
          "AlexE.Wade",
          "Drgig",
          "SeanM.",
          "tinaryan"
        ],
        "customerProfilePictures": [
          "https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif"
        ],
        "customerRatings": [
          "5.0 out of 5 stars",
          "5.0 out of 5 stars",
          "5.0 out of 5 stars",
          "5.0 out of 5 stars",
          "5.0 out of 5 stars",
          "5.0 out of 5 stars",
          "5.0 out of 5 stars",
          "5.0 out of 5 stars"
        ],
        "customerReviewTitles": [
          "Beautiful♡",
          "Muy hermoso",
          "",
          "Sunflower",
          "My middle age daughter LOVED it!",
          "My daughter loves it.",
          "Very nice",
          "Very Cute",
          "I love sunflowers."
        ],
        "customerReviewBodies": [
          "Beautiful! My mother-n-law loved it. It's large enough to be noticeable and small enough to be cute!",
          "Precioso 💖",
          "",
          "This is definitely for sunflower lovers. A gorgeous piece. The packaging and scent had a beautiful presentation. Arrived quickly too. This would make a great gift.",
          "I sent this beautiful necklace to my daughter for her birthday… she loved it!!",
          "Time to buy the earrings.",
          "Bought it for my wife for Valentine’s Day. She loves it.",
          "It is very small. But the recipient LOVED IT!! So , very happy with purchase",
          "The necklace is for me because I love sunflowers. I used to plant them when I was younger.",
          "I never ever write reviews. But this necklace deserves one!!!! It didn't dissapoint that's for sure. It's super cute and the silver is quality. Stamped 925.",
          "A very cute jewellery piece, even cuter than it looks on the site. Love it"
        ]
      }
    },
    {
      "id": "i4EWrXi",
      "title": "Amazon Collection 10k Gold Round-Cut Birthstone Ring made with Infinite Elements Crystal",
      "price": "$60.30",
      "image": "https://m.media-amazon.com/images/I/71tQlzD9lUL._AC_UX395_.jpg",
      "description": "An Amazon brand - 10K yellow gold ring set with a Swarovski crystal in colors representing birthstones of the month.",
      "reviews": {
        "customerProfileNames": [
          "nrichoux",
          "Customer",
          "Customer",
          "Vctlzzr",
          "NicoleB.",
          "BeckyWheeler",
          "Stephanie",
          "Turner",
          "H.H."
        ],
        "customerProfilePictures": [
          "https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif"
        ],
        "customerRatings": [
          "1.0 out of 5 stars",
          "5.0 out of 5 stars",
          "5.0 out of 5 stars",
          "5.0 out of 5 stars",
          "5.0 out of 5 stars",
          "5.0 out of 5 stars",
          "5.0 out of 5 stars",
          "5.0 out of 5 stars"
        ],
        "customerReviewTitles": [
          "Falls Apart!",
          "It's perfect!",
          "Catches light nicely, ring was blowing across lawn in package.",
          "MUST BUY!!!!",
          "Durable!",
          "Beautiful ring!",
          "Love these rings!",
          "Beautiful June birthstone ring!😍❤💍"
        ],
        "customerReviewBodies": [
          "I loved this ring when I ordered and received it, it was what I had been searching for as a simple right-hand birthstone ring. It is real 10k and it fit nicely and looked good.\n\nAfter wearing it a couple of times, the \"pearl\" fell off the ring setting. That's also when I realized that the \"pearl\" is nothing more than a little plastic disc coated in a pearl style paint. I wasn't necessarily expecting a genuine pearl, but given the other rings are Swarovski Crystal, I expected a higher quality than what I got.",
          "I was hesitant to purchase this after reading someone's review that this ring was \"teeny tiny\" but it's not! It's the perfect size! It's very well made and the crystal is beautiful. I just purchased it in turquoise as well. 100% recommend!",
          "I was very glad to get this item earlier than expected (over night). I really like this ring but it's only my first day so I will update if I have any issues. One thing I noticed was the package was half ripped open and I was scared there wasn't going to be a ring so I hope they secure these a little better. This looks very pretty and I'm thrilled its real and will last. It's not big, maybe 1/3 in design. The sparkle is intense as well.\nStamped 10k. If you give as a gift just know the ring is in a baggie in the box not a holder.\nUpdate: my size 7 was a little big so I exchanged for size 6. My word the difference in one size was extreme. I decided to keep my 7 as the 6 was very tight, I also noticed my size 7 one was a tad mishaped but that's ok, I wanted to share this since my hands are pretty small incase someone else is thinking about exchanging, know that sizing can be off. Another thing I wanted to say was my package was just a ring, no one rang the bell or put it inside the screen door so it was blowing across my lawn when I got it, be sure you're home even if you left instructions to put it somewhere safe.",
          "If you are on the fence about the quality of this ring based on the low price like I was, rest assured your worries are for naught with this ring. It is BEAUTIFUL! The stone is large for the setting so it looks HUGE! And the ring is made of solid gold and it is not super thin it is nice and solid and sturdy. It hasn't bent AT ALL and the prongs are holding the stone in good and strong. THIS RING IS A MUST BUY!!! I cannot stress enough that you will not only be happy with your purchase you will be very happy you found such a nice ring at such a low price like I am. I waited a good couple months before writing this to make sure it would hold up, too. I bought anther ring at the same time for 3 times more and the stone, which seemed puny on that ring compared to this, fell out within a week.",
          "I do a physically demanding job and I hesitated to buy this ring because I wasn’t sure if it would hold up. I am happy to say that I wear it everyday and it is still in perfect shape. It’s only been three months but for the price and what I put it through I am impressed. Would recommend buying.",
          "Wanted a birthstone ring just to wear everyday. I love jewelry and wear real or costume depending on what I'm wearing. But, I am disabled now and I don't go out of the house like I use to. Everyday, I wore something different to match what I wore. I worked and wore scrubs but that didn't stop me from changing my jewelry. But, I don't work. I don't get out of the house but on average once a month. Still, I can't stop buying jewelry and I like having jewelry on now. Funny, but before I was disabled, I didn't wear any jewelry while at home except earrings and I would take those off before I went to bed. ALL this didn't have to be said but I just wanted to give an idea how simple yet pretty this ring is. I wear thin, light inter loop earrings, my wedding rings and now this ring. All pure gold since I keep them on all the time, while bathing, sleeping, etc. I just got it today so hopefully it'll last. If it doesn't, will edit review.",
          "These rings are real gold and a lovely size. Not too big or too little. I bought three of them all different colored stones. I stacked them on one finger for a more chic look. Absolutely satisfied with this ring. It fits as expected.",
          "My daughter's review: \"I really love this ring! It is perfect for a June birthstone. The size 7 is perfect.\nThe size fits as expected. Don't go bigger or smaller. This ring is nice and small. It will not snag on things. It is smaller than it is in the photo online but it is the perfect size of ring. Strongly recommend! 5 stars!\"",
          "The ring is just as described. It came within the time frame promised. I have worn it everyday all day since it came doing dishes, cleaning the house and even taking a shower with it it has never tarnished or changed colour .",
          " Not sponsored or offered any discount for review... I just knew there weren’t that many reviews, it’s definitely a beautiful ring...it has been good so far no chipping of gold or bending of the prongs ... will update in 6 months... still beautiful 5 months later , pictures do not do justice it sparklessss",
          "Outre ma main pas très jolie, la bague elle est vraiment belle.. on ne doit pas s'attendre a une bague lourde et massive, elle est legerte comme une plume et mince. Mais ça ne lui enlève pas son cachet. J'en suis bien heureuse, il ne lui manque qu'une mince bague corde pour jumelé avec elle et ce sera très jolie.",
          "",
          "I bought this because our baby is due for December and it made me happy, and if it's a girl I thought about passing it down to her when she was older.\nIt has 10k stamp on the ring. But the diamond definitely looks like costume jewelry. Which isn't terrible. I can always change the gemstones if need be.",
          " The only thing that makes this ring something that didn't come out of a cracker Jack box is the fact it states that it is 10kt gold. Absolute garbage."
        ]
      }
    },
    {
      "id": "Ehv0u3Z",
      "title": "Anne Klein Earrings",
      "price": "$25.00",
      "image": "https://m.media-amazon.com/images/I/61KqtL1eM0L._AC_UY695_.jpg",
      "description": "",
      "reviews": {
        "customerProfileNames": [
          "Jric",
          "Needtobreath",
          "DestinyKnopf",
          "peggy",
          "Marcy",
          "MaryLouHartis",
          "AdrianaA.",
          "FR"
        ],
        "customerProfilePictures": [
          "https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif",
          "https://images-na.ssl-images-amazon.com/images/S/amazon-avatars-global/3f45aa3c-24a8-47ad-99e8-c06a3719efc4._CR62,0,375,375_SX48_.jpg"
        ],
        "customerRatings": [
          "1.0 out of 5 stars",
          "5.0 out of 5 stars",
          "5.0 out of 5 stars",
          "5.0 out of 5 stars",
          "5.0 out of 5 stars",
          "5.0 out of 5 stars",
          "5.0 out of 5 stars",
          "5.0 out of 5 stars"
        ],
        "customerReviewTitles": [
          "Lovely, please open before you want to wear",
          "Sparkly!!",
          "Shiny, lightweight, and amazing",
          "Beautiful!! Perfect size, not over the top.",
          "Very beautiful!!",
          "These earned all stars!",
          "Super shiny!",
          "Perfect!"
        ],
        "customerReviewBodies": [
          "I",
          "These are beautiful and sparkling. I bought them to wear for my wedding Nov 7th. I compared them to my diamond in my wedding ring and you can’t tell a difference!!",
          "I get so nany compliments on my earrings. I love them much. I have super sensitive ears and these earrings don't bother them at all. They are the best!",
          "I bought these for myself for my daughter's wedding. Subtle, classic elegance. I love them!",
          "I bought this for me...but I end up\nGiving them to my sister as a gift...she really loved them ...they are very elegant and sparkling",
          "These are very pretty, comfortable to wear and look expensive. An excellent purchase and I give them 5 stars.",
          "Beautiful earrings, I recieve a lot of compliments.",
          "My daughter ordered for her HS prom, she wanted a small shiny drop earring that was a little more than just a stud. These worked great.",
          "La entrega fue muy rápida y eso es excelente.\nEl brillo de las piedras no es óptimo, se ven 10 veces menos atractivos en la realidad.",
          "",
          "No me gusto además de que en cuanto me los puse se rompieron.",
          "",
          "No se parece en NADA a la calidad que se percibe en la imagen. El proveedor debería de ser más honesto. El costo muy elevado para la calidad que tienen los aretes.",
          "",
          "Well made. Looks nice.",
          "Un dije llego dañado.",
          ""
        ]
      }
    },
    {
      "id": "AOgI1HE",
      "title": "Amazon Collection Sterling Silver Cubic Zirconia Halo Pendant Necklace and Stud Earrings Jewelry Set",
      "price": "$33.00",
      "image": "https://m.media-amazon.com/images/I/81wrnVlO-AL._AC_UX395_.jpg",
      "description": "Discover the Amazon Curated Collection of fine and fashion jewelry. The expansive selection of high-quality jewelry featured in the Amazon Curated Collection offers everyday values that range from precious gemstone and diamond pieces to the latest fashion designs. This hand-selected assortment features an array of diamond, gemstone, and precious metal designs that receive a quality inspection, including from Amazon’s staff graduate gemologist, to ensure they meet Amazon’s high standards. All diamonds featured in the Amazon Curated Collection are certified by our suppliers to be conflict free, and IGI, GIA, or AGS certifications are provided on white diamonds of .75 carats or larger on all stud earrings, rings, and pendant necklaces.\n\nspring-ring\n\nSee more",
      "reviews": {
        "customerProfileNames": [
          "MichaelRicobaldi",
          "teag",
          "MelaniSingletary",
          "AmandaMcD",
          "MoxieVida",
          "Customer",
          "Customer",
          "Customer",
          "Customer",
          "LeighannKeith"
        ],
        "customerProfilePictures": [
          "https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif",
          "https://images-na.ssl-images-amazon.com/images/S/amazon-avatars/default._CR0,0,1024,1024_SX48_.png"
        ],
        "customerRatings": [
          "5.0 out of 5 stars",
          "5.0 out of 5 stars",
          "5.0 out of 5 stars",
          "5.0 out of 5 stars",
          "5.0 out of 5 stars",
          "5.0 out of 5 stars",
          "5.0 out of 5 stars",
          "5.0 out of 5 stars"
        ],
        "customerReviewTitles": [
          "but they look great and I get compiments on the set at work ...",
          "4 years of wear! Still going strong",
          "Shows color in the light. Nice looking.",
          "Beautiful",
          "Gorgeous! Mom really loved this set!",
          "Perfect",
          "Perfect for wedding",
          "Great Set!"
        ],
        "customerReviewBodies": [
          "After 2 months of wearing these products everyday, it is time to give them the 5 star review they deserve. In the shower, in the pool, at the gym, at work, overnight-- these hold up! The nacklace has not shown any discoloration eventhough I wear perfume everyday, have worn it in the pool 3 times, and wear them in the gym 3-5 times a week (picture a sweaty mess). I will say though, that I had to coat the earrings in clear nailpolish, because they made my ears bleed (I am used to this); but with an application day 1 and a second application of clear nail polish about a month in, I can wear them continuously without thinking twice. Not only have they held up, but they look great and I get compiments on the set at work and with my family. Tbh, 10/10 would buy for anyone and would buy another set if there were a different design available. Classy AF.",
          "Ok I bought this in October of 2015 it’s now July 2019\nI have worn this almost daily.\nLiving in Florida I am in the pool almost daily I have two young kids. I have put this jewelry through the ringer and it still looks as good as it did the day I got it. I swear I thought for a long time someone made a mistake and sent the real deal! I loveeeeeeee this set!",
          "I bought this as a gift for a friend. I held it up to the light and it shines. It hangs very nicely. The pendant lays flat when it's held against the skin. It didn't swivel left or right. It looks like a very nice costume jewelry set. It may be momentarily mistaken for the real thing. It takes close inspection to see it's not. I like the fact it's SS and not some junky piece of garbage I'd return to the seller. The earrings I did not try on for sanity reasons. They too are very pretty when the light catches the stones. They are not clunky or heavy. I think I will suggest to the person receiving the gift to exchange out the back piece on the earring for one of those silicone ear thing-ys. I've always liked those things because sometimes that front piece falls off and before you know it you're searching around on the floor or the carpet wondering where did my earring go? I have extra so I'll include it in the gift box. Someone in the reviews complained their set that arrived was all tangled up in knots. I have found a solution that. ANYTIME a necklace of any kind, costume, 14K to 22K gets tangled... stick the chain in the freezer for a little bit - maybe 10 to 30 minutes depending how heavy the necklace chain is and how many knots are in the tangled mess. You take it out of the freezer and with a toothpick or a needle you can untangle the knots in no time. It really works. Be patient and don't yank it in the beginning when they get tangled. When you do get it untangled, after you wear it re-string it thru a drinking straw or a swivel coffee stick and re clasp it closed. Next time you travel or stick it in your drawer or purse, all you have to do is pick up the straw and Bingo! It's untangled! The set I bought was for someone that works in an operating room. Because the earrings don't dangle they were able to wear them at work. Perfect they said.",
          "Given the price point, what I received exceeded expectations. A beautiful necklace and earring set. Stamped verifying sterling silver. For the earrings, I would recommend getting earring backs for larger earrings as these come with standard backings that do not hold the weight securely on the lobe.",
          "It’s very flashy, but not too much as to be gaudy. If you want something for special occasions but don’t want to wear your good jewelry this would be perfect at a great price! Wish I would’ve take a pic of it on my mom. Only thing I recommend is to get larger backs for the earrings as they are heavy and don’t lay flat with backs provided. Otherwise gorgeous!",
          "I bought this to wear for my wedding coming up and it’s absolutely beautiful. It looks more expensive than it really is.",
          "The earrings and necklace did the job it was a last min purchase and if lived up to my expectations.",
          "I got this set to wear in my sister's wedding and it was perfect. Not too much bling, but just enough to still add to the outfit.",
          "Was tangled so horribly. Not overly impressed.",
          "Larger than I expected & they look rather cheap",
          "It is a cute set but a little big for my liking but good enough",
          "小ぶりのスワロフスキーですが、よく輝き、なかなか上品です。\nサイズが大きすぎないので、うるさくないのが良いですね。\n手頃な価格ですがクオリティが高く、服装も選ばないので、普段使いでも問題なく使えます。",
          ""
        ]
      }
    },
    {
      "id": "9ydwcg3",
      "title": "Swarovski Women's Symbolic Evil Eye Crystal Jewelry Collection",
      "price": "$83.08",
      "image": "https://m.media-amazon.com/images/I/81EhoLubuCL._AC_UY395_.jpg",
      "description": "",
      "reviews": {
        "customerProfileNames": [
          "Machielove",
          "Xilefone1",
          "MarioVilche",
          "Yunaiky",
          "MimiPlastique",
          "VanWyld",
          "Thatina"
        ],
        "customerProfilePictures": [
          "https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif",
          "https://images-eu.ssl-images-amazon.com/images/S/amazon-avatars-global/default._CR0,0,1024,1024_SX48_.png"
        ],
        "customerRatings": [
          "5.0 out of 5 stars",
          "5.0 out of 5 stars",
          "5.0 out of 5 stars",
          "5.0 out of 5 stars",
          "5.0 out of 5 stars",
          "5.0 out of 5 stars",
          "5.0 out of 5 stars",
          "5.0 out of 5 stars"
        ],
        "customerReviewTitles": [
          "Beautifully made and excellent quality❤️",
          "True Swarovski quality and beauty❤️❤️❤️",
          "More beautiful in person…..",
          "Worth it",
          "Belleza",
          "WAY more stunning than the picture can ever display",
          "Gift means much to my wife",
          "Love it"
        ],
        "customerReviewBodies": [
          "Firstly, I love Swarovski jewelry. I bought this item and I wear it every day just about. It is very comfortable snd goes with everything. It has not changed color and no Chrystals have fallen out. The quality is true Swarovski! Since then I have bought the matching bracelet and earrings excellent quality and wear.",
          "Since I ordered this bracelet I have warn it everyday. This bracelet stands up to the Swarovski name. It is very comfortable, no changes in color even when I wash dishes it still looks as beautiful as the first time I put it on. Since then I have bought the matching earrings and necklace. They are all so beautiful and true Swarovski quality!",
          "M",
          "it's definitely worth the price, very good quality. It was a great buy.\n\nUpdated 7-19-2021, GF lost it, she wore it everyday and loved it so getting her another one",
          "O",
          "what a beautiful pair of earrings I purchased I am so happy to say that I now have the entire evil eye set from Swarovski my fav jewelry brand",
          "Beautiful Dark Blue Evil Eye Pendant Necklace. Greek heritage gift. Very meaningful for my wife.",
          "I loved ! Beautiful earrings! They are very small and delicate!!!",
          "Well I thought it was a very pretty piece. Though the wife gave it back and said it was creepy. No accounting for taste I suppose. I still think it is a very nice piece of jewelry.",
          "Picture does not do a justice is such a precious thing and value for money i love it i have 7 months wearing it keeps the colours and bright as a star still .",
          "Collana molto bella ma manca del certificato di garanzia e non ne capisco il motivo dato che in tutti i negozi swarovski viene consegnato, ma cosa ancora più inaccettabile e aver pagato la collana 79,00€ e poi vederla vendere dallo stesso venditore a distanza di pochi giorni a 39,00€, incomprensibile, questo tipo di politica fa si che non si riesca mai a capire se il prezzo che si va a pagare un oggetto sia quello giusto o meno!!! Delusione assoluta e soprattutto 40€ in più gettati via!!! MAI PIU'",
          "",
          "I bought this product as a gift for a close friend. She absolutely loved it and was lost for words with how beautiful it is. The blue stones are stunning and the light hits them perfectly making them sparkle. Great purchase!",
          "A ver, es bonito pero yo he pagado un swaroski y ha llegado un colgante aunque bonito y fino sin el sello de garantía swaroski. He pagado por algo original y he pagado una buena imitación. Es fake.",
          ""
        ]
      }
    },
    {
      "id": "kQQW9LH",
      "title": "Amazon Collection Sterling Silver Blue and White Diamond Heart Pendant Necklace (1/2 cttw), 18\"",
      "price": "$225.00",
      "image": "https://m.media-amazon.com/images/I/81PdvjAM7EL._AC_UY675_.jpg",
      "description": "Sterling silver necklace featuring twisted heart pendant embellished with rows of blue and white diamonds\n\nThe Amazon Curated Collection\n\nDiscover the Amazon Curated Collection of fine and fashion jewelry. The expansive selection of high-quality jewelry featured in the Amazon Curated Collection offers everyday values that range from precious gemstone and diamond pieces to the latest fashion designs.\n\nThis hand-selected assortment features an array of diamond, gemstone, and precious metal designs that receive a quality inspection, including from Amazon’s staff graduate gemologist, to ensure they meet Amazon’s high standards. All diamonds featured in the Amazon Curated Collection are certified by our suppliers to be conflict free, and IGI, GIA, or AGS certifications are provided on white diamonds of .75 carats or larger on all stud earrings, rings, and pendant necklaces.\n\nPieces from the Amazon Curated Collection come packaged in a custom box, making them wonderful gifts. In addition, we offer free one-day shipping within the continental U.S. on items over $500. International shipping options for friends and family overseas are available for an additional fee.\n\nThe Amazon Curated Collection offers a specialized customer service team that is available seven days a week to answer any product questions before, during or after the purchase. If you’re not satisfied for any reason, you will receive a full refund and free return shipping within the U.S. if you return your purchase within 30 days.\n\nFind a special gift for a loved one or a beautiful piece that complements your personal style with jewelry from the Amazon Curated Collection.\n\nDiamond Clarity:\n\nNo two diamonds are alike. A diamond's most distinguishing characteristics are its inclusions, marks that are often invisible to the naked eye. However, under a jeweler's magnifying loupe or microscope they can look like crystals, tiny rivers, or clouds. A diamond's clarity is determined by the presence or absence of inclusions--fewer inclusions mean better clarity--and how visible they are. The greater a diamond's clarity, the greater its brilliance and value. A diamond categorized as internally flawless will have no inclusions, but this is extremely rare.\n\nDiamond Color:\n\nThough diamonds come in a wide range of colors, colorless diamonds have traditionally been considered the most valuable. Most diamonds are graded on a scale using the letters of the alphabet, from D (colorless), the best grade, through Z (a light yellow). It is difficult for the untrained eye to notice such variations in color unless stones are being compared side by side.\n\nDiamond Carat Weight:\n\nA diamond's weight is measured in carats, with one carat being equivalent to 100 points. You will often see a diamond referred to as a 3/4-carat stone or a 75-point diamond. Larger stones are often more highly valued, but size should not be the only consideration--high brilliance, which varies according to clarity, cut, and color grade, is highly desirable in a diamond.\n\nDiamond Certification:\n\nA diamond certificate represents independent verification that the stone purchased has all the qualities of cut, color, clarity, shape, and weight expected. It is a further indication of the condition and value of that diamond as represented on our site. Such certificates are issued by several agencies employing highly trained gemologists and provide an unbiased and accurate evaluation of the diamond. These gemologists scrutinize each stone to analyze its dimensions, clarity, cut, color, finish, symmetry, and other details.\n\nDiamonds purchased from the Amazon.com Collection may be certified by the Gemological Institute of America or the International Gemological Institute. The type of certificate provided will be noted in the product specifications of your jewelry purchase; if you do not see a certificate type noted, one will not be provided.\n\nOur Diamond Policy:\n\nAmazon.com sources high-quality diamonds from some of the world's largest suppliers. All our diamond suppliers certify that to their best knowledge their diamonds are not conflict diamonds.\n\nDiamond Care:\n\nDiamonds, as the hardest substance on earth, are resistant to damage. However, diamond jewelry is set in different metals, and care will vary from piece to piece. Diamonds should be cleaned in a solution of one part ammonia to six parts water, using a gentle scrubbing brush to remove any dirt. It is a good idea to have them cleaned once a year by a professional jeweler, at which time the security of the setting can be checked as well. Diamond jewelry should be stored in a soft cloth pouch to ensure that the stone will not scratch other jewelry.",
      "reviews": {
        "customerProfileNames": [
          "zach",
          "CPCO",
          "LynMurdock",
          "Elliemae",
          "Jenny",
          "CecilBader",
          "Titaniumgrl",
          "starawilkins"
        ],
        "customerProfilePictures": [
          "https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif"
        ],
        "customerRatings": [
          "5.0 out of 5 stars",
          "5.0 out of 5 stars",
          "5.0 out of 5 stars",
          "5.0 out of 5 stars",
          "5.0 out of 5 stars",
          "5.0 out of 5 stars",
          "5.0 out of 5 stars",
          "5.0 out of 5 stars"
        ],
        "customerReviewTitles": [
          "Great!",
          "Very nice",
          "A Favorite Necklace",
          "This is a beautiful piece of jewelry.",
          "Lovely necklace",
          "Awesome gift the ladies would love.",
          "Great Sparkle in this heart!",
          "Worth the cost"
        ],
        "customerReviewBodies": [
          "Looks like the picture. Looks very nice",
          "It turned out to be very beautiful is what my girlfriend said. Everyone that saw it was admiring it very much. She loved it. We did change the chain so that it was better and would not break.",
          "Dress it up. Wear it every day. This beautiful necklace is affordable and looks beautiful. I love the sapphire color and the heart design is classic, but unique.",
          "I was so pleasantly surprised how beautiful this necklace was. I have had many compliments on it.",
          "Very sparkly, bigger than I expected, beautiful necklace and great price! Hopefully it does not tarnish, let’s see what happens…",
          "My wife loved it. For the money I thought it was very nice. As long as she loved it that’s what matters.",
          "I was worried when I purchased as some said the color was not a true blue but mine came just like shown! Very nice sparkle and lays well against you when worn. Chain is not all that great. Good value for the money.",
          "Giftable"
        ]
      }
    }
  ]
}
