[
	{
		"id": "0fraxtMId-sk8KNIByWFd",
		"title": "Alienware 25 Gaming Monitor - AW2518Hf, Full HD @ Native 240 Hz, 16:9, 1ms Response Time, DP, HDMI 2.0a, USB 3.0, AMD FreeSync, Tilt, Swivel, Height-Adjustable (Renewed)",
		"imageUrl": "https://m.media-amazon.com/images/I/71VuLdCgW4L._AC_SY450_.jpg",
		"price": "$69.99",
		"description": "1920 x 1080 - 400 Nit - 1,000:1 - Full HD - HDMI - DisplayPort - USB - Silver, Black Chrome",
		"reviews": [
			{
				"name": "Ashley Fernandez",
				"pictureUrl": "https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif",
				"rating": "1/5",
				"reviewTitle": " Refurb Doesn’t Hold Up",
				"review": "Product lasted about 40 days and went out on me, it was refurbished so I guess get what you pay for. Was really wanting this monitor to work out."
			},
			{
				"name": "hrhill3",
				"pictureUrl": "https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif",
				"rating": "5/5",
				"reviewTitle": " Great monitor",
				"review": "My son designed his own gaming computer and picked this screen out .. loves it .. he also picked out a high graphics card and this was the monitor that was able to handle it and really show the graphics"
			},
			{
				"name": "thomas",
				"pictureUrl": "https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif",
				"rating": "5/5",
				"reviewTitle": " Best monitor I ever had",
				"review": "All around the best monitor I ever had. The quality is amazing in every way!"
			},
			{
				"name": "PublicName",
				"pictureUrl": "https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif",
				"rating": "4/5",
				"reviewTitle": " Refurbished goods are never \"Like New\", but this one might be worth the trade off",
				"review": "It didn't come with a display port cord and was refurbished being promised as like new, but had some minor screen damage. Saved a lot of money for an originally great product."
			},
			{
				"name": "Jose",
				"pictureUrl": "https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif",
				"rating": "2/5",
				"reviewTitle": " Stand",
				"review": "The stand is too big"
			},
			{
				"name": "Amysterz",
				"pictureUrl": "https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif",
				"rating": "5/5",
				"reviewTitle": " great monitor",
				"review": "I love it"
			},
			{
				"name": "Austin",
				"pictureUrl": "https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif",
				"rating": "5/5",
				"reviewTitle": " Great buy",
				"review": "No complaints this monitor will up your gameplay!"
			},
			{
				"name": "Boyd",
				"pictureUrl": "https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif",
				"rating": "5/5",
				"reviewTitle": " Competitive beast",
				"review": "I got this monitor from someone off of Craigslist and its being great for games that can run that 240hz display the image quality doesn't hold up to 2k if you compare it to a game like cyberpunk or forza or halo but thats not really what this is meant for so thats not fair but using it for the games its meant for mainly seige and csgo its amazing also there is no ghosting until you put it into the super fast or extreme mode even then its not noticeable in practice"
			},
			{
				"name": "Leone",
				"pictureUrl": "https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif",
				"rating": "1/5",
				"reviewTitle": " Not brand new!!!",
				"review": "Quality control excuse to open the box. Send me a used monitor."
			}
		]
	},
	{
		"id": "CTuW5Rlx_ROOH48Q0Yz0f",
		"title": "Lenovo L28u-30 28-inch IPS Monitor, UHD 4K Display, Ultra-Thin Bezels, AMD FreeSync, 4ms, 60Hz, HDMI, DisplayPort, Low Blue Light, VESA Mount Capable",
		"imageUrl": "https://m.media-amazon.com/images/I/61NPhTFMPoL._AC_SY450_.jpg",
		"price": "$293.45",
		"description": "The Lenovo L28u-30 computer monitor has a 28-inch 4K display with an ultra-thin bezel that's ideal for home entertainment and gaming. With 3840 x 2160 resolution, you'll enjoy astounding clarity with colors that flow seamlessly whether you're streaming that new movie or playing your favorite game. The quick 4ms response time and AMD FreeSync™* technology ensure smooth gameplay, elevating your experience. The wide viewing angles (up to 178°) enabled by the In-Plane Switching (IPS) panel lets you enjoy what you're watching from any position without color shift or distortion. Natural Low Blue Light technology minimizes eyestrain, while Eyesafe Display Certification meets the industry standards for low blue light and high color performance. Plus, with 3-side NearEdgeless bezels, you'll enjoy maximum screen space with less distraction.\n\nThe L28u-30 monitor displays vivid colors covering an exceptionally wide color range with high accuracy at 99% in the sRGB gamut and 90% in the DCI-P3 color gamut. Additionally, the 10-bit profile can display 1.07 billion colors, so you'll enjoy spectacular visuals on your 4K monitor. HDMI 2.0 and DisplayPort 1.2 video input ports make sure that your video signal has the highest resolution available.\n\n*AMD Freesync™ is enabled for AMD Radeon™ Series graphics cards.",
		"reviews": [
			{
				"name": "james m edwards",
				"pictureUrl": "https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif",
				"rating": "5/5",
				"reviewTitle": " Perfect for day-trading.",
				"review": "Changed out 6 Dell monitors 24 to 30 in for 6 Lenovo 28 to 32 inch with displayport and hdmi connections and could not be happier. The Dells were old and very HOT, these run almost at room temperature. Colors vibrant, response time is twice what the Dells were (there were old). UNIFORM color and brightness with screen adjustment that makes sense unlike almost all the other monitors I shopped. The price is a bargain. Would absolutely buy again without hesitation."
			},
			{
				"name": " Customer",
				"pictureUrl": "https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif",
				"rating": "5/5",
				"reviewTitle": " Top quality image, perfect for reading text",
				"review": "Top quality image, perfect for reading text"
			},
			{
				"name": "N Drew",
				"pictureUrl": "https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif",
				"rating": "5/5",
				"reviewTitle": " Happy with my purchase",
				"review": "Great monitor- easy to set up"
			},
			{
				"name": "thequest",
				"pictureUrl": "https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif",
				"rating": "5/5",
				"reviewTitle": " Choice",
				"review": "The picture quality is stunning."
			},
			{
				"name": "Jackie",
				"pictureUrl": "https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif",
				"rating": "5/5",
				"reviewTitle": " Great 4K monitor at a great price",
				"review": "I'm really happy with this 4K monitor. I've purchased 3 of them (1 for home and 2 for office). Great picture and great value!"
			},
			{
				"name": "Rob Anglin",
				"pictureUrl": "https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif",
				"rating": "2/5",
				"reviewTitle": " Monitors are NOT new",
				"review": "I bought (2) of these; they are advertised as new when they are clearly used/refurbished. Buyer beware!"
			},
			{
				"name": "Tom G",
				"pictureUrl": "https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif",
				"rating": "1/5",
				"reviewTitle": " Buyer Beware! Weird Screen issue after 6 months",
				"review": "This monitor worked really well for 6 months. However, today, I noticed a weird square splotched spot in the upper left corner of the screen. Not sure what it is or how to fix it. I couldn't find a solution on the internet. If you need a high end monitor for gaming, this might be a good option. But, if just need a monitor for work, I would suggest something cheaper and more basic. It probably will last longer than this one."
			},
			{
				"name": "Patrick O'Malley",
				"pictureUrl": "https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif",
				"rating": "4/5",
				"reviewTitle": " Good monitor for the price",
				"review": "I just wanted a monitor with 4k resolution to fit more text on a page (not for movies), and this is a good value at the price point."
			},
			{
				"name": "MG537",
				"pictureUrl": "https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif",
				"rating": "3/5",
				"reviewTitle": " Not the most colour accurate monitor",
				"review": "For around $450 (canadian) this monitor is a bargain if the 4K resolution is all you're looking for.\nI bought this needing the screen Real estate that a 28\" inch 4K monitor would bring.\nIn my line of work I need to keep many Windows Open at a Time so the more real estate the better.\nI put it next to my older Dell 24\" (it too a 4K) and you can clearly see the Lenovo having a slight yellowish tint.\nNo big deal if MS Office, and UNIX/Linux consoles are your thing.\nNot suitable for photo/video editing where colour accuracy is important.\nFlimsy stand but as long as you don't constantly bump your desk, it's OK."
			}
		]
	},
	{
		"id": "R6l60sQxjTmuDg8_QXPbr",
		"title": "Alienware 25 Gaming Monitor - AW2518H (Renewed)",
		"imageUrl": "https://m.media-amazon.com/images/I/91p4-M4xhvL._AC_SY450_.jpg",
		"price": "$359.00",
		"description": "Dell New Alienware 25 Gaming Monitor: AW2518H. Viewable image size (diagonal) 62.23 cm(24.5 inches). Active display area - Horizontal/Vertical: 543.74 mm (21.41 inches) / 302.62 mm (11.91 inches). Maximum resolution1920 x 1080, Full HD @ native 240Hz. Aspect ratio 16:9. Pixel pitch 0.2832 mm x 0.2802 mm. Brightness (typical) 400 cd/m. Color gamut (typical) 72% (CIE 1931). Color depth 16.7 million colors. Contrast ratio (typical) 1,000:1. Viewing angle (typical) (vertical/horizontal) 170/ 160 . Response time (typical) 1 ms(GTG). Panel technology TN. Backlight LED Edgelightsystem. ComfortView1 with Flicker-free screen. Dell Display Manager. Connectivity 1x DP1.2, 1 x HDMI 1.4, 1x USB3.0 upstream, 4x USB 3.0 downstream with 1 power-charging, 1 x audio line-out jack, 1 x headphone-out jack , VESA mount support (100 mm). Security Kensingtonlock. AC input/voltage/frequency/current 100 VAC to 240 VAC / 50 Hz or 60 Hz +3 Hz / 1.5 A (typical). Power consumption( typical) 26W 73W. Power saving(typical) Less than 0.5W.",
		"reviews": [
			{
				"name": "Zakariah Siyaji",
				"pictureUrl": "https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif",
				"rating": "1/5",
				"reviewTitle": " It’s not worth the price tag.",
				"review": "The color flickers black when in full screen mode. The gaming quality was mildly better than my normal HP monitors."
			},
			{
				"name": "Jose Armando Manzo",
				"pictureUrl": "https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif",
				"rating": "5/5",
				"reviewTitle": " Best 240hz gaming monitor",
				"review": "Best gaming monitor for the price!"
			}
		]
	},
	{
		"id": "O2cdI4-WhdZGozehWradU",
		"title": "Thinlerain PC Monitor 17-inch 4:3 LED Backlit Monitor 1280 X 1024, 60 Hz Refresh Rate, 5Ms Response Time, VESA Mountable, VGA, HDMI, TN Panel, Built-in Speakers",
		"imageUrl": "https://m.media-amazon.com/images/I/71PhSuu236L._AC_SY450_.jpg",
		"price": "$89.99",
		"description": "About this item\nWide Application - Thinlerain 17 Inch monitor for PS3/PS4/Xbox 360/Switch, PC monitors, Laptop extend monitors. (Note: This is a low-resolution monitor)\nLED Monitor - 1280*1024 native resolution screen. LED Screen 250 nits brightness. 1000:1 Contrast Ratio, Aspect Ratio Standard (4:3)\nMulti-interface: HDMI VGA Monitor have one HDMI input ,Connect any device with HDMI interface as portable hdmi monitor. One Input audio: audio signal input, transmission of audio signals to the speakers.One VGA interface: for analog signals, pictures and sound. also Built-in two 1.5w speaker.\nDual Installation PC Monitor - It can be put on the desk with the include stand, and also can be hang on the wall via the 100mmx 100mm VESA mount on the back.\nThinlerain Customer service: We have provided one year warranty and lifelong customer service. If you have any problem when use the monitor please contact us.",
		"reviews": [
			{
				"name": "tiffany",
				"pictureUrl": "https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif",
				"rating": "5/5",
				"reviewTitle": " Would recommend if you need a small office monitor",
				"review": "Color is not adjustable so everything is muted from email to websites. Works fine with the exception of the color being off. I will be replacing with a better monitor as I need color for some of the reports I use.\n\n5/3/22 I am editing this recommendation as the company reached out to me after my review and sent me a new monitor. This one was bought for my home office as a second screen and I had already bought a replacement since the colors/brightness was an issue for my needs however the company sent me a bigger screen that allows for color/brightness adjustments and it works wonderfully. Highly recommend if for no other reason than the company wants the customer happy."
			},
			{
				"name": "Brenda Thatcher",
				"pictureUrl": "https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif",
				"rating": "5/5",
				"reviewTitle": " Fabulous",
				"review": "Lovely piece of equipment. I don't game so I don't have that answer buy everything was in hand and it the display and sound are fabulous"
			},
			{
				"name": "Keith",
				"pictureUrl": "https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif",
				"rating": "5/5",
				"reviewTitle": " Display for the office",
				"review": "This monitor is more suitable for use as an extra monitor in the office. The 17inch and 4:3 can be better for viewing some data and reading documents/Excel. I recommend this monitor for some people who work in the office."
			},
			{
				"name": " Customer",
				"pictureUrl": "https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif",
				"rating": "5/5",
				"reviewTitle": " Good things come in small packages!",
				"review": "The packaging was smaller than I expected, but the monitor arrived intact and fully functional. I connected it up to my NVIDIA GeForce RTX 2070 & it worked perfectly. I did have to adjust my display settings to share monitors and to make my larger monitor primary (I use the 17\" for research/walkthrus). Excellent replacement for an LCD panel with pixel rot & more energy efficient!"
			},
			{
				"name": "Gary",
				"pictureUrl": "https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif",
				"rating": "5/5",
				"reviewTitle": " Great Monitor at a Great Price!",
				"review": "This monitor is perfect for what we need; which is a basically square one. The only issue I had is that we needed to remove the old screw in cable and instead use ONLY the HDMI cable. It's been a while since I bought a monitor, so only using the HDMI wasn't clear to me when I opened the box....my fault.\n\nI highly recommend this monitor!!!"
			},
			{
				"name": "Louise Hampton",
				"pictureUrl": "https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif",
				"rating": "5/5",
				"reviewTitle": " Good value for money.",
				"review": "Does a great job with good picture quality. Definitely worth the money would recommend for great for security systems, gaming and family computers."
			},
			{
				"name": "C. Rosselli",
				"pictureUrl": "https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif",
				"rating": "5/5",
				"reviewTitle": " Surprising good for the money.",
				"review": "Bought this monitor as a second monitor for my desktop. The size is what I was most interested in as I don't have room for another large monitor. This is very decent for the money. The picture if very clear and I was pleasantly surprised. Working great thus far."
			},
			{
				"name": "Cory Camallieri",
				"pictureUrl": "https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif",
				"rating": "5/5",
				"reviewTitle": " Functional Small Monitor",
				"review": "A well-designed sturdy functional small Monitor with clever touch controls for adjustment."
			}
		]
	},
	{
		"id": "dEM071bB6uano-e5ZQ1wM",
		"title": "13.3 inch Portable Monitor,KENOWA PC 16:9 Display with HDMI VGA External Screen for Computer/Laptop/Raspberry pi / PS3/PS4 Xbox,Aluminum Housing,HD Resolution 1366x768 60HZ",
		"imageUrl": "https://m.media-amazon.com/images/I/71d38ARQxpL._AC_SY450_.jpg",
		"price": "$96.99",
		"description": "About this item\nVisual enjoyment: the 13.3 inch TFT screen, 1366x768 FHD resolution, providing excellent detail, work stability, anti-jamming, the color bright saturation image and high reduction, bring you a pleasant visual enjoyment.\nA very wide range of use: has the rich input ports, including VGA, HDMI, it can be perfect for CCTV security monitors, PC monitor, raspberry PI monitors, car monitor screen, DSLR cameras, mini TV screen. Note : Connect to for apple MAC or other without HDMI interface laptop ,then ,you must to use DP-HDMI Transfer line .\nThe multilingual OSD menu can complete various Settings, such as rotating screen view.\nMonitor Interface : 1* VGA Port, 1* HDMI Port,1*DC Power Port,1* 3.5mm Audio Input, Support 75*75 mm Vesa Hole and Camera tripod hold hole .\nPortable PC Display: with VGA and HDMI video Signal transmission interface ,TFT panel; lcd monitor; FHD 1366x768 monitor,Brightness: 250cd/m, Contrast: 800:1",
		"reviews": [
			{
				"name": "Kell Innes",
				"pictureUrl": "https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif",
				"rating": "5/5",
				"reviewTitle": " Meets my needs!",
				"review": "Glad I found this portable monitor at the price point that I did. I didn’t need anything overly expensive. I’m now working 100% remote and needed a second monitor for when I travel, and this fits the bill. Easy to travel with and not too heavy. Only downside is that as others have stated, the screen is a little dark even when the brightness is turned all the way up. This hasn’t prevented me from getting work done, but it would be nice if the screen was brighter. But again, for the price paid, I’m satisfied with my purchase."
			},
			{
				"name": "Tom",
				"pictureUrl": "https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif",
				"rating": "5/5",
				"reviewTitle": " Portable monitor",
				"review": "Great with the monitor! I am a programmer. I just want to have a smaller screen delegated for my slack and meeting. This is perfect! Their support is also excellent too! I also turn this into TV in the car while traveling. One of the best products I've purchased. love it"
			},
			{
				"name": "JoDee",
				"pictureUrl": "https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif",
				"rating": "5/5",
				"reviewTitle": " A GREAT EXTRA MONITOR. GREAT PRICE. GREAT QUALITY",
				"review": "Great extra monitor. Came with instructions. Great Price. I had a question and the seller was quick to respond."
			},
			{
				"name": "KarenMike",
				"pictureUrl": "https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif",
				"rating": "5/5",
				"reviewTitle": " Wonderful second screen!",
				"review": "Wonderful second screen for my laptop while away from home."
			},
			{
				"name": "Jay",
				"pictureUrl": "https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif",
				"rating": "5/5",
				"reviewTitle": " It works very well for my security camera.",
				"review": "It is a great 13.3 inch portable monitor that is compatible with variaty of connections. It comes with HDMI, VGA and 3.5mm Audio input interface. I use it for my security camera system and it works very well."
			},
			{
				"name": "JH in MN",
				"pictureUrl": "https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif",
				"rating": "5/5",
				"reviewTitle": " Love it!",
				"review": "I purchased this for use in my work truck, so I could have a portable monitor and keyboard that I could place in front of me, but was small and light enough to set up as I moved from site to site. My laptop is on a stand by passenger seat and I was developing significant neck strain from twisting and leaning over to read screen and type. I fabricated a simple bracket that clips onto steering wheel and I set the monitor on it while working, and have the keyboard on my lap. When I'm done, the keyboard sits on the center console and I place the monitor in a sleeve on the floor in front of the console. With all the movement back and forth, I have yet to lose a connection and colors and clarity are great. Since it sits only 16 - 20\" from my face, the smaller screen size is no problem. Seems well constructed - only one small issue - wish the menu keys on back were a bit more protected as I have changed screen setting as it leaned against center of steering wheel, but I put two screws in Vesa bracket holes and that solved that issue."
			},
			{
				"name": "New golfer",
				"pictureUrl": "https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif",
				"rating": "5/5",
				"reviewTitle": " Works great",
				"review": "Easy to set up and works great."
			},
			{
				"name": "Alicia Guilloty",
				"pictureUrl": "https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif",
				"rating": "5/5",
				"reviewTitle": " Excelente para áreas pequeñas!",
				"review": "Excelente para visualizar cámaras de seguridad con una pequeña pantalla sobre el escritorio."
			},
			{
				"name": "Cortexpert",
				"pictureUrl": "https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif",
				"rating": "3/5",
				"reviewTitle": " OK monitor when powered from USB",
				"review": "Plugged in on receipt using the 12v UK adapter supplied - the monitor lit up, said hello and promptly turned off again before my Windows 10 PC could recognize it. Was about to send it back but thought to try powering from USB on my PC and then it worked fine. Micro USB cable is not supplied. I'm using it as a second monitor in portrait mode on a VSG 75x75 VESA stand. Display quality appears good. I see others also had issues using the 12v adapter but I haven't researched whether it's the adapter or the monitor that's at fault. Update: Two-months on and the monitor still works fine using USB power."
			},
			{
				"name": "Qin Yu",
				"pictureUrl": "https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif",
				"rating": "5/5",
				"reviewTitle": " Great portable monitor",
				"review": " Great portable monitor with all necessary accessories included. I bought it for working while travelling. It serves the purpose perfectly. The resolution is brilliant and color is bright for a portable monitor. I also love the protective case included. It protects the monitor well and helps it stand alone. Overall i am really happy with this purchase."
			},
			{
				"name": "\"cowboy_dan\"",
				"pictureUrl": "https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif",
				"rating": "5/5",
				"reviewTitle": " Does the job",
				"review": "Got it as a 2nd monitor that doesn't take up too much space so I could keep an eye on the football, twitch etc whilst I do something else on the main screen. It doesn't seem made for this purpose (i.e. wires in the side) but does exactly what I wanted it to do."
			},
			{
				"name": "Steven",
				"pictureUrl": "https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif",
				"rating": "1/5",
				"reviewTitle": " NEED HELP ASAP",
				"review": "My screen wont work charger is making a crazy noice am worried"
			},
			{
				"name": "Kym H",
				"pictureUrl": "https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif",
				"rating": "5/5",
				"reviewTitle": " Very High Quality Surprise - Brilliant Image and Multi-Touch",
				"review": "I am surprised at just how high quality this unit appears.\n\nA simply brilliant picture and nice feel and control over multi-touch features.\n\nAs a retired pro-photographer, will happily use this for sorting and rating digital images as it's so much easier to zoom and move around images than with a mouse.\n\nIt's working well with my Windows 11 and Windows 10 PC's, notebook and HP 2in1 touch screen notebook without the need to install drivers or apps.\n\nI only purchased this to use for easier control of instruments with my Flight Simulator Rig but quickly realized it's going to get much more use than just that.\n\nI did not think a power adapter was included for some reason but it was and the included little stand is surprisingly stable.\n\nThe HDMI cable was a tad short for me but I had an extender cable in my kit.\n\nI highly recommended this touch screen and it arrived to me in South Australia the very next morning with  Prime Delivery."
			}
		]
	},
	{
		"id": "DVslmFZ05WVBnu0fhQigl",
		"title": "11.6 Inch Small HDMI Monitor 1366x768 Small PC Monitor LCD Mini Monitor Built-in Speaker with HDMI VGA AV BNC USB Input for Computer Home Kitchen Monitor Prechen",
		"imageUrl": "https://m.media-amazon.com/images/I/61jzDsrTapL._AC_SY450_.jpg",
		"price": "$89.99",
		"description": "About this item\n{11.6 Inch Portable Monitor Small}-Prechen 11.6 Inch 1366x768 Resolution TFT LCD Monitor  Aspect ratio 16:9 Constrast 500:1. High-quality display gives you first-class visual enjoyment, make you see every frame and hear every note.\n{Multi Interface Input} -HDMI/VGA/AV/USB/BNC INPUT: With HDMI, VGA, BNC and USB interface, this HDMI monitor can connect cable box, PC, Raspberry Pi 3 2 1, Security Monitor , DVD to meet your home entertainment. Connecting your USB disk, this 11.6 inch monitor can work for office and meeting, best suitable for home and business use（Note:when the monitro connect with the vga interface，there is no volume)）\n{LCD Monitor with VESA}-2-Way Installation: The Portable monitor can be mounted on desktop by adjustable stand or mounted on the wall by the standard VESA 75 wall mount bracket (NOT Included)\n{Support VGA input} The computer model，800*640/HZ，800*600/HZ, 1024*768 HZ,1366*768 HZ,，1920*1080 HZ,， supports vertical image inversion function options to meet different angels installation mode.\n{Lifetime Warranty} We Promise Lifetime Warranty,If you have any Problem with the monitor,Please Contact us",
		"reviews": [
			{
				"name": "Alex Alexander",
				"pictureUrl": "https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif",
				"rating": "5/5",
				"reviewTitle": " 11.6\" 12 Volt Monitor with Multiple Inputs",
				"review": "TL:DR version at the bottom, if you want to skip the review.\n\nDisregard those that moan about the image quality not being perfect. This is a sub-$80 monitor (Prime Day it was $66ish) and should be reviewed as a sub-$80 monitor. It should also NOT be reviewed that its performance is lackluster when used as a DSLR/M43/etc. camera mounted monitor; this isn't an Atomos monitor - nor is it priced as such.\n\nWhat it is: an ~$80 monitor with VGA, HDMI, composite, and BNC video inputs. This would be a fantastic monitor to put in a portable IT kit, for connecting to a KVM or directly to a server/workstation for troubleshooting.\n\nMy particular use case is for a homemade luggable computer of sorts. I'm a fan of 8 bit era computers, as well as certain modern takes on that era of computers, such as the Color Maximite 1, Color Maximite 2, BASIC Engine, BASIC Engine (Orange Pi edition), et al.\n\nMy needs for this particular project were:\n1: DC input, using an external power source - so that I can easily power it via battery.\nThis input needed to be of relatively low watt draw.\n2: HDMI, VGA, and composite inputs\n3: At least standard HD resolution of 1280x720 or more\n4: The overall monitor size needs to be relatively close to a smaller keyboard. Not necessarily a 60% sized keyboard, but something close to that.\n5: $ cheap $, just in case the project doesn't work out\n\nI've machined a prototype case out of wood (somewhat similar to a Pi-Top Raspberry Pi laptop) and fitted the original BASIC Engine retro computer, BASIC Engine OPi edition, and a Color Maximite 2 inside the lower half of the luggable laptop. My power supply needs, at least for now, is a Makita LXT battery adapter mounted to the outside of the rear part of the upper laptop housing - with wires routed into the lower half and connected to two buck DC-DC converters (one set at 12V and one set for 5V). The BASIC Engine Orange Pi edition is connected to the HDMI input, the BASIC Engine original edition is connected to the composite input, and the Color Maximite 2 is connected to the VGA input. All are working flawlessly. The color reproduction is 100% acceptable for my use case.\n\nThe only negative, at least for my use case, is the tight fit of the VGA and HDMI connectors. Fortunately, I had a small HDMI male to micro-HDMI adapter that is barely larger than just the male part of a full-sized HDMI cable by itself. I connected a small gauge, coiled cable to that.\n\nTL:DR version: DO NOT BUY THIS IF YOU WANT TO EDIT VIDEOS AND PHOTOS for professional or similar purposes!!! You are not and cannot spend $80 and get what you want....you HAVE to spend much more than what this monitors costs. This monitor is the bee's knees if you want to game on the go, from 8 bit retro computers over composite all the way to the 2020 generation of high end consoles over HDMI and all sorts of devices in between. This would be a great tool to put in an IT tool kit. I most definitely recommend this!"
			},
			{
				"name": "amber",
				"pictureUrl": "https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif",
				"rating": "5/5",
				"reviewTitle": " Happy wife happy life",
				"review": "Got this monitor to watch TV in my kitchen while cooking, and couldn't not be easier to use, comes with a lot of different imputs, I used HDMI to connect  fire stick and was up an running in a minute, image quality is very clear, the sound it's okay for this little thing. I really recommend it as a extra TV, it does the job very well for a good price."
			},
			{
				"name": "Zantosa",
				"pictureUrl": "https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif",
				"rating": "5/5",
				"reviewTitle": " Does what it's supposed to do, great customer service",
				"review": "I purchased this to use as a secondary monitor for a custom computer I was building. It worked quite well for several weeks, and then seemed to be having some sort of problem with the power plug, where the external power supply plugged into the back of the monitor. It would flicker when I moved the monitor, and then would not turn back on for a few minutes. I had exceeded the  return window, so I contacted the seller, and they responded quickly, went through some basic troubleshooting, and determined it wasn't anything I was doing. Then they just asked for a shipping address, and sent me a new monitor, it arrived in a few days and is working perfectly. I think this is probably the fastest response and best response I have ever had working directly with a seller, and the replacement actually was faster than the original order. I was originally going to give this 3 stars, but the customer service and the working replacement made me want to bump it up quite a bit. It's a cheap monitor, and it may have issues, but the company will make good on it even if they don't have to. That's worth a lot."
			},
			{
				"name": "Gene Baginski",
				"pictureUrl": "https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif",
				"rating": "5/5",
				"reviewTitle": " Light weight and very portable",
				"review": "I use this as a portable spot monitor. It has the connections I need for troubleshooting CCTV issues. It is also usable as a 2nd Monitor for a Laptop for troubleshooting a laptop display."
			},
			{
				"name": "PTVEGAS",
				"pictureUrl": "https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif",
				"rating": "5/5",
				"reviewTitle": " Excellent Little monitor",
				"review": "I was pleasantly surprised as it is very bright, and very clear. I use it when a larger server needs a reboot and works great."
			},
			{
				"name": " Customer",
				"pictureUrl": "https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif",
				"rating": "5/5",
				"reviewTitle": " Great monitor for cctv",
				"review": "I read all the reviews on these little monitors and finally decided on this one. Great picture quality for a little screen, with good color also. If you are sitting this on a flat surface you will need a 90 degree hdmi cable as a straight one has trouble bending underneath it. I like that the buttons are on the back as I don't have to look at them then."
			},
			{
				"name": "Cbow",
				"pictureUrl": "https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif",
				"rating": "5/5",
				"reviewTitle": " Exellent customer support",
				"review": "Our Prechen 11.6 Inch CCTV HDMI Monitor has worked well for about 9 months, then is started getting lines, and blinking... the seller has been quick to send us a replacement at no charge.. very happy."
			},
			{
				"name": "Nana of 5",
				"pictureUrl": "https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif",
				"rating": "5/5",
				"reviewTitle": " Works",
				"review": "Works well for a screen for our grandsons retro gaming system! I think if I ever need it for a second screen for my computer it would work great too"
			},
			{
				"name": " Customer",
				"pictureUrl": "https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif",
				"rating": "5/5",
				"reviewTitle": " What I was looking for",
				"review": "Needed a small monitor for set up of my cctv. Good picture and the size I needed."
			},
			{
				"name": "Ali",
				"pictureUrl": "https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif",
				"rating": "5/5",
				"reviewTitle": " It Works good",
				"review": "It's good for its value, this is worth it for100$\n\nNot the greatest but does the job."
			},
			{
				"name": " Customer",
				"pictureUrl": "https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif",
				"rating": "3/5",
				"reviewTitle": " ---good budget deal",
				"review": "extra tv in my kitchen so i dont miss any TDs"
			},
			{
				"name": "steve just",
				"pictureUrl": "https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif",
				"rating": "5/5",
				"reviewTitle": " Great item",
				"review": "Works great"
			},
			{
				"name": "Rosa Robins",
				"pictureUrl": "https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif",
				"rating": "5/5",
				"reviewTitle": " As described and fast delivery",
				"review": "This item is exactly what I needed. Arrived well packaged and ahead of time. Thank you"
			}
		]
	}
]
