{
  "mensJackets": [
    {
      "id": "fGLPV-T",
      "title": "Columbia Men's Steens Mountain 2.0 Full Zip Fleece Jacket",
      "price": "$22.52",
      "image": "https://m.media-amazon.com/images/I/619D3Y5MfrL._AC_UX342_.jpg",
      "description": "The next generation of a Columbia classic, this outdoor staple features a finely tuned fit and a soft-yet-rugged filament-fleece fabrication to keep you warm when temperatures plummet.",
      "reviews": {
        "customerProfileNames": [
          "SupYo77",
          "Triplehammer",
          "Inna",
          "WilliamGainey",
          "Atechnogeek",
          "Spacetime",
          "G.Seaton",
          "Amazoncustomer"
        ],
        "customerProfilePictures": [
          "https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif",
          "https://images-na.ssl-images-amazon.com/images/S/amazon-avatars-global/25204d49-81a5-4a31-9f2b-2c88ce20b622._CR0,0,488,488_SX48_.jpg",
          "https://images-na.ssl-images-amazon.com/images/S/amazon-avatars/default._CR0,0,1024,1024_SX48_.png"
        ],
        "customerRatings": [
          "5.0 out of 5 stars",
          "4.0 out of 5 stars",
          "5.0 out of 5 stars",
          "2.0 out of 5 stars",
          "2.0 out of 5 stars",
          "5.0 out of 5 stars",
          "4.0 out of 5 stars",
          "5.0 out of 5 stars"
        ],
        "customerReviewTitles": [
          "Great quality, looser, relaxed fit",
          "Came with free OpsTechIT logo",
          "Looks great, the price was great, doubt it’s real Columbia.",
          "Fits a few sizes smaller than listed.",
          "Felt, not fleece",
          "Very nice",
          "2XL/Tall fits well for 6'5\" 280 lbs broad shoulders",
          "Soft and comfy, perfect fleece jacket!"
        ],
        "customerReviewBodies": [
          "I just tried it on and really like it. Great quality. The collar can be zipped up or it can lay flat like a traditional jacket. The large size fits me great. I like the strong and thick elastic near the wrists. (The sleeves don't just hang.) It's a little loose in the chest and arms, but that's fine with me, as I like a more relaxed fit. The two interior pockets are pretty loose, but are deep and would hold a lot.\n\nTo give a better idea of the fit, I'm 6'3\" and 185-190 lbs. So, tall and skinny with long legs. If the length of the torso material was any shorter, I'd search for a size large tall. I hope this helps someone :-)",
          "W",
          "I ordered this for my boyfriend. I ordered a large. First of all, I was so pleased because it arrived the next day after I ordered it. It was supposed to arrive tomorrow or on Saturday, but it just arrived a few minutes ago. He has not tried it on yet, he will in a bit, but I can already tell the large will be a bit roomier on him. He has really long arms so my concern is whether this will cover his arms. If the body fits well, usually the sleeves are a few inches too short. He does typically wear Large. The stitching looks fine, don’t see anything wrong with it. I do agree that the material is not actually fleece, it’s fleece-like. Feels thin but warm. Isn’t super fluffy, which is fine. My order says made in Bangladesh, which the reviews keep saying is the better quality zip-up in comparison to the ones that say made in China.\n\nIf I don’t forget, I will update the review once he wears it a few times and once it’s washed to see how it holds up. But so far, other than it being fleece-like, it looks great for the price.\n\nI don’t know if it’s real Columbia though. I typically wear north face fleeces so I don’t even know what Columbia’s fleeces feel like. I doubt it’s the real thing.\n\nUPDATE 12.29.18: it fits him well, it’s very warm. He wears it almost every day when it’s colder outside. Has been washed a few times, still looks fantastic. Did lose the shiny new look after being washed, but it still does the job. We ended up buying the same one except black at TJMaxx for his brother for Christmas. Sometimes I wear it myself because it’s big and cozy; perfect for chilly days or lazy mornings.",
          "Shiping was fast due to Prime and the item was true color, but not true to size. I am extremely disapointed with this fleece jacket. I normally wear a 3XL or 4XL and i know fleece jackets can fit tight sometimes so i wanted one I could be comfortable i , one with some extra room. So I ordered a 5XL....nope this thing fits lile its a 3XL, the sizing is wayyyy off. I look like an overstuffed chimichanga.",
          "While the cut and stitching are good, the fabric is not really fleece, but rather a kind of felt: \"A cloth or stuff made of matted fibers... fulled or wrought into a compact substance by rolling and pressure ... without spinning or weaving.\" The inside fibers are loose, not firmly attached: I can pinch them into a clump with my fingers. I attach photos comparing this coat with my 10 year old Columbia fleece. I wondered if this is one of the counterfeits people mentioned. This review describes the fabric, with a photo of the interior that looks like what I received: \"The inner face of the fabric has a felt-like feel that’s very soft and the outside is a low-pile shaggy fleece (think Mountain Hardwear Monkey Man, but less shaggy). ... After a couple weeks of wear and two nights on the trail, the Steens Mountain is still in great shape, even with me: a notorious spiller and snagger.\" Perhaps it is actually o.k.?",
          "Quality garment especially for the price. Happy with my purchase. I'm 6'0 155 lbs and the M was tight but acceptable, and the L fit a tiny bit loose but I preferred the L in the end. Perhaps that info can help someone",
          "I got black but the black is a sort of matte black (dark, dark graphite).\n\nAfter reading some of the reviews, I decided to order the 2XL/Tall instead of my normal 3XL/Tall and it's a good fit.\n\nI'm 6'5\", 280 lbs, with broad shoulders and carry a bit of weight in the belt, but the 2XL/Tall fits well without being too tight.\n\nThe Steens jacket isn't the warmest or the best but I got it to throw on, look good, and knock the chill off 40F+ and it works well.",
          "I’m a female, 5’7” usually wear a size small in women’s clothing. I purchased this jacket in men’s because I wanted some extra length and room, I do wish it came in a men’s XS because that would have been perfect but the small fits as expected! Unbelievably soft and cozy, it’ll be amazing for lounging around or to wear outdoors in the spring/fall, and can easily be paired with another jacket for extra warmth if needed. I will say I’m a little annoyed that the label is a darker gray color, in the photo it was the same light gray as the jacket and didn’t stand out as much, but oh well! Overall I love it and would recommend it to anyone!!",
          "This fleece isn't that thick at all, it would be a good base layer to put under a larger fleece or coat. Be aware if you are looking to purchase the black, as I'd say the black is more navy and the grey is no where near as dark as the photo it is a much lighter grey.",
          "Probably the best fleece I have owned. Warm, soft and extremely comfortable. Great on its own when there’s a bit of a chill or as a soft layer underneath a waterproof coat for when it’s cold/wet.",
          "Hubby really loves this fleece. It fits true to size, is a nice slightly longer length with a good long sleeves. Very lightweight but suprisingly warm, it keeps out the wind chill. Nice deep pockets 5*",
          "Nice looking would recommend and came before the time that was given.",
          "Very warm and comfortable. I would recommend for autumn/winter season."
        ]
      }
    },
    {
      "id": "50VPfTD",
      "title": "TACVASEN Men's Jackets-Windproof Bomber Jacket Full Zip Winter Warm Padded Coats Outwear",
      "price": "$45.98",
      "image": "https://m.media-amazon.com/images/I/610DOILk1jL._AC_UX385_.jpg",
      "description": "Polyester\nSpandex lining\nZipper closure\nThe zipper head is on the left. Stylish stand-up collar design and full zip up.\nCOMFORT FIT: Ribbing on collar, cuffs, and hem for a snug fit.\nMULTI POCKETS: 2 front slash zipper pockets, 1 pencil pocket on the left sleeve and 1 interior pockets on the chest.\nLINING DESIGN: Conspicuous orange polyester lining, warm and fashion.\nOCCASION: Classic design jackets for spring, fall and cold winter, perfect for casual wear, business, dates and parties or outdoor activities like hiking, picnicking, jogging, cycling, golf, traveling and so on.",
      "reviews": {
        "customerProfileNames": [
          "JohnM.",
          "RManz",
          "IrelandRhyce",
          "S.N.",
          "PW",
          "SharronCrandell",
          "Christiaan",
          "TaeKyunKim"
        ],
        "customerProfilePictures": [
          "https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif",
          "https://images-na.ssl-images-amazon.com/images/S/amazon-avatars-global/6a2a2bcf-6ec7-4296-a1ba-29d191a60176._CR0,0,1000,1000_SX48_.jpg",
          "https://images-eu.ssl-images-amazon.com/images/S/amazon-avatars-global/default._CR0,0,1024,1024_SX48_.png"
        ],
        "customerRatings": [
          "5.0 out of 5 stars",
          "1.0 out of 5 stars",
          "5.0 out of 5 stars",
          "5.0 out of 5 stars",
          "5.0 out of 5 stars",
          "5.0 out of 5 stars",
          "5.0 out of 5 stars",
          "5.0 out of 5 stars"
        ],
        "customerReviewTitles": [
          "Nice Coat",
          "Clearly A Womans Jacket ... not a mans jacket",
          "Looking to replace your old school, SKA days, Flight jacket?",
          "Taking it back",
          "good lightweight jacket",
          "-:¦:-•:*'\"*:•.-:¦:-•* FABULOUS * -:¦:- * HIGHLY RECOMMEND -:¦:-•:*'\"*:•.-:¦:-",
          "Great jacket!!",
          "I tried to look like Ryan Reynolds from 6Underground..."
        ],
        "customerReviewBodies": [
          "This is a nice medium duty coat. It's well made and the fit is good (lg. size). One thing, the zipper is backward on the jacket I received, no biggie, noone notices. I know someone will say it's a ladies jacket because of the zipper, nope, definitely men's size and cut. I really like this coat and wear it for outside chores. One last thing, the \"warm padding\" is exactly as advertised, for a light jacket, the padding keeps you warm in windy, chilly, weather",
          "Zipper is located on the wrong side for a man in addition to the smaller sizes. Jacket must have been made OUTSIDE of the United States … Extra Large Should Have Been Labeled Small (US)",
          "Look no more! I looked high and low for a bomber/flight jacket similar to the ones I wore back in the days. This is as close as it gets! Im sooooooooooo frikken excited! I bought the Black and the Green. Next I’m buying the maroon and maybe the grey. Got my Doc’s on and I’m ready!\nFit as expected. I got XL because I didn’t want to be tight. If a female is looking at these, order a size up if you don’t want it tight, and a size down if you do. The sleeves are a perfect fit, but some may think they aren’t long enough. So perfect! First try! Yea!!!",
          "The jacket’s warm enough and I like the style, but then a friend made fun of me because bomber jackets historically ya e been associated with some alt-right groups. I was gonna return the coat, but I like it, and so I’m taking the style back to us. The tolerant and artistic! I just put a “be kind please rewind” video store sticker button on it.",
          "This is a well made light weight jacket for the price range. It is made overseas, so I ordered 1 size up from my usual size and it fit perfectly. The zipper is on the left, which is a bit odd, since I'm used to it being on the right, but it's not a big deal. I don't think it's suited for rough activities, but it should last a long time under normal circumstances.",
          "Great jacket - will probably buy another one in another color. I am allowed to wear jeans to work so this is perfect. I got an XL and really should have gotten a L but with sweaters underneath it should be fine. The next one I order will be smaller. Highly recommend!!!!",
          "I love this jacket. I cannot believe how affordable this jacket is for the quality. It's just an excellent piece of clothing that does the job of keeping me warm during cold California winter days and makes me look great. Now I have to keep my young adult sons from \"borrowing\" it!!",
          "...but I realized I am too ugly, short, and fat. I don't have the charm either.\n\nBut it's a great jacket!!! Very affordable, keeps me warm, and very lightweight. The inner liner is great as it keeps the moisture within the jacket. It's a very good daily jacket that I can swap for the daily hoodie during windy days.",
          "I thought it would be much thicker. But it's really flimsy. Not suitable for winter at all. The size is good. I'm 6.2 and ordered an XL.\nI also have a real Alpha Industries genuine bomber jacket and it's 10x thicker than this one. Also the green is not like on the picture advertised.\nOH well, I'll wear it in the spring and fall.",
          "As first sight, it looked a well made wind breaker but details and quality don't match what they shown.\nJoint of elastic waistband and main body is single, not doubled stitches like their photo shown. Inside pocket is the same (single stitch). Zipper is cheap looking and not even close to what they showed on the photos. Pencil pocket is made with single layer of fabric with no thicken edge. If you use this, soon the fabric will be torn.\nSomeone mentioned that inside smells like old insulation. I agree. It has old hay like smell. I'm not sure if the smell goes away eventually. You need to order one size bigger than what you normally buy.\nWhat they showed as good features/quality are not there. You should check your jacket very closely if you bought one. The price is reasonable but YOU WILL NOT GET WHAT YOU SAW ON THEIR AD.",
          "My jacket order was fast. Ordered on Sunday, received on Wednesday. Colour (navy) and quality as advertised. It;s not a puffy coat and it's not real thin. Somewhere in between. Size chart and sizing is accurate. I'm 5' 10, 210 lbs (size 46 suit jacket), I ordered an XL and it's great. My son is 5' 11\", 175 and the XL is not too big but L would be perfect. Zipper was a LITTLE wonky like others have mentioned in their reviews. All in all, very satisfied.",
          "I like the material and model of this jacket. Tend to get puffed up a bit since there are air pocket in the insulation. Nothing major but this jacket won't drop super straight on you. Giving only 4 stars because middle zipper is a bit hard to start and there were a couple of loose threads of fabric I had to remove here and there. All seems ok but was not expecting to do this with a 50$ jacket. The size chart was missing to ended up ordering a Medium and a Large. I am 5'10'' and weight 180 lbs. Large was perfect for me. I am super satisfied of the look of the jacket.",
          "T"
        ]
      }
    },
    {
      "id": "KtHknPD",
      "title": "TBMPOY Men's Windproof Bomber Jackets Lightweight Running Windbreaker Outdoor Golf Fashion Coat",
      "price": "$35.99",
      "image": "https://m.media-amazon.com/images/I/61aK5WXwBCL._AC_UX342_.jpg",
      "description": "100% Polyester\nMaterial: high-quality breathable Polyester shell\nLightweight and windproof fabric provides excellent protection against wind and sun\nDesigned with high collar and full-zip front, which makes it more well-fitting\n2 big hand pockets, 1 zippered pocket and one cargo pocket on sleeve, 1 zipper inner poakct\nTBMPOY Mens Windbreaker Jaclets Ideal for all outdoor & indoor activiyies: Runningm, Hiking, Camping, Traveling, Fishing, even daily wear",
      "reviews": {
        "customerProfileNames": [
          "TheMatt",
          "SalAuriemma",
          "Customer",
          "JuanMorales",
          "lnguyen",
          "TLSmith",
          "R.E.Miller",
          "JOHNFKROL"
        ],
        "customerProfilePictures": [
          "https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif"
        ],
        "customerRatings": [
          "4.0 out of 5 stars",
          "5.0 out of 5 stars",
          "5.0 out of 5 stars",
          "5.0 out of 5 stars",
          "5.0 out of 5 stars",
          "5.0 out of 5 stars",
          "5.0 out of 5 stars",
          "5.0 out of 5 stars"
        ],
        "customerReviewTitles": [
          "Nice Jacket But...",
          "The New “Members Only” jacket",
          "Husband likes color and comfort",
          "Really nice jacket",
          "Very satisfied",
          "This jacket is perfect for someone that is short in the torso",
          "Comfortable Light Jacket",
          "Nicer than I thought it would be"
        ],
        "customerReviewBodies": [
          "T",
          "Fits just right. Reminds me of the old “members only” jackets from back in the day. Can’t beat the price. I was looking for something to wear when the weather is wet!! This seems to do the trick.",
          "My husband really likes his jackets. But he has long arms so the sleeves come above his wrists. He used to that issue.",
          "This jacket is exactly as discribed. Bought for hubby for xmas and it was just what he wanted. Great value for the price.",
          "I like the jacket because it’s thin enough to be worn in chilly but. It so chilly weather. I got a size medium. It is roomy enough that I can wear a sweater underneath. I read somewhere that I can remove the arm pocket by undoing the stitching. I better not try and end up ruining the jacket.",
          "At 5’8” most costs are too long on me, this jacket fits perfect. I like the light weight while also keeps me warm in that 40-50 degree weather. Upon arriving I opened that package and put the jacket in the dryer for 10 minutes to knock the wrinkles out and was ready to go. Great value!",
          "This is an excellent product at a very reasonable price. It is just a little tight across the shoulders for me. I'm a golfer and would hesitate to wear this jacket on the course because it might inhibit my swing. For all other occasions it is fitting and excellent. It has a nice slick appearance. I suspect it is waterproof though I have not yet had occasion to test it in the rain. Overall, I am very pleased.",
          "I do not have the longest torso and I have short arms. Given that, a lot depends on the sleeve cuffs and waist band. The cuffs and band work nicely. Nothing puffs out and nothing binds too much. I do not think I shall be using all those pockets though when I golf. Walking around, yes. The surface of the jacket is nice and soft and looks pretty water repellant. The lining helps the coat slide on. I wondered about the neck when swinging. I shouldn't have, it is perfectly comfortable. There hasn't been much sun, but I have been comfortable wearing it near 70 degrees and down to the high 40s.",
          "Buena calidad y precio económico. Excelente servicio!!",
          "",
          "Esta muy bien pero creo que si le falta algo que mejorar",
          ""
        ]
      }
    },
    {
      "id": "_iZH481",
      "title": "Columbia Men's Watertight Ii Jacket",
      "price": "$25.96",
      "image": "https://m.media-amazon.com/images/I/6142UY8xXeS._AC_UX342_.jpg",
      "description": "Top-notch rain protection — this waterproof-breathable, fully seam-sealed jacket will keep you nice and dry, even in the heaviest of rains. An essential waterproof jacket that packs versatile protection in a variety of stylish color options. What’s more, it's lined with a fine mesh lining for extra comfort in dreary weather. This lightweight jacket is so comfortable, it acts as an everyday insulated windbreaker and rain jacket. It features an adjustable hood, zippered hand pockets, a drawcord adjustable hem. You'll be comfortable and dry in this off-weather coat. Offered in several stylish colors and sizes. Available in extended sizing. Regular Fit. To ensure the size you choose is right, utilize our sizing chart and the following measurement instructions: For the sleeves, start at the center back of your neck and measure across the shoulder and down to the sleeve. If you come up with a partial number, round up to the next even number. For the chest, measure at the fullest part of the chest, under the armpits and over the shoulder blades, keeping the tape measure firm and level.",
      "reviews": {
        "customerProfileNames": [
          "Customer",
          "Customer",
          "M.Tomas",
          "RaymondLarose",
          "Mel",
          "Josh",
          "AdamHu",
          "KindleCustomer"
        ],
        "customerProfilePictures": [
          "https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif"
        ],
        "customerRatings": [
          "1.0 out of 5 stars",
          "1.0 out of 5 stars",
          "5.0 out of 5 stars",
          "5.0 out of 5 stars",
          "5.0 out of 5 stars",
          "5.0 out of 5 stars",
          "5.0 out of 5 stars"
        ],
        "customerReviewTitles": [
          "Fake Jacket",
          "Columbia or couldn't verify counterfeit",
          "Nicely Made (and a word for you if you're on the L/XL line)",
          "Great jacket!!",
          "Incrediblé jacket",
          "More Than a Rain Jacket",
          "It's waterproof and keeps the wind out while being lightweight."
        ],
        "customerReviewBodies": [
          "The jacket I received is a fake. I also ordered a tall to compared the lengths. See pictures. The tall jacket is on the left off the 1st 3 pics and the bottom on the last. The fake jacket does not have Columbia embroidered, it is a sticker of some sort. Also the tag on the inside is different as with the \"Omni-tech\" on the sleeve. The fake jacket does not have \"Packable\" on the inside of the pocket. The jacket appears nice and I would have not questioned its authenticity if I didn't have the tall jacket to compare. I am returning it.",
          "B",
          "I am on the border of large and x-large with most my clothes (36\" give or take waist). From other reviews, I read it's a little big, so decided to size down and went for the large. It fits nice with a t-shirt underneath, but not a lot of extra room for my... ugh... expanded mid section. With a fleece mid-layer, it's a bit snug me. So if you're right on that L/XL line in most your clothing due to an over-indulgence in yummy trail treats and plan to wear over thicker clothing, I'd go with the XL. But if you plan to be using it as a summer raincoat over just a tee for hiking and so on (that's my plan with it), then I'd go with the L. It's really that fine of a line for me.",
          "My husband loves this jacket. It is actually waterproof. My husband mountain bikes as a hobby and he volunteers to build the trails. Rainy days are the best trail building days and he said this jacket kept him completely dry while he was working in the rain for hours. On sizing if you are barely a large size down to a medium. The large runs big. My husband is 5'10\" 170lbs and medium fits him perfect. The large fit my brother inlaw perfectly and he is 6' 220lbs for reference.",
          "Had this jacket for about a month now and all I can say is it's awesome! Perfect for rain and a pretty damn good wind breaker as well. I can't say it's completely waterproof because I haven't been in a monsoon rainstorm but it's kept me dry for every other rain storm. Also it packs up so if you don't need it right now but maybe later for like a camping trip or something you can pull it out and put it on.\n\nInstructions: the left pocket has a label inside that says \"packable\" turn that guy inside out and stuff the rest of the jacket on in there.\n\nAbout the size of a normal picture 6\"x4\" and the width of maybe 3-4\" probably depends on how well you stuff it in there. Hope this helps!",
          "A Review of the Columbia Men’s Watertight Rain Jacket\n\nThe Columbia Men’s Watertight Rain Jacket is a lightweight waterproof jacket with a slim design. As the name suggests, the jacket is very much capable of keeping you dry on a rainy day; however, its value goes way beyond a rain coat. Here are several features that make this jacket a wonderful addition to your wardrobe.\n\nWaterproof and Windproof\nThis jacket is truly waterproof. It helps you stay clean and dry even in the pouring rain. With the waterproof technology comes the wonderful stain repellent feature. No matter how dirty the jacket gets during a rainy day, a simple wipe is enough to take care of it. The windproof feature provides an extra protection against the cold. Meanwhile, the fabric is still breathable that it allows moisture vapor to move away from the skin. The only downside is that the waterproof feature can post difficulty when it comes to washing this jacket. You may find a pouch of water when you take it out of the washer. An extra cycle of drying will take care of the issue if this ever occurs.\n\nDesign\nThis jacket is lined with a soft layer of mesh and is very light weight. The longer arm length and body length provide enough coverage to keep you dry no matter how hard the wind is blowing. The hood comes out far enough forward to shield your face while the drawstring helps keep the hood on even in strong wind. Two front pockets with zipper are big enough to protect a phone, a wallet, a set of keys, and even a pair of gloves from getting rained on. The slim design delivers a more modern look than its competitors, helping you keep the style even on an awfully crummy day. Meanwhile, the jacket is still generous with space around your chest so that you always have enough room for a sweater or a hoodie or even a coat. Another notable feature is that the entire jacket can be packed into the front left pocket, which comes with a double-sided zipper.\n\nVersatility\nFew jackets are as versatile as this one. The waterproof and windproof features make this jacket practically perfect for a fishing trip. The breathable fabric makes sure that you can throw this jacket over your favorite tee on a rainy day in the middle of the summer. You can also layer up under this jacket for fall or winter use. The matt finish and the slick look ensure that no one knows you are using a rain jacket as a spring/fall windbreaker. You can also use this jacket to protect your pea coat from getting wet on a snow day.\n\nOverall, the Columbia Men’s Watertight Rain Jacket is a high quality jacket that can be worn in many occasions. It surely has room for improvements. But for the price you are paying, you can hardly find a better deal than this.",
          "I bought this jacket for my husband who is 5'10' and about 200 lbs. It's a bit roomy as I wanted him to be able to fit a fleece jacket under it when needed. It is loose enough without being baggy to look good with or without the fleece. He's worn it a bit likes the feel and says it keeps the wind out. It finally rained to test out the waterproof part - it's waterproof all right! We stood out in the rain about 4 hrs, some of it was drizzle, most a steady rain. His shirt was dry when he took the jacket off. His only wish was the hood was a bit stiffer at the top. He said it kind of plastered around his head instead of creating a hood that stood out a bit. His solution is to get a baseball hat and that will keep the rain off his face. I would buy it again for sure!",
          "Very smart jacket, very waterproof, nice lining, so close to being perfect. Unfortunately it isn't very breathable and it doesn't have pit zips so you end up getting very damp and sweaty, as a waterproof jackets job is to keep you dry I find it to be counter productive. If you were doing a low intensity stroll (around the shops or walking with young children) then it is perfectly fine. I have kept it as a backup jacket.\nThe Columbia evaPOURation jacket is far better than the Watertight II as it is breathable and has pit zips, but it does lack the comfortable mesh lining.",
          "This is not the proper Columbia jacket. Despite the images showing it should be..\n\nThe logos on the chest and arms are cheap prints and not the correct styling. The hood is twice the size it should be and the general fit is way off.",
          "Bought as a gift, recipient delighted with fit and performance has been tested to the max in the recent inclement weather conditions, would def recommend.",
          "Questioning whether I got a fake? Seems to fit smaller Than most reviews seemed to suggest.\nLogo and tag seem a bit off (vinyl appliqué for the logo instead of embroidery and tag at the collar instead of sewed to the back of the jacket) and the arms are suuuper long.\nIf this is a real one, kinda disappointed with the quality NGL\nWill be returning it.",
          "Wore this for first time during a constant but not torrential rain fall\nAfter a few hours I could feel my shirt getting wet around my torso\nI sit on a lawnmower for hours and the rain pools in the folds of the coat\nWithin hours I was soaked from below my chest to my knees\nI also purchased Columbia rain pants and they too are not waterproof\nProbably fine if your standing and water can run off but not good for what I need ."
        ]
      }
    },
    {
      "id": "GMbGseM",
      "title": "Weatherproof Ultra Tech Mens Jacket Winter Coat for Men Winter Coat Rain Jacket for Men with Fleece Bib and Removable Hood",
      "price": "$49.99",
      "image": "https://m.media-amazon.com/images/I/51CfkZOFF8L._AC_UX385_.jpg",
      "description": "100% Polyester\nZipper closure\nMachine Wash\n✔️ DURABLE QUALITY FABRIC - The lightweight soft shell of this mens winter coats exterior is water and wind resistant protecting you from the elements. Water is repelled from its removable hood across its body making it a great mens rain jacket as well.\n✔️ VERY WARM & LIGHTWEIGHT - The perfect winter jacket for men. This casual fall jacket rests lightly on your body while insulating you to keep you nice and warm all season long. Includes an attached additional zipped bib for added warmth in addition to its quilted insulation fill.\n✔️ GREAT FIT & COMFORTABLE - This mens winter jackets is roomy, but gives off a slim looking shape to maximize comfort and sleek style. The shell fabric even has a little stretch for added movement for outdoor activities. A great running jacket that you can also use to ski, snowboard, hunt, go camping or wear hiking in the snow.\n✔️ FEATURES - This mens jacket features a total of four handy pockets. Two zip secured pockets at the front sides, one at the upper left chest and another on the interior. The fleece lined hood is removable via zipper and is adjustable using adjustable draw chords. Velcro tabs at the cuffs give added protection against the wind and rain.\n✔️ EASY CARE : Fully machine washable.",
      "reviews": {
        "customerProfileNames": [
          "J.Allen",
          "KSegovia",
          "JBMcInnes",
          "RB",
          "JoyceM.",
          "JohnLaGuardia",
          "Barbara",
          "ChristaPhillips"
        ],
        "customerProfilePictures": [
          "https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif"
        ],
        "customerRatings": [
          "5.0 out of 5 stars",
          "5.0 out of 5 stars",
          "4.0 out of 5 stars",
          "5.0 out of 5 stars",
          "5.0 out of 5 stars",
          "5.0 out of 5 stars",
          "2.0 out of 5 stars",
          "5.0 out of 5 stars"
        ],
        "customerReviewTitles": [
          "Works great",
          "Jacket is well made and very comfortable.",
          "Warm waterproof jacket",
          "Perfect weight coat.",
          "Bought for a Seattle trip",
          "Comfort",
          "Very small and not warm enough for a cold climate.",
          "great buy"
        ],
        "customerReviewBodies": [
          "I got this to handle cold days in Portland and to replace my other coat that isn't as warm and it fits well and keeps me warm. Not sure I understand having two sets of zippers but outside of that, I like it.",
          "I like how the jacket fit. I like it because it is well made. I've worn about 10 times because in north Texas it doesn't get and hasn't been very cold yet. I really like the material the pockets are lined with because it's very soft and warm, but I hope that softness does not translate into holes later on. For that reason, I keep my keys in my pockets and use the pocket strictly for my hands. The lining is just the right amount and the weight of the jacket is very warm and comfortable. This is my new favorite winter jacket/coat. I also like the navy blue and the zipper pocket on the sleeve for the cigarette box full of cigarettes that I don't smoke. I know I will use that pocket for something sooner or later.",
          "I bought this jacket to take with me on a cruise and vacation to Alaska. The jacket proved to be a gods send. It was warm and waterproof and represented great value for the money",
          "Great purchase",
          "Bought this for my son for a Christmas trip to Seattle. The coat was great for the weather, wind and water resistant, and warm too. Not what I would call a heavy winter coat for places where it is really cold, but was great for our trip.",
          "Great comfort, warmth and waterproof. A solid reliable jacket.",
          "Made for a small male. 3X is equal to a female's large. The coat is surprisingly well sewn. It looks good BUT . . . it is very bulky yet not warm enough for a cold climate. It's ok for a southern California winter, 35-40 degrees and it is waterproof.\n\nI was hoping it would be roomy and oversized. Not at all. I bought 2 sizes bigger and still tight in the arms and hips.\n\nIt is sized for somebody thin with no hips, no stomach, no arm muscles.",
          "I love this jacket - I got one years ago at Costco, same ran, same style - except the old one has more pockets and is a little bigger in fit. But I am happy. Its great for a Montana winter.",
          "I would easily give this product 5 stars because it is a great fitting functional jacket and is warmer than you would expect...great jacket for the price. However, this one arrived with the inside pocket ripped, so I will have to fix that before I can use it as that is a feature I like to have in a jacket. It's not something I will return the jacket for, but disappointed that it wasn't checked before shipped."
        ]
      }
    },
    {
      "id": "vbnoTc4",
      "title": "TRAILSIDE SUPPLY CO. Mens Windbreaker Jackets Lightweight Packable Jacket,Windproof and Dustproof",
      "price": "$29.99",
      "image": "https://m.media-amazon.com/images/I/91z30XVHRwL._AC_UX342_.jpg",
      "description": "Polyester/Nylon Shell\n100% Machine washable\nFront-Zip up closure\nEASY TO CARRY: the jacket rolls or folds up for storage easy enough requiring very little space for the same.This is one that you should keep in your car or backpack.\nSECURITY ZIPPER POCKETS:offers convenient safe places to stash your essentials.\nMORE FEATURES:the jacket has adjustable hook-and-loop cuffs,and add inner mesh pocket.\nGreat with jeans, shorts, sweatpants, back to school, rain or snow gear, skate attire, surfing apparel. This lightweight coat is great as a last layer to keep dry or easily allows you to layer for warmth with a relaxed look.\nIdea for running, hunting, fishing, camping, hiking,travelling,cycling, work, gym, golfing, walking, outdoor activities, skating, soccer, softball, beach, sports practice. Great for summer, breezy spring, early fall, warm weather, windy weather.",
      "reviews": {
        "customerProfileNames": [
          "CarlL.Anderson",
          "djl",
          "TomH.Powers",
          "george",
          "M.Hill",
          "Customer",
          "CaptainOrinda",
          "RobertBlake"
        ],
        "customerProfilePictures": [
          "https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif",
          "https://images-na.ssl-images-amazon.com/images/S/amazon-avatars-global/21p09fW70eL._CR0,0,87,87_UX110_.gif"
        ],
        "customerRatings": [
          "5.0 out of 5 stars",
          "5.0 out of 5 stars",
          "5.0 out of 5 stars",
          "5.0 out of 5 stars",
          "5.0 out of 5 stars",
          "4.0 out of 5 stars",
          "5.0 out of 5 stars",
          "5.0 out of 5 stars"
        ],
        "customerReviewTitles": [
          "Excellent Product at a GREAT price !",
          "Very Good Winbreaker",
          "Great windbreaker.",
          "Great buy!",
          "Trailside Men's Water Repellent Windbreaker Jacket",
          "Gray Jacket is Black",
          "Nice inexpensive windbreaker",
          "Great lightweight jacket"
        ],
        "customerReviewBodies": [
          "I'm a big guy, XL is usually my size but in today's market some XL's are not really XL. This is true to size, I have much wider shoulders than waist so I was happy to see it fit great in the shoulders and was very comfortable and roomy elsewhere. I love it...and for the price, compared to what \"brand\" name sellers are asking...this is amazing...I am going to get another, I bought the Black one. Very happy.",
          "I was wanting a light weight windbreaker and this product is exactly what I was looking for. Nice & light, good quality and a good fit.",
          "A good fit and just the right weight",
          "Light weight and packable",
          "Handsome and extremely lightweight this windbreaker jacket has a 100 percent nylon shell and 100 percent polyester partial mesh lining. The jacket is constructed well with finished seams so and excellent top stitching so it has a quality appearance and should add to longevity.\n\nIt is perfect to transport when traveling, hiking or attending a sporting event because it weighs almost nothing and takes up very little space. Although not heavy it is good to use to add a layer if the temperature drops. Note it has no hood.\n\nThe cuffs have an elastic casing and hook and loop (Velcro) adjustment for a close fit to help keep out moisture and the full-length nylon zipper also has a tab at the top of the 3 1/2 inch stand-up collar to also prevent moisture intrusion.\n\nThe large size jacket fits the in-house male exactly as expected (his usual size). It is 27 inches in length and the sleeve length measured from center back of neck is 34 inches. The chest circumference is 48 inches measured from underarm seam all the way around.\n\nThe jacket has three vertically zippered pockets on the front—one on the left front chest and two at each side of the waist. The chest pocket has a 6 1/2 inch opening and is 7 inches deep. The other two pockets have a 6 inch opening and are 7 inches deep. All the zippers have long pull tabs so they are easy to locate and operate.\n\nOn the inside are two open pockets situated on top of the two side pockets. It is notable that the pockets are all created with a thin mesh fabric which may not be capable of holding anything too heavy. Gloves, hat and/or scarf, sure. There is a white screened logo of mountain profiles on the left upper chest which while noticeable is reasonably discrete and attractive—helping to add interest to the solid navy color.\n\nFabric care instructions are machine wash cold, do not bleach or use fabric softener (standard for water repellent treated fabric), tumble dry low heat and may use a low heat iron if needed. Do not dry clean. Basic lightweight, well-made jacket. Excellent.",
          "Just an FYI - if you order the gray windbreaker, it's not a gray color its black.\ni ordered the gray one and returned it because it was black.\nAfter receiving the second one it was also black, so I gave up and just kept it\nWith that being said - it is a very nice jacket",
          "Perfect for traveling.",
          "Wads up to fit in my hip pocket - very nice if you want a very lightweight windbreaker - fit was great for 3x"
        ]
      }
    },
    {
      "id": "MkdeVbu",
      "title": "Essentials Men's Lightweight Water-Resistant Packable Hooded Puffer Jacket",
      "price": "$7.87",
      "image": "https://m.media-amazon.com/images/I/81TnIAEZoBS._AC_UX342_.jpg",
      "description": "Essentials is focused on creating affordable, high-quality, and long-lasting everyday clothing you can rely on. Our line of men’s must-haves includes polo shirts, chino pants, classic-fit shorts, casual button-downs, and crew-neck tees. Our consistent sizing takes the guesswork out of shopping, and each piece is put to the test to maintain the highest standards in quality and comfort.",
      "reviews": {
        "customerProfileNames": [
          "Tyler",
          "BillMc",
          "EveryDayIsMyBirthday",
          "MidwestShopper",
          "H.Auerbach",
          "phil",
          "pokerplayer21",
          "KindleCustomer"
        ],
        "customerProfilePictures": [
          "https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif"
        ],
        "customerRatings": [
          "5.0 out of 5 stars",
          "5.0 out of 5 stars",
          "4.0 out of 5 stars",
          "5.0 out of 5 stars",
          "5.0 out of 5 stars",
          "5.0 out of 5 stars",
          "5.0 out of 5 stars",
          "4.0 out of 5 stars"
        ],
        "customerReviewTitles": [
          "This thing is sick",
          "Temporary replacement turns into permanent everyday wear",
          "A Hooded Packable Puffer for $44? Yes, Please.",
          "No complaints",
          "Very warm and very lightweight",
          "Great value",
          "jacket did it's job in light snow and rain",
          "Plenty warm for midwest america winter but not too bulky!"
        ],
        "customerReviewBodies": [
          "I was really impressed by the performance and sleekness of this thing. I wasn't expecting anything too much for 40 bucks, but fits perfect and is a great color - charcoal heather. I am 5 foot 11 and weigh 200 pounds and got the large. perfect",
          "I bought this jacket in an emergency when I tore open my very expensive down jacket sleeve. I was hoping it would be good enough to get me through a few cold days while I shopped around for a replacement \"good\" jacket. Turns out that this \"cheap\" jacket is way better than my old expensive one! Light years better! It's lighter and warmer, dries quickly and the hood doubles as a neck warmer when down. Love this thing!",
          "I",
          "E",
          "Great Jacket. After reading the other reviews on this jacket I bought an XL although I usually wear a Large. Fits perfectly. I'm 6'2\" and slim, the arm length is perfect and the fit is great. First I bought the 32 degrees hooded puffer which looks very similar and I returned it as it was very thin and not warm enough. This jacket fits the bill!! Very happy with this purchase and the price is great too. I highly recommend it.",
          "I really like these puffer jackets. Lightweight and very warm. They do run a little large. I am 6ft 1 tall 175lbs and exchanged from a large to medium.",
          "perfect jacket to keep me dry and warm in 20 degree weather, light snow and light rain. only wore a longsleeve base layer and tshirt underneath.\nafter getting rained on, my inner layers were dry, so there were no unseen rips or bad stitching that i found. candle wax was also accidentally dripped on it, and did not compromise the jacket, and also did not burn near campfire stray embers. only complaint, which is very minor, is that the stuff sack ripped a tiny bit when i was trying to stuff the jacket in there.",
          "I do like this coat! Plenty warm and the wind doesn't cut through it and not bulky. I have been wearing it every night for two weeks delivering pizza in January. So far its perfect however I would like draw strings on the hood. It does not have a way to pull the hood tight. The coat zipped fully is what holds the hood on. Works OK but pull strings would be better. This my first review ever! I look at reviews a lot so I thought its about time. Very good coat in first two weeks.",
          "Nice jacket. Smooth, soft, warm, comfy. I'm a 41\" chest and it fits nicely around my shoulders chest and arms, but it's pretty baggy around the stomach. As there's no elastic at the bottom it's pretty loose. Will likely see if a tailor can put some elastic in it or something. Probably better off waiting to see if Trespass have anything in the Christmas sales to be honest.",
          "100% Good value for money\nQuality is better than what I paid.\nOnly one suggestion or downside, this is not adjustable, they could easily make this adjustable but still deserves 5 star\nReduced 5 to 4 stares for the following reasons:\n1) Zipper is apposite side (this is not related to cost )\n2) Tested on moderate chilli wind and it doesn't stand. (I understand it is a lightweight but I expect it holds for moderate cold weather )",
          "This is a very lightweight yet effective jacket. Keeps you warm. It has two large pockets closed with zips (no chest pocket or inner pockets). The hood does not have a zip code to tighten around the face. The main zip slider is strangely on the left. It slides easily.\nBut this is a very comfortable jacket. Well worth the price. I ordered one size larger as my arms are longer than what it should be. So it fits slightly loose on the chest.\nOverall I like the jacket. Would recommend to others.",
          "Good fit, packs down well into its own bag. External pockets are zipped and reasonably deep so if you neglect to zip the pockets up you should not lose anything. Two internal deep pockets, probably not wide enough for maps but useful in any event. Have only worn in mildly cold conditions, where it was perfectly comfortable, so cannot comment on the thermal performance.",
          "Not the most stylishly tailored jacket in the world, but good quality and very practical. Considering that some similar jackets with designer labels cost 4 or 5 times as much, it's actually very good value for money indeed."
        ]
      }
    },
    {
      "id": "r_Fc6Sc",
      "title": "Essentials Men's Water-Resistant Softshell Jacket",
      "price": "$16.08",
      "image": "https://m.media-amazon.com/images/I/71P5J5OuGqL._AC_UX342_.jpg",
      "description": "An brand - This lightweight jacket keeps phones more safely out of the rain with water-resistant outer shell",
      "reviews": {
        "customerProfileNames": [
          "ResistImpulse_VideoReviewsOnYouTube",
          "HeathJackson",
          "StevenM.",
          "Samrio",
          "gd",
          "GInteriors",
          "A.K",
          "David"
        ],
        "customerProfilePictures": [
          "https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif",
          "https://images-eu.ssl-images-amazon.com/images/S/amazon-avatars-global/9a5c97b2-6e52-46cb-9a9d-e1b1886732fb._CR119,0,262,262_SX48_.jpg"
        ],
        "customerRatings": [
          "5.0 out of 5 stars",
          "2.0 out of 5 stars",
          "5.0 out of 5 stars",
          "5.0 out of 5 stars",
          "5.0 out of 5 stars",
          "3.0 out of 5 stars",
          "5.0 out of 5 stars",
          "5.0 out of 5 stars"
        ],
        "customerReviewTitles": [
          "BUY IT BEFORE THEY DOUBLE THE PRICE",
          "Design Flaw",
          "Comfortable, well made, and water resistant - yes, please",
          "A great soft shell jacket for a good price.",
          "Better quality than expected",
          "Looks great, I’m hesitant about the quality.",
          "Nice surprise",
          "Great Jacket! Just what I expected and needed!"
        ],
        "customerReviewBodies": [
          "The jacket does the chin guard well, the cuffs are solid and the attention to detail is superb. The lining is there!! I am used to a softshell with less warmth. This jacket is best served with a layering system planned with this being a layer to provide some warmth. I have a softshell that was easily twice the cost and certainly does not meet the standard of value this jacket presents. So while I was taken sideways by how warm the lining can be, this is my own assumption and failure to pay attention to detail when ordering, not a fault I hold against the jacket. So where are the super tiny flaws? or super tiny details done right?\nThe cuffs are the easiest place on this jacket to find the smallest pros and cons on an otherwise AMAZING value proposition.\n\nThe velcro on the cuff is great quality. The hook and loop sides both are done spectacularly well. On some jackets the ribbon base on the loop side of the velcro can be placed to far to the edge of the cuff presenting an abrasive edge to wear on your hands/wrists. Not so on this jacket. The spacing is superb.\nThe hook side can have issues such as scratchy hooks, aggressive ribbon base under the hook velcro or other issues that create scratching and abrasions. Not on this jacket. They use a hook section that is a rubbery material with hooks that are more like little triangle tree stumps so nothing feels scratchy or abrasive at all. The rubbery material has a friction grip feel on the back side so you can get some grip in the rain or cold, and the edges are smoothed over or rounded.\n\nThe cuffs are where the issue of this jacket exists though, the small small issue. The lack of internal elastic or section of elastic. Basically the cuff is all fabric tube with velcro to seize it down for warmth or to close aorund your gloves during a snow covered wrestling match or w/e. In some other jackets the sleeve would compensate for this adjustability with a touch of elasticity, and I know why.\n\nWith this jacket if you cinch down witht he velcro then you may have to uncinch the velcro to get your hand back through the sleeve. Therefore for a better day to day fit in the sleeve you would need to velcro both sleeves getting into the jacket then both getting out of the jacket. Every time. This of course is not reality and you can have them cinched down but not fully and slip your hand in and out, leaving the velcro where it is, and only need to adjust it if you want to cinch down the cuff completely.\n\nI know this is a very small nitpick more than a flaw, but I think if I point it out then you can understand the level of criticism I can bring to a jacket and to see this is the only thing to nitpick means the jacket for the price is an insane value proposition. They could definitely sell this jacket for double the price and still have great ratings and reviews. It is an incredible jacket and value.",
          "Don't buy this jacket! I love the look, the feel, the quality of the material, and the warmth level. But, there is a serious design flaw in the jacket. The pocket zipper bottoms sit above the rest of the material and take all of the weight of your hands when you have your hands in the pocket. I am sending back my second jacket for return, even though I'd love to keep it. Both times, the zippers bust in the first few days due to the strain of normal wear. At first I tried to repair the zipper,on but then learned that no zipper could be successful sewed in the way it is. If the pocket zippers are not important, maybe you will love the jacket.",
          "I",
          "H",
          "The materials and stitching are of a better quality than I was expecting. The lining is very lightweight and not entirely fleeced, which is what I was looking for. It makes this jacket a great option for cloudy windy days that are not too cold. I love that it has no visible logos on the outside.",
          "I love the fabric and the collar height on the jacket. I’m 5’11” 235lbs and all the weight is in my stomach. (I’m working on it) that being said the jacket fits pretty good, a tad tight around my stomach but that’s on me. I ordered an XL, I felt and still do feel that an xxl would swallow me. That being said my critiques have nothing to do with sizing and everything to do with quality. Within a couple wears (not my everyday jacket) the zippers in the pockets stopped working, and the pulls for all the zippers except the large bottom to top zipper had come undone. I’ve not washed it yet, but I’m kind of afraid to. If you need a nice looking jacket for a job interview or your quarterly sales meeting, this will do great. If you need a nice looking jacket to wear everyday, I’d maybe look elsewhere.",
          "T",
          "This jacket is exactly what I wanted. I've had it for about a week with no issues. Washed it about 3 times just due to my clumsiness/spills and its held up! I haven't had the zipper issue that some have had. Wore it on very windy ~45 degree days and it was perfect, especially at keeping the wind out. This will be my go-to spring/fall jacket! It fits true to size but is just a tiny tiny bit tight at the bottom. I definitely won't need to sinch it up at all. Love it!",
          "This jacket does not come with a european left side zipper tab. It's the american way round which makes zipping up the jacket very annoying. Otherwise a great jacket, very lightweight not much insulation, although very good at preventing wind chill. The pockets at the bottom are very deep with a smaller breast zipper pocket which is a nice touch. The cuff adjustment is very nice with a triangular hook and loop pattern which I haven't seen before and seems easier to clean and less hairs seem to be getting stuck onto this design. A hooded and more insulated winter version of this jacket would be a nice bonus which I would have also bought as well.",
          "The product was heavier than expected and the material did not feel comfortable. I have returned this product.",
          "It's a decent jacket...order a size small as they are big!\nVery similar to Keela stuff",
          " ",
          "",
          "Exactly as description and what I wanted."
        ]
      }
    },
    {
      "id": "eEKWhwz",
      "title": "Essentials Men's Lightweight Water-Resistant Packable Puffer Jacket",
      "price": "$12.04",
      "image": "https://m.media-amazon.com/images/I/81UiEq+TM6L._AC_UX342_.jpg",
      "description": "An brand - Cold-weather style is easy with this versatile water-resistant lightweight puffer jacket featuring a full-zip front and stand-up collar\n\nAmazon Essentials is focused on creating affordable, high-quality, and long-lasting everyday clothing you can rely on. Our line of men’s must-haves includes polo shirts, chino pants, classic-fit shorts, casual button-downs, and crew-neck tees. Our consistent sizing takes the guesswork out of shopping, and each piece is fine-tuned to offer quality and comfort.",
      "reviews": {
        "customerProfileNames": [
          "JenSi",
          "GaryGoodnow",
          "BaoH.",
          "AUCE9798",
          "KindleCustomer",
          "Louise",
          "TheBruce",
          "TheJoey"
        ],
        "customerProfilePictures": [
          "https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif",
          "https://images-na.ssl-images-amazon.com/images/S/amazon-avatars-global/2ef1e2b7-7b37-4a21-b42e-65490a0d344e._CR51,0,398,398_SX48_.jpg"
        ],
        "customerRatings": [
          "5.0 out of 5 stars",
          "5.0 out of 5 stars",
          "4.0 out of 5 stars",
          "5.0 out of 5 stars",
          "5.0 out of 5 stars",
          "5.0 out of 5 stars",
          "5.0 out of 5 stars",
          "4.0 out of 5 stars"
        ],
        "customerReviewTitles": [
          "Perfect base layer",
          "Versatile light-mid weight jacket - perfect for multi-uses",
          "Nice fit but still have to try out",
          "Solid jacket. On par with name brands for significantly less.",
          "it actually fits",
          "This Jacket is perfect",
          "Loving It So Far, We'll See In A Month Or So",
          "Reliable Casual Jacket"
        ],
        "customerReviewBodies": [
          "Exactly what I was looking for. I was looking for a water resistant light weight and warm base layer. This one fits great. 2 deep internal pockets. Zippers on external pockets. Well constructed. No issues so far. I plan to scotch guard it just to ensure its water resistant.\n\nOrdered Size Large.\n5ft 6\n200lbs",
          "I",
          "For the price I had to try. I have an REI version of this jacket. This version is a little bit more tough and rough it seems. I was able to pack it in the bag it came along with. I'm 150lb 5'6 and got a Small. As you can see in the pictures it fits fine, the chest portion is a little snug as I wear a 38 jacket. The waist portion has a lot of room left. Two pockets on the outside and two on the inside. I still have to try out during a colder night, but I think it'll get the job done!",
          "L",
          "I",
          "I",
          "I ordered this jacket more than a year ago, & so far it's been the best $40 I've ever spent on any single article of clothing. My friends have all been blown away by the light weight, & here in the San Francisco Bay Area it's all the jacket I need. The medium size fits me perfectly ( 5'10\", 180 pounds) & layers perfectly over a hoody if I need extra warmth. My only complaint, & it's a very tiny one, is that I wish one of the inside pockets were a little smaller. But, sized as they are, I can fit my pocket umbrella into one & my beanie cap into the other. When packed into its stuff sack it fits nicely into my backpack & I can leave it there for long periods, pull it back out, & it's ready to wear. I wear it all the time, there's been no sign of defects, & I love this jacket so much I'm likely going to order another in a different color. If your area's winters are really cold you'll likely want a heavier jacket, but if you live on the California coast you probably don't need anything heavier than this. Highly recommended, especially at this price!!!",
          "It's lightweight, seems well constructed and is reliable. I've worn it in temperatures as low as 13 degrees fahrenheit and it kept me warm. It's not one of those high-end down puffer jackets, but if you're looking for a lightweight jacket for being out and about in cold weather, this is solid. I've also heard of people stowing this jacket in its pack in their cars for emergencies, which is a great idea too.",
          "E",
          "",
          "S",
          "...with this jacket.\n\nIt is everything it claims to be in the description and despite being lightweight it is pleasingly warm [snug as a bug actually].\n\nThe stitching is excellent and I found no loose threads. It has two external zipped pockets and two large inside lower front quite deep pouch pockets. The zip, in keeping with the 'lightweight' theme is quite narrow but works well and zips right up to the top of the collar.\n\nSize-wise I would say it is 'true to size' bearing in mind what you may be wearing under the jacket in cooler times.",
          "Truly surprised by how warm this jacket is. It’s feather light and my first thought was that it is pretty thin so my expectations were pretty low. How wrong was I? I work outdoors in N Scotland and already in Oct temperatures are only 4 or 5C. I’ve been wearing it under my overalls instead of a fleece and wow it’s warm. It isn’t an Arctic level puffa jacket but I think that’s fairly obvious but it’s way warmer than a fleece, not at all bulky and fabulous value for money. I definitely recommend it",
          "Zip is on the wrong side, well to my mind anyway here in the UK, fastener should be on the left side. But is on the right side. So it is weird. Wondered if I had been sent a womans version of the coat instead. But then read that there are no zip standards, especially in the USA. Coat was made in Vietnam so don't know. Coat seems alright, fits fine which is always a gamble with clothes mail order.\n\nThink if I had been in a shop trying it on, the zip would have be even more of an issue and I wouldn't have bought the coat. But being delivered and having to sort out a return it just didn't seem worth it, so kept the coat. Just beware the zip fastener. Plan on using it to just pack in the backpack anyway ... so will be occasional use.\n\nShould it be minus two stars just for a zip? Yeah because it is weird, you go to fasten it then the zip on the opposite side. Takes a few moments to register."
        ]
      }
    },
    {
      "id": "ZHQpUHe",
      "title": "Essentials Men's Quilted Flannel-Lined Work Jacket",
      "price": "$15.41",
      "image": "https://m.media-amazon.com/images/I/91MjhhDjPDL._AC_UX342_.jpg",
      "description": "An brand - This essential quilted work jacket features a zip-up front with split kangaroo pocket and warmth-sealing ribbed cuffs and hem",
      "reviews": {
        "customerProfileNames": [
          "MeaganRedstone",
          "Bob",
          "FlBuyer",
          "thrasymachus",
          "FixieBoi",
          "Diane",
          "M.Miguel",
          "JacobMoreno"
        ],
        "customerProfilePictures": [
          "https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif"
        ],
        "customerRatings": [
          "5.0 out of 5 stars",
          "5.0 out of 5 stars",
          "5.0 out of 5 stars",
          "5.0 out of 5 stars",
          "4.0 out of 5 stars",
          "5.0 out of 5 stars",
          "5.0 out of 5 stars",
          "5.0 out of 5 stars"
        ],
        "customerReviewTitles": [
          "Great value coat",
          "Fabulous price-Nice quality!",
          "Great but Size Down!",
          "High quality jacket that runs too latge",
          "Great, comfortable, thick and warm.",
          "A bang for your buck kinda work jacket.",
          "Great Winter coat!",
          "OVER-EXCEEDED EXPECTATIONS, saved $$$"
        ],
        "customerReviewBodies": [
          "5'8 female, 210ish pounds, 42D chest, purchased size large. Perfect loose fit for layering. Slimmer fit and less bulky shape than other brands of same size. Perfect arm length, although I DO have slightly longer arms. Probably could have gotten away with a medium, but back portion from armpit to armpit fits perfect when I have my arms flexed forward (like a hug). Medium might have been a little tight. Remove stupid leather bits from zipper and drawstrings and you got yourself a great and cheap carhartt doupe.",
          "This coat is easily an $80 value for less than $20. The quality is so good that I ordered two more for my son and son-in-law. They both love the coats!",
          "I'm guessing this is discounted because it is the dead of summer however it's great quality. This jacket is significantly heavier duty than any typical hoodie or light zip type of jacket so you probably wouldn't need to layer if its only mildly cold. Word of caution if you prefer a slim fit order a size down from what you normally order.",
          "I",
          "This review will sum up all other reviews.\n\nIn terms of utility, it is very warm, you could basically treat it as a 2 in 1 jacket/sweater. Very thick. Although the large is a bit wide, you could fit 2 sweaters underneath without feeling snug and my stomach is big. (5’8, 200lbs). So if your shorter and thinner than me you should get a medium.\n\nIn terms of comfort, it is very comfortable,\n\nIn terms of fashionable. Not at all fashionable, it more of a Dickies style, warehouse type esc.",
          "I",
          "Great for cold winter/spring days. Got an XL and it fit quite well. Roomy with lots of pockets for wallet and cellphone.",
          "N",
          "A good product it will keep you warm plenty of room in the coat I'm on the bottom end of x l and I bought a large it fits realy well someone reviewed this item and said it was as good quality as a similar carhartt jacket unfortunately it's far from that but for the price I paid was a bargain I will defiantly get some wear put of it next winter oh yes it is only shower proof",
          "This is the third one of these I've bought. They are rugged and warm. I usually take a medium so I got size m in this and it's a good fit, a little generous, but I like it that way. Room to move or wear a hood underneath.\nGreat value for money for the price I paid.",
          "Saw this jacket come up. Thought about it a lot before I bought it. Glad I did now it will be lovely and warm in the cold weather. Good quality and a nice design.",
          "Great jacket. The rain just rolls off it and its cosy and comfortable to wear. Not stiff like similar types can be. Recommend for sure, I've bought two",
          "A"
        ]
      }
    },
    {
      "id": "DMzarPk",
      "title": "Essentials Men's Heavyweight Hooded Puffer Coat",
      "price": "$12.54",
      "image": "https://m.media-amazon.com/images/I/81TNM2an11L._AC_UX342_.jpg",
      "description": "Essentials is focused on creating affordable, high-quality, and long-lasting everyday clothing you can rely on. Our line of men’s must-haves includes polo shirts, chino pants, classic-fit shorts, casual button-downs, and crew-neck tees. Our consistent sizing takes the guesswork out of shopping, and each piece is put to the test to maintain the highest standards in quality and comfort.",
      "reviews": {
        "customerProfileNames": [
          "BJ1517",
          "DarleneAbrahamson",
          "SteveSchnurbusch",
          "J.John",
          "A.Cornelius",
          "Bluemoon",
          "M.Mercado",
          "CPNY"
        ],
        "customerProfilePictures": [
          "https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif",
          "https://images-na.ssl-images-amazon.com/images/S/amazon-avatars-global/f66161dc-497e-4306-9b26-60e308acca08._CR0,0,500,500_SX48_.jpg"
        ],
        "customerRatings": [
          "5.0 out of 5 stars",
          "5.0 out of 5 stars",
          "5.0 out of 5 stars",
          "4.0 out of 5 stars",
          "1.0 out of 5 stars",
          "5.0 out of 5 stars",
          "5.0 out of 5 stars",
          "5.0 out of 5 stars"
        ],
        "customerReviewTitles": [
          "Among a sea of options, this is a steal",
          "Warm, but not heavy.",
          "Very warm - great coat for the price",
          "Nice but missing key features.",
          "Zipper breaks immediately- not worth it",
          "Great Jacket!",
          "Excellent Winter Action Coat, Perfect Fit....",
          "Excellent warm jacket. Buy it"
        ],
        "customerReviewBodies": [
          "L",
          "It’s warm but not heavy. It’s only been down to about 15 degrees here, and jacket was nice and warm. I don’t know how warm it will be when it gets to 20 or 30 below, but I think with a layer underneath it will be ok. Size fits perfectly.\nI’m a woman and I always buy men’s jacket for two reasons: they fit more comfortably and they are made to last.Warm",
          "I get cold really easy and this jacket is great if you want a warm one. I'm 5'10\" and weigh 135lbs and the small fits me well. It has fleece lined pockets and a fleece lined hood. It has a good quality YKK zipper. The coat snaps shut in addition to zippering shut. It has elastic around the wrists for a nice tight fit that won't allow breezes to flow up your arm. There a fleece-line inside pocket about chest high big enough for a cell phone or wallet. It has a velcro enclosure.\n\nI was at my daughter's basketball tournament in an unheated gym when I got notification that it arrived. I was pretty cold despite wearing some layers. The next day of the tournament I wore this new jacket and was plenty warm. I had to take it off at one point because I was a little too warm.\n\nUPDATE: I'll be looking for this to go on sale again. At Christmas Eve service tonight our pastor said a homeless gentleman was outside the church shivering when she got there. They brought him in and let him sleep in our youth room during our service. It was cold outside so I wore this coat to church. I decided he needed the coat much more than I did and gave it to him. I expect it will serve him well and keep him nice and warm!",
          "Good jacket, it is really warm as the other reviews said. I wish there were more inside pockets as my other one that I bought from Costco years ago for 20 bucks has a breast pocket on both the right and left.\n\nThis one only has one on the left side, and I don’t like keeping my phone on the same side as my heart, never know with radiation these days. I usually keep my wallet on the left side and phone on the right.\n\nMy other jacket has three inside pockets. Feature request...",
          "I’ve bought this coat twice and both times the zipper broke within a week of use. I’m outside of the return window on the first one but am returning the second one. It fits well and is warm but if it doesn’t zip it doesn’t work.",
          "Great jacket and fits perfectly!",
          "A",
          "For 35 bucks you can’t go wrong. It looks great casual and is extremely warm. Was thinking it would be “cheap” but nope, it’s made really well, def has good weight to it to keep you warm. It’s been windy in the low 30s and it has kept me extremely warm.",
          "Mixed feelings about this coat ,if feels very thin ,not much insulation in it ,and not heavy ,was looking for something a bit heavier and warmer but with a jumper underneath it does the job to walk the dog on cold evenings, plus zip is on opposite, and can be quite fiddly to zip up .",
          "Nice enough jacket cost was reasoable and looks good - quite large in size for my lanky teenager but allows for extra layers in the cold",
          "Not a heavy coat, not really a winter jacket. I went out in it when it was 0°c and was cold.\nGood quality though",
          "Was searching for a new winter coat for several months and stumbled across this as a last resort and was not expecting to much,however when the coat arrived well wow what a surprise the cost was a perfect fit the quality is great and looks like it cost a lot more than the 35 pounds I payed very very very plesde",
          "Tried initially to send it back but changed my mind."
        ]
      }
    },
    {
      "id": "HwxRP1a",
      "title": "Essentials Men's Long-Sleeve Water-Resistant Sherpa-Lined Puffer Jacket",
      "price": "$15.60",
      "image": "https://m.media-amazon.com/images/I/91Cprh1ahgL._AC_UX342_.jpg",
      "description": "An brand - This adventure ready sherpa-lined, water resistant puffer jacket features an elastic bound hood opening and interior rib cuffs at sleeve openings\n\nAmazon Essentials is focused on creating affordable, high-quality, and long-lasting everyday clothing you can rely on. Our line of men's must-haves includes polo shirts, chino pants, classic-fit shorts, casual button-downs, and crew-neck tees. Our consistent sizing takes the guesswork out of shopping, and each piece is put to the test to maintain the highest standards in quality and comfort.",
      "reviews": {
        "customerProfileNames": [
          "MotherReviews",
          "MissV",
          "Damon.D",
          "Mark",
          "QiQi",
          "Momoftwo",
          "Dina",
          "M.Trinh"
        ],
        "customerProfilePictures": [
          "https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif",
          "https://images-na.ssl-images-amazon.com/images/S/amazon-avatars-global/e9b8e46f-3cfe-4fde-b30a-85a3f63ffe68._CR0,0,460,460_SX48_.jpg",
          "https://images-na.ssl-images-amazon.com/images/S/amazon-avatars-global/8a36e4c7-ecf7-4686-b704-419a08cbb339._CR0,0,720,720_SX48_.jpg"
        ],
        "customerRatings": [
          "5.0 out of 5 stars",
          "5.0 out of 5 stars",
          "5.0 out of 5 stars",
          "5.0 out of 5 stars",
          "5.0 out of 5 stars",
          "5.0 out of 5 stars",
          "5.0 out of 5 stars",
          "5.0 out of 5 stars"
        ],
        "customerReviewTitles": [
          "UH WHATTTT!?!",
          "Perfect for ladies too!",
          "Pretty nice jacket",
          "Excellent bargain and warm! Lightweight, can't be beat!",
          "Bought two",
          "soft and cozy",
          "Perfect for the cold weather",
          "Good jacket for the price!"
        ],
        "customerReviewBodies": [
          "W",
          "I",
          "Didn't think this jacket would be so nice for the price. Wanted something warm but lightweight. Honestly they could slap a North Face logo on this jacket and charge $100-200 easily.\n\nI'm 5' 10\" and 175 and the large fits perfect. Enough room for a light base layer+shirt.\n\nLining is soft and warm. Was out in sub 30 windy weather today and felt no wind and stayed warm. Hood fits nice. Pockets are warm also.\n\nI might buy another color.\n\nCan't comment on water resistance but didn't really buy it for the rain. I have a jacket for that.",
          "Why spend $40-100+ bucks for a similar style jacket when this one was $15 bucks, nicely made, isn't falling apart, medium fit me perfect and even though it's light, it warms ya up! Good size pockets. Great for light/mid rain!",
          "Bought one in camo for $16, and found it so lightweight, warm and comfy that I ordered another (identical), now I have one to wear out to the fields and barn, and the other to wear indoors on cold wintry nights (like a bed jacket - it's that soft/comfy/cozy). PNW woman.",
          "Purchased for 20 year old. He likes the attached hood and really loves \" shearling\" on the inside of the jacket. He says its warm and cozy. He likes the double pockets on the front as well as the inner chest zipper pocket. I liked the price!",
          "I got this for my fiancé as he did not have a jacket and he said that it definitely helps keep him warm despite it not being the bulkiest jacket. The lining does extend down the arms so it's very insulated. If you want to layer it it's best to go up a size to be able to do so. Overall it's a very good budget jacket. Also you do have to be gentle when washing it.",
          "I",
          "Pros:\nServes a purpose.\nWill keep you warm\nDouble pockets on the outside are comfortable and functional\n\nCons:\nDoesn't hug the body as much as I like\nNot as warm as a winter coat but looks like one.",
          "Absolutely bargain!!! Amazing jacket. Fit well. My husband was surprised.",
          "Bit oversized for xx but happy with coat.",
          "Die Jacke ist unbeschädigt,angenehmes \"teddyfutter\",bin 1,82 gross,92kg,mittlerer Bauch,habe Grösse XL bestellt,Ärmel dürften nicht länger sein,Jacke passt,geht bis zur Hüfte,habe normale Schulterbreite,bei einem breitschultrigen wirds eng,dann besser XXL bestellen,habe drunter ein dickes Bw-Unterhemd und ein Hemd,dünnes Unterhemd und Pullover geht auch.Eher Übergangsjacke,kann aber bei leichten Minusgraden auch getragen werden.",
          "",
          "G",
          ""
        ]
      }
    },
    {
      "id": "8jb2xYI",
      "title": "Essentials Men's Full-Zip Polar Fleece Jacket",
      "price": "$7.64",
      "image": "https://m.media-amazon.com/images/I/81McI2xG3NS._AC_UX342_.jpg",
      "description": "Essentials is focused on creating affordable, high-quality, and long-lasting everyday clothing you can rely on. Our line of men’s must-haves includes polo shirts, chino pants, classic-fit shorts, casual button-downs, and crew-neck tees. Our consistent sizing takes the guesswork out of shopping, and each piece is put to the test to maintain the highest standards in quality and comfort.",
      "reviews": {
        "customerProfileNames": [
          "Mowrind",
          "Marty",
          "Raj",
          "M.Hill",
          "forlotto"
        ],
        "customerProfilePictures": [
          "https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif",
          "https://images-na.ssl-images-amazon.com/images/S/amazon-avatars-global/21p09fW70eL._CR0,0,87,87_UX110_.gif",
          "https://images-eu.ssl-images-amazon.com/images/S/amazon-avatars-global/6b5d5e34-a001-4734-85eb-0a8c77928074._CR62,0,375,375_SX48_.jpg"
        ],
        "customerRatings": [
          "2.0 out of 5 stars",
          "5.0 out of 5 stars",
          "5.0 out of 5 stars",
          "5.0 out of 5 stars",
          "3.0 out of 5 stars"
        ],
        "customerReviewTitles": [
          "Comfortable, affordable",
          "Keeps you warm and Toasty in any Condition",
          "Its GOOOD..... here's why...",
          "Essentials Men's Full-Zip Polar Fleece Jacket",
          "Near Perfect but... Ordered 4 2 of 4 Pilling and shedding after two times wearing!"
        ],
        "customerReviewBodies": [
          "Pros: Comfortable, affordable, not undersized. Currently available in tan, which is strangely hard to find in other full zip fleece jackets right now.\nCons: Sheds fuzz like crazy. Makes me doubt its durability, though so far it's holding up. Using Columbia Steens Mountain as a baseline, it's heavier than I expected. A bit too warm indoors. The currently trendy cuffless sleeve design is also an annoyance. I'll willingly pay a bit more for the Columbia next time.\n\nEdit: After two or three wash cycles now, the fuzz ball shedding issue seems to be going away.\nUpdate: a couple of months later, as I feared, visible signs of wear. Elbows are shiny. I have to conclude the product is not a good value even at its well-below-average price.",
          "I've been wearing Polar fleece since the Army place this into their inventory in 2005. Not only does this keep you warm but is so snugly and comfortable when you sleep. I've worn fleece clothing on the coldest and snowy mountain tops of Afghanistan and it has always kept me warm. If you've ever been stationed in Germany during the winter then you know how cold it gets there but with Fleece sweater I didn't even need a Jacket, its perfect for any condition. I prefer Fleece over cotton cause it wont wont absorb the sweat and soak the material and it wont shrink on you. Love me some Fleece!!",
          "If you are in dilemma to buy Columbia fleece or Amzn essential fleece, I will vote for Amzn, I recently tried a Columbia but it kind of looked very unprofessional even for casual wear, the collar didn't stood uptight and the hand pockets were not flush to the jacket and were hanging out a bit. Since this amzn one has a zipper to outer hand pockets they stay snug to your body. This jacket also has two internal pockets for keeping stuff (without zip). All in all it's a bargain to buy at this low price. I love the color, it appears a bit on a lighter shade than displayed but great for dressing up or down.",
          "Medium-weight 100 percent polyester fleece is used to create this simple classic style zip-front jacket. The stand-up collar measures 2 1/2 inches high. Both the garment’s straight bottom hem and sleeve hems are a slim 1/4 inch. And although a casing with elastic is not obvious, both areas respond in a similar way, slightly expanding when pulled.\n\nThe sizing is exactly as expected. The male in residence normally wears a large jacket but wanted to wear this over a sweater on cold but not frigid winter days when layering makes sense. This size-up is definitely one size larger – no more, no less. The jacket is warm and comfortable, and it looks quite good on him. The design is inherently flattering..\n\nBasic construction. The main zipper is a heavy-duty nylon model with a large easy-to-pull metal tab. Two in-seam vertical pockets have a nylon zipper closure so they secure the contents and do not cause the fabric to sag open, helping to neatly maintain the jacket’s silhouette.\n\nThere are two large interior pockets on either side of the zipper that measure 7 1/2 x 11 1/2 inches. They are placed at the mid-point of the front panels extending to the bottom hem edge. These pockets do sag open a bit so they are partially visible when the jacket is un-zipped. This is a minor issue and the additional pocket capacity increases functionality.\n\nThe sewing is excellent with the stitches even with no hanging threads and all interior seams are finished which eliminates raw edges for a neat appearance. There is no hanging loop and there is a sewn-in back label. Fabric care instructions are to machine wash cold with like colors, no bleach, tumble dry on low heat, no iron and no dry cleaning. Basic, handsome easy care jacket.",
          "T",
          "🟥 🟧 🟨 🟩 🟦 🟪 🟫🟥 🟧 🟨\n🚫 TEST E CONSIDERAZIONI: 🚫\n🟥 🟧 🟨 🟩 🟦 🟪 🟫🟥 🟧 🟨\nFelpa acquistata a marzo 2019 e recensisco ora, maggio 2020, a distanza di oltre 1 anno, dopo averla indossata parecchio, specialmente per stare nei dintorni di casa, non essendo elegante, ma davvero molto molto calda e pratica.\n\nLe lampo con cordino permettono di allacciarla e slacciarla al volo, sono davvero toste, sia quella per la chiusura della felpa che quelle delle tasche, sono lampo con chiusura femminile, ovvero al contrario di quella maschile, per intenderci il cursore lo farete scorrere con la mano destra anzichè con quella sinistra come sono abituati gli uomini, ma poco male è questione di abitudine.\n\nLa felpa è in pile, molto comodo, caldo e soffice, tiene davvero caldo in inverno pieno anche con venticello moderato, ovviamente se il vento è consistente l'aria passa, non essendo fatta di materiali wind stop.\n\nRisulta discretamente traspirante, tanto da non mettersi sonovuoto quando la indossate.\n\nIo sono alto 175cm e peso circa 72Kg, ho preso la taglia S e mi calza alla perfezione, stretta ma non troppo, perfetta di maniche. Le tasche con cerniera sono comode e profonde. Non si tratta di un capo alla moda ma adatto a coloro che lavorano e che necessitano di un indumento caldo per l'inverno da mettere magari sotto la giacca per poi poterlo utilizzare da solo in caso la giornata si scaldi leggermente.\n\nSono totalmente soddisfatto, nonostante le finiture non precise anzi, tutt'altro, il proprio dovere lo fa egregiamente, tiene caldo e dopo 1 anno di lavaggi praticamente settimanali è ancora soffice e perfetto, difficile pretendere di più.\n\n🟥 🟧 🟨 🟩 🟦 🟪\n🔹 CONCLUSIONI:🔹\n🟥 🟧 🟨 🟩 🟦 🟪\nAl prezzo di 18 euro a marzo 2019 (attualmente 19,99 euro) è difficile pretendere di più da questo genere di indumenti, non di certo adatti a situazioni eleganti ma pià che altro a situazioni pratiche in cui l'efficacia passa in secondo piano rispetto alla bellezza dell'indumento. Diversi colori disponibili ma il camouflage verde è quello che mi ha colpito di più.\n\nInserisco qualche foto e vi ringrazio per la lettura\nStefano",
          "",
          "Sadly this product was disappointing considering all the positive reviews.\nFirstly the zip fastener stuck and I put it down to being new or perhaps because it was on the LHS, but after numerous tries I decided it was faulty.\nAlso the L size fitted my arms in length and was comfortable but the body was way too small. And that's the problem with buying stuff on line. One man's large is another man's small.\nIt was however lightweight and what I wanted but...................",
          "This may not be the best fleece jacket you will ever own, but it could well be the best value for money. Fleece is a fairly basic material that is reasonably warm, highly breathable and fairly light weight, compared to say wool. However it offers almost no protection against wind or rain so is best suited to being worn as a mid layer.\nThis jacket offers almost no frills e.g. no shoulder or elbow reinforced patches, no 2 way zip and not even a hem cord with cord locks. However most of these features merely add weight and cost and provide very little benefit in the real world.\nUltimately what really matters are decent materials, good quality construction and accurate sizing and happily this jacket is very good when it comes to these criteria.\nOverall this jacket provides good warmth, from a mid weight material, being around twice the weight of a micro fleece fabric. It fits me very well and the slightly elasticated cuffs and hem are sufficient to keep out any draughts. There are two hand warming outer pockets with zips and additionally 2 large inside “poacher” pockets big enough for a Ordnance Survey map but much more likely to be used for a hat or light weight windproof shirt/waterproof smock. The poacher pockets also provide a useful double layer of insulation, like wise the collar also has double thickness of material\nIf worn under a Goretex type jacket you may miraculously find that the jacket suddenly becomes far less leak prone. This is because around 99% of the moisture inside the jacket is not in fact rain coming in, but sweat that cannot get out, but can be managed very effectively by the fleece.",
          "The description for this product reads, 'Everyday made better: we listen to customer feedback and fine-tune every detail to ensure quality, fit, and comfort'. Well if this is true why is it still being sold as a Man's fleece when the zipper is on the Ladies side? There have been enough reviews stating this, so why hasn't this problem been rectified?\nGreat shame, because apart from this annoying problem, it's a great value garment and fits perfectly.",
          "Medium weight fleece. I would say it's a standard fit. I ordered small, and it fits well, with still some extra room in the arms etc.Don't size up in other words. Front zipped pockets are useful although they do add a bit of visible padding in the gut area with the thicker material. If you're concerned with looks, that might be the only issue when it's zipped up."
        ]
      }
    },
    {
      "id": "ZZnHXgs",
      "title": "Wrangler Authentics Men's Long Sleeve Quilted Lined Flannel Shirt Jacket with Hood",
      "price": "$22.00",
      "image": "https://m.media-amazon.com/images/I/61J2YWfGrXL._AC_UX342_.jpg",
      "description": "Wrangler Authentic men's quilted long sleeve lined Flannel with hood. This flannel features polyester lined body, interior, two pockets, and brushed flannel exterior making it the perfect jacket for those cold winter nights. The jacket offers versatility, comfort, and warmth, making it a fall and winter essential.",
      "reviews": {
        "customerProfileNames": [
          "LeonardoValerio",
          "hatweyrogers",
          "Smile&EnjoyToday",
          "BrookeTaelor",
          "Anorsegoddess",
          "KJ",
          "Jessica",
          "CamilleCollins"
        ],
        "customerProfilePictures": [
          "https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif",
          "https://images-na.ssl-images-amazon.com/images/S/amazon-avatars/207b4c3e-3850-4d01-b153-943a3bbc3dd8._CR0,0,380,380_SX48_.jpg",
          "https://images-na.ssl-images-amazon.com/images/S/amazon-avatars-global/bb22f749-dfd7-44c7-a1a5-a87f1f8d1958._CR0,0.0,333,333_SX48_.jpg",
          "https://images-na.ssl-images-amazon.com/images/S/amazon-avatars-global/da13776f-702f-44c7-a4bc-25d98e013a85._CR0,0,497,497_SX48_.jpg",
          "https://images-na.ssl-images-amazon.com/images/S/amazon-avatars-global/fa510551-a3f7-42cb-a246-a5f04e5badd8._CR0,0,500,500_SX48_.jpg"
        ],
        "customerRatings": [
          "5.0 out of 5 stars",
          "4.0 out of 5 stars",
          "5.0 out of 5 stars",
          "3.0 out of 5 stars",
          "5.0 out of 5 stars",
          "5.0 out of 5 stars",
          "5.0 out of 5 stars",
          "5.0 out of 5 stars"
        ],
        "customerReviewTitles": [
          "EXC jacket, I guarantee you are not going to get disappointed",
          "decent",
          "My husband loves this great looking, warm flannel jacket!",
          "Loved the look, didn't like the material",
          "Depends on your build.",
          "Perfect.",
          "Perfect throw on layer to keep the chill off",
          "Hot on Guys"
        ],
        "customerReviewBodies": [
          "I use to wear L things, sometimes they fit a little small but this one FITS PERFECT !! it is a real L, no the things some people sell from China. The jacket keep you warm, fit awesome and the colors are wonderful, I REALLY LOVE IT !",
          "little flimsy for my flannel needs, but being the manly man i am i got over it after only crying for 2 hours. you proud of me now mom?",
          "I ordered this lined flannel jacket with hoodie is the \"Total Eclipse With Heather Gray Hood\" color and size large, as gift for my husband to keep him warm during the cold months ahead. He's 5'10, 175 pounds and likes to buy alot of flannel lined shirts in XL to wear like a jacket, which is cool for the need to layer clothes perspective, but I felt this jacket would achieve the extra warmth way better, without the extra bulk and darker color will match nearly all his casual wear, too. My gift and intentions were a hit, because he loves this great jacket, already been wearing it a lot and the color indeed pairs well with most of his clothes. Best of all, I know he's staying warm during cool Fall nights and early hours of the day and so far, even without needing to wear extra layers... yet! The buttons, weight of flannel and craftsmanship of this nice looking jacket is high quality and made to last. We are both very happy with this purchase, absolutely recommend and would buy again.",
          "I've been searching for a oversized flannel-type jacket to throw on with biker shorts. I originally loved this because of the hood and print, however, once I tried it on I couldn't picture myself wearing it. The lining is not comfortable at all - very stiff. Wish that it was a little more cozy, and I would have kept it! I'm a size small and bought a large (probably could have went with a medium, as it was really big).",
          "If you're a buff guy, definitely buy the size you always wear. Some reviews said to go a size smaller and I did. I unfortunately have to return this for a bigger size. My fiance wears a large and I got him a medium, it's too small. This is true to size. So I will be getting a large instead.",
          "Beautiful sweater. My husband loved and want to use it as soon as possible.",
          "Fiance loved it, I got it for him to throw on for running around or working outside, etc so a nice coat doesn't get ruined. He runs warm usually but it gets nippy enough to need just a little something so this was the perfect layer for keeping the chill off. Sizing is true, he's normally a XL and that's what I ordered, fit perfectly.",
          "Bought this coat for my fiancé after realizing his old coat was 10 years old and small enough to fit me. He doesn’t usually wear a jacket out, but with the cold weather coming on, I wanted something to cover his arms when it snowed. He wanted a size up, so it wasn’t as form fitting as I wanted, and the material felt a little thin. It is incredibly warm, though, and he gets toasty quick! Didn’t have the color he wanted in his size? Otherwise, very good for the price and exactly what I needed.",
          "Medium size is perfect for me (5'-8\", 165lbs). The outer material is great and feels really good. The inside lining is warm enough for quick errands in this winter weather. Really nice color. Does not bleed during washing. 4-star rating is due to getting a bit deformed after the first wash. I think the outside material shrinked a little bit but the inside lining remained the same. Ironing could probably fix it but I am still not quite happy about it. But overall quality and fit is great.",
          "I",
          "I like it. That said I read the reviews and there were lots of people mentioning this should have a zipper rather than the buttons. I ordered it thinking the buttons would be fine, I was wrong.\n\nI still like this coat and wear it often but with the style, fit, and fabric weight.....a zipper would have been a nice feature.\n\nI would still order it again with the buttons but would order faster with a zipper.",
          "El producto es cómodo, delgado y practico de llevar. Proteje bien del frió a pesar de ser delgado.\nPara este abrigo yo recomiendo que escojas la misma medida que usar con una camisa de manga larga, el tiro de los puños te quedará bien de esa manera. Debes tener en cuenta que no es un abrigo ajustado, es bombacho tanto de los brazos como de la cintura.",
          "",
          "Guys, this jackets the whole line, are terrible in terms of material quality, yes they look good when they arrive to your front door and you open them, but let me share my experience. right after I took it out the box i was like wow they look cool, but then i got disappointed cause soon as I got my hands on This jacket, that typical thin cheap fabric material sensation became present. I was tryna be optimistic about it, so I was ok maybe it's just some lint or dust from the factory,that is making this jacket feel that way. But I was wrong, after washing it following the instructions carefully, it became even more trash, lint all over the shell, sleeves were covered by tons of lint that it was as if the sleeves had some kind of texture of decoloration.\n\nBought 2, one was 100% cotton the other one was 60% cotton the other 40 was polyester. Both were the same level of poor quality, although anyone could think the 100% was better, the answer is they are trash no matter which one you choose.\n\nI'm 6'0 76kg, medium was kind of boxy and sleeves a bit longer than they should be for a Medium."
        ]
      }
    },
    {
      "id": "5febO0i",
      "title": "Champion Stadium Packable Jacket, Lightweight Water and Wind Resistant Pullover, Half Zip Hooded Windbreaker",
      "price": "$19.52",
      "image": "https://m.media-amazon.com/images/I/713HTxcq62L._AC_UX342_.jpg",
      "description": "Think outside the gym! Champion authentic originals are athletic wear classics updated with the latest in fabric and fashion.",
      "reviews": {
        "customerProfileNames": [
          "Kentyana",
          "N.Beitler",
          "Customer",
          "Customer",
          "HeatherM.",
          "seantfinnh",
          "F.Zeri",
          "buyer",
          "C.A.Garland"
        ],
        "customerProfilePictures": [
          "https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif",
          "https://images-na.ssl-images-amazon.com/images/S/amazon-avatars-global/8b8d420f-5e1e-4e73-891c-c8b65fe61b7e._CR0,0,498,498_SX48_.jpg"
        ],
        "customerRatings": [
          "5.0 out of 5 stars",
          "5.0 out of 5 stars",
          "2.0 out of 5 stars",
          "5.0 out of 5 stars",
          "5.0 out of 5 stars",
          "5.0 out of 5 stars",
          "3.0 out of 5 stars",
          "5.0 out of 5 stars"
        ],
        "customerReviewTitles": [
          "Love it",
          "A light-weight outer shell to protect from wind and wet weather, but not cold.",
          "False advertising!!!",
          "Great Product",
          "Perfect fit",
          "The bottom",
          "Ookay",
          "A convenient jacket."
        ],
        "customerReviewBodies": [
          "I love that it’s just like the picture",
          "I ordered this jacket for my 19-year-old son who is in college. He is a student-athlete who lives off campus with other athletes. He rides a bike to and from campus and was needing a light jacket to keep him dry if he faced rain during his morning or afternoon ride to and from campus. This jacket was perfect for that purpose, and because it is so small and light weight, after he takes it off he can easily shake most of the water from it and then crumple it into a small ball and stuff it into his backpack. When I first got it for him, he thought he wouldn't use it very much. As time has passed, though, he has thanked me for it because he wears it more and more frequently. He will need a different jacket in the winter, because this will not protect you from cold temperatures, but it is light enough that you can wear it on even warm days without completely sweltering.",
          "Not the same as pictures they advertise. False advertising!!!",
          "I",
          "Love this. Wear it to work",
          "This is beautiful jacket with plenty of pockets, unfortunately the bottom part is tight even if you put the strings to loose. You know how it is in winter, you have other clothes under this windbreaker and you have to fight to let the bottom part slide down. Bad Bad idea design.",
          "So it serves the purpose of a rain jacket very well, but it doesn't come with the \"fake\" champion logo on the front, so it really just looks like a high quality shopping bag. To answer any questions anyone may have, yes this is fake. Personally I think there's cuter raincoats out there, but it's okay still.",
          "Purchased this product from a different company and color some months ago. Fits great. Very light, comfortable to wear on nice days. Having a large front pouch pocket is convenient for carrying around keys, wallets, hand sanitizer and facial coverings. Wind resistant and easy to wash. I recommend hang drying in order to keep it looking nice.",
          "I bought this jacket for my 14 years old son. He has worn it throughout fall 2020 and is already wearing it again this spring (April 2021). It is lightweight and very well-made. It has 2 regular side pockets in the waist area as well as a large zippered front pocket in which the jacket can be folded into. When wearing the jacket, this extra large pocket is very practical for storing your keys, cellphone, earbuds, and any other personal items. Even though the fabric is thin, it keeps you warm during cooler windy days. The quality is good as we have had no issues at all with the fabric ripping.\n\nIt fits my son nicely and has a little extra space which is great since he can easily wear layers underneath. It is adjustable at the waist and it is wind and rain repellent. The hood is also a nice touch and helps keep him dry when he is out and about. It's stylish, comfortable and the fact that it can be neatly folded into a compact little pouch is definitely a plus. Great purchase. Would recommend.\n\nIf my review was helpful let me know by clicking on the ''Helpful'' button :) 👍🏻",
          "Es una chamarra delgada y se siente de buena calidad al tacto, en cuanto al tamaño compre Talla M, mido 1.75 y peso 75 Kg. No tengo panza y tengo cuerpo plano sin mucho músculo (cuerpo de corredor jaja) Me quede bien ancho y largo ni muy ajustada ni muy holgada perfecta en ese aspecto, aunque como comentan varios compradores quizás un poco corta del largo de las mangas, apenas y me llegan a la muñeca aunque normalmente uso ese tipo de prendas con las mangas remangadas un poco por lo que no me afecta mucho ese detalle, pero si consideran que las mangas son cortas en lo largo. Si tienen mucho músculo en el pecho y brazos y normalmente son Talla M mejor pidan la L, ya que si viene justa en esas área les puede llegar apretar un poco esas zonas.\nNo le puse las 5 estrellas porque la chamarra no tiene buena ventilación y el material no transpira, es como uno de esas sudaderas de plástico que usan los boxeadores para sudar, por lo que para actividades físicas como correr van a sudar mucho con ella, aunque eso sí, con mucho estilo.",
          "",
          "Very thin jacket and very very small to size, by the next size uo from your usual size.",
          "It said it would be my size but was way larger",
          "Esta chamarra es muy bonita, ordené una talla M de acuerdo a las reseñas de otros clientes y tuve que devolverla, usualmente soy talla S, esta chamarra es muy muy ancha de los brazos, principalmente de la zona de los hombros y hasta los codos, en cuanto al largo era aceptable, el largo de las mangas es normal a mi parecer, espero que ahora que ordené una talla S no me quede corta de los brazos, en cuanto a lo demás, por la experiencia de haberme probado la talla M, seguro la talla S me quedaría perfecta.",
          ""
        ]
      }
    },
    {
      "id": "5c4ehg9",
      "title": "URBANFIND Men's Slim Fit Lightweight Sportswear Jacket Casual Bomber Jacket",
      "price": "$33.99",
      "image": "https://m.media-amazon.com/images/I/519kCnvDE7L._AC_UX385_.jpg",
      "description": "Polyester\nImported\nZipper closure\nslim fit wear, soft, comfortable and breathable.\nFashion and Stylish: Rib collar, cuff and hem, Zipper Closure, Long Sleeve.\nSuitable for: Casual, Outdoor, Daily, School, Working, Camping, Sports, Athletics and so on.\nSeason: Spring & Autumn\nMachine Washing Available",
      "reviews": {
        "customerProfileNames": [
          "Paulette",
          "ThomasPatterson",
          "JB",
          "Anonymous123",
          "JeséRodríguez",
          "B.Woo",
          "TonyBullard",
          "AdamHaviland"
        ],
        "customerProfilePictures": [
          "https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif",
          "https://images-na.ssl-images-amazon.com/images/S/amazon-avatars/default._CR0,0,1024,1024_SX48_.png",
          "https://images-na.ssl-images-amazon.com/images/S/amazon-avatars-global/2ad4373b-6dd0-4556-a35c-66e4c1e02194._CR61,0,377,377_SX48_.jpg"
        ],
        "customerRatings": [
          "5.0 out of 5 stars",
          "5.0 out of 5 stars",
          "5.0 out of 5 stars",
          "5.0 out of 5 stars",
          "5.0 out of 5 stars",
          "5.0 out of 5 stars",
          "4.0 out of 5 stars",
          "5.0 out of 5 stars"
        ],
        "customerReviewTitles": [
          "Best Purchase!",
          "Light weight slim-fit bomber jacket",
          "Order one size up from your normal size",
          "Damn I look good…",
          "Fits as expected! Very good for the price",
          "Good jacket",
          "Sizes must have been adjusted - Order the sie you normally would",
          "Looks sharp, fits great"
        ],
        "customerReviewBodies": [
          " Okay so don’t hesitate in this. I bought this because I needed a pocket inside while I work for my phone not to be seen. So it has one pocket inside the jacket. And a pocket on arm and like 2 spots where you can attach a handy pen too. It’s about 56 degrees and keeps you warm also highly recommended I love this purchase I’ve posted videos and pictures! Thank You!!!!!",
          "Great light weight slim fit bomber. The material isn't all shiny like other bomber jackets. No exterior logos or weird decals. Definitely getting your money's worth with this purchase. Has interior flask pocket that can fit a cell phone with a 6 inch display no problem. It's thin so I don't recommend for extreme cold weather. This is more of a jacket for when you wanna look good and clean. My chest is a size 40 and I'm 6'1. I purchased the large and it fit perfect to my preference. (See attached photos)",
          "I read the reviews and verified the sizing chart which helped. I'm 5'5 160lbs and the large fit me perfectly. The jacket isn't too thin or too thick, but exactly what I was looking for.",
          "I wasn’t sure what to expect with the price that was attached, but am very pleasantly surprised at the quality and fit of this jacket.\nGood length, the arms are long enough to not pull up immediately, the feel is nice and not too shiny like some bomber jackets, and the fit is damn near perfect, the pockets are all useful and spacious.\nAnd it’ll keep you warm which is surprising in itself because it’s pretty thin.\nThe inside has this blue bandanna design which might get me jumped, but you can’t really see it when you wear it anyway, overall for the price this jacket is worth every penny.\nOne nitpick is the zippers are a little flimsy, but it’s $30 so I can live with it.",
          "I'm 5'11\", 180 pounds. Size M fits as expected.",
          "Love the jacket. It's really good. I got a 2X and that really fits really nice on me. Just a little bit of tip if you are trying to zip up the zipper and it gets kind of hard. Just lift up the jacket while you have it on. Just lift it up and then zip it up.",
          "I saw all the reviews from 2018, saying that the sizes run smaller than usual, however, I ordered a Large (I was a large T-Shirt) and the jacket fit me like I'd expect a large jacket to. However, I like my jackets snug, so I would prefer a medium.\n\nMany of the reviews recommend you go a size up, but I don't think that's needed anymore.\n\n4 stars because the zipper is SUPER bright and shiny against the black fabric, and it just LOOKS really cheap. Feels nice, with a bit of warmth. If I'd gotten a medium, and the zipper wasnt to so shiny, I would have been perfectly happy.",
          "I’m 5’11” 170lbs. Ordered a medium. Fits as expected!",
          "Maybe I wasn't observant enough but I seem to have failed at getting the right size and ended up getting a equivalent of an XXL UK size...and I'm a small in the UK. Reviewers have previously warned about this and I thought I had double checked with the size conversion but I don't think it is clear enough. So unfortunately even thought the top is really nice it doesn't fit and the guide isn't user friendly. That or the seller just wants to shift stock.",
          "Im one of those people who never writes reviews but feel i have to on this, thanks to Hermes my order got delivered to someone else and i had no clue as to who had it so i contacted the sellers and straight away they could not be more helpful if they tried they went above and beyond to track down my order and found it with 2 days! It got delivered a few roads away from me luckily the people still had it!the coat is perfect exactly as described could not be happier will definitely be ordering from them again!",
          "Poor quality make and material with a nasty smell when arrived through post. Zippers are cheap and shinny. Returned but they could only offer 50% back as it would cost a lot for shipping from China. So I kept it for donation to the homeless!!",
          "Nice jacket, good feel, solid price. Runs a tiny bit small. I'm normally a large large or small xl, so I opted for xl and it fits like a large. Im 45\" chest and 34\" waist, was a tiny bit snug. Only fault is lack of zips on side pockets.",
          "Ordered a little bigger than i normally do and was still a little too small, great feeling jacket just a shame the size lets it down."
        ]
      }
    },
    {
      "id": "8A8sH6V",
      "title": "London Fog Men's Auburn Zip-Front Golf Jacket (Regular & Big-Tall Sizes)",
      "price": "$29.99",
      "image": "https://m.media-amazon.com/images/I/71oZCnwm8NL._AC_UX385_.jpg",
      "description": "Auburn zip-front golf jacket ( regular & Big-Tall sizes )",
      "reviews": {
        "customerProfileNames": [
          "JoeG",
          "DeWalterWhite",
          "ArtH.",
          "J.Gates",
          "AP.",
          "StephenM.Geraci",
          "CynthiaFisher",
          "antistatist"
        ],
        "customerProfilePictures": [
          "https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif",
          "https://images-na.ssl-images-amazon.com/images/S/amazon-avatars-global/350baaf1-de50-4caf-9da1-98ffed7cd5bb._CR0,130.0,852,852_SX48_.jpg"
        ],
        "customerRatings": [
          "5.0 out of 5 stars",
          "5.0 out of 5 stars",
          "5.0 out of 5 stars",
          "5.0 out of 5 stars",
          "5.0 out of 5 stars",
          "5.0 out of 5 stars",
          "5.0 out of 5 stars",
          "5.0 out of 5 stars"
        ],
        "customerReviewTitles": [
          "It even looks pretty good on little old fat guys.",
          "Say It's Name. London Fog.",
          "Great Fit For My Body Size",
          "Great price for the quality",
          "Perfect But Pay Attention to the Sizing Comments",
          "Great Jacket and great price",
          "Beautiful and Functional Jacket",
          "Extremely Well Made and Washes Well"
        ],
        "customerReviewBodies": [
          " ",
          " I bought this specifically for impersonating the Walter White character. I am a medium to slim build guy, very average body type. This fits perfectly. The color is Camel. Washed and machine dried, no issues. Money well spent for the purpose I wanted it for.\nI'm 6'0\", 180 lbs. I take a 40 Long Sports coat or suit jacket. So you can see how this jacket fits me by comparison.\nUPDATE: Bought my third one, in black this time. Heisenberg - \"Breaking Bass\"",
          "Plenty of good things have already been said about this jacket which I agree with, so I won't bore you by repeating them here. My only concern isn't about the product so much, but about how descriptive reviews concerning the fit often fail to describe the person that's wearing the jacket. To say it's a \"great fit\", \"too long\", \"too tight,\" etc., is worthless unless the reader knows more about the wearer's body. So here goes . . . I bought a Large size jacket. I'm 5'10\", at 202 lbs, and have slightly long arms. (A 34\" sleeve shirt sleeve ends the cuffs near perfectly, about 3/4 inch below my wrist.) I mention this because this Large size jacket also fits my arm length perfectly, which might make the sleeves a smidgen long for men with more average length arms. (Probably not a big deal tho, as the cuff's snaps should stop the sleeves from sliding into your hand.) Believe my shoulder and chest width is about average for my height, and the jacket fits well there too, with some jacket slack. Am happy with the general length of this Large size, but (alas!) I've got a fairly significant gut which makes zipping the jacket a tight fit in that area, so, I'll likely just wear it unzipped, which is rarely a problem in Albuquerque's mostly warm temperatures. Hope this more descriptive info provides some extra help in figuring out the best size for your order. PS - Just have to add that the jacket really is a quality buy for the $$$ and \"free\" returns removes any real sizing anxiety.",
          "I was looking for a lightweight jacket for spring, fall and warmer winter days. I have lived in Boise, Id for 10 years and have not seen below zero yet.\nThe jacket is very well made, no loose stitches or threads hanging out. The style is quite nice, more than just a casual jacket. Very nice attention to detail and finish. It has partial elastic waist bands, shoulder expansion pleats, 7 pockets!!! (3 inside with Velcro closure, (4) outside, 2 with zippers and 2 open for quick access.\nAfter seeing this jacket in person and wearing it, I ordered one in Brown. I have spent money on things that were well below my expectations but, this jacket has far exceeded my expectations. I have included a pic of the inside of the jacket.",
          "First a BIG THANK YOU to all who wrote about the long sleeve length and fuller body fit. I am 6'3\", 230lbs with a 34\" waist and routinely wear an XL. Based on other's comments regarding the sleeves running long, I bought this in Large. It fits perfectly!! Plenty of great pockets, functional and well placed. The extra shoulder flexibility makes arm movement easier. The black I ordered sure looks as black as my other black coats.\nThis is exactly the light weight jacket I was looking for. I thought the price was great and could not be happier with the purchase.",
          "I am really impressed with the value for the money. I know London Fog was always considered high-end and this watch really is well made and looks amazing. The only thing not high-end is the price. I can't believe how inexpensive it is. Back in the day, you would need to take out a loan to afford a London Fog jacket. So happy with it. I'm a short five-six very stock 230 lbs and bought and XXL. Although a little long at the sleeves, that is a problem guys at my height have all the time. Other than that the Jacket fits perfect and I particularly love the snaps at the sleeves so even though they are on the long side, you can't tell. I bought the color black and it looks great.",
          "Bought this jacket for my boyfriend and he loves it. We used to have a London Fog factory close to us and I have always known about the great quality of their outer wear. The jacket is soft and the inside and outside pockets are wonderful. The outside pockets are really two, one is zippered and one is open. Would highly recommend this jacket. My boyfriend is short with short arms. He is also plump and a d XL worked great for him.",
          "The workmanship is quality. The fit is quality. (I am a female who buys Men's jackets and shirts in both small and medium. I purchased this in a medium because I wanted to be sure that it would loosely fit over several layers for early spring, fall and winter.\n\nI like the fact that it has the mesh lining that doesn't catch and drag the garment you are trying to put it over. I wanted something that would also be lightweight over a t-shirt in summer when I go grocery shopping since groceries in the summer feel like a mortuary to me. with air conditioning cold to the point my noise runs. And the pockets are plentiful.\n\nI already own a full length maxi down puffer coat from London Fog that I bought directly from them so I expected the quality to be better than most and was not disappointed.\n\nHighly recommend for a very versatile jacket that will last for many years.",
          "Generous sizing means the XL fits my 44 chest and 6’3” frame perfectly. A very smart looking jacket that feels good quality. 5/5",
          "I bought a medium sized jacket. On paper it’s the right size but this seems huge.",
          "Very smart and good quality",
          "When l recieved this jacket it was in a plastic bag and the jacket had so many creases in it l could not believe the condition of the jacket,very disappointed with this.",
          "The jacket arrived with a seized Zip and was badly creased. The zip broke when tugged really hard and I had to throw the jacket out. Avoid London Fog"
        ]
      }
    },
    {
      "id": "J_rLDvz",
      "title": "Columbia mens Flashback Windbreaker Jacket, Water Resistant Jacket, Black, Large US",
      "price": "$39.96",
      "image": "https://m.media-amazon.com/images/I/61JF7MjG3IL._AC_UX342_.jpg",
      "description": "Defy the wind. The Columbia Men’s Flashback Windbreaker has a sporty feel and a cool color blocking design that makes this water repellent coat ideal for lightweight protection in the elements. Wear as an outer layer for your first line of defense to combat windchill. Great in a wide range of cool weather, lightweight and versatile, you'll grab it for all those in between days. Designed for a modern classic fit with hood, elastic cuffs, and front pockets that allow for comfortable yet sheltered movement. Columbia offers this windbreaker in multiple colors and sizes. Available in extended sizing. Regular Fit. To ensure the size you choose is right, utilize our sizing chart and the following measurement instructions: For the sleeves, start at the center back of your neck and measure across the shoulder and down to the sleeve. If you come up with a partial number, round up to the next even number. For the chest, measure at the fullest part of the chest, under the armpits and over the shoulder blades, keeping the tape measure firm and level.",
      "reviews": {
        "customerProfileNames": [
          "D.Baker",
          "cwesleyg",
          "JackRotan",
          "StephenG.",
          "marceloantonioburgos",
          "BrianG.",
          "KindleCustomer",
          "sandeepPal"
        ],
        "customerProfilePictures": [
          "https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif"
        ],
        "customerRatings": [
          "5.0 out of 5 stars",
          "5.0 out of 5 stars",
          "5.0 out of 5 stars",
          "5.0 out of 5 stars",
          "5.0 out of 5 stars",
          "5.0 out of 5 stars",
          "5.0 out of 5 stars",
          "5.0 out of 5 stars"
        ],
        "customerReviewTitles": [
          "It's a windbreaker not a rain jacket",
          "Recommend",
          "Too Long",
          "Very Satisfied",
          "Espectacular producto y excelente vendedor!!!",
          "",
          "Great for what it is",
          "Great fit",
          "size"
        ],
        "customerReviewBodies": [
          "I see some complaints about it but I think it is great. It is a light windbreaker made for 55 to 60 degree days, if you want something with liner don't buy a windbreaker. My 17 year old son used mine so much that I bought him one.",
          "Obvious high quality. Super light, and still breaks the wind.",
          "The windbreaker is good fit but a little too long for my taste.",
          "Exactly what I wanted. Very light, great fit, looks good, inexpensive.",
          "Espectacular producto y excelente vendedor!!!",
          "",
          "Very thin, won't keep you warm in the wind",
          "Fits Great! On the thinner side",
          "perfect ft, and it small windshied jacket with very thin polyster fabric",
          "I usually get large , but it felt this is a little to small,the zipper is not easy to get on the track and is frustrating when zipping it up.. I have other older wind breakers made by Brooks and are better quality and design.",
          "I'm 65 and have been wearing size L for a very long time. Now with online shopping it seems they're geared for youth sizes not adults. I haven't changed, you have.\n\nDisgusted",
          "Una prenda muy practica para esos días lluviosos , se puede doblar y se vuelve tan compacta que podria caber fácilmente en una bolsa de mano o mochila.",
          "",
          "It’s extremely thin material",
          "Excelente acabado, solo me quedo un poco grande. Compraría otra en color cereza negra",
          ""
        ]
      }
    },
    {
      "id": "DCftrk3",
      "title": "Marmot Men’s PreCip Jacket | Lightweight, Waterproof",
      "price": "$77.01",
      "image": "https://m.media-amazon.com/images/I/910yzuZklGL._AC_UY445_.jpg",
      "description": "The PreCip Jacket is reliable, value-oriented, full-function rainwear for backcountry and urban travelers alike. The PreCip Men's Rain Jacket features Marmot's comfortable and breathable NanoPro waterproofing technology. NanoPro coating is comprised of densely packed pores small enough to keep water droplets from getting in, but big enough to let water vapor out—providing cool, dry comfort even as your activity level increases. The PreCip also features fully taped seams to prevent leaks, an attached hood that rolls up when not in use, and a Driclime chin guard that protects against scratching when the jacket is fully zipped. If interior heat should begin to build up, simply open the Pit zips—zippered ventilation openings under the arms—to increase air flow. Your arms will retain full mobility through it all, thanks to the built-in Angel-Wing Movement. When the weather lets up, you can stuff the entire jacket into its interior pocket and stash it in your pack.\n\nHow to Measure\n\nChest: Measure under the arms and around the fullest part of your chest.\n\nNatural Waist: Measure around the smallest part (the crease where you bend sideways).\n\nHip: Standing with your feet together, measure around the fullest part of your hip.\n\nInseam: Select a pant you like the length of. Start at the crotch seam and measure to the bottom. Round to the nearest 1/2 inch.",
      "reviews": {
        "customerProfileNames": [
          "Robin",
          "MidwestBoomer",
          "NickP.",
          "lord_bow",
          "LX",
          "REV"
        ],
        "customerProfilePictures": [
          "https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif",
          "https://images-na.ssl-images-amazon.com/images/S/amazon-avatars/default._CR0,0,1024,1024_SX48_.png"
        ],
        "customerRatings": [
          "3.0 out of 5 stars",
          "5.0 out of 5 stars",
          "5.0 out of 5 stars",
          "5.0 out of 5 stars",
          "5.0 out of 5 stars",
          "4.0 out of 5 stars"
        ],
        "customerReviewTitles": [
          "One Year Later",
          "Think About Sizing",
          "PreCip great value / Med. vs. Large",
          "Really Good Rain Jacket",
          "From Backcountry to Supermarket, does the trick nicely to keep water out.",
          "Awesome windbreaker that happens to repel water"
        ],
        "customerReviewBodies": [
          "This jacket was great until it wore out in less than a year.\n\nA little background: I work as a bicycle messenger in Minneapolis year-round so I was looking for the lightest, most breathable rain jacket out there. This definitely fits the bill, and while you're still gonna sweat while being active in this jacket, it does better than most at breathing out vapor, so I stayed comfortable.\n\nThe fit of this jacket is interesting. I generally wear US Mens size L shirts for a looser fit. This jacket had a very loose, almost poncho-like fit at the bottom. However the chest was normal and the arms were fitted and tapered down to the cuffs. If you're in between sizes and you have big arms, consider sizing up. Also, it seems they got the hood a little wrong. The visor tends to dip down in front of my eyes. There is no physical support for the visor.\n\nThe way that the hood folds into the collar is very convenient especially for me as a cyclist. The rolled up hood surrounds the neck creating extra warmth.\n\nAnd finally, the wear. I should qualify this by saying that I used this jacket for cold weather cycling many times this winter, in temps as low as -10 degrees ferenheit. I understand that this is not the intended use for the jacket and I should've used a different one. However, I am still disappointed that, less than a year later, the waterproof lining has already worn out. Was this due to the extreme cold? I don't know. But either way I can't justify spending $100 a year for a jacket",
          "My husband is 6'1\" and weighs 195-200 pounds. He wears a large tee shirt, and prefers an XL dress or flannel shirt. He wanted a waterproof shell to wear when walking the dog. We went with this one because it was one of the few that claimed to be waterproof, not just water resistant. We went with a 2XL because he wanted to be able to layer insulating shirts/vests under the shell, and he was more concerned with functionality than with a slim, stylish silhouette.\n\nThis is a great shell that fits well. It's full enough in the torso to allow easy movement and as many layers as he needs, and the sleeves cover his wrists -- usually, his wrists \"stick out.\" The shoulder seams run right along his shoulders, and the shell is long enough to cover most of his butt. There is a draw string on the bottom of the jacket that allows him to cinch it as tightly as he wants, and while the pockets are very lightweight (probably not good for heavy wads of keys) they are adequate for stashing gloves or a wallet.\n\nThe slate gray color is nice and neutral. This is a shell that can be worn in many situations. Well worth the extra $$.",
          "Great value for the price. Light weight, packable, hood stashes in collar, breathable, pit zips nice for extra breathability. Feels sticky on bare arms, when wearing short sleeve shirt.\n\nOriginally ordered large, too big, very full cut in body, I'll use in colder season if I need layers. Ordered med., much better, more fitted, sleeves perfect length. I can wear with a light fleece if needed, a little snug in the neck & forearm with fleece. For reference, I'm 5'9\", 168 lbs., med/large shirt (16-34 dress shirt), 32 waist.",
          "I don't remember where I read about this rain jacket but I went for it because it had good reviews and it was cheaper than most rain jackets. Although it was cheaper, it definitely performed as good as jackets that are double the price. The jacket lasted me trips to 6 different countries and up more than 10 mountains and about 3 rainy seasons. It definitely put in a lot of work and it handled every drop of water like a champion. i can't recommend anything else over this jacket. Get this jacket, you'll be saving yourself money and getting an excellent jacket. The zippers are sturdy and easy to manage. I wasn't a fan of the armpit zippers but they did work when I needed extra ventilation. The elastic chords at the wrists were a perfect touch for keeping water out, and the hoodie did a great job and was easily concealable. Only problem was that I still got kind of wet from all my sweat, as the jacket didn't breath great, but then again, I'm climbing a mountain with it so it's fair.",
          "Lightweight, packable, water resistance to keep you dry in a light rain or medium storm, this is it. Great value for the price.\n\nIf it’s storming heavy, a small jacket like this won’t keep you bone dry. You wear this jacket to prevent getting soaked from a standard rain—it works great but it’s helpful to know what breathability means in the context of rain jackets: you’ll still start sweating if it’s warm outside or if you’re moving around because the same membrane that keeps water out, keeps heat and water in. I’ve seen people rate jackets low for this…that’s literally what you bought the jacket to do!\n\nThe other cool things about the jacket are good adjustability and nice and snug wrists. Plus it has a nice cut that uses just the right amount of material—whereas some jackets have too much extra material floating around and others have too little.",
          "First things first: this is just a rain shell. If you are looking for a jacket that offers any real insulating value, you need to keep looking.\n\nThat said, if what you want is something inexpensive that breaks the wind, sheds the water, and breathes well, look no further. I have tested this Marmot in several Oregon rainstorms without getting a drop inside.\n\nThe fit is designed for people with a pretty average build. For me, the chest and shoulders are a little more snug than I'd like, but if I trade up to an XL the waist will be way too baggy and the arms will be too long. It's acceptable, but if you are a weightlifter you will not be able to fit a thick sweater or fleece under this and still be happy with the fit.\n\nConstruction is a mixed bag. You can't expect much at this price point, and everything works pretty well. Some details aren't confidence inspiring though. The snap at the bottom is too sturdy; I keep expecting the jacket to tear when I open it. The fasteners for the hood drawstring are too tiny and weak; I keep expecting them to break off in my hands, and even if they don't they are hard to manipulate even with bare fingers, much less with gloves.",
          "Lightweight and waterproof, packs down very small, perfect to put in your backpack in case of a downpour. The only thing that stops this being a proper hiking waterproof shell is the lack of a wired hood - the hood tends to sag over your eyes and flaps around in the wind which becomes an annoyance when on the hills. Also the zips are not waterproof although I haven't had any real issues with getting wet in this jacket as a result of this.\n\nI have also lost a couple of things (beanie hat, dog lead) through accidentally putting them into what looks like the internal mesh pockets - these are not pockets, they are open at the bottom!! So anything you inadvertently put in them drops straight out through the coat onto the ground. By the time you've realised your error.... gone.\n\nFor the price it's a good item, but invest in something better (Rab, Paramo, Montane) if you are going to hike seriously with only one shell.",
          "Great jacket. Took it with me to Japan last year and have been using it ever since whenever I go hiking and have to contend with some light rain and the like. Fares fine against moderate hail and snow, too. Packs down very *very* well and also acts as a good cover for your pack if you have to leave it out in the rain while camping and it's really spitting bullets.\n\nOnly qualm is that the DWR coating/etc wore out obscenely fast and didn't work too well to begin with. The first time I used it near-zero in the rain and mist up a mountain, it soaked itself fairly fast, outside-in. Thankfully I can guarantee that it is indeed waterproof: dry as a fresh piece of toast on the inside.\n\nOn another note, do not recommend for extreme amounts of rain or very *very* high wind. The thing will soak through and if your sizing is even a tiny bit off, proceed to flap around as if calling for a second descent of Christ.",
          "It's really light and excellent at keeping you dry, the collar works really well and the hood is even big enough for my gigantic head! The drawstrings on the hood and waist, as well as the cuff straps, work to keep rain out. The pockets are roomy and the whole thing actually looks alright as long as it isn't scrunched up. It's great for sporadic weather as it breathes really easily, so hot spots of sun aren't too much of a bother.\n\nOnly minor gripe might be that in wind it's difficult to keep your face dry, I have to hold the hood peak down a bit. I think that's more because of the size of my head though, as I tend not to use the hood drawstrings too much as they bring the shoulders up and make my upper body look like a tent. Maybe with a smaller head you could do them up tighter to protect your face in the wind.\n\nOther than that though it's a great, lightweight, easily stowed jacket that looks great and works well.",
          "A good quality waterproof jacket that is more stylish than a sports specific shell and that is reasonably packable. Biggest niggle is that it can get a little clammy in warmer weather, however zipped side vents do help. Recommended for normal use, but not for active use on warm and wet days.\n\nPros\nFully waterproof\nGood quality seams and zips and feels like it will last a long time.\nZipped side vents\nGood pockets\nQuite stylish for every day use.\nVery light and packs down to size of grapefruit.\nDoesn’t crease when packed.\nPacks to about size of a grapefruit\nGiven that it is just worn for short periods it is comfortable\n\nCons\nCan get a little clammy if humid and above 19c but ok as long as no strenuous activity is involved.\nThe hood is far too large and obscures visibility. Wearing a baseball cap underneath does stabalise the hood, but it can look a bit weird (I don’t mind, ‘weird’).\nHood can fall protrude from collar when rolled up because there is only 1 central strap.\nNot advisable to be used for sports or moderate activity.\nIt rustles a bit when it is worn.",
          "Nach den vielen überwiegend positiven Berichten habe ich mir die Precip als \"Notfall-Regenjacke\" zugelegt.\nDas bedeutet, das sich sie bei Regen über meine Jacke oder Blazer trage.\n\nPro:\n* Die Größenangabe ist akkurat. Mit 1,76cm bei normaler Statur, kann die Jacke in L als Überjacke verwendet werden.\n* Bündchen sind in Ordnung. Schliessen gut ab.\n* Material ist haptisch ok. Zu abnehmenden Qualität kann ich nichts sagen.\n* Sie ist leicht und normal zu verpacken.\n\nContra:\n* Im Einsatz bei Nieselregen ist sie bei Normalwetter (um 8 bis 14 Grad) ausreichend. Das Wasser wird von außen abgehalten. Wenn man aber Fahrradfahrer ist, dann kann es schwitzwasser geben.\n* Bei Normalregen der länger als eine Viertelstunde andauert sind die Nähte nicht gut abgedichtet. Auch an den Ärmeln kann es feucht werden.\n* Bei stärkerem Regen ist die Jacke sofort durchnässt. Ich erwarte hier nicht Top-Qualität, aber nach weniger als fünf Minuten in man Nass bis auf die Haut.\n\nFazit:\nZwar leicht, passt und gut verstaubar, aber als Regenjacke unbrachbar.",
          ""
        ]
      }
    },
    {
      "id": "SvOFwiX",
      "title": "Essentials Men's Full-Zip Polar Fleece Jacket",
      "price": "$7.64",
      "image": "https://m.media-amazon.com/images/I/81gIg06ortL._AC_UX342_.jpg",
      "description": "Essentials is focused on creating affordable, high-quality, and long-lasting everyday clothing you can rely on. Our line of men’s must-haves includes polo shirts, chino pants, classic-fit shorts, casual button-downs, and crew-neck tees. Our consistent sizing takes the guesswork out of shopping, and each piece is put to the test to maintain the highest standards in quality and comfort.",
      "reviews": {
        "customerProfileNames": [
          "Mowrind",
          "Marty",
          "Raj",
          "M.Hill",
          "forlotto"
        ],
        "customerProfilePictures": [
          "https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif",
          "https://images-na.ssl-images-amazon.com/images/S/amazon-avatars-global/21p09fW70eL._CR0,0,87,87_UX110_.gif",
          "https://images-eu.ssl-images-amazon.com/images/S/amazon-avatars-global/6b5d5e34-a001-4734-85eb-0a8c77928074._CR62,0,375,375_SX48_.jpg"
        ],
        "customerRatings": [
          "2.0 out of 5 stars",
          "5.0 out of 5 stars",
          "5.0 out of 5 stars",
          "5.0 out of 5 stars",
          "3.0 out of 5 stars"
        ],
        "customerReviewTitles": [
          "Comfortable, affordable",
          "Keeps you warm and Toasty in any Condition",
          "Its GOOOD..... here's why...",
          "Essentials Men's Full-Zip Polar Fleece Jacket",
          "Near Perfect but... Ordered 4 2 of 4 Pilling and shedding after two times wearing!"
        ],
        "customerReviewBodies": [
          "Pros: Comfortable, affordable, not undersized. Currently available in tan, which is strangely hard to find in other full zip fleece jackets right now.\nCons: Sheds fuzz like crazy. Makes me doubt its durability, though so far it's holding up. Using Columbia Steens Mountain as a baseline, it's heavier than I expected. A bit too warm indoors. The currently trendy cuffless sleeve design is also an annoyance. I'll willingly pay a bit more for the Columbia next time.\n\nEdit: After two or three wash cycles now, the fuzz ball shedding issue seems to be going away.\nUpdate: a couple of months later, as I feared, visible signs of wear. Elbows are shiny. I have to conclude the product is not a good value even at its well-below-average price.",
          "I've been wearing Polar fleece since the Army place this into their inventory in 2005. Not only does this keep you warm but is so snugly and comfortable when you sleep. I've worn fleece clothing on the coldest and snowy mountain tops of Afghanistan and it has always kept me warm. If you've ever been stationed in Germany during the winter then you know how cold it gets there but with Fleece sweater I didn't even need a Jacket, its perfect for any condition. I prefer Fleece over cotton cause it wont wont absorb the sweat and soak the material and it wont shrink on you. Love me some Fleece!!",
          "If you are in dilemma to buy Columbia fleece or Amzn essential fleece, I will vote for Amzn, I recently tried a Columbia but it kind of looked very unprofessional even for casual wear, the collar didn't stood uptight and the hand pockets were not flush to the jacket and were hanging out a bit. Since this amzn one has a zipper to outer hand pockets they stay snug to your body. This jacket also has two internal pockets for keeping stuff (without zip). All in all it's a bargain to buy at this low price. I love the color, it appears a bit on a lighter shade than displayed but great for dressing up or down.",
          "Medium-weight 100 percent polyester fleece is used to create this simple classic style zip-front jacket. The stand-up collar measures 2 1/2 inches high. Both the garment’s straight bottom hem and sleeve hems are a slim 1/4 inch. And although a casing with elastic is not obvious, both areas respond in a similar way, slightly expanding when pulled.\n\nThe sizing is exactly as expected. The male in residence normally wears a large jacket but wanted to wear this over a sweater on cold but not frigid winter days when layering makes sense. This size-up is definitely one size larger – no more, no less. The jacket is warm and comfortable, and it looks quite good on him. The design is inherently flattering..\n\nBasic construction. The main zipper is a heavy-duty nylon model with a large easy-to-pull metal tab. Two in-seam vertical pockets have a nylon zipper closure so they secure the contents and do not cause the fabric to sag open, helping to neatly maintain the jacket’s silhouette.\n\nThere are two large interior pockets on either side of the zipper that measure 7 1/2 x 11 1/2 inches. They are placed at the mid-point of the front panels extending to the bottom hem edge. These pockets do sag open a bit so they are partially visible when the jacket is un-zipped. This is a minor issue and the additional pocket capacity increases functionality.\n\nThe sewing is excellent with the stitches even with no hanging threads and all interior seams are finished which eliminates raw edges for a neat appearance. There is no hanging loop and there is a sewn-in back label. Fabric care instructions are to machine wash cold with like colors, no bleach, tumble dry on low heat, no iron and no dry cleaning. Basic, handsome easy care jacket.",
          "T",
          "🟥 🟧 🟨 🟩 🟦 🟪 🟫🟥 🟧 🟨\n🚫 TEST E CONSIDERAZIONI: 🚫\n🟥 🟧 🟨 🟩 🟦 🟪 🟫🟥 🟧 🟨\nFelpa acquistata a marzo 2019 e recensisco ora, maggio 2020, a distanza di oltre 1 anno, dopo averla indossata parecchio, specialmente per stare nei dintorni di casa, non essendo elegante, ma davvero molto molto calda e pratica.\n\nLe lampo con cordino permettono di allacciarla e slacciarla al volo, sono davvero toste, sia quella per la chiusura della felpa che quelle delle tasche, sono lampo con chiusura femminile, ovvero al contrario di quella maschile, per intenderci il cursore lo farete scorrere con la mano destra anzichè con quella sinistra come sono abituati gli uomini, ma poco male è questione di abitudine.\n\nLa felpa è in pile, molto comodo, caldo e soffice, tiene davvero caldo in inverno pieno anche con venticello moderato, ovviamente se il vento è consistente l'aria passa, non essendo fatta di materiali wind stop.\n\nRisulta discretamente traspirante, tanto da non mettersi sonovuoto quando la indossate.\n\nIo sono alto 175cm e peso circa 72Kg, ho preso la taglia S e mi calza alla perfezione, stretta ma non troppo, perfetta di maniche. Le tasche con cerniera sono comode e profonde. Non si tratta di un capo alla moda ma adatto a coloro che lavorano e che necessitano di un indumento caldo per l'inverno da mettere magari sotto la giacca per poi poterlo utilizzare da solo in caso la giornata si scaldi leggermente.\n\nSono totalmente soddisfatto, nonostante le finiture non precise anzi, tutt'altro, il proprio dovere lo fa egregiamente, tiene caldo e dopo 1 anno di lavaggi praticamente settimanali è ancora soffice e perfetto, difficile pretendere di più.\n\n🟥 🟧 🟨 🟩 🟦 🟪\n🔹 CONCLUSIONI:🔹\n🟥 🟧 🟨 🟩 🟦 🟪\nAl prezzo di 18 euro a marzo 2019 (attualmente 19,99 euro) è difficile pretendere di più da questo genere di indumenti, non di certo adatti a situazioni eleganti ma pià che altro a situazioni pratiche in cui l'efficacia passa in secondo piano rispetto alla bellezza dell'indumento. Diversi colori disponibili ma il camouflage verde è quello che mi ha colpito di più.\n\nInserisco qualche foto e vi ringrazio per la lettura\nStefano",
          "",
          "Sadly this product was disappointing considering all the positive reviews.\nFirstly the zip fastener stuck and I put it down to being new or perhaps because it was on the LHS, but after numerous tries I decided it was faulty.\nAlso the L size fitted my arms in length and was comfortable but the body was way too small. And that's the problem with buying stuff on line. One man's large is another man's small.\nIt was however lightweight and what I wanted but...................",
          "This may not be the best fleece jacket you will ever own, but it could well be the best value for money. Fleece is a fairly basic material that is reasonably warm, highly breathable and fairly light weight, compared to say wool. However it offers almost no protection against wind or rain so is best suited to being worn as a mid layer.\nThis jacket offers almost no frills e.g. no shoulder or elbow reinforced patches, no 2 way zip and not even a hem cord with cord locks. However most of these features merely add weight and cost and provide very little benefit in the real world.\nUltimately what really matters are decent materials, good quality construction and accurate sizing and happily this jacket is very good when it comes to these criteria.\nOverall this jacket provides good warmth, from a mid weight material, being around twice the weight of a micro fleece fabric. It fits me very well and the slightly elasticated cuffs and hem are sufficient to keep out any draughts. There are two hand warming outer pockets with zips and additionally 2 large inside “poacher” pockets big enough for a Ordnance Survey map but much more likely to be used for a hat or light weight windproof shirt/waterproof smock. The poacher pockets also provide a useful double layer of insulation, like wise the collar also has double thickness of material\nIf worn under a Goretex type jacket you may miraculously find that the jacket suddenly becomes far less leak prone. This is because around 99% of the moisture inside the jacket is not in fact rain coming in, but sweat that cannot get out, but can be managed very effectively by the fleece.",
          "The description for this product reads, 'Everyday made better: we listen to customer feedback and fine-tune every detail to ensure quality, fit, and comfort'. Well if this is true why is it still being sold as a Man's fleece when the zipper is on the Ladies side? There have been enough reviews stating this, so why hasn't this problem been rectified?\nGreat shame, because apart from this annoying problem, it's a great value garment and fits perfectly.",
          "Medium weight fleece. I would say it's a standard fit. I ordered small, and it fits well, with still some extra room in the arms etc.Don't size up in other words. Front zipped pockets are useful although they do add a bit of visible padding in the gut area with the thicker material. If you're concerned with looks, that might be the only issue when it's zipped up."
        ]
      }
    },
    {
      "id": "In-4rlg",
      "title": "adidas Men's Marathon Jacket 3-Stripes",
      "price": "$20.30",
      "image": "https://m.media-amazon.com/images/I/61bPPH5dBsL._AC_UX385_.jpg",
      "description": "Run in classic adidas style. This men's adidas jacket shows off a bold athletic look with a stand-up collar, full zip and 3-Stripes down the sleeves. Zip pockets hold your keys and other small essentials.",
      "reviews": {
        "customerProfileNames": [
          "AndreChotoosingh",
          "A.Lee",
          "KeeganAdriance",
          "KarenM",
          "Tickster17",
          "MichaelSobczyk",
          "Kevin",
          "Customer"
        ],
        "customerProfilePictures": [
          "https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif"
        ],
        "customerRatings": [
          "5.0 out of 5 stars",
          "5.0 out of 5 stars",
          "5.0 out of 5 stars",
          "5.0 out of 5 stars",
          "5.0 out of 5 stars",
          "5.0 out of 5 stars",
          "5.0 out of 5 stars",
          "5.0 out of 5 stars"
        ],
        "customerReviewTitles": [
          "GREAT PURCHASE",
          "Expectations Met!",
          "Shockingly good",
          "Gift for my teen",
          "Orange is practically NEON",
          "Tailored Fit, Sizing as Expected",
          "Truly slim fit!",
          "Chompa adidas",
          ""
        ],
        "customerReviewBodies": [
          "I bought this jacket (actually two of them) for the spring and fall weather. I wanted something light and breathable, yet not bulky. These are perfect. They’re very thin, so you don’t actually get hot, but it blocks the cool air from making you cold when you go from the indoors to outside and you’re still sweaty.\nI especially like them for running on chilly mornings when you start of cool but later, you want to shed a few layers when your core warms up. I can just ball it up in my hand or put it in my pocket and continue my run. The zipper handle is a bit small, but the benefit is that it makes it streamlined.\nThe arm length is a bit longer than normal, but it’s a welcomed length when you reach out or extend your body. You can tell it was deliberately done.\nI’m a litter over 5’10” and I weigh about 190ish right now. I’m not bulky or muscular, but not skinny. This is designed for a slim person, in my opinion.\nWorth the buy, worth the price.",
          "For something with such quality and styling, this Adidas Marathon Jacket is very affordable and would make a great gift for any runner.\n\nOne thing about Adidas athletic apparel, they're sizing has been very inconsistent in recent years. Sometimes I would fit a L, other times I'm a S.\n\nFor this jacket, I fit a M. I'm 5'10\" with a slim build, but wide shoulders. My shirt size is 16-16.5, 34/35.",
          "I purchased this because it was on sale and I really couldn't be more impressed. This jacket fits me better than any other running jacket I own - I have decently long arms and the sleeve length is perfect. The jacket is slimming while still having plenty of room for movement and motion. It's the perfect weight for those chilly spring runs or for use before or after a race. Great purchase!",
          "Fit and comfort are perfect. My son loves this. He is athletic and about 5’8” at about 133 pounds but he has wide shoulders and long arms.",
          "Fits to size and is a good colder weather jacket. I use this when it is around 35/40 degrees outside. Enjoy the color but it is very bright, just be aware. Has been really nice to have on for early morning runs.",
          "It has a nice tailored fit (i.e., it's not too baggy), but isn't too short, which is often the case with the more tailored jackets. I'm 6' tall and 185 lbs and purchased the large, for reference.",
          "This jacket is great! The fit is very slim, which I was overjoyed with. I'm 6'2\", 150lbs and a small fits me perfectly! The jacket rolls up to a very small size too.",
          "Muy bonita pero la talla es más pequeña , normalmente compro talla medium pero me quedo muy estrecha, se debería pedir una talla más grande en mi caso",
          "",
          "Está muy cómoda solo no tiene descripción es talla m",
          "",
          "Prenda ligera cómoda y de moda..",
          "",
          "Pa"
        ]
      }
    },
    {
      "id": "IrPjHTk",
      "title": "Levi's Men's Trucker Jacket",
      "price": "$42.96",
      "image": "https://m.media-amazon.com/images/I/51vsU5xqmuS._AC_UX385_.jpg",
      "description": "The original jean jacket since 1967. A symbol of self-expression for decades, and a great starting point for customization. Gets better over time from natural wear with fading, stains and holes.",
      "reviews": {
        "customerProfileNames": [
          "Max",
          "DevonS.",
          "AlejandraHuggins",
          "Rex",
          "JEM",
          "SarahMelcher",
          "Customer1",
          "Customer1",
          "AmberDowns"
        ],
        "customerProfilePictures": [
          "https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif"
        ],
        "customerRatings": [
          "5.0 out of 5 stars",
          "5.0 out of 5 stars",
          "5.0 out of 5 stars",
          "1.0 out of 5 stars",
          "5.0 out of 5 stars",
          "4.0 out of 5 stars",
          "1.0 out of 5 stars",
          "5.0 out of 5 stars"
        ],
        "customerReviewTitles": [
          "GO WITH YOUR GUT!!",
          "Best Review",
          "Now this is a “Boyfriend” Style Jacket",
          "Size alert",
          "Great Quality, Sizing Different Than Yesteryear",
          "For the ladies, too!",
          "If you have even a tiny bit of muscle consider ordering a size up",
          "Man you Best Buy this jacket"
        ],
        "customerReviewBodies": [
          "Fits perfectly - I purchased a Medium. I’m 180 lbs, 6 feet tall, regular semi athletic build. I can wear it with a hoodie or flannel underneath and it looks great. It’s supposed to be a little snug. I only read two or three reviews that told me to “go with my gut” and hundreds of other reviews that told me to size up to a large. I’m glad I didn’t listen to the masses on this one. I think the disagreement stems from 3 issues:\n- People aren’t sure how these are supposed to fit: the sleeves are supposed to come down to your wrists and the bottom should rest at the top of your waist at your belt line. It should feel snug some areas, or else it loses the edgy look.\n- I think there are lots of muscular guys with huge biceps buying mediums or smalls, OR very large men buying larges. If you have really big biceps, or are just a large person altogether, you may need to size up. If you fall with in typical sizes, go with your typical sizes.\n- Some might be 100% cotton and some have 2% Elasane (spandex); I think the 2% can make a huge difference in how it fits/stretches out. The one I bought was a “stretch” which means it had that 2%. Maybe they all have this? I’m not sure.\n\nIn sum, if you over 6 feet tall and over 180lb, use the sizing chart and *maybe* size up. I’m very happy with mine. Can’t stop wearing it!",
          "If you need to know your size, go to Levi's website and look up your measurements for jackets and it'll be fairly accurate. I'm about 5'10\" 185lbs~ and I went to their website, measured my chest (about 42-43\") and my waist (about 33\") and it said to get medium, so I bought a medium and the fit is nearly perfect. If you want a baggier jacket, I recommend going up a size from what it tells you, but if you're like me and want a slimmer fitting jacket, the measurements should be pretty accurate. If you do go with the slimmer fit and you want to wear a hoodie underneath the jacket, just know that it'll be pretty snug. But for wearing with just a normal shirt, it'll be great. Now onto the actual jacket. Everything is great about it except for two small things. 1. The sleeves are just a tad bit too long for me, but it's not bad. 2. There were some random wear marks in the jacket. Also, not a big deal. So far, I love it and I recommend it.",
          "I was looking for an oversized jacket to wear with certain outfits - this time to wear over a hockey jersey. Most “boyfriend” style clothes made for women aren’t really that oversized so I’ve given up and this was my first attempt at ordering a men’s jacket online and hoping it’d fit just right. Luckily it did! I’m 5’8, 150lbs and I purchased a medium. It had just the right amount of bagginess I wanted and it perfected the outfit I had envisioned. Very happy!",
          "Very disappointed with the sizing on this jacket. I normally order a 2 extra large tall in jackets and shirts. This item did not have that size to select from but it did have a 3 xl so my thinking was that it would probably work. It turned out to not even be close. The sleeves are too short and too small in diameter, the jacket is too short, the shoulders are too narrow and the jacket will not button. It's undersized in every aspect. I'm guessing that it probably would work well if a person wore a large/extra large but certainly not any larger than that. The tag in the jacket says 3 extra large, but it most assuredly is not.",
          "The quality of the jacket is incredible, but if you've become accustomed to the sizing of decades past, you need to order per the new recommendations. Whereas I would have ordered an extra small ten years ago, I had to order a Medium in this fit, and it is still a bit snug. I'm 5'-7\" with broad shoulders, curl 50's, and have a 33\" waist. I mention the curling weights only to warn that if you have thicker arms, or curl more than 50's single-handed -- your arms will be hard pressed to fit in this jacket. It's a modern, slim fit, and stretches slightly with wear, but it is also very unforgiving. I ordered XS, and S, before finding that M fit properly though slightly snug.",
          "I bought a men's jacket so I'd be able to layer, and to have a longer cut. The ladies jackets seem to be cut really short and are very fitted. I'm 145lbs 5'7\" with wide hips and a small fits pretty well, considering it's a men's cut. It has the loose fit I was aiming for but it is pretty tight in the hips. I usually wear a size 6 bottoms, and I can't button the bottom two buttons. I don't mind it though, because I don't plan to ever wear it buttoned up. I'm very narrow in the shoulders, so the breast of the jacket and the arm holes are a little large. Again, not bothered, because it will give me room to put a Hoodie under it in cooler weather. This is straight up classic denim, so there's no stretch, but it's also not too stiff. It's just right.",
          "B",
          "Absolutely love this jacket. It’s my second one. Good for mild days and on cold days, you can add a sweater. Sleeves roll up nice. Inside pockets are to die for, you can store so many sweet items in inside pockets. Man....this jacket sets the bar for light weight rugged jackets. I’m about 5’8 160 super average size dude and large fits perfect.",
          "Absolutely love this jacket. The fit is as expected and has two deep inside pockets.\nThe denim is rigid and of very high quality - unfortunately rigid 501 jeans in the UK are titled classic/vintage and cost upwards of £130.00. I therefore order mind direct from the USA - Rocky Mountain Connection in Colorado offer excellent service.",
          "As expected from Levi a great looking hybrid that attracts attention and comments\nfantastic idea",
          "Too big!",
          "Happy with the jacket Bot Happy to have to pay import duty of 25%!!!",
          "Not an original jacket, stretch denim rubbish was expecting more value for my money money."
        ]
      }
    },
    {
      "id": "8c6KxEu",
      "title": "Essentials Men's Quarter-Zip Polar Fleece Jacket",
      "price": "$5.69",
      "image": "https://m.media-amazon.com/images/I/811gGQfS7lL._AC_UX342_.jpg",
      "description": "Essentials is focused on creating affordable, high-quality, and long-lasting everyday clothing you can rely on. Our line of men’s must-haves includes polo shirts, chino pants, classic-fit shorts, casual button-downs, and crew-neck tees. Our consistent sizing takes the guesswork out of shopping, and each piece is put to the test to maintain the highest standards in quality and comfort.",
      "reviews": {
        "customerProfileNames": [
          "IaninSeattle",
          "Tex",
          "Pete",
          "MattBrown",
          "Efren",
          "johnh",
          "adamyaw",
          "ccgirl"
        ],
        "customerProfilePictures": [
          "https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif",
          "https://images-na.ssl-images-amazon.com/images/S/amazon-avatars-global/20e99203-6a3b-4b82-91af-98c7f4f428a5._CR0,0,960,960_SX48_.jpg"
        ],
        "customerRatings": [
          "5.0 out of 5 stars",
          "5.0 out of 5 stars",
          "5.0 out of 5 stars",
          "4.0 out of 5 stars",
          "5.0 out of 5 stars",
          "5.0 out of 5 stars",
          "5.0 out of 5 stars",
          "5.0 out of 5 stars"
        ],
        "customerReviewTitles": [
          "Nicer than I expected",
          "Awesome punchy pullover!",
          "Great Product",
          "pretty good for price",
          "Basic essential and very toasty",
          "Runs on the small side",
          "Very soft And very warm!! Price point is the icing on the cake",
          "My husband loves it!"
        ],
        "customerReviewBodies": [
          "I bought one thinking I'd return it but it turned out to be a pleasant surprise. The fabric is on the thinner side (without being too thin) and feels good to the touch. Medium fits me well. I'll update this review if this thing dissolved in the washer, but for now I am quite pleased.\n\nUpdate: it holds up to washing",
          "If you like punchy western clothes you will love this for a casual look. My son wears it with his western jeans and boots. He is college student and punchy style is really popular. Plus, it’s really soft and the price is great.\n\nUpdate: this washes so well too. After washing it stays really soft and most importantly it doesn’t get fuzzy!\nMy son has the solid black one too. These are great fleece pullovers.\n\nLet 👇 me know if this review was helpful . ❤️",
          "I",
          "It's a good sweater for the price. There are few things I don't like about it, but my dislikes are mostly style. I'll put up with my dislikes for the price.\n\nThe front pouch pocket is not ideal for me. I'd rather have a breast pocket. Being able to warm my hands in the pouch is good, but having a convenient place for my phone would be better.\n\nOverall, the fit is as expected for me. I tend to be a bit skinny and lanky. On me the shoulders are good, body length is good, arm length is good. However, I think the arms fit a little snug. Snug arms are good for layering under an outer shell, but again I'm a bit of a twig. The cut of the arms might not bode well for someone with thick forearms. I push my cuffs up as I warm, and that's hard for me to do in this sweater.",
          "T",
          "Quality of product seems to be good.But if you plan on layering under it go 1size larger.I'm 5'9\" 185 pounds,wear a 42-44 jacket and it was tight.Gave it to my son. Update I ordered an xl fits perfect.But now i see why people are complaining about pocket sagging and bunching up.Since I don't use the pockets anyhow I just cut it out,problem solved LOL. Pockets could use redesigned.\n\ni",
          "Very soft fleece!! As soft as any of my northface fleece. Got a few styles to wear for work as a layer over my Under Armour base layer so it will breathe and keep me dry all day. I’m a Carpenter and always in and out of the houses I’m in so getting sweaty means you’re going to get cold in upstate NY!! For the price I think they are awesome!! Will it last as long as one that’s 3-4x the money ....... no clue...... but for a work shirt layer that does exactly what I want with a $17 price tag...... HELLZ YEAH\nHas more of a 1/2 size big feel BC it’s a jacket not a shirt but I wear it as a shirt. I wear a large and this in large allows me to wear a layer under it and still be comfy. If you want a tighter form fit vs a loose jacket fit you’ll want to round down a size",
          "We have mild winters, so my husband owns a lot of quarter-zips. He likes to wear them over a short-sleeved tee in case he gets hot later in the day. He has some nicer ones from Criquet and Orvis, and then a couple of athletic ones from Under Armour and Columbia, so I was hoping this one would match the quality he likes--thankfully, it did. He says it's soft and comfortable, and he likes having a variety of weights with these shirts and sweaters. I asked him if the pockets bothered him as some other men have mentioned, and he says they're fine. I bought him a large, which is true to size for him (he's about 5'10, average build). Great purchase!",
          "Not yet decided if they are cheap and cheerful or cheap and nasty, they are not really warm or comfortable enough for lounging around indoors but I'll find some use for them,",
          "Delighted with this product ,really good fight and so comfortable to wear .Excellent value for money .I purchased another one in a different colour perfect for the dog walks ,",
          "General lounging about, as a warm layer for dog walking, and as a general mid layer for activities . Super quality, better than some I have paid 4 times the price for. Well made , good fit and shape, very warm . Cannot fault the quality, very warm, size and fit is really good for activities",
          "I'm really delighted with this fleece. For the price I was expecting some compromise but it's actually very well made from really good materials. There are three zipped pockets and the material around your shoulders and neck is shower proof I would think. What an absolute bargain.",
          "I like this a lot.. Thicker than a normal fleece so warm enough to wear outside on its own. Has a 'hoodie' type through pocket. Nice finish to bottom and sleeves and a firm collar makes this the perfect winter accessory"
        ]
      }
    },
    {
      "id": "bGmYw6l",
      "title": "Wrangler Authentics Men's Long Sleeve Sherpa Lined Shirt Jacket",
      "price": "$24.36",
      "image": "https://m.media-amazon.com/images/I/81IQ4i6NdyL._AC_UY445_.jpg",
      "description": "Wrangler Authentics Men's Sherpa Lined Denim Shirt. Built to keep you warm and comfortable during those cold nights. This versatile shirt jacket is extremely functional and can be worn on many different occasions. Stay warm in this sherpa lined denim shirt all winter long.",
      "reviews": {
        "customerProfileNames": [
          "JohnWellsburg",
          "Ghennel",
          "PaulJohnTautkus",
          "A.Dobrynin",
          "Bartab",
          "Krummy",
          "Rachel",
          "Brenna"
        ],
        "customerProfilePictures": [
          "https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif",
          "https://images-na.ssl-images-amazon.com/images/S/amazon-avatars-global/45316e04-b667-4396-b1c1-a920b5a18c88._CR62,0,375,375_SX48_.jpg",
          "https://images-na.ssl-images-amazon.com/images/S/amazon-avatars-global/c89a235a-65ae-43f5-a88b-e32c0862f882._CR0,26.0,281,281_SX48_.jpg",
          "https://images-na.ssl-images-amazon.com/images/S/amazon-avatars-global/cee5ad50-ca37-4c7e-8999-e78bd6d5bf35._CR0,0,264,264_SX48_.jpg"
        ],
        "customerRatings": [
          "5.0 out of 5 stars",
          "5.0 out of 5 stars",
          "5.0 out of 5 stars",
          "5.0 out of 5 stars",
          "3.0 out of 5 stars",
          "5.0 out of 5 stars",
          "5.0 out of 5 stars",
          "5.0 out of 5 stars"
        ],
        "customerReviewTitles": [
          "Perfect flannels for me!",
          "Warm and well made!",
          "Not as bulky as the photos, but still awesome",
          "The very best insulated shirt IMO",
          "Runs big and just missed the mark on quality.",
          "Good value",
          "My favorite",
          "Love it!"
        ],
        "customerReviewBodies": [
          "The borg-lining is very soft and warm.\nThe sleeves have inner-lining.\nThe colors and design are beautiful! Very traditional as I like it! So I bought 3 different ones.\n\nLet me give it up for Wrangler!!!",
          "I am a female and I was looking for a lined, warm, well made flannel shirt. Since it is cut for a man, it fits me loose, longer and more boxy. However that is what I was looking for since I am using it as a fall jacket. The lining is soft and is what makes this shirt useful as a jacket. I am very happy with my purchase and am going to get another one in a different color. It will also come in handy when winter comes.",
          "Not as bulky as it looks in the photos.\nI wore it under a denim jacket recently so I could have insulation while still having the look and it works well.\nJust ordered another in plain charcoal.\nThe lining isn’t super bulky, but enough to feel the difference when out in the elements.\nThe sleeves are quilted lined and aren’t too short or too long.\nThe side pockets are nice, but not big enough for something like an iPhone.\nAnother review said something about the collar being flimsy, they are correct. It isn’t a super sturdy shirt collar, but if you’re okay with that, then you’re fine.",
          "I bought another Wrangler Sherpa Lined shirt in Denim color, and it was so nice, I bought this one in the plaid pattern. It is just as nice and comfortable as the first one I bought. I wear them everyday at home during the cold months with sweat pants, which gives me the ability to turn down my thermostat to 65 degrees and stay perfectly comfortable and save a bunch on my heating bill, and so the shirts have actually paid for themselves. Also, it's nice to be able to go out to the mailbox without having to put on a winter jacket for only a couple minutes use. And going from the house to car to go shopping, there's no need for a winter coat either. They've gone through several washings and are holding up quite well. I highly recommend them.",
          "I’m 6’ 250lbs with a bit of a belly and the XXL was HUGE. The sleeves are very bulky and puffy. The wrist opening, however, has to be unbuttoned to allow enough room for your hand to get through — pretty odd for a shirt-jacket... The front of the shirt is oddly short. The side pockets are very shallow and do not have any droop so nothing would stay in there. The pattern on the front pockets is asymmetrical showing little care for quality. Pretty much the only good thing that I can say is that the lining is nice and soft. Really disappointed.",
          "Fits a little bigger than I thought it would. I have other wrangler items that I wear a large and this was a little bigger. I love the Sherpa lined flannel, but the sleeves are the quilted material. I do wish the whole thing had the same lining but for the price I can't complain. It's really warm and I wear it a lot.",
          "I’m 5’7 142 lbs and I ordered a medium. Seems pretty true to size for men’s sizing. The sherpa lining is so soft and warm. My favorite lazy day flannel.",
          "Great jacket for my boyfriend! He is 6’4, 250 pounds.",
          "The product was as described. I’d already read some reviews that mentioned the lining in the sleeves and pockets that were not Sherpa, but polyester. And that the sleeve buttons quite tight but it’s no problem. The seller delivered the product earlier than expected, with a nice note and piece of candy. Would order from again.",
          "Really disappoint with the fit. But did the job great. Lightweight yet very warm. I sold it on e bay at a loss.",
          "Why can't a company put the Sherpa lining all the way through the sleeves. It's like no one has ever told them the nylon quilted crap collects sweat and moisture and does an all round crap job of keeping arms warm. Also this jacket/sweater could stand to be thicker.",
          "This Jacket is especially good for me for when I use my mobility scooter or power wheel chair as the weather has turned quite chilly of late, this gives me an extra layer of comfort now. Having smooth cloth lining the arms as it's much easier to put on. Ernie L",
          "Los productos enviados de EU se realiza los cargos despues de días de haber hecho el pedido, con horario de madrugada , los bancos los detecta como movimientos fraudulentos. Así que se retrasaron 3 sem por problemas de autorización.\nLa talla es muy amplia.\nNo tiene forro polar en las mangas , la tela es de poliéster, en mi gusto no es cómodo .",
          ""
        ]
      }
    },
    {
      "id": "kABv0rH",
      "title": "Columbia Men's Ascender Softshell Jacket",
      "price": "$54.57",
      "image": "https://m.media-amazon.com/images/I/51SIYBu+RsL._AC_UX342_.jpg",
      "description": "Columbia Men's Size Chart Sure, you can learn about nature and the great outdoors on television, or you can throw on the Ascender™ Softshell Jacket, get in the field, crawl into a woodchuck hole, and get the knowledge firsthand! Modern classic fit is relaxed, but not sloppy, and perfect for everyday activities. Bonded softshell delivers wind- and water-resistant protection. Stand collar extends protection. Full-zip front closure with chin-saving zipper garage and interior wind flap. Long sleeves sport hook-and-loop adjustable tabs. Napoleon zip pocket and embroidered brand mark at left chest. Zip hand warmer pockets. Drawcord hem for a dialed-in fit. 100% polyester. Machine wash cold, tumble dry low. Imported. Measurements: Length: 28 in Sleeve Length: 36 in Product measurements were taken using size MD. Please note that measurements may vary by size.",
      "reviews": {
        "customerProfileNames": [],
        "customerProfilePictures": [],
        "customerRatings": [],
        "customerReviewTitles": [],
        "customerReviewBodies": []
      }
    },
    {
      "id": "zDVFqwj",
      "title": "Columbia Men's Buck Butte Insulated Hooded Jacket",
      "price": "$58.30",
      "image": "https://m.media-amazon.com/images/I/81M7WAYr9uL._AC_UX342_.jpg",
      "description": "When you live in a cold damp climate, finding a warm, comfortable, and water-resistant jacket is part of life. If you've been searching for a professionally designed and engineered men’s jacket, Columbia offers this superior solution. The Columbia Buck Butte Insulated Hooded Jacket is made for men with a modern active fit. It features our Shadow Ripstop nylon shell and incorporates premium synthetic down insulation. This coat provides comfy dry reprieve in most any environment. The adjustable hood is paramount in extreme winters, while the chin guard provides a nice touch of comfort. This water-repellent fabric and synthetic down is thoughtfully integrated into the coat and has been engineered with a series of features and baffles to improve overall usability and comfort. Includes an interior security pocket, two zippered hand pockets, elastic cuffs, and a drawcord adjusable hem. Available in a wide range of colors and sizes for men. Active Fit. To ensure the perfect fit, follow these steps for measuring and refer to the size chart. To determine the neck size, measure at the base or thickest part of your neck. For the sleeves, start at the center back of your neck and measure across the shoulder and down to the wrist. Round up to the next even number. For the chest, measure at the fullest part of the chest, under the armpits and over the shoulder blades, keeping the tape measure firm and level.",
      "reviews": {
        "customerProfileNames": [
          "MichelleJ.",
          "Kman",
          "Kiwi",
          "book_junkie94",
          "A.StevenToby",
          "WillFoti",
          "Boris",
          "Customer"
        ],
        "customerProfilePictures": [
          "https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif"
        ],
        "customerRatings": [
          "5.0 out of 5 stars",
          "3.0 out of 5 stars",
          "5.0 out of 5 stars",
          "5.0 out of 5 stars",
          "4.0 out of 5 stars",
          "5.0 out of 5 stars",
          "5.0 out of 5 stars",
          "5.0 out of 5 stars"
        ],
        "customerReviewTitles": [
          "Perfect for my son!",
          "Wanted to love it, but quality wasn't there",
          "Logo",
          "Great for Winter!",
          "It's lots warmer than you expect!",
          "Love it!",
          "Muy cómodo, liviano y protege muy bien contra el frío",
          "",
          "Love this puffy!"
        ],
        "customerReviewBodies": [
          "My son is 5'8\" and has an athletic build - thin with broad shoulders and a long torso. He wanted something that would be warm enough for the short walk to school in Iowa winter weather but not overly heavy/bulky; not constricting across his shoulders; long enough for his torso; and that he could comfortably wear a hoodie under. I bought him a medium and it fit him well. Without a hoodie or sweatshirt on, it is a little loose through the torso however, the drawstring at the bottom hem of the coat lets him adjust the coat to a comfortable fit. He is one of those kids that does not like to wear winter coats but he has worn this one without me having to fight him to put it on! :)",
          "I've been a distant fan of Columbia - distant b/c I typically think of their products (shoes mostly) a bit outside my price range comfort level. So when I saw this jacket at this price, I jumped on it. I was disappointed to find that it didn't keep me warm. Although being a native of the northeast all my life, I've never liked the winter, and hate being cold. So I was hoping this would help. Even in 30+ degree weather, this was not working well for me. But what really pushed me over the edge (ie returned it) was that the pockets are sown such that wind flies right up and into them. So my hands were even colder than normal. I read after this experience that Columbia has lately pushed out more products at lower prices that don't quite meet consumers' past expectations in terms of build quality. I would say that's the case in this coat. OK - but not for this price. I'd say this is more of a $40-50 coat in terms of quality and warmth-factor.",
          "Columbia logo does peel, it’s lifting already I got this coat in November. Otherwise water resistant is solid isn’t too heavy.",
          "I bought this coat as a gift for my husband as he didn’t have a really good cold-weather jacket. He didn’t like the one he had because it was too chunky and bulky, and he absolutely LOVES this one! It’s light, washable, and he really likes the blue accent on the black fabric. For someone as picky as he is, this was a fantastic buy :) I HIGHLY recommend!",
          "My ratty old ski jacket from 1990 was obviously in need of replacement so I bought this. When I opened it up and tried it on I was disappointed -- it was so light and thin I didn't really believe it would be effective, but since it fit, I didn't send it back and then a cold day came and I decided to try it outdoors. Well, it is quite warm. As warm as the old ski jacket used to be and it had real down (this jacket is \"insulated\" but it uses synthetic, imitation down.) I'm not sure I have as free motion as I did with the old jacket but then again I'm too old for the slopes now, I just want to be comfortable outdoors. And the hood, which I didn't think was important when ordering, turns out to be very effective too at keeping my head warm, although the hood tends to fall down over my face and reduce my field of vision. These are minor drawbacks. The biggest negative is the slick, plasticky surface that feels unpleasant where it touches my skin (wear a hat under the hood and a scarf around your neck, but thin ones because the jacket does the insulation job without any help). The variety and large size of the pockets are other big advantages -- you'll be carrying thick gloves in those pockets, maybe a balaclava, maybe a smartphone.\nI tried the jacket when it was 34 degrees F outside. Will it still be effective in 20? I guess I'll find out.",
          "Great fit, nice style and super warm!!! I bought a North Face down jacket similar wanting a nice warm jacket. It gave me itchy dry eyes and come to find out I am allergic to down. This was the perfect alternative without compromising heat, comfort, or quality...100% recommend this jacket!!",
          "Para el invierno en New York",
          "",
          "I’m a bit of a jacket nerd, and this one definitely is worth every penny. Warm, light, fits perfectly, attractive. Super happy with it...and you would be too.",
          "I usually size S - M for jackets\nI bought the S size and it was like an XL\nSent back, they don't have smaller",
          "Great quality jacket with quality finishing and of course, nice and warm.",
          "Smart and Comfortable Jacket. Good value for money, pleased with this purchase! A+",
          "gud fit and really comfortable. it keeps you warm as well.",
          "I am 220 lbs and 180cm.\nNice fall or mild winter jacket. I purchased on sale for $54 Cdn, worth every penny.\nIf you plan on using as your main winter jacket, make sure you wear a sweater as well. I was outside in -5c with -14c wind chill and not being active, I could feel the cool air (maybe due to sizing. I normally wear XL but ordered XXL). Wearing the jacket walking in -5C with -11C windchill it was okay, kept me warm. If there isn't a strong wind chill this jacket would be suitable. I can confidently say this would be an awesome mild winter -5c & above or a fall jacket. The hood is a good size for a hat and there are 2 large and 2 small inner pockets. The outer hand pockets are lined and quite warm."
        ]
      }
    },
    {
      "id": "EmGsl1a",
      "title": "DRI Duck Men's Cheyenne Jacket",
      "price": "$56.44",
      "image": "https://m.media-amazon.com/images/I/71+NpqpwRyL._AC_UX342_.jpg",
      "description": "Our very popular standard, full metal zipper, men's workwear casual jacket. Made with our heavy duty 12 oz. 100% cotton quarry washed Boulder cloth canvas for long wearing and our diamond brushed tricot lining for movement and comfort. Small=34-36 Chest; Medium=38-40 Chest; Large=42-44 Chest; X-Large=46-48 Chest; XX-Large=50-52 Chest; XXX-Large=54-56 Chest; 4X-Large=58-60 Chest; 5X-Large=62-64 Chest; 6X-Large=66-68 Chest",
      "reviews": {
        "customerProfileNames": [
          "Uplander",
          "S.Campbell",
          "JasonH",
          "D.Willis",
          "EP",
          "Rahim"
        ],
        "customerProfilePictures": [
          "https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif",
          "https://images-na.ssl-images-amazon.com/images/S/amazon-avatars-global/8c1525cd-4c1b-4378-a471-f68f32beac4f._CR121,0,257,257_SX48_.jpg"
        ],
        "customerRatings": [
          "5.0 out of 5 stars",
          "5.0 out of 5 stars",
          "5.0 out of 5 stars",
          "5.0 out of 5 stars",
          "5.0 out of 5 stars",
          "5.0 out of 5 stars"
        ],
        "customerReviewTitles": [
          "Reminiscent of the good ole carhartt jackets",
          "Excellent coat/hoodie for the cold!",
          "Honest coat for a honest price.",
          "Awesome Jacket.",
          "Stop looking with this jacket! You won't find better.",
          "Navy color jacket fits like a Dickies XL Sanded jacket! And like a size L in Carhartt hooded jackets"
        ],
        "customerReviewBodies": [
          "S",
          "I love this coat/hoodie. I added my own patriotic patches to the arms and I love it. It’s a fantastic coat for the winter. I’ve found myself sweating in it 40 degree weather when being very active. As of today it’s 21 degrees outside and it keep me warm perfectly. The material is just like that of a Dickies coat. The pockets are fine. They aren’t insulated in the front but that doesn’t bother me. I tried quite a few jacket/coats and this one is fantastic. I highly recommend it.",
          "After months of research. This outdoor coat was the winner for me. After considering the price and amount of time that I will be spending outside. I decided to purchase this coat. This coat is definitely not for stylish wear. It’s bulky but the interior fabric feels very comfortable. I’m 5.7 and 145 lbs. the medium fits a little loose. Enough room for a hoody or any vest to wear inside. There is enough room around the pit area that the whole jacket doesn’t ride up if you lift your arms up. Definitely a plus on that. Overall the coat isn’t for extréme cold but for a decent cold weather it will do justice. I tested the coat under rain yesterday and it does have some kind of water resistance. The inside was not wet and it dried up faster under a heater. Not sure how well it will hold up under big rainstorm. The wrist balls up lot of lints after a week. That’s a minor issue for me.",
          "Ordered in field khaki color and love it. XL fits perfect for me at 5'11\" 250lbs. The jacket has elastic around the waist and wrists so it's comfortable to wear while working. Also has an inner pocket for a smartphone or gloves, etc. Feels like it would be good for weather as low as 15-20 degrees. Below that, you might want to wear a hoodie underneath.",
          "My husband said if he could he would rate this a 10 star for water resistance, comfort and warmth. He has had the jacket for 3 1/2 years now (since oct. 2016) and it has held up like no other. He works 40 hours a week at a major tree company and it has held up through it all. He is from Florida and moved here to Kentucky about 10 years ago. Usually he starts avoiding the outdoors when it hits 40° but last year he worked in negative temps in this jacket and said it kept him warm enough to get through the day without any issues. It gets used daily in brush, with chainsaws and all of the other hazards and is still going strong. I just recently had to do a little sewing around the wrist area for a few holes starting but otherwise its in amazing condition.\nWe are buying a second one today because he has become so much broader since this purchase but I imagine he will be keeping his old one as well. Well worth 2x what we paid for it.",
          "Rugged weighty jacket! At 5'10\" 240 XL regular length fits right on the money, not too short and not too long! Included size chart for these jackets from Dri Duck website! Numbers on chart equate to circumference around the chest and back in inches.",
          "La lona más fuerte que he visto, 100% antidesgarre. Esta chamarra no se acaba en una vida, esta excelente para trabajo y caminatas en terrenos muy difíciles y accidentados. El ajuste es correcto, mido 1.80 y 90 Kg, pedí talla grande.",
          "",
          "Eine sehr schöne, robuste und wärmende Jacke. Habe ich mir in Schwarz für die Arbeit gekauft. Jetzt habe ich mir noch eine zweite Jacke in Blau für Haus, Hof und Garten bestellt.\nNachtrag:\nHabe jetzt auch die zweite Jacke und bin damit voll zufrieden.",
          "",
          "well nice jacket turned out to be to big on me. I bought a pioneer jacket in same size it was much smaller then this one. so if you buy this jacket buy the right size. if you buy pioneer jacket you need to buy 3 sizes bigger still mite be to small unless you built like body builder",
          "My husband really likes this jacket! A little lighter in weight then i expected- compared it to a similar jacket weight I ordered from here last year.",
          "This jacket is perfect for me. I tend to be hard on my clothes this jacket is very tough for half the price of their competitors. I would definitely recommend."
        ]
      }
    },
    {
      "id": "XoOjpSg",
      "title": "Cherokee Men Scrubs Jacket Workwear Revolution Zip Front WW320",
      "price": "$32.98",
      "image": "https://m.media-amazon.com/images/I/61XwlJRYv9L._AC_UY445_.jpg",
      "description": "78% Polyester, 20% Rayon, 2% Spandex\nImported\nZipper closure\nMachine Wash\nMen Collar\nLong Sleeve Jacket\nBack Length: 27\"\nPatch Pockets, Sleeve Zip Pocket, Chest Pocket, Cell Phone Pocket, Welt Pocket",
      "reviews": {
        "customerProfileNames": [
          "Paul",
          "ChrisFarasopoulos",
          "Juliet",
          "RyanThompson",
          "R.Kennedy",
          "AlY",
          "KarenHarrington",
          "Bonbon"
        ],
        "customerProfilePictures": [
          "https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif"
        ],
        "customerRatings": [
          "5.0 out of 5 stars",
          "5.0 out of 5 stars",
          "5.0 out of 5 stars",
          "5.0 out of 5 stars",
          "5.0 out of 5 stars",
          "5.0 out of 5 stars",
          "5.0 out of 5 stars",
          "5.0 out of 5 stars"
        ],
        "customerReviewTitles": [
          "IDK what y’all complaining",
          "I wear this jacket pretty much daily!",
          "Comfy light scrub jacket",
          "A Nice warm jacket that compliment your scrubs.",
          "Sleeve length is perfect",
          "Love it.",
          "Very handy and look classy.",
          "Style"
        ],
        "customerReviewBodies": [
          "The jacket is lightweight and material is flexible so I can easily move around while doing lab works. Very professional looking, fits perfectly, and no defects like what the others were saying. Medium size fits perfect for me. I am 5’4 and 165lbs short and little bulky and it fits perfect for me.",
          "I work in medicine and having a scrub jacket is a must (3 pockets?? Come on; how could you say no?). I wear this jacket pretty much daily and it is comfortable, breathable, and keeps me at the perfect temp. The zippers are also pretty “hidden” so they don’t bother the materials I work with. I have it in blue and white and I love both of them. If you need a scrub jacket, get this one for sure.",
          "I have this jacket in both the medium and large. I purchased the large a second time. I normally wear a medium, but if I wear a long sleeve under it, I wanted to still be able to pull back my sleeves and I couldn't with the medium jacket. Fits like a large t shirt would, not really stretchy but comfortable. Material washes well. And if you like having extra pockets this is great for that.",
          "It a nice jacket for them cold night shift. I love it",
          "This is a great jacket. It matches the color of my scrubs and it adds some warmth during my shift. I work nights in ICU and it does exactly what I want it to. I am 6'2\" and 220. I have long arms as you would expect and the hardest part about finding a jacket that fits is the sleeve length. I was very happy that this fit. it stays at my wrist with the raise arms and bend the elbow test. I will be ordering another.",
          "As a male nurse, our scrub selection is very limited. However, this one fit right, with all the pockets that I need for my clinical supplies. Perfect on the go if you are a bedside nurse or a home health nurse. I actually wear this to my vacation because of all the pockets and the light weight. You can't really tell it's a scrub jacket.",
          "This jacket is perfect. I like these versus a blazer. They’re lighter and can be worn for most of the year where I live (too hot in the summertime).",
          "Very good looking jacket, just what I was looking for",
          "La marca Cherokee es de las mejores para indumentaria de trabajo para el personal de salud y este producto no es la excepción! Excelente calidad de la tela, la talla es la adecuada, el color firme y acabados de primera. Espero poder adquirir al menos otro color del mismo modelo en otro color! Peso 73Kg y mido 168cms , la talla S me quedó perfecta.",
          "",
          "Es de buen material, varios bolsillos. Elijan de la misma talla que usan las filipinas. Yo uso ropa extra grande pero tanto las filipinas cómo está chamarra de la misma marca las pedí una talla menor, es decir: grande y me queda bien",
          "",
          "Pedí la pequeña (s) , y me quedo bastante bien. Se siente cómoda. Esta delgada la tela pero se siente bastante cómoda. Mido 1.64, peso 66 kg.",
          "",
          "Compre esta chamarra para obsequio, elegí talla grande y le quedo a la perfección a la persona. Es ligera y muy linda.",
          "",
          "Buen producto, yo soy pequeño mido 1.56 y la talla extra chica me quedo perfecta, mis amigos que miden entre 1.60 y 1.75 la. Chica les quedó bien tomen precauciones porque puede venir un poco grande.",
          ""
        ]
      }
    },
    {
      "id": "MhqHXRZ",
      "title": "Essentials Men's Water-Resistant Softshell Jacket",
      "price": "$16.08",
      "image": "https://m.media-amazon.com/images/I/41Sk3oDACuL._AC_UX342_.jpg",
      "description": "Face: 92% Polyester, 8% Spandex; Lining: 100% Polyester\nImported\nZipper closure\nMachine Wash\nThis lightweight jacket keeps phones more safely out of the rain with water-resistant outer shell\nFeatures a full-zip front with stand-up collar, adjustable cuffs and zip pockets at side seam and chest\nEveryday made better: we listen to customer feedback and fine-tune every detail to ensure quality, fit, and comfort\nShow more",
      "reviews": {
        "customerProfileNames": [
          "ResistImpulse_VideoReviewsOnYouTube",
          "HeathJackson",
          "StevenM.",
          "Samrio",
          "gd",
          "GInteriors",
          "A.K",
          "David"
        ],
        "customerProfilePictures": [
          "https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif",
          "https://images-eu.ssl-images-amazon.com/images/S/amazon-avatars-global/9a5c97b2-6e52-46cb-9a9d-e1b1886732fb._CR119,0,262,262_SX48_.jpg"
        ],
        "customerRatings": [
          "5.0 out of 5 stars",
          "2.0 out of 5 stars",
          "5.0 out of 5 stars",
          "5.0 out of 5 stars",
          "5.0 out of 5 stars",
          "3.0 out of 5 stars",
          "5.0 out of 5 stars",
          "5.0 out of 5 stars"
        ],
        "customerReviewTitles": [
          "BUY IT BEFORE THEY DOUBLE THE PRICE",
          "Design Flaw",
          "Comfortable, well made, and water resistant - yes, please",
          "A great soft shell jacket for a good price.",
          "Better quality than expected",
          "Looks great, I’m hesitant about the quality.",
          "Nice surprise",
          "Great Jacket! Just what I expected and needed!"
        ],
        "customerReviewBodies": [
          "The jacket does the chin guard well, the cuffs are solid and the attention to detail is superb. The lining is there!! I am used to a softshell with less warmth. This jacket is best served with a layering system planned with this being a layer to provide some warmth. I have a softshell that was easily twice the cost and certainly does not meet the standard of value this jacket presents. So while I was taken sideways by how warm the lining can be, this is my own assumption and failure to pay attention to detail when ordering, not a fault I hold against the jacket. So where are the super tiny flaws? or super tiny details done right?\nThe cuffs are the easiest place on this jacket to find the smallest pros and cons on an otherwise AMAZING value proposition.\n\nThe velcro on the cuff is great quality. The hook and loop sides both are done spectacularly well. On some jackets the ribbon base on the loop side of the velcro can be placed to far to the edge of the cuff presenting an abrasive edge to wear on your hands/wrists. Not so on this jacket. The spacing is superb.\nThe hook side can have issues such as scratchy hooks, aggressive ribbon base under the hook velcro or other issues that create scratching and abrasions. Not on this jacket. They use a hook section that is a rubbery material with hooks that are more like little triangle tree stumps so nothing feels scratchy or abrasive at all. The rubbery material has a friction grip feel on the back side so you can get some grip in the rain or cold, and the edges are smoothed over or rounded.\n\nThe cuffs are where the issue of this jacket exists though, the small small issue. The lack of internal elastic or section of elastic. Basically the cuff is all fabric tube with velcro to seize it down for warmth or to close aorund your gloves during a snow covered wrestling match or w/e. In some other jackets the sleeve would compensate for this adjustability with a touch of elasticity, and I know why.\n\nWith this jacket if you cinch down witht he velcro then you may have to uncinch the velcro to get your hand back through the sleeve. Therefore for a better day to day fit in the sleeve you would need to velcro both sleeves getting into the jacket then both getting out of the jacket. Every time. This of course is not reality and you can have them cinched down but not fully and slip your hand in and out, leaving the velcro where it is, and only need to adjust it if you want to cinch down the cuff completely.\n\nI know this is a very small nitpick more than a flaw, but I think if I point it out then you can understand the level of criticism I can bring to a jacket and to see this is the only thing to nitpick means the jacket for the price is an insane value proposition. They could definitely sell this jacket for double the price and still have great ratings and reviews. It is an incredible jacket and value.",
          "Don't buy this jacket! I love the look, the feel, the quality of the material, and the warmth level. But, there is a serious design flaw in the jacket. The pocket zipper bottoms sit above the rest of the material and take all of the weight of your hands when you have your hands in the pocket. I am sending back my second jacket for return, even though I'd love to keep it. Both times, the zippers bust in the first few days due to the strain of normal wear. At first I tried to repair the zipper,on but then learned that no zipper could be successful sewed in the way it is. If the pocket zippers are not important, maybe you will love the jacket.",
          "I",
          "H",
          "The materials and stitching are of a better quality than I was expecting. The lining is very lightweight and not entirely fleeced, which is what I was looking for. It makes this jacket a great option for cloudy windy days that are not too cold. I love that it has no visible logos on the outside.",
          "I love the fabric and the collar height on the jacket. I’m 5’11” 235lbs and all the weight is in my stomach. (I’m working on it) that being said the jacket fits pretty good, a tad tight around my stomach but that’s on me. I ordered an XL, I felt and still do feel that an xxl would swallow me. That being said my critiques have nothing to do with sizing and everything to do with quality. Within a couple wears (not my everyday jacket) the zippers in the pockets stopped working, and the pulls for all the zippers except the large bottom to top zipper had come undone. I’ve not washed it yet, but I’m kind of afraid to. If you need a nice looking jacket for a job interview or your quarterly sales meeting, this will do great. If you need a nice looking jacket to wear everyday, I’d maybe look elsewhere.",
          "T",
          "This jacket is exactly what I wanted. I've had it for about a week with no issues. Washed it about 3 times just due to my clumsiness/spills and its held up! I haven't had the zipper issue that some have had. Wore it on very windy ~45 degree days and it was perfect, especially at keeping the wind out. This will be my go-to spring/fall jacket! It fits true to size but is just a tiny tiny bit tight at the bottom. I definitely won't need to sinch it up at all. Love it!",
          "This jacket does not come with a european left side zipper tab. It's the american way round which makes zipping up the jacket very annoying. Otherwise a great jacket, very lightweight not much insulation, although very good at preventing wind chill. The pockets at the bottom are very deep with a smaller breast zipper pocket which is a nice touch. The cuff adjustment is very nice with a triangular hook and loop pattern which I haven't seen before and seems easier to clean and less hairs seem to be getting stuck onto this design. A hooded and more insulated winter version of this jacket would be a nice bonus which I would have also bought as well.",
          "The product was heavier than expected and the material did not feel comfortable. I have returned this product.",
          "It's a decent jacket...order a size small as they are big!\nVery similar to Keela stuff",
          " ",
          "",
          "Exactly as description and what I wanted."
        ]
      }
    },
    {
      "id": "SSptvn8",
      "title": "Essentials Men's Long-Sleeve Polar Fleece Shirt Jacket, Indigo Blue Heather, Medium",
      "price": "$32.80",
      "image": "https://m.media-amazon.com/images/I/91LHqRHgyRL._AC_UX342_.jpg",
      "description": "An brand - This mid-weight fleece shirt jacket features two welt pockets and two chest flap pockets with button closures\n\nAmazon Essentials is focused on creating affordable, high-quality, and long-lasting everyday clothing you can rely on. Our line of men's must-haves includes polo shirts, chino pants, classic-fit shorts, casual button-downs, and crew-neck tees. Our consistent sizing takes the guesswork out of shopping, and each piece is put to the test to maintain the highest standards in quality and comfort.",
      "reviews": {
        "customerProfileNames": [
          "JakeO'Hara",
          "Nancy",
          "Lcurtisvt",
          "DianneF",
          "ellsea",
          "HakkiOrun"
        ],
        "customerProfilePictures": [
          "https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif"
        ],
        "customerRatings": [
          "5.0 out of 5 stars",
          "5.0 out of 5 stars",
          "2.0 out of 5 stars",
          "1.0 out of 5 stars",
          "4.0 out of 5 stars",
          "5.0 out of 5 stars"
        ],
        "customerReviewTitles": [
          "I assumed had mediocre clothing, I couldn’t have been more wrong",
          "My son-in-law loved it!",
          "Button holes too small for buttons",
          "Don’t waste your money",
          "Slim cut, be aware",
          "Good one for the money"
        ],
        "customerReviewBodies": [
          "I ordered this with little expectations and I’m very surprised how nice it is. It came in the mail yesterday and it’s been on ever since. Super comfy",
          "What more need I say? It was a hit! Thanks!",
          "Warm, cozy shirt bought as gift for elderly man. Button holes waay too small for the buttons. He could not button it and even I had a hard time. Every button hole needed to be snipped to enlarge them so short can be buttoned",
          "We really thought this would work for someone who does not like harsh fabrics. Couldn’t be more wrong. Material is harsh to the touch. Very irritating to the skin. Will be returning.",
          "S",
          "This is soft touch fleece. It is good enough to protect from the cold weather, especially when layered."
        ]
      }
    },
    {
      "id": "FV-VIoD",
      "title": "Essentials Men's Long-Sleeve Polar Fleece Shirt Jacket",
      "price": "$5.78",
      "image": "https://m.media-amazon.com/images/I/91mNiXLT64L._AC_UX342_.jpg",
      "description": "An brand - This mid-weight fleece shirt jacket features two welt pockets and two chest flap pockets with button closures",
      "reviews": {
        "customerProfileNames": [
          "Brandi",
          "John",
          "JoshuaMichael",
          "LaineP.",
          "Stroppy",
          "Patrick",
          "ChampHampton",
          "JaimeA."
        ],
        "customerProfilePictures": [
          "https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif",
          "https://images-na.ssl-images-amazon.com/images/S/amazon-avatars-global/7209c4be-e611-4f6a-9558-000bb21ce7ba._CR0,0,438,438_SX48_.jpg",
          "https://images-na.ssl-images-amazon.com/images/S/amazon-avatars-global/87e0b550-f2e0-42fa-8e0a-4d612672613e._CR0,51.0,231,231_SX48_.jpg"
        ],
        "customerRatings": [
          "5.0 out of 5 stars",
          "5.0 out of 5 stars",
          "5.0 out of 5 stars",
          "5.0 out of 5 stars",
          "3.0 out of 5 stars",
          "5.0 out of 5 stars",
          "5.0 out of 5 stars",
          "5.0 out of 5 stars"
        ],
        "customerReviewTitles": [
          "10/10",
          "Great purchase",
          "Essentials Is My New Zara",
          "Wonderful quality",
          "Button up fleece jacket.",
          "Nice",
          "Very Fashionable Shirt/Jacket!!",
          "Excelente Producto, justo como lo esperaba!",
          ""
        ],
        "customerReviewBodies": [
          "M",
          "Great product!\nI’m 5’10” 205lbs well build and the jacket fit perfect\nNo to heavy, great to go out at night\nNice neutral color",
          "L",
          "I got this for myself to wear as a “ shirt/ jacket” and yes I’m a girl and I got a mans shirt. First off the color is beautiful. It’s very light grey / white and the quality is AMAZING. I got a medium so it’s oversized. I’m 5’3 ,125lbs. Fits perfect. Super warm and comfy. I ordered another one in a different color. Don’t hesitate to buy.",
          "It's a nice basic button up fleece jacket. The reason I'm only giving it three stars is because it's not really a shirt jacket. This fits right below the waist w/a straight hem just like any other fleece jacket; a shirt jacket should have a rounded hem, which would give it a slightly longer fit.",
          "Awesome shirt jacket. Very warm and light weight. Fit as expected ,would purchase again",
          "These Shirt/Jackets are very nice and very warm! I got to wear in the Spring and Fall but they are even good for the winter time. I'm 6-4 about 195lbs and ordered a Large and it is a perfect fit for me. I will probably order 2 more colors in this because it really looks and feels good wearing it.",
          "Mido 1,75 y peso 88 kg y la talla L es la que me corresponde; excelente sensación de calidad por el precio. El tiempo dirá qué tan durable es, pero por el momento es cinco estrellas sobradas!",
          "",
          "I am very pleased with this purchase. I wanted the black sweater which was only available in size Medium. No Large or Extra Large which I would normally buy. I have lost 65 lbs in the last 8 months through Keto and Fasting, so my previous sweaters look like bags on me. I am 5'10\" and currently weigh 167 lbs. BMI of 24. I wasn't certain that Medium would be OK on me, but as it turns out it is my new perfect size.\n\nAll of the features of this sweater are ideal for me. Top button down breast pockets great for my phone and keys. Handy side pockets to easily keep hands warm. Button cuffs. Sleeve length is great too. Material is very soft and warm. Lots of compliments on the style and slim fit with my new bod.\n\nStill new. Haven't washed it yet. If it does not shrink with a wash, I will be buying another one, also in medium and black.",
          "This is Very well made. Having those two pockets comes in handy.\nCollar is a little on the bulky side but not too bad considering its a Shirt/jacket.\n\nOrdered the Blk to see how sizing would be lol and now they are out of the Grey. Regret that.\nI have about 48” Chest, 38” Waist and probably 40” around belly. 250 lbs\nThese days I can normally wear XL sometimes XXL but decided to go XXL for this one in case of shrinkage, didnt shrink but fit is good\n\nIt says to turn inside out, wash in cold water and tumble dry.\nNot what I do so I did turn it inside out and washed it in warm and threw it in the dryer on Normal Setting to sink or swim with rest of my load.\nAbsolutely No Shrinkage. Nice and warm and real good quality for the money.\nI ordered one for my Buddy for xmas and now that I know how its sized and doesnt shrink I am ordering two more for members of my family.",
          "No puedo creer que compré este producto por menos de 350 pesos y es de excelente calidad.\n\nLo compré para regalo y me arrepiento no haberme comprado uno para mi. Aparentemente le quedó muy bien para la persona de la siguiente complexión:\n\nAltura 1.65, Peso 75 kg, talla corte regular mediana.\n\nViene con un corte capitonado así que se ve super elegante.",
          "",
          "Buena chamarra, muy calentita, algo que debo añadir es que pedí talla S y me queda ligeramente ajustada, lo justo para no poder llevar más de 2 prendas debajo. Debí haber pedido talla M. Pero no importa, soy de complexión delgada.\nPara personas de 1.75 - 1.80m con peso de 63kg en adelante pedir talla M.",
          "",
          "this is a warm shirt/jacket ,well worth the price and true to size as advertised, the only recommendation I might have is: if you plan on wearing it as an autumn jacket( over a sweatshirt) , you might find it slightly too tight. I returned the large size for an extra large , it now fits perfectly even with a heavy sweater under it."
        ]
      }
    },
    {
      "id": "zSy3Zdo",
      "title": "Levi's Men's Washed Cotton Hooded Military Jacket",
      "price": "$43.06",
      "image": "https://m.media-amazon.com/images/I/81ue5-58RmL._AC_UX385_.jpg",
      "description": "This jacket in rich neutral colors will you keep as warm as you need to be with its removable hood and lining.",
      "reviews": {
        "customerProfileNames": [
          "JoeKing",
          "Michael",
          "TheDude",
          "T.CharlesHowser",
          "MitchE.",
          "Internetshoppingjunkie",
          "KindleCustomer",
          "Sailorann"
        ],
        "customerProfilePictures": [
          "https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif",
          "https://images-na.ssl-images-amazon.com/images/S/amazon-avatars-global/b1e2c946-5a59-49b8-bfe7-3de18586c8fc._CR83,0,333,333_SX48_.jpg",
          "https://images-na.ssl-images-amazon.com/images/S/amazon-avatars-global/d2314014-5430-4556-9903-c1466c0b5d09._CR62,0,375,375_SX48_.jpg"
        ],
        "customerRatings": [
          "5.0 out of 5 stars",
          "5.0 out of 5 stars",
          "5.0 out of 5 stars",
          "5.0 out of 5 stars",
          "5.0 out of 5 stars",
          "5.0 out of 5 stars",
          "5.0 out of 5 stars",
          "5.0 out of 5 stars"
        ],
        "customerReviewTitles": [
          "A pox on pizza theif.",
          "Great Fit, Durable Material",
          "GREAT COAT",
          "Very Warm and Tough",
          "SIZE UP FOR BIG SHOULDERS!!!",
          "Well-made mostly winter jacket",
          "Great jacket, good quality, warm.",
          "Buy This!"
        ],
        "customerReviewBodies": [
          "Good jacket. Pretty warm, you will need to layer if you're getting into temperatures under literal freezing. That's 0°C/32°F, for those who dropped out of junior high. It definitely retains heat when zipped up. I wouldn't wear this if it's 70+. You'll get sweaty quick. Lots of pockets. Fits well, the black will show dirt pretty quick. I really liked this thing. It is made in China, for those whom it may concern. This jacket is so good, in fact, that some copulator of maternal figures had to go and swipe it while I had it in the break room at work. I bet it was the same guy that stole my pizza out of the fridge, and just left the crust in the box as if I wouldn't notice.",
          "I was skeptical at first about this jacket, but boy was I blown away when I got it. This jacket is the real deal. I am 6'1\" 160 lbs and the medium fits me perfectly. The body of the jacket is lined with a type of fur and the pockets are lined with fleece (perfect for my cold hands!). The material a kind of durable cotton, super tough. The hoodie is nice and big so it fits over my head all the way (A lot of jackets I've seen have tiny hoods that don't fit). The hoodie part is removable, but I don't think I'll ever remove it. Everything about this jacket is super durable and I am very happy with it.",
          "C",
          "I bought this jacket more than a year and a half ago. I use it in everday social situations, and also for rugged outdoor use (camping, etc). It looks nice to wear around town, but it is also tough as nails. It is not super duper thick and huge, so you can also wear it normally in the spring and fall. I washed it a few times, and it still retains its normal look and feel. It's simple and basic looking, and I like that.\n\nWhat I liked best is the surprising warmth that it provides. I wore it while I was up in the Arctic Circle in winter. Even out on a frozen lake in the dead of night, it was all I needed up there. I did not expect that. I was worried about freezing to death in those conditions, so had also brought along a big puffy snow coat for the cold, but I never needed it with this jacket on.\n\nKudos to the makers of this coat.",
          "It fits well, I'm normally a 2XT, but after reading the reviews, I decided on the 3XT. A bit big, but good through the shoulders. So when I layer it'll work out fine. It's just a bit big through the middle.\nOtherwise, a very well made and comfortable jacket. I'm going to wear it this morning, only 23° outside!!\nI highly recommend this jacket! But your normal size unless you have wide shoulders like me from sports my whole life!",
          "I",
          "T",
          "I LOVE this jacket. The jacket is amazing quality, super thick, and warm. I love that you can remove the sweatshirt bits and the hood as well. I bought this for my boyfriend as one of his Christmas gifts and he admires every aspect and now wears this jacket out all of the time. You will not be disappointed in any way. This item is worth even more than what I paid for. It is true to size, 100%. My boyfriend is 5'9 ish, 160 pounds, and we ordered a medium. Fits perfectly with wiggle room.",
          "Good fit. Quality jacket. Quality brand.",
          "Excellent fit",
          "I love the look of this jacket, but I must say the quality has left me disappointed. The fit is not overly generous for the size I bought, but it's OK. The main issues I have had are that the zipper pull broke on day one - not a big problem, I was able to rig a replacement, and yesterday (just after the return period closed), a seam on the right sleeve at the back of the shoulder opened up about 4 inches. I had to take the jacket to a tailor to repair it. I have only worn the jacket a few times so far, so there's no way it should be coming apart already. Really not impressed.\n\nUpdate 22-2-22 - today the seam on other sleeve came apart as I was simply reaching up to take off my hat. This jacket is SUCH poor quality - I STRONGLY ADVISE AGAISNT BUYING ONE. I will be contacting the seller to see if they will refund, even though the date has passed.",
          "Way too short on me, bought a large and the only sizing charts are for chest size but nothing about length. I am 6'4\" and unfortunately only realized it didn't fit after I removed the tags. Every shirt I own sticks out the bottom of the jacket. I like the quality of it though but it would be nice if I knew what size would actually fit me.",
          "This coat is very well made and should be a fine winter coat except on the coldest of days. I'm in Calgary Alberta. The Sherpa lining is heavier than expected and the hoodie part is removable. I'm very happy with this purchase. Good value for money."
        ]
      }
    },
    {
      "id": "8nfzzxn",
      "title": "CRYSULLY Men's Spring Fall Casual Slim Fit Thin Lightweight Outwear Sportswear Bomber Jacket Coat",
      "price": "$36.96",
      "image": "https://m.media-amazon.com/images/I/61rNwJOTjqL._AC_UX385_.jpg",
      "description": "Polyester\nZipper closure\nMachine Wash\nNOTE: This jacket zip on the left.\nMaterial: 100% Polyester, lightweight and high-quality fabric makes this jacket comfortable and soft.\nZipper closure ; Rib collar, cuff and hem\nMulti-pocket: two side-entry pockets; one sleeve pocket; interior lining with one chest pocket\nWash: Machine wash, normal cycle, don't bleach, don't insolate",
      "reviews": {
        "customerProfileNames": [
          "BlaiseCascio",
          "GinoQuevedo",
          "Madisyn",
          "MFun",
          "wordofreason",
          "HayanariMizoguchi",
          "DavidStanley",
          "Carlos"
        ],
        "customerProfilePictures": [
          "https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif",
          "https://images-na.ssl-images-amazon.com/images/S/amazon-avatars-global/07ec181e-6fc9-43fe-b04c-b9d8d06ab375._CR62,0,375,375_SX48_.jpg",
          "https://images-na.ssl-images-amazon.com/images/S/amazon-avatars-global/285f118f-fd94-4c0b-b6f9-2dc55022ee6b._CR0,0,344,344_SX48_.jpg"
        ],
        "customerRatings": [
          "5.0 out of 5 stars",
          "5.0 out of 5 stars",
          "5.0 out of 5 stars",
          "5.0 out of 5 stars",
          "1.0 out of 5 stars",
          "5.0 out of 5 stars",
          "5.0 out of 5 stars",
          "5.0 out of 5 stars"
        ],
        "customerReviewTitles": [
          "Awesome Jacket very stylish",
          "Amazing Bomber Jacket!!",
          "My man looked AMAZING !",
          "Great light fashion jacket",
          "Obviously Not A Man's Jacket",
          "Nice looking",
          "High quality workmanship is in this product.",
          "Bought to press vinyl works great!"
        ],
        "customerReviewBodies": [
          "This bomber is jacket is perfect. It looks so nice with just a tee, jeans ,and some nice kicks. Don’t buy the ones that say wind breaker material, jacket is by no means for real cold days but it’s fine to wear to a dinner or shopping or really anytime in winter when you just not going be outside very long. Highly recommend. I’m 5’10 235 so xxl fits me like a gem.",
          "I ride an ebike (Super73-R Brooklyn) and need a jacket to match and not to mention the fact I needed a jacket for those days where the sky is falling haha. First thing I realized when I put it on is that it is EXTREMELY thin like t-shirt thin which for me is exactly what I was looking for as I plan on wearing this on every ride in the Florida weather. It is extremely comfortable and the fabric is extremely soft to the touch. Feels and looks waterproof but I have not yet put it to the test. Comes with 2 front pockets for putting your hands and an inside pocket where you can put a wallet or a phone as well as a left shoulder pocket for loose cards or maybe some earbuds. The inside of the jacket is lightly padded where you will stay warm on cold nights but not enough to make you sweat in the heat. Lastly, the collar sits nicely on your neck and the stitching is flawless, for the price you may think its cheap and although its thin its beyond amazing for the price! 10/10 would buy again",
          "This jacket not only fit just right and very true to size but was light weight and stretchy. My man has a built upper body and he loved the look! The price was great and will be buying more colors of this jacket for future events!",
          "I got this in the eggplant for my husband in size large which is true to his size- 6’2”, 200lbs. He really likes it as it’s different and lightweight. I think he said the zipper is on the opposite side as it normally is for men?",
          "This is not a man's jacket, The zipper is on the opposite where you would find it on a woman's jacket. This explains why a lot of the negative reviews states the fit is small. I hate returning items and hate even more giving negative reviews but I cannot allow this seller to get away with misrepresenting women's clothing as men's. its impossible for any apparel dealer not to know women's zippers and buttons are placed on opposite sides than men. gave one star for delivery speed wish I could give negative stars.",
          "I have been looking for a tan color jacket and I finally found a one I was looking for. The only thing I don't like s the jipper is for lady's .",
          "The inside pocket was a happy surprise, I highly recommend this jacket.",
          "Loved the jacket. The blue on the picture vs. the blue I got was a little bit darker, but wasn’t an issue for me, the quality I like, and would buy again, I used mine as a sports jacket for my business and I cut and pressed vinyl my self and worked perfect on it with out burning the material. 5 out of 5",
          "Les plus +\n- Léger -\n\nLes moins -\n- Trop léger - Conception polyester luisant d'un coupe vent mais sans le capuchon... - Prix élever pour ce qu'il est - Robustesse medium -\n\n* A prix ajuster, certains pourraient l'aimer pour ce qu'ils ont a faire avec.",
          "",
          "Garbage quality don't buy made in China",
          "It is true to size but the issue is, it is a slim fit. I like regualr fit for my COVID gut but if you are atheletic it will fit you great! I sent mine back.",
          "The style fits like a glove and they always look so neat and dressy.",
          "I love the stuff and fitting . Everything i love it .. recommend highly . I ordered another one too . 🥰"
        ]
      }
    },
    {
      "id": "VWh0T-U",
      "title": "The North Face Mens Full Zip",
      "price": "$229.00",
      "image": "https://m.media-amazon.com/images/I/61grMMxx8+L._AC_UX342_.jpg",
      "description": "100% Nylon\nMade in USA\nWater-resistant, insulated jacket packs into its own hand pocket. Standard Fit. 15D nylon ripstop. Lightweight, durable VISLON center front zip. Covered, secure-zip hand pockets. Internal chest pocket. Internal, elastic-bound cuffs. Hem cinch-cord. Media compatible.\nDeveloped in partnership with Primaloft, Inc., ThermoBall is a revolution in insulation technology. Unlike traditional continuous-filament synthetic insulation, the small, round PrimaLoft synthetic-fiber clusters closely mimic down clusters, trapping heat within small air pockets to retain warmth. Independent clo testing by Kansas State University has shown that ThermoBall has warmth equivalent to 600 fill goose down. As a result, ThermoBall can offer the lightweight warmth and compressibility o\nThe North Face products are fully warranted against defects in materials and workmanship with a LIFETIME GUARANTEE. Exclusions apply.\nThe North Face's fundamental mission remains unchanged since 1966: Provide the best gear for our athletes and the modern day explorer, support the preservation of the outdoors, and inspire a global movement of exploration.\nThe North Face delivers an extensive line of performance apparel, equipment, and footwear. We push the boundaries of innovation so that you can push the boundaries of exploration. We remain deeply proud to be the first choice of the world's most accomplished climbers, mountaineers, extreme skiers, snowboarders, endurance runners, and explorers.",
      "reviews": {
        "customerProfileNames": [],
        "customerProfilePictures": [],
        "customerRatings": [],
        "customerReviewTitles": [],
        "customerReviewBodies": []
      }
    }
  ]
}
