[{"id":"yv3QfXySC6DekPnAGRIg8","title":"Precision Comfort 6 Piece Jewelry Tool Kit with Carrying Case","imageUrl":"https://m.media-amazon.com/images/I/91gd7FurQLL._AC_SX450_.jpg","price":"$21.74","description":"Cousin tools provide you with great quality instruments to create beautiful jewelry. This Set includes a convenient carrying case with round nose pliers for making loops and bends in wire, needle nose pliers to open and close wire loops and jump rings.","reviews":[{"name":"Luke longjohn","pictureUrl":"https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif","rating":"5/5","reviewTitle":" The grip of using it.","review":"Like the way it works up great.\nI use it to make jewelry."},{"name":"TeriS0277","pictureUrl":"https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif","rating":"5/5","reviewTitle":" very nice","review":"This is a great kit for the beginning jeweler or to replace your main tools that have gotten worn out. I really like the different colored handles, makes it easy when holding something and reaching for different tool."},{"name":"Tink1981","pictureUrl":"https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif","rating":"5/5","reviewTitle":" Good size tools, easy to maneuver","review":"Perfect case for storing tools, tools included good quality, nice selection"},{"name":"Wickerball","pictureUrl":"https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif","rating":"5/5","reviewTitle":" Five Stars","review":"Also great for electronics work."},{"name":"Love this book","pictureUrl":"https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif","rating":"5/5","reviewTitle":" Tools","review":"I had a set of these tools and then they mysteriously disappeared. The tools are not top grade but with a little filing down of the sides and points, they are quite useful in projects."},{"name":"Edilda Castroverde","pictureUrl":"https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif","rating":"5/5","reviewTitle":" Good deal","review":"Used to make jewelry"},{"name":"Joy","pictureUrl":"https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif","rating":"5/5","reviewTitle":" Good set.","review":"Handy set of tools for jewelry making as well as other small tasks. Nice case."},{"name":"Cheryl","pictureUrl":"https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif","rating":"5/5","reviewTitle":" Easy to use","review":"Granddaughter love the tools 😃"}]},{"id":"wioB5TlShEgUnKaAS5uz-","title":"Jewelry Making Tools Kit with Jewelry Making Supplies Kit, Jewelry Wires and Jewelry Findings for Jewelry Repair Beading, Making Bracelets, Earrings and DIY Jewelry Craft Supplies","imageUrl":"https://m.media-amazon.com/images/I/713NxezhSWL._AC_SY450_.jpg","price":"$17.99","description":"About this item\n✧COMPLETE JEWELRY SUPPLIES KIT - This package includes scissors, awl, blue color calipers, soft ruler, ring, single crochet, elbow scorpion, straight scorpion, elastic crystal line, steel wire, beads Needle, Pearl Needle, Needle Needle, Canvas Bag.\n✧VARIOUS JEWELRY ACCESSORIES - A total of 845 different types of jewelry, includeing the jewelry kit you need open jump rings (4mm, 5mm, 6mm, 8mm), lobster clasps, eyelets, eye bolts, screw pins, crimp beads, earhooks, strap ends and cord ends and rubber earring.\n✧SUPERIOR BEADING PLIERS - The jewelry repair tool has 3 necessary jewelry pliers: round pliers, wire cutting pliers and chain tongs. Each pliers have double leaf spring and non-slip handles that they use effectively and safely.\n✧FIT PROFESSIONALS & AMATEURS - It’s perfect for either professional or just amateur jewelry making lovers and starter to do their jewelry making project, jewelry beading project, jewelry repair and other DIY projects.\n✧EASY TO STORE - The jewelry tool comes with a premium black zip pouch, so you can keep your tools handy, organize and safe, and no worry about losing tools or accessories.","reviews":[{"name":"Kim H.","pictureUrl":"https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif","rating":"4/5","reviewTitle":" Great for beginners only","review":"I purchased this kit as a first time beginner in jewelry making. I didn't know much about jewelry making and saw that a lot of items came in the kit.\nMy most used part of the kit is the small jewelry accessories, pliers and cutters.\n\nPros: good range of products for beginners; storage case comes with; inexpensive for amount of product\nCons: storage case straps don't accommodate everything easily, especially the pliers, I tend not to use the case because of that; the cutters are great for the included wire, but are extremely difficult cutting anything thicker; the regular pliers when closed leave a gap unless squeezed really tight (pics); the round nose pliers do not line up exactly (pics) - this has not been problematic however; would be nice if it came with a product list/uses.\n\nOverall, I removed a star due to the cutters and pliers - my most used items. Would I purchase again? Yes, but only for a beginner. I have since upgraded my pliers. This is a good kit if you aren't sure what you are doing and/or want to get a feel for jewelry making before you invest in it full time."},{"name":"Pete","pictureUrl":"https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif","rating":"5/5","reviewTitle":" Great gift for the beginner","review":"There were lots of choices in this area and spent a good amount of time reviewing each one. It had a couple of hand tools that appeared a little better than the others in this market. Our granddaughter just starting out has created a special attraction to rings and we supplemented this kit with several others to allow her to try several different blanks for rings and also some beginning engraving. She was thrilled and took everything out and inventoried the goods. We have several other tools in mind that are more expensive and we shall see where her talent lies."},{"name":"in76","pictureUrl":"https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif","rating":"5/5","reviewTitle":" Great value for the price","review":"Really well made case and lots of tools for the price. I got this for my daughter in law for Christmas and she loved it she was wanting to make keychains out of some small funko pop figures and this had all the tools she needed to do that and more."},{"name":"Keith Bedore","pictureUrl":"https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif","rating":"5/5","reviewTitle":" Great kit for beginners","review":"This kit is better then I was hoping for. Everything has a pocket or place making it easy to use. The tools are very straightforward and would work well for beginners. And the case material feels durable with decent thickness. I also love the ring for quickly opening and closing jump rings. Super handy."},{"name":"Brizeyda C.","pictureUrl":"https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif","rating":"5/5","reviewTitle":" Must have it","review":"It’s just what I was looking for, I’ve been crafting for a while and needed sets for making erasing and keychains, is this set has everything I was looking for, I just made some keychains and I had everything I need here. Is super was to use and has everything for beginners."},{"name":"Ms. Mac","pictureUrl":"https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif","rating":"1/5","reviewTitle":" Item already used","review":"Item looks already used and scissors missing. Just got the plastic cover."},{"name":"Lolly","pictureUrl":"https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif","rating":"3/5","reviewTitle":" Not made for arthritic hands.","review":"Not like my \"old set\". They're smaller and hard for my arthritic hands. I returned them and will buy individual Craftsman tools. The other stuff in there was nice."},{"name":"janocostela","pictureUrl":"https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif","rating":"5/5","reviewTitle":" esta bien para principiantes","review":"esta bien para principiantes"}]},{"id":"FxskQ8bY-BZATsP33pQfC","title":"14600 Pcs Clay Heishi Beads Kit Including 56 Color Clay Beads, 200 Pcs Letter Beads, Pendant, Jump Rings and Elastic Cords for DIY Jewelry Making Bracelets Necklace Earring Making Supplies","imageUrl":"https://m.media-amazon.com/images/I/91HP+sTT-GL._AC_SY450_.jpg","price":"$22.90","description":"Specification: Material: Polymer Clay Color: As pictures shown. Size: As pictures shown.(approx) Disc bead diameter: 6mm(0.24in), hole: 2mm(0.08in) Package Contains: -56 color strands clay beads (14000 pcs) -200 letter beads -50 heart beads -50 smile face beads -18m clear stretch cord 4 rolls\n-100 jump rings\n-10 pendant charms\n-300 gold charm beads\n-10 pair earring kit -160 jewellry making accessories.","reviews":[{"name":"Mo","pictureUrl":"https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif","rating":"5/5","reviewTitle":" BUY IT!!!!","review":"very nice colors, my 13 yr old loves it!! perfect for a gift or something to do when bored. 100% worth your money!"},{"name":"Michelle Sanders","pictureUrl":"https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif","rating":"5/5","reviewTitle":" AMAZING gift and thing for you to do","review":"i have not used it yet but i can tell by how much it comes with it is a good price for it ."},{"name":"Leonard","pictureUrl":"https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif","rating":"5/5","reviewTitle":" 10/10 recommended","review":"Really good selection of colors. The clay beads are smaller than expected. I wish there were more clay beads but 10/10 recommended."},{"name":"Kevin","pictureUrl":"https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif","rating":"4/5","reviewTitle":" Came in a small box","review":"Cam in a small cardboard box crammed in a bag but the product itself was good"},{"name":"Ashley Whitaker","pictureUrl":"https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif","rating":"5/5","reviewTitle":" Very entertaining","review":"My daughter can make all kinds of things with this kit. She loves it!"},{"name":"OndaWire","pictureUrl":"https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif","rating":"5/5","reviewTitle":" Great value and gift for crafty person!","review":"Our 12 year old daughter is super crafty and has been super into making bracelets for her and her friends. This kit keeps her busy on days we don't have plans and she really enjoys making colorful bracelets. She has not tried making earrings or necklaces yet but pretty sure this kit has the supplies to make those as well.\n\nFrom the pictures, you can see all the variety of colors of the clay beads. There are also some accent pieces and letters to form names or words on the jewelry. It also comes with a variety of colors of wire. My daughter says she only likes the clear one and may not use the colorful one but we will see.\n\nThe quality of the beads and the bracelets that she has made is pretty impressive. It could have easily been a jewelry item that she bought a store. Noone would know it was a handmade item.\n\nThis would make a great gift for a crafty person or for you if you enjoy jewelry making."},{"name":"Mom with a zoo","pictureUrl":"https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif","rating":"5/5","reviewTitle":" Great bead kit","review":"My first clay bead set - love it! It is so easy to work with and good quality. The clay pieces are like thin, durable plastic circles, I was afraid they would crack or break easily. It’s an excellent value for all the pieces that come in the kit."},{"name":"Harrisburg PA Momma","pictureUrl":"https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif","rating":"5/5","reviewTitle":" Pretty and sturdy","review":"My 14 year old daughter and her friend really enjoyed making bracelets with these. Here is her take:\nLove these beads. Come in a bunch of pretty colors, and make really sturdy bracelets. Very pretty and I would recommend to any bracelet makers"}]},{"id":"QUpSIOEwEgRrOjwSy8SCo","title":"SONGMICS Jewelry Cabinet Armoire Organizer with LED Lights, Wall-Mounted Storage Cabinet with Full-Length Frameless Mirror, Built-in Makeup Mirror, 2 Drawers, Lockable, White UJJC013W01","imageUrl":"https://m.media-amazon.com/images/I/71pw4j9p-+L._AC_SY355_.jpg","price":"$99.43","description":"Makeup Made Easier\nAnnoyed by having to open and close the cabinet door several times to use the outside mirror to check your look? No more with this jewelry cabinet. There’s a mirror and LED lights inside, making checking out your makeup a breeze.\n\nA Jewelry Cabinet or a Mirror?\nYou get both with this mirrored jewelry cabinet. Sized at 14.8\"L x 3.8\"W x 42.5\"H, the cabinet has all your necklaces, bracelets, earrings, rings, skincare products, cosmetics, and makeup tools on display, organized, and tangle-free. You can just grab and go. Then check out your look in the full-length mirror before heading out. Hectic mornings? A thing of the past!\n\nSpecifications:\n- Color: White\n- Material: MDF (Medium Density Fiberboard), Glass Mirror, Velvet Lining\n- Product Size: 14.8\"L x 3.8\"W x 42.5\"H (37.5 x 9.7 x 108 cm)\n- Size of the Inner Mirror: 13.6\"L x 8.3\"W (34.5 x 21 cm)\n- Product Weight: 21.8 lb (9.9 kg)\n\nPackage Contents:\n- 1 x Jewelry Cabinet\n- 1 x Accessory Kit\n- 1 x Instructions\n\nSONGMICS Notes:\n- To locate the battery holder, please remove the lipstick tray and the lid of the compartment beneath it. Place 3 AA batteries (not included), then press the on-off switch on the battery holder to make the interior lights work.\n- The inner width of the hook is 2\", which only fits doors with a thickness of 1.7\" or less. Please note that the cabinet can’t be hung on any doors that are thicker than 1.8\".\n- Remove batteries when the LED lights are not used for a long time.\n- Avoid direct sunlight or next to heat sources.\n- Don’t place the product in damp places to avoid deformation.\n- Keep the product away from sharp and hard objects to avoid scratches.","reviews":[{"name":"madelyn","pictureUrl":"https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif","rating":"5/5","reviewTitle":" The lights DO WORK!!","review":"I’ve seen a lot of people comment that the lights do not work. At first I thought the same but then I looked underneath the lipstick holder, and I found a white piece of wood with two holes about quarter sized, and I saw that I could remove this. Here I found that there is a battery box where the ON/OFF switch is. You need to put in three AA batteries. The box is a little difficult to figure out how to open, though."},{"name":"kerin Medrano","pictureUrl":"https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif","rating":"5/5","reviewTitle":" Great option for jewelry storage!","review":"Sturdy material. We’ll built and heavy. Plenty of storage for jewelry, make up and more. 100% recommend. Full body mirror and the inside mirror is perfect for doing make up. Lockable."},{"name":"julie","pictureUrl":"https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif","rating":"5/5","reviewTitle":" Keeps little hands off my makeup! :)","review":"Perfect for daily use, helps me keep my jewelry and make up organized and easy to see what I need and don’t need. Good size for few jewelry and makeup."},{"name":"Kaitlyn roscoe","pictureUrl":"https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif","rating":"5/5","reviewTitle":" Obsessed is an understatement","review":"This is amazing. Holds everything you can possibly need for a fast and easy morning of getting ready!!"},{"name":"Laura","pictureUrl":"https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif","rating":"5/5","reviewTitle":" Best thing ever","review":"Hard to open with one hand."},{"name":"Yadii","pictureUrl":"https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif","rating":"5/5","reviewTitle":" Beautiful everything fits!","review":"Very beautiful not bulky easy to set up"},{"name":"VMC","pictureUrl":"https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif","rating":"3/5","reviewTitle":" Cannot hold statement jewelry.","review":"Already came assembled. Easy to hang to wall (with measurements). However, I was disappointed that it cannot hold statement necklaces (as pictured hanging behind my door), large (2”) hoop earrings, or chunky bracelets. The cabinet is not deep enough. However, if you own small, thin, or light weight items, this cabinet is perfect. I have a lot of statement necklaces. :-("},{"name":"Amanda McInnis","pictureUrl":"https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif","rating":"3/5","reviewTitle":" Cute but Lights Don't Work","review":"This is cute but I'm pretty miffed about the lights not working and the manual having nothing to say about fixing it, and the little mirror inside came detached from the cabinet the second it came out of the box."}]},{"id":"7lGxDJyo6nndsjj7tHjiX","title":"FOREGOER Hanging Jewelry Organizer with Zipper Pocket Double Sided 43 Pockets Large Necklace Earring Accessory Holder Organizer(Beige)","imageUrl":"https://m.media-amazon.com/images/I/71QBdsbfOCL._AC_SY355_.jpg","price":"$17.99","description":"About this item\n【LARGE CAPACITY】 Dimension: 16.73\" (W) X 43.31\"( L), Double sided 43 different size visible pockets with zipper and 7 necklace hanging loops. It can hold at least 100 pieces of jewelry.Unique design of large size pockets to hold bracelets,sunglasses and other relatively large items\n【QUALITY MATERIALS】100% Polyester,Lightweight, clear visible PVC material ,dust-proof,convenient to clean, and make it easy to see your jewellery, earrings, rings, necklaces, bracelets, watch, hair clips, hair accessories,sunglasses etc\n【360°ROTATING HANGER&DUAL ZIPPERS】The hook(Removable hanger) can be rotated in any direction, flipped easily while browsing, and can be hung in a bedroom, bathroom, closet, or behind a door..There are two zippers on each row of pockets for quick access to jewelry and to protect your jewelry from falling\n【STURDINESS & FOLDABLE】 It can rolls up for easy carry, weight only 0.62 pounds.perfect for traveling or drawer to save space\n【100% QUALITY ASSURANCE】We are dedicated to providing our customers with high quality products and superior service. If you have any questions about the product, please feel free to contact us\n› See more product details","reviews":[{"name":"Daydreamy24","pictureUrl":"https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif","rating":"5/5","reviewTitle":" Covers necklaces. Keeps dust etc off them unlike all others you can hang necklaces on.","review":"I really like many features on this that my half a dozen others do not have. In fact this is my second one. Being able to hang my favorite necklaces in a zippered pouch is a huge win for me. That way I can hang my favorites, or seasonal necklaces where I can easily find them and they don't get grimy from our fuel oil furnace. Then dusty from our centennial, animal loving house.\nI like the zippered organizers the best but this one has those few extra touches that gets my rave review. The hook at the top swivels, unlike a hanger or others of these I've purchased. The different size pockets are spot on for my oversized and dainty pieces.\nThe one thing I'm worried about is my collection has a lot of stones and it seems sort of heavy for the fabric at the top. A lot of hematite. Maybe heavy for the hook too. I may reinforce the seam etc. Will just keep watch. I will still buy more, so far it's holding up fine and that's not a deal breaker."},{"name":"Frankie","pictureUrl":"https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif","rating":"5/5","reviewTitle":" Excellent quality!!","review":"Better than expected ! I got frustrated digging through jewelry boxes trying to find the right piece, now I only have to glance at it. Done. It's large and sturdy. 5 STARS"},{"name":"Shirley M Skillern","pictureUrl":"https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif","rating":"5/5","reviewTitle":" Awesome.","review":"I use this for traveling and storage. The bag is very sturdy and zippers keep my jewelry in place. I think the hanger could be stronger. I had to replace the hanger with a wooden one."},{"name":"Jeni Carson","pictureUrl":"https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif","rating":"5/5","reviewTitle":" great for organizing","review":"This was such a great buy for vacation. The zipper pockets keep things separated and untangled. (who hasn't wasted so much time de-tangling jewelry u wanted to wear?) it was an amazing time saver on my vacation when everything was right there and ready."},{"name":"TGlobal","pictureUrl":"https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif","rating":"5/5","reviewTitle":" Organize","review":"What a wonderful idea to organize all this jewelry I have. I've bought a lot of 'fun' type jewelry and find these are great to organize them with earrings and necklaces."},{"name":"Diane Murillo","pictureUrl":"https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif","rating":"5/5","reviewTitle":" Good price. Exactly what i needed.","review":"Takes up no space. Great for organizing. You can see everything you have to go with your outfit all at once, so its also time saving. All around win, win, win . Bam, makes life a little easier."},{"name":"Laura","pictureUrl":"https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif","rating":"5/5","reviewTitle":" Organiza y economiza especio","review":"Tiene muchos compartimientos y era lo que en realidad queria algo que no ocupara el espacio de un joyero y fuera fácil de llevar"},{"name":"Vanessa Johnson","pictureUrl":"https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif","rating":"5/5","reviewTitle":" Would buy again!","review":"This is the biggest jewelry organizer I have been able to find and it's been wonderful. It has so far made the trip with me to three to different moves and I love the necklace organizer."}]},{"id":"BLXT_AflV8mt9R__oinvL","title":"Jewelry Armoire with Mirror, soges Jewelry Organizer Jewelry Cabinet Lockable Jewelry Armoire with Mirror Wall Door Mounted Full Length Mirror with LEDs Jewelry Holder Dresser with 2 Drawers, White","imageUrl":"https://m.media-amazon.com/images/I/71q16riuvhL._AC_SY355_.jpg","price":"$119.99","description":"About this item\n✿Full Length Mirror: Perfect dressing mirror of modern design, view your image from head to toe\n✿Auto LED Lights Organizer: Stylish and soft LED lights to check your make up and view your jewelry\n✿Wall or Door Mounted Armoire: Space-saving and convenient to use, decorate the comer of your room\n✿Lockable Organizer: For your privacy and jewelry's safety, avoid jewelry being messed up by others\n✿Separate Jewelry Shelves: Contain earring holder, necklace holder, bracelet holder, earring pad, perfume shelves and 2 drawers, organize your jewelry better\n› See more product details","reviews":[{"name":"Margaret Baugher","pictureUrl":"https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif","rating":"5/5","reviewTitle":" Beautiful piece that takes up no space with lots of storage for my jewelry!","review":"Love it! Easy for me to attach the over the door hangers. Easy to insert batteries for light. Love the light! Very sturdy and love the finish which is kind of off white or almond."}]},{"id":"QnJgaKr-z-V9zTBnnfoKp","title":"SONGMICS Lockable Jewelry Cabinet Armoire with Mirror, Wall-Mounted Space Saving Jewelry Storage Organizer, Rustic Brown UJJC051K01","imageUrl":"https://m.media-amazon.com/images/I/71KgPJtOg-L._AC_SY450_.jpg","price":"$79.99","description":"About this item\nPRACTICAL JEWELRY CABINET: Boasting more functional areas for various types of jewelry, this jewelry cabinet helps you say goodbye to the lost earrings and tangled necklaces\nLOCKABLE 2-IN-1 CABINET: Combines a dressing mirror with a jewelry box for ultimate convenience; lockable cabinet keeps your precious jewelry out of reach of children\nSPACE-SAVING YET SPACIOUS: 14.6''L x 3.9''W x 26.4''H occupies little wall space, but offers large storage room with 2 compartments, 60 ring holes, 64 earring slots, 24 stud holes, and 24 necklace hooks\nSET UP IN A SNAP: The cabinet comes pre-assembled, and all you need to do is mount it on the wall with 2 anchoring screws\nFANCY GIFT IDEA: Give this stylish jewelry organizer to your special someone and watch as they smile from ear to ear, or treat yourself and create a beauty station that will make you shine every day","reviews":[{"name":"D. M. Hutchins","pictureUrl":"https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif","rating":"5/5","reviewTitle":" Awesome Earring and Necklace Storage, Great Mirror","review":"Even though it cost more to buy this smaller wall-mounted jewelry cabinet (as opposed to buying one of the many full-length mirror versions) I'm very happy I went with this item over anything else. For one, it works PERFECTLY with my existing jewelry armoire. It's a fine armoire, so I didn't want to give it away or otherwise dispose of it just to save a bit of money on a wall-mounted cabinet. You see, what I really wanted this cabinet for was necklace and earring storage. I had been using free standing racks to hang those items but they and the jewelry on them would always get really dusty and dirty. I needed a closing jewelry storage solution to protect my items from the elements. Even out of the cheaper full-length cabinets I looked at, this shorter product still had a much better interior arrangement and the most earring storage of all. I wasn't interested in the mirror at first, but now that I have the cabinet mounted, it's actually really great. I find myself putting jewelry on almost every day now, even if I won't be leaving the house, just because the mirror makes it so easy to chose and try on different pieces. It's a good quality mirror, excellent clarity and plenty big. While I'm on the subject, all the materials that went into making this cabinet are of excellent quality and it was packaged well so that there wasn't any noticeable damage to the unit when it arrived. Now, the locking feature, though it technically works, is completely useless for me since my existing armoire doesn't lock. I just wanted to mention it so people who are actually in the market for a locking cabinet know that my unit did come with a working lock and two keys 😉 Finally, installation was pretty simple for a handyperson like myself. They included a sheet of paper that you can use to mark the anchor spots of your wall, which I was very grateful for since it reduced the amount of measuring and calculating I needed to do in order to get the cabinet mounted perfectly over my armoire. If you've never installed something like this before, you may need to seek some help for the basics, since the instructions weren't super detailed. It DID come with all the mounting hardware, so that's a plus!\n\nThe only cons for this jewelry cabinet are as follows: 1) The initial factory smell was very strong. It's gone away now but if you're sensitive to that kind of thing, I recommend planning on letting the cabinet air out for a few days or even weeks (depending on your sensitivity) before actually using it. 2) The door won't stay fully open. I have gently worked it so that the hinges open much farther than they originally did, but the door still swings most of the way shut if I don't hold it. It makes selecting jewelry a little annoying but it's not enough of a hindrance to take a star off my rating. Everything else about this cabinet is so awesome that these cons would not prevent me from buying this exact same item again, if I needed to."},{"name":"Margoricke Hidalgo","pictureUrl":"https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif","rating":"5/5","reviewTitle":" The best jewelry armoire. Get your hands on this ASAP","review":"Do NOT hesitate to buy. It is PERFECT! I had a crazy amount of jewelry so it is huge for those who don’t have the amount of jewelry I did. It helped me downsize & it came with a lock & 2 keys. It came extremely quick & well packaged. Very light weight & it even came with a cheat sheet to mount on the wall. However the bottom part is where there is supposed to be bracelets or tiny jewelry boxes. I prefer rings over bracelets so I bought 2 removable ring organizer & placed it on the bottom for EXTRA ring space, & the little shelf/gap I put more rings. It is perfect now. The last photo shows the little DIY I did! Do not hesitate to buy!"},{"name":"Kelly S.","pictureUrl":"https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif","rating":"5/5","reviewTitle":" Perfect!","review":"I looked and looked for a jewelry cabinet that wasn't gigantic like most, had a lock, and a large section for earrings as most smaller cabinets are lacking earring space. This is PERFECT for me! Arrived quickly and very well packaged, and came with a hanging template and 2 keys. Highly recommend!"},{"name":"Lisa S","pictureUrl":"https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif","rating":"5/5","reviewTitle":" The only other thing I could possibly ask for would be an interior light. Totally not a problem.","review":"This jewelry armoire had the 3 features I was looking for: size, lockability, and mirror exterior.\n\nOne reviewer mentioned that they wished the cabinet would mount to the wall from the inside. I actually had the same thought. So after mounting it inside my walk-in closet, I peeled down the top section of the ring storage a little and drilled through to the wall behind with a small bit. I then took it off the wall and drilled slightly larger pilot holes and tapped in spring loaded metal wall anchors with a hammer. I then remounted the armoire and, using my power drill, started the machine screws into the wall anchors. Half an inch from being flush to the rear of the cabinet interior, I tapped them in with a hammer and continued to tighten until the cabinet was really locked into the wall. I was able to pull the bottom away from the wall a little and installed a long strip of thick gel-type double sided sticky to add extra stability and security.\n\nI feel fairly confident that it would be too much work to remove the armoire if someone thought to look inside my closet. Not that I have expensive stuff, but I feel better with the additional security."},{"name":"Janet Sedlar","pictureUrl":"https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif","rating":"5/5","reviewTitle":" Worked out great. Just the right size for the area I ...","review":"Worked out great. Just the right size for the area I planned it for. Unit efficiently stores all my jewelry with a little space left over. I was happy to discover that the area for rings also stores stud earrings, since I'd been concerned about not being able to use that part (I don't have rings). I did find that I wasn't able to store any earrings with the backs on them, but my solution was to put all earring backs on one of the little shelves and just grab a pair when needed. This has worked out fine. In fact, it's preferable if you have more earrings than backs, as I do.\n\nWomen with a large jewelry collection may want to consider the larger version of this."},{"name":"Amy McNeil","pictureUrl":"https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif","rating":"5/5","reviewTitle":" Very convenient","review":"I’ve been using this for a few months now. I really like it. It’s so convenient. The hooks for necklaces/bracelets are durable and wide enough to hold multiples. The ring slots really hold the rings in place. Most of my earrings are hook backings not posts so they are easy to hang up. The few pairs of post earrings I do have I put in the ring slots because I found it difficult to attach the backing when I tried to put them on the earring. But that’s probably just me and not a fault of the cabinet. I do recommend this!"},{"name":"Heather D.","pictureUrl":"https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif","rating":"5/5","reviewTitle":" A great case","review":"I'm really impressed with this. Definitely sturdy- mirror is good quality, it doesn't warp or bend. The door is also solid when open or closed.\nI was not disappointed with the amount of storage for my jewelry. I didn't realize that there are ring slots in the foam at the top.\nThe only thing is I ended up using my own anchors that support up to 75 lbs, because the ones that came with it didn't seem like they'd be enough. The case isn't overly heavy on its own, but filled with jewelry, I wanted to make sure the anchors would hold."},{"name":"D & J Morin","pictureUrl":"https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif","rating":"5/5","reviewTitle":" lighter then thought but perfect","review":"It arrived 6 days after I ordered it which is a nice surprise. Its not as heavy as I thought it would be . was packaged so well mirror was safe. I will post pictures once I have it up and organized. I'm a visual person and needed it here to figure out correct place for it to stay. :)\nIts now up. Only thing , it really is not great for ear studs . which is what I mainly wear. I tried putting them in ring section but some of the backs stayed inside :( . Thinking I will remove the earing boards and attach a plastic ear ring tree or something like that. just adding a hinge so I can take on and off studs easier. might also add a few more hooks. all in all. I do like it."},{"name":"Erin Murphy","pictureUrl":"https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif","rating":"5/5","reviewTitle":" Beyond Impressed","review":"This product comes with some pretty good reviews, but even still I was a bit concerned about the quality and sturdiness. I have to say I’m very impressed. The only thing I did was swap out for a better quality pair of drywall anchors.\nWith the amount of storage this offers, I was able to get rid of my tabletop jewelry box. Even my stud earrings slip nicely into the notches.\nThe one thing they could improve is the quality of the keys. Everything else is so well done but the keys are cheap little plastic luggage keys. They work and the lock system itself is nice, but in terms of going with the overall look & aesthetics of the rest of the piece, they could be better.\nOverall, I wouldn’t hesitate to recommend this to any of my friends."},{"name":"D","pictureUrl":"https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif","rating":"5/5","reviewTitle":" Good secure option","review":"I used to keep my jewelry in one of those small jewelry boxes. A few months ago, I had a break in and the thieves just took the whole box. I got this cabinet as a more secure way to store valuables. I like the lock and the fact that it mounts to the wall. It has lots of room for jewelry and other things."},{"name":"Julio Cesar Ceballos","pictureUrl":"https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif","rating":"4/5","reviewTitle":" Muy recomendable, podría mejorar la seguridad y funcionalidad de los espacios.","review":"Bonito diseño, llegó impecable sin daños y con todos los accesorios como lo especifica la publicación. Esta muy completo y esta bien terminado. Tiene tres cosas en las que podría mejorar según mi criterio: 1. La tabla trasera es muy debil y delgada en comparación con el resto del joyero que se siente sólido. Para hacerlo más seguro, se debería poder atornillar a la pared desde adentro del mueble 2. Tiene espacio para que le pongan más colgadores de cadenas y queden mejor distribuidas y no tan amontonadas, seria mucho más funcional. 3. El espacio para aretes no es tan funcional porque hay algunos que no se sujetan bien y se caen."}]}]