{
	"womensPants": [
		{
			"id": "B4UC_0p",
			"title": "Lee Women's Relaxed Fit All Day Straight Leg Pant",
			"price": "$22.00",
			"image": "https://m.media-amazon.com/images/I/71aoxjomUnL._AC_UX385_.jpg",
			"description": "LEE Women’s Relaxed Fit All Day Straight Leg Pant. Previously known as the All Day Pant, these pants are made for all day wear with silky-soft fabric and a slight drape. Overall Fit: Relaxed fit pant. Rise: Mid rise, sits at the natural waist. Closure: Zip-Fly with button closure. Leg: Straight fit through the seat, leg, and thigh. Pockets: Four pockets: (2) welt back pockets, (2) front pockets. Inseam: Short 29-inches, Medium 31-inches, Long 33-inches. BRAND HERITAGE: Just like our founder, H.D. Lee, our passion is helping can-do people do more. We are committed to designing clothing that conforms to your body, allowing you to move through life freely. We help you chase the things that bring you joy and laughter. The things that make you fearless and hopefully because your passion is what makes you unique. And what moves you, moves us. Move your Lee.",
			"reviews": {
				"customerProfileNames": [
					"Gertrude",
					"Alicia",
					"Helander",
					"EveB.",
					"Gladerunner",
					"SharonPatterson",
					"RobinWaker",
					"ClareB."
				],
				"customerProfilePictures": [
					"https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif",
					"https://images-na.ssl-images-amazon.com/images/S/amazon-avatars-global/e1fce3da-ca4c-42b9-b15b-788695ace0a8._CR0,0,392,392_SX48_.jpg",
					"https://images-na.ssl-images-amazon.com/images/S/amazon-avatars-global/cb66cc21-0b2f-4718-97fd-1b98b161b14e._CR0,0,499,499_SX48_.jpg",
					"https://images-na.ssl-images-amazon.com/images/S/amazon-avatars/default._CR0,0,1024,1024_SX48_.png"
				],
				"customerRatings": [
					"5.0 out of 5 stars",
					"5.0 out of 5 stars",
					"5.0 out of 5 stars",
					"5.0 out of 5 stars",
					"5.0 out of 5 stars",
					"5.0 out of 5 stars",
					"4.0 out of 5 stars",
					"5.0 out of 5 stars"
				],
				"customerReviewTitles": [
					"Great buy.",
					"I will purchase more!!!",
					"Grown-up pants!",
					"Comfortable and fits great",
					"GREAT POCKETS AND fit great for us \"Apple\"- shaped types!",
					"It fits very well, I’m surprised",
					"Good for me",
					"As advertised!"
				],
				"customerReviewBodies": [
					"I bought two pairs of these a size 8short and a 10short. I am 5’3” and a half and the length of the short size is perfect. I’m not telling you my weight, sorry.\n\nI normally buy size 10 jeans at Old navy and in Levi’s. While both sizes fit me (8 and 10), the size 10 is much better for work. The waist is a bit tight on both sizes, but this loosens during the day. The pockets are functional: the two pockets in the front and the pockets in the back. This is a big deal because way too many women’s pants assume we don’t need pockets which is so annoying.\n\nI bought the size 8 in dark gray and the 10 in tan. I’m pleased because while I can wear jeans to work, it is always safer to wear actual pants. These are not too stuffy, cheap enough to buy multiple pairs and I can just wash them with everything else.\n\nThe material isn’t too thin. These are pretty nice. I wouldn’t Hesitate to buy more when I stain these.",
					"I am 5'2, weigh 165, with mom hips. I would says if you are taller than 5'3 you would need the long option. I love these pants. they are great quality and look really nice. I am planning to order more! They are extremely comfortable. and the waist is a little stretchy but not to the point that it makes you look like you have more rolls than what you really do like some pants. I have a smaller waist than I do hips/butt. I usually have to buy my pants to fit my hips/butt and my waist is loose. This forms to my curves very nicely. I would recommend these to anyone. They are true to size and exactly as pictured.",
					"Just ordered my 5th pair, and as a woman over 50 have vowed never to wear those uncomfortable tight jeans again. I searched for months for the perfect substitute, and finally was surprised to find these online. They give just the right amount of room without looking like baggy old lady pants. The waist is actually AT the waist, so there's no riding down the hips when you sit down, or embarrassing tugging to get them back up where they belong. Very happy to have graduated to these grown up pants!",
					"This is my second pair. I loved the first one so much that I waited a year to buy in my color and size.\n\nLove the fit and extremely comfortable to wear all day in the office.\n\nThese pants are vanity sized. I normally wear a size six and the first time I tried on a six it was too loose/large. The size four fits better.\n\nIf it helps someone to determine if they fit the size four, my body measurements are:\nWaist 31.5\nHip 36.5\nThigh 20.5\nInseam 28",
					"These slacks are of mid-weight fabric that washes beautifully, comes out of the dryer looking pressed, and stays neat all day. The cut is perfect for those of us with more belly than saddlebags, and the waist comes up high enough that there is no danger of muffin-top or accidental disclosures. The straight legs are slightly wide all the way to the heel, a flattering look for everyone. The petite size is just perfect for a mid-to-low heel and looks great with tall heels too. One of the best, and most unexpected bonuses, was that the pockets are actually functional! I'm able to hold my huge mobile phone *(which has a big Otterbox case on it) as well as keys and other necessary items without carrying a purse. Even holds my wallet. If you've shopped for slacks with functional pockets, you know what a minor miracle this is today. I'm definitely buying more of these!",
					"Fits perfect. I’m 5’4 and about 190 pounds? I got a 16 short. It’s very soft and well made and I just love it overall. I’m sure I’ll get another color in the future",
					"I ordered size 10 because I own a pair of shorts by Lee that are size 10 that for really well, even though I'm usually a size 12. I'm 5'3\" and around 140 lbs.\n\nI literally just tried them on and until I saw the pictures I really loved them 😂 that being said, they stay in place and aren't too baggy or tight for my taste, so I like them.",
					"I am 5'5\", 28\" waist and 38\" hip - ordered a 4 in Allspice. They fit wonderfully, with moderate stretch, working equally well with flats and pumps. As a professional and a mom (apologies for toddler handprint smears on my mirror), I was looking for a relaxed, comfortable pant I would wear at home as well as work. These fit the bill, and price by quality couldn't be beat.",
					"These are my favourite trousers; always bought them when living in USA, and happy to be still able to get them from the UK.",
					"Had been looking for this style of trousers for work that weren’t too formal and wasn’t disappointed. The quality is amazing and they fit great. They are so comfortable to wear, so much so I ordered another 2 pairs!",
					"Finally found dress pants that fit in length and nicely in the waist. Could have gone a size smaller, but didn't want to take the chance of the waist being too tight. These are a little large in the rear end, but I can live with it. So much so, I ordered 4 more, with different colours.",
					"It is very difficult for plus sizes to find pants that are fit well and COMFORTABLE. They are not resistant pants. They are soft (almost velvet) and thin. So dirt especially in black appears very quickly, animal hair sticks easily to it and if you worked in a warehouse (because it's really comfortable) it will tear easily. But, me I don't care about that because I feel great in these pants. I'm short and very plump. So I'm 5.2 feet tall (1.58m) and my weigh is 216lbs (98kg); I have a feminine body shape balanced up and down. I chose 18 short. Perfect fit.",
					"I bought the tall pair for my 34inch inseam and they fit perfectly. I love that I now have a pair of everything go to pants that are long enough. They kept their shape and didn't relax too much and are comfortable all day. I especially love how deep the front pockets are. Usually women's pants have these little pockets! They are a great pair of wear anytime pants. Can't go wrong with them!"
				]
			}
		},
		{
			"id": "whFD7PZ",
			"title": "Champion Women's Cotton Jersey Pant",
			"price": "$12.98",
			"image": "https://m.media-amazon.com/images/I/61fyoyHT4GL._AC_UX385_.jpg",
			"description": "Champion Jersey Pant with a rib waistband is just the right fit and look for everyday wear.",
			"reviews": {
				"customerProfileNames": [
					"Unik",
					"ACollins",
					"AdrienneDriggs",
					"Sarah",
					"AndreaF",
					"EliMac"
				],
				"customerProfilePictures": [
					"https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif",
					"https://images-na.ssl-images-amazon.com/images/S/amazon-avatars-global/51fa9e25-d8af-44dc-b5ef-c910cd1ed0ae._CR81,0,338,338_SX48_.jpg",
					"https://images-na.ssl-images-amazon.com/images/S/amazon-avatars-global/007632ec-10e0-4317-9af7-09536c901397._CR0,0,500,500_SX48_.jpg"
				],
				"customerRatings": [
					"1.0 out of 5 stars",
					"4.0 out of 5 stars",
					"5.0 out of 5 stars",
					"5.0 out of 5 stars",
					"5.0 out of 5 stars",
					"5.0 out of 5 stars"
				],
				"customerReviewTitles": [
					"Advice to Curvy Women",
					"FINALLY!!",
					"Classic Jogging Grey pants",
					"Perfect for tall gals/guys",
					"Almost perfect",
					"Nice quality, lightweight and comfortable"
				],
				"customerReviewBodies": [
					"C",
					"I have been looking & looking for a pair of lounge pants to fit my athletic build in a comfortable way. I am 5’8, 150lbs with a decent sized booty & thicker thighs. I literally have been trying on pants for a year, & leave the stores so depressed feeling like something is wrong with my body shape b/c no pants ever fit me right! I am so happy with the fit of these around the booty, in the thighs, AND finally—there is enough length!! I purchased a medium. Bonus: they are 100% cotton, so goodbye static cling! (Full disclosure: I haven’t washed these yet, so I’m holding my breath they don’t shrink terribly, but so far, I’m VERY happy. Finally.)\n\nUpdate 6/1/2020: These did shrink in the dryer a bit but not terribly. They went from a perfect fit to just a decent fit upon washing. They probably shrunk 3/4 of an inch & got a little tighter in the booty which I didn't want.",
					"Classic grey jogging pants! They're pretty loose but the drape lines created by the ties at the waist feel very natural and don't look weird at all. great length on these too. Bought a Medium and i'm 5'7\", 125lbs and a 35\" hip for reference.",
					"I am 5'9 and 165lbs, pear shaped body. I usually wear a US 12 in pants and dresses. I ordered a Large and it fits nice, and smug, I could probably go a size up since they have a draw string. I have a hard time finding sweatpants that are long enough for me, I usually buy men's because they have a longer inseam. These are the only pair I have bought that are almost too long, even after washing. I roll the waist band once and they still hit the floor while barefoot! These are lightweight, they are not fleece-lined or heavy. They are straight leg style, not too baggy, one roll of the waist band makes my butt look better. I ordered the dark gray and ended up reordering the heather gray (featured in picture) because I love these sweatpants so much. Great for tall chicks, the length might be annoying for anyone under 5'6.",
					"I am on a quest for my holy grail of comfy pants. These are close! I prefer to sleep in these type of pants, as well as wear them around the house as lounge wear. I bought these because they were 100% cotton. (although please note, it seems only the black are all cotton, the other colors are a cotton/poly blend). My criteria for the perfect pair of comfy pants is as follows.\n1.) Fits me\n2.) Are all cotton\n3.) Does not have pockets\n4.) Are long enough (I'm 5'9\")\n5.) Don't shrink - which is difficult when they're all cotton.\n6.) Are so soft and comfortable that I don't want to take them off\n\nThese pants are so close to meeting the list. They do fit fairly well. I bought and XL. I'm a 14/16, but my waist is fairly small so I always struggle with the stomach area being too big, and the thigh area too small. These are pretty balanced, but they are a bit too big in the waist. The drawstring definitely helps. They do not have pockets so they meet that item on my list. These are long enough, and managed to stay at an acceptable length even after normal washing and drying. I do not buy things I have to wash carefully (low heat, etc) if I can help it. I try to keep it low maintenance. They are cotton, they did shrink a little. But compared to some of the competitor's pants I've tried, even much more expensive ones, I was impressed with the amount of shrinkage. I have one pair that still shrinks every time I wash them and I've had them for two years. And the others shrink unevenly so one leg is four or five inches shorter than the other one! I only wear that pair on laundry day.\n\nMy only real issue with these pants, that keeps them from being the holy grail and me buying a dozen pairs is the comfy factor. They are comfortable, but they are just a thicker fabric than I was looking for. They were a bit stiff at the beginning, they did soften up a little after a few washes, but they're just too thick for me. I think they'd be great for people who are looking to wear them out of the house to the gym, etc. This is totally a matter of preference, I am just looking for something to be a bit more loungy and a little less real pants like.",
					"I love these pants. They are great for hanging around the house on an off day and I have even worn them to the gym. The cinch tie waist keeps them from being so loose they ride down and the fabric is a nice lightweight but not overly cheap feeling. I found the overall quality to be really good. I ordered the light grey and liked them so well I ordered the black and dark grey as well. Like other reviews mention, they are long. I'm 5'6 and they need to be about 1 hemline shorter to be ideal. I did find that depending on the color, the hemlines were not consistent. The light grey was fine but both the black and dark grey seem to be a little longer. For the price, it's an easy fix.",
					"I get so frustrated reading dishonest reviews. Notice how most products have a 4 or 4 1/2? This product is no different. The quality is crap, fell apart after 2 washings and the material is so thin there were holes appearing after the first wash. Yep, I'm angry. My advice is DO NOT BUY, YOU'RE JUST THROWING AWAY YOUR MONEY. There, now this is an honest review.",
					"I find them a little too flared at the ankles and high in the waist. A little old-fashioned. But I'm glad for the 100% cotton. They did shrink a little after washing, which I am glad for, because they were about an inch too long in the leg. I am regular, medium build, 5' 7'' (168 cm).",
					"AMO estos pantalones, he comprado 4 de ellos, soy una persona alta. Mido 176 cms, y me quedaron un poco largos, tuve que cortarlos, pero me agradan.\nYo compré XL y me quedan un poquito grandes, tal vez me hubieran quedado en L, pero no me gusta sentir la ropa ajustada.\nTuve una cirugía de abdomen en diciembre y usé estos pantalones durante toda la recuperación, nunca sentí que el elástico me apretara demasiado o me lastimara.\nSon de tela ligera, pero sin transparentarse, no es tela áspera ni se siente rígida.\nLos inviernos en mi ciudad son muy cálidos (18-28 grados Centígrados), estos pantalones fueron suficiente para no sentir frío ni calor.\nNo tienen afelpado por dentro.\nDefinitivamente seguiré comprando este modelo mientras lo sigan manejando.",
					"",
					"These pants are ridiculous, they fit rather large boxy, and the strangest fabric. I thought if I removed the tags and washed them, they’re shrink up a bit and feel softer. No such luck. Kept them, because I removed the tags, but I use them as Pajama pants instead.",
					"Engaño total!\nEs un VIL engaño! Se señaló como el 100% algodón. Sin embargo, el producto tiene 60% de algodón y 40% de poliéster. Es para tirarlo ahora mismo a la basura! El vendedor debería ser multado por proporcionar la información falsa!",
					""
				]
			}
		},
		{
			"id": "8iJjHNM",
			"title": "Bamans Work Pants for Women Yoga Dress Pants Straight Leg Stretch Work Pant with Pockets",
			"price": "$36.99",
			"image": "https://m.media-amazon.com/images/I/51z9BlLTBmL._AC_UY445_.jpg",
			"description": "87% Polyester, 13% Spandex\nImported\nZipper closure\nThe work pants are made from soft and breathable fabric,provide ultimate comfort.\nDesigned with straight leg and streamlined hips cutting,formal but also gorgeous.\nStretchy and lightweight,give you a smooth touch and a soft feeling,work without burden !\n2 front functional pockets,2 back faux pockets,easily hold your phone or other essentials.\nZipper closure,suitable for wearing to work,also comfortable enough to lounge and do some workout.",
			"reviews": {
				"customerProfileNames": [
					"Jenny73",
					"CaitlinOpshinsky",
					"Nicole",
					"LaurenM",
					"StephN",
					"Renee",
					"K.O.",
					"MochaD7"
				],
				"customerProfilePictures": [
					"https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif",
					"https://images-na.ssl-images-amazon.com/images/S/amazon-avatars-global/269fd807-dd31-47ce-a1c7-a11e83c3910a._CR0,0,400,400_SX48_.jpg"
				],
				"customerRatings": [
					"5.0 out of 5 stars",
					"5.0 out of 5 stars",
					"5.0 out of 5 stars",
					"5.0 out of 5 stars",
					"3.0 out of 5 stars",
					"5.0 out of 5 stars",
					"5.0 out of 5 stars",
					"5.0 out of 5 stars"
				],
				"customerReviewTitles": [
					"Love..Love...this yoga style casual dress pants",
					"Pockets",
					"Comfortable, fit good",
					"BUY THESE",
					"Would be nice pants but they're TINY",
					"Perfect fit as expected",
					"5'4 200 got an xl perfect fit",
					"The Perfect Business Pants!"
				],
				"customerReviewBodies": [
					"Great fit and very flattering pants. Very soft and super comfortable. I think I would buy this again, since I just got them I just want to see how this pants would hold up. I'M 5\"3 Tall I weight 178lbs and I order a LG (Large) . The packets on the back of the pants are just for show, they are not really real pockets but I don't care about that, I just love it the way it is.",
					"These pants have actual pockets that you can fit things into. My entire cellphone fits in the pockets without fear of falling out.\n\nThey are a little long, but I am also 5'2 and they are not petite pants, but otherwise they are a good purchase for the price. Especially if you are sick of tiny or fake pockets in your pants.",
					"Love the material feel, gives my butt a nice look as well so that’s always a plus. My waist size is about 32-33inches so it fits slightly big on me but I get bloated majority times so that helps keep it up 🤷🏻‍♀️ Also there’s belt loops so that’s helpful too. I’m short, so bottom touched the floor barely. With some slightly heeled shoes, or tennis shoes, it helped.\nMy only complaint is, if it is slightly tight on you or you got a little small belly/pooch, it’s gonna stretch that front out a little which leads to the zipper being revealed oddly. I don’t like my zipper being seen so I’m always adjusting the flap part to cover it better or I try not to get bloated while wearing them.\nSize:Medium",
					"I bought these to try out, didn't expect to fully love them. I have gained 15 lbs over the last two years, and my dress pants that I already owned were feeling too tight and didnt look flattering anymore. Losing weight takes time, and with return to office I needed professional looking pants that fit while I work on losing the weight. I knew I wanted something with some stretch for comfort and some flexibility as I work on losing weight, and I promise these deliver. They have a button and a zipper and belt loops, you would never know that they were actually yoga pants. I find that the overall aesthetic looks very nice, they're super comfy and I feel even once I lose the weight I will still be able to wear them just due to the stretch. I bought a size small, for reference I am 5'4 and 125 lb, I found that they fit very well. These pants are flattering, professional looking, extremely comfortable, All around a great purchase! Within a week of receiving my pair I have already purchased two more",
					"I normally wear a 16 pants. Ordered these in XL and I could not dream of wearing these. Not even close - I'd say the XL is made for a size 12? I can't even button them. I'm hesitant to order larger because these are quite long already.",
					"W",
					"These look so professional and are so comfy. I will be buying more colors!!",
					"I took a chance and ordered these pants. OMG! Super soft. Enough give to hug in all the right places! Perfect length! I bought a second pair. That should let you know how much I loved these pants😍👏🏽👏🏽👏🏽👏🏽"
				]
			}
		},
		{
			"id": "llLyImt",
			"title": "KMBANGI Women Baggy Cargo Pants Low Waist Wide Leg Sweatpants Casual Drawstring Loose Pocket Joggers Trousers Hippie Punk",
			"price": "$19.99",
			"image": "https://m.media-amazon.com/images/I/61q8mKYuvTL._AC_UX385_.jpg",
			"description": "\n\nWomen Baggy Cargo Pants Low Waist Wide Leg Sweatpants Casual Drawstring Loose Joggers Trousers Hippie Streetwear\n\nFriendly Tips:\n1. Please kindly allow 2-3% difference according to manual measurement.\n2. Please check the measurement chart carefully before you buy the item. (1 inch = 2.54cm)\n3.Please note that slight color difference should be acceptable due to the light and screen. Thanks.\n\nPackage Contents\n1 * Women´s Low Waist Baggy Cargo Pants",
			"reviews": {
				"customerProfileNames": [],
				"customerProfilePictures": [],
				"customerRatings": [],
				"customerReviewTitles": [],
				"customerReviewBodies": []
			}
		},
		{
			"id": "bEwpLog",
			"title": "neezeelee Dress Pants for Women Comfort Stretch Slim Fit Leg Skinny High Waist Pull on Pants with Pockets for Work",
			"price": "$38.99",
			"image": "https://m.media-amazon.com/images/I/612uP51RUAL._AC_UX385_.jpg",
			"description": "62.8% Viscose, 32.3% Polyester, 4.9% Spandex\nMade in USA or Imported\nPull On closure\nMachine Wash\nFlattering Skinny Fit: 4-Way Stretch Knit makes these stretchy pants fit like a dream. Modern Leg, High-rise, Fitted through the hip and thigh. Making them a quick and comfortable option for starting any outfit with style\nClassic Comfort: Pull-on style, (No zipper, no closure). They pull on like leggings, Elasticized waistband that moves with you, and smooths out any imperfections. Now you can look office-ready while enjoying all the comfort of your favorite yoga pants.\nAdded Features: Elastic and durable waist elastic with front pockets, Comfortable Fit with Skinny leg pants for touch of chic. Higher rise designed to keep them from slipping down when bending or crouching. Added back yoke seam for a better fit- No gaping!\nShow more",
			"reviews": {
				"customerProfileNames": [
					"R🧿🧿💭",
					"cassie",
					"Marie",
					"SWilke",
					"Kim",
					"Sam",
					"Amber",
					"JamesCullen"
				],
				"customerProfilePictures": [
					"https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif",
					"https://images-na.ssl-images-amazon.com/images/S/amazon-avatars-global/97d34974-9cb2-43d7-a514-f60fcc6a23cc._CR75,0,350,350_SX48_.jpg",
					"https://images-na.ssl-images-amazon.com/images/S/amazon-avatars-global/07beb561-69ef-490b-9352-02bf72f75338._CR0,0,960,960_SX48_.jpg"
				],
				"customerRatings": [
					"5.0 out of 5 stars",
					"5.0 out of 5 stars",
					"5.0 out of 5 stars",
					"5.0 out of 5 stars",
					"5.0 out of 5 stars",
					"5.0 out of 5 stars",
					"5.0 out of 5 stars",
					"5.0 out of 5 stars"
				],
				"customerReviewTitles": [
					"Comfy, good for many occasions.",
					"Beyond comfortable",
					"LOVE these pants (just check the pockets)",
					"Thick material - super comfortable",
					"Great length and fit",
					"So impressed with the length and fit!",
					"Love them… most of the time.",
					"BUY THEM BUY THEM"
				],
				"customerReviewBodies": [
					"T",
					"I immediately purchased a second pair. And then told my mom and friends to order them. These pants feel like BUTTA! They are so comfortable and have a coolness to them which is perfect for someone who works in the Florida heat. I’m 5’8 and probably about 160 (thank you quarantine weight) and I am very bottom heavy.",
					"I am in love with these pants. I'm 5'11'' and 198 lbs, and a size 12 fits me. They do all the right things for the lower half of my body. Plus they're so comfortable, but still work-appropriate. I get compliments on them all the time, and people ask me where to get them. The only thing you have to do is check the pockets. There's an older version of the pants with satin pockets and those pockets will fray. I got a couple pairs of the older version after I reordered the pants (because I loved them so much), and had to return them. I contacted the seller and they assured me they aren't selling the older version anymore and the next two pairs I got were the newer version that I loved. These are the only brand of pants that I will wear to work; I loved them so much that I just ordered a bunch in black and a bunch in blue. So, definitely try out these pants (just check the pockets).",
					"These pants are AWESOME! I was not expecting the thickness of these pants! They DO NOT look or feel like yoga pants, but like real dress pants, but are EXTREMELY comfortable and have a good bit of tummy control! I’m pleasantly surprised by this purchase. I would suggest sizing down if you want a good snug fit in the leg. I am 5’3” 137lb and bought both a 2 & 4 just to try. I’m keeping the 2 (Im a 4/6 or 7/9 in jeans).",
					"Good quality, not too tight for professional wear, nice length and overall fit - I’m 5’9, but usually wear a regular leg length, I find many Ponte pants run short, but these are great.",
					"I am 5’7, 145 lbs and am mostly just legs. I have been searching everywhere for work pants that are comfortable but are also long enough to reach my ankles. Everywhere I go, I find office pants that are either too short, fit me too tight in weird places, and are not high waisted if they’re long. I’m usually a 4 in pant sizes, and these fit me perfectly. They feel really comfortable to wear walk around in and sit in all day. I am so impressed with these pants, I will absolutely be buying more. 10/10 highly recommended.",
					"The pants are extremely comfortable, perfect for business casual environment, and look great with flats or heels,\nHowever, beware of inconsistent size and length as well as material from one pair to another. One will be perfect but the next might be a 1/2 inch too short, or the legs may fit slimmer than the last pair, and the material may be heavier than others, etc. I simply return and purchase another until I get the correct size/length. Overall I give them 4 stars due to the inconsistencies.",
					"I usually don’t like shopping for pants and ESPECIALLY hate online but these are the pants! They are so stretchy and comfortable while being flattering and professional looking. They fit and curve to your body like leggings but also make sure to smooth out all your cellulite and little rolls! They fit really nicely except sometimes, they don’t stay up super well but tucking the shirt in is such a cute look with them! You can also try to add a belt which i’ve done a few times; honestly just an amazing product and so many cute ways to wear them! I’ve worn these casually and to work, if you’re interested in them totally get them!",
					"Fue lo que esperaba y se siente muy bien la tela.",
					"",
					"Love the cut & fit!"
				]
			}
		},
		{
			"id": "uO8f0NO",
			"title": "DAYOUNG Bootcut Yoga Pants for Women Tummy Control Workout Bootleg Pants High Waist 4 Way Stretch Pants",
			"price": "$19.98",
			"image": "https://m.media-amazon.com/images/I/61yTwG-R0AL._AC_UX385_.jpg",
			"description": "Elastic closure\nSupremely Soft & Non See-through: DAYOUNG flared bootleg yoga pants for women are made from the highest quality fabrics( 87 % Nylon & 13% Spandex ) Nylon Spandex imitation cotton fabric designed to remove moisture-wicking providing maximum comfortable and movement can more lasting.\n4 Way Stretch & Flared Bootleg: Using 4-way stretch material to promote both compression and support. Slight flare bootleg yoga pants at cuffs design to create a streamlined silhouette,giving a slender look.\nOutside Pockets/Back Pockets & High Waist Design: Intimate hidden back pocket to stash your keys,cash and cards, outside pockets can be put for cell phone or any essentials. DAYOUNG Women's workout pants are designed with high waist,tummy control contours your curves and give you a streamlined appearance.\nOccasions: The flared bootleg pants is comfortable, perfect amount of stretch and very fit, great for yoga, fishing, sporting, vacation, beach, sleep, lounging around, and relaxing at home, daily wear. This casual bootcut pants will be a favorite in your lounge wear wardrobe. The flared bootleg pant is a nice choice for any type of exercise, fitness-related activities or everyday wear.\nAs a manufacturer brand for the yoga pants, DAYOUNG always do best to provide good quality products and service for every customer. Any problem feel free to contact us.",
			"reviews": {
				"customerProfileNames": [
					"Dee",
					"Mz.Johnson",
					"Shelby",
					"Maranda",
					"Caroline",
					"nowayJose",
					"Janice",
					"Fluffy31517"
				],
				"customerProfilePictures": [
					"https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif",
					"https://images-na.ssl-images-amazon.com/images/S/amazon-avatars-global/6e540025-d9c5-48b6-9af3-8fe2224098a6._CR0,0,463,463_SX48_.jpg"
				],
				"customerRatings": [
					"3.0 out of 5 stars",
					"5.0 out of 5 stars",
					"3.0 out of 5 stars",
					"4.0 out of 5 stars",
					"5.0 out of 5 stars",
					"5.0 out of 5 stars",
					"5.0 out of 5 stars",
					"5.0 out of 5 stars"
				],
				"customerReviewTitles": [
					"Misleading",
					"These are the BEST and the real deal!!!!",
					"Waste band and color good, length and thickness not so good",
					"Not for work but great for around the house",
					"Great comfort and style",
					"I really liked it",
					"Length and patterns cut off American models",
					"Fit as expected"
				],
				"customerReviewBodies": [
					"Very misleading in color and look. Basically work out pants not to wear to work with heels as I had hoped for!",
					"These pants are the TRUTH!!! I'm 5'2 and 220lbs. I'm heavy, not fat. I'm thick in the rear , flat stomach and small waist. I normally wear a size 12 womens pants.. I have them in just about every color, except red and green. I'm so impressed with these pants that I've ordered about 10 pair without pockets. I can dress them UP with heels or down for work with tennis or boots (truck driver). I have returned so many of these types of pants, so I am happy to find these. The fabric is thick, to whereas I don't have to wear foundation underneath, but don't look cheap. They hold me in very good and smooth like a girdle. The threads don't pop and they don't fade.\nNow, I have ordered the wine color, green and gray colors with pockets, but had to return those colors. The ones with pockets are NOT the same color as the pictures. The green looks grayish, and wine color is much lighter. I also notice the pants with pockets are a thinner fabric, but still nice. Just not the same color. The gray pants with no pockets don't have the same stretch and is a different fabric, more cotton feel. I have some in a XL and the ones that I want to dress up with heels are and tighter are a large, but still comfortable. Neither size rolls down.. I feel super sexy in the LARGE though. I wished they had the wine color with no pockets. You can size up or down. In my pictures I placed the wine (with tag) next to my maroon pair and showed that they green pair looks GRAY..... THICK GIRL APPROVED.",
					"I do really like the color and feel of these yoga pants, the waste band fits nicely also to hold the tummy in. I removed 2 stars because the length is ridiculously long and I am a pretty tall woman (5'8\") with long legs and the ends of the pants drag on the ground. The pants are also semi see through when bending over, I could see the white tag pretty easily.",
					"These pants arrived earlier than anticipated and they are very comfortable. Unfortunately, I ordered them as yoga work pants and was hoping they would be similar to beta brand and they are not which is why I knocked off a star because there are brands that do that better. If you are looking for yoga pants these would work great and come in different lengths/colors which is great for us short people. I ordered the 31's and I'm 5'6\" and they are perfect. Too shiny to imitate work pants though.",
					" Great comfy style, but professinal enough for the office. Perfect fit. Material is thick enough to not be see-through, but thin enough to not be hot in the summer. Very happy with these pants!",
					"I loved it! I use it for my work and I feel really comfortable, the material is smooth and comfortable, weight 148 and I measure 5.3 I bought in size M and I'm going to buy 2 more",
					"I have a 36” inseam and finally I found a company making longer pants as a 33-34 inseam. Had no problem until China moved into the picture. Of course the buyers has the control on that. Us tall ladies don’t have much choice on fabric and length of our garments. There many more tall girls than ever before.",
					"Perfect I’m 6’1 they are long enough they are perfect",
					"Raisons personnelles.",
					"",
					"el precio es muy alto para el tipo de tela y pantalon",
					""
				]
			}
		},
		{
			"id": "4Kj_ISo",
			"title": "Amazon Essentials Women's Studio Woven Stretch Jogger Pant",
			"price": "$18.04",
			"image": "https://m.media-amazon.com/images/I/31IG1c5zz1L._AC_UX342_.jpg",
			"description": "Amazon Essentials keeps you moving from the moment you step out the door. You'll find performance tees, hoodies, gym shorts, and more made with quality fabrics at stock-up prices. Whether you're heading out for a jog or running errands with the kids, our apparel is made to work out, live in, and lounge.",
			"reviews": {
				"customerProfileNames": [
					"Brookehart",
					"Live2Travel",
					"CourtneyGuido",
					"KimMK",
					"Kyna",
					"Customer",
					"Customer",
					"SuperAmazonMom"
				],
				"customerProfilePictures": [
					"https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif",
					"https://images-na.ssl-images-amazon.com/images/S/amazon-avatars-global/edbefdd5-8de5-4d86-9b7c-df006950a24d._CR0,0,375,375_SX48_.jpg"
				],
				"customerRatings": [
					"5.0 out of 5 stars",
					"5.0 out of 5 stars",
					"5.0 out of 5 stars",
					"3.0 out of 5 stars",
					"5.0 out of 5 stars",
					"2.0 out of 5 stars",
					"5.0 out of 5 stars",
					"2.0 out of 5 stars"
				],
				"customerReviewTitles": [
					"I'm a Size 14 and XXL are really big on me",
					"Awesome lightweight pants!",
					"Great thin joggers!",
					"Great fabric, short and small",
					"Slim and comfortable",
					"Not what I was hoping for.",
					"Awesome joggers for the money",
					"Tight in the calves"
				],
				"customerReviewBodies": [
					"I gambled and bought the XXL and they are baggy. Just wanted to let other size 14 women out there know that.",
					"Great pants! I bought them for Travel and they stood up to trekking through temples and hiking hilltops. They are very lightweight - soft silky material with just the right amount of stretch to them.\n\nThey will show water marks if you splash water from the outside, but they dry very quickly. Amazingly though, the pants never showed any of my sweat. In the photo, it was about 1000% humidity and I was sweating hardcore (Hello, boobsweat!), but you can't see any marks on the pants!\n\nI bought the large, and I was very happy with them for travelling, comfortable on long rides and flights, but since I got home I ordered the Navy in medium and they are a big snugger and less baggy overall so I think I'll get more day to day wear on the medium. I want them in all the colors!!",
					"I LOVE these pants! I am 5’2 and a mother of 2 with thicker thighs and a bigger butt. I live in the south and the weather is hot. I wanted/needed a thin pair of joggers to play with my kids in. These work great!!! They dry really fast for when we play in the water table or watering our garden. They are a bit tight on my calves. At first I didn’t like that when I tried them on but after wearing them during the day I didn’t even notice it. I have a pair of Lululemon joggers that are a bit thicker but these fit very similarly.",
					"I love the cut and fabric of these, however they were too small for me and too short. I’m 5’9” and the leg was much too short, hitting me four inches above my ankle. I am a size 10-12 bottom, and I would definitely need the xl for my bottom :)",
					"These pants have a great fit and can be worn for hiking, the gym, or just as a relaxed outfit. I am very satisfied with this find!",
					"I really wanted to like these joggers, but there were some big issues with them. I’m 5’6” and the length was very funky with them not quite hitting my ankle. The material is also super thin and felt more like track pants than I would want a jogger to feel like. If they were cheaper in price maybe I would understand the choice of material, but overall they were just very uncomfortable and not what I was hoping for out of them. Plus super thin so I couldn’t really wear them in any other season than really summer.",
					"These fit great & the fabric is perfect",
					"These pants are okay for the price. The fit is strange, though- they are very tight in the calves (and I don't consider myself to have large calves), so beware of that when considering purchase. They are also very thin, which isn't necessarily a bad thing, just that they aren't made of very substantial fabric.",
					"2",
					"Bought these and was so impressed lightweight comfortable .\nBought blue then ordered another pair on black which they did other colours",
					"I like these pants more than I thought I would! I find them perfectly comfy and roomier at the thigh and hips (without being baggy), and they taper below the knee with a stretchy ankle. These pants end directly at my ankle. For reference, I am 5’4”, 135lbs, with a 29” inseam. The material has a bit of stretch and give, and drapes nicely, in my opinion. The waist band is stretchy and has a drawstring, the drawstring is far too long, and I may remove it. The material is similar to “windbreaker” material, but with stretch; it is lightweight and does rustle a bit when one walks. I found the pants slightly tight on my left calf, which is why I took a star off (plus the too long drawstring). These pants would be great for travelling, and I would definitely consider purchasing a pair in a different colour.",
					"I love these pants! I buy them for work because they look and feel similar to some scrubs but look a lot nicer than your traditional scrubs. (These are NOT scrub pants but if you work in the medical field and are not required to wear scrubs but want something comfortable and similar in function they are good) I like them because I’m short and the elastic at the bottom is easy to roll up or bunch up so my pant legs aren’t dragging on the ground. I have every colour and have had no issues at all. The sizing is accurate. I wish they had more colours (specifically a dark red pair or a lighter beige or white pair would be nice)",
					"Ok, these pants are AMAZING! They do seem to run a bit big though. I'm 5'5\", 210lbs and usually wear a 14. Bought an XL and wish I had went with a large. I would return, but I don't wanna take them off lol... So I'll just buy another pair in a L. Maybe a few different colors too. Can you tell I'm in love? LoL"
				]
			}
		},
		{
			"id": "eTv0nHC",
			"title": "Amazon Essentials Women's Performance Slim Bootcut Active Pant",
			"price": "$18.50",
			"image": "https://m.media-amazon.com/images/I/81lNpVMqq0S._AC_UX342_.jpg",
			"description": "An Amazon brand - Train in confidence with this sporty bootcut pant featuring a flattering wide waistband\n\nAmazon Essentials keeps you moving from the moment you step out the door. You'll find performance tees, hoodies, gym shorts, and more made with quality fabrics at stock-up prices. Whether you're heading out for a jog or running errands with the kids, our apparel is made to work out, live in, and lounge.",
			"reviews": {
				"customerProfileNames": [
					"ButterflyLoverinRI",
					"BarbaraE.",
					"Bywater",
					"NanaRita",
					"K.Martin",
					"TerryD",
					"Chelsea",
					"Customer"
				],
				"customerProfilePictures": [
					"https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif"
				],
				"customerRatings": [
					"5.0 out of 5 stars",
					"1.0 out of 5 stars",
					"5.0 out of 5 stars",
					"5.0 out of 5 stars",
					"4.0 out of 5 stars",
					"5.0 out of 5 stars",
					"5.0 out of 5 stars",
					"5.0 out of 5 stars"
				],
				"customerReviewTitles": [
					"Great lightweight yoga pants",
					"Very uncomfortable on sensitive skin.",
					"Nice.",
					"Nice pant",
					"Comfy and Inexpensive",
					"Exactly What I Was Looking For!",
					"Just buy them",
					"Fantastic yoga pant"
				],
				"customerReviewBodies": [
					"These are a wonderful weight for summer. They are not at all see-through, have just enough stretch in them to move easily with your body, and almost feel like a pajama pant that clings gently to the tummy and upper thigh and then gets slightly wider at the bottom. I typically wear Champion yoga pants in the winter, which are much too heavy for spring/summer/even early fall usage so I will definitely get a lot of use out of these.",
					"The seams and elastic around the top/waist of the pants are rough and almost painful Washing didn't help.",
					"I like the pants just fine, but where’s the pocket? Usually don’t buy pants without pockets.",
					"Purchased for laid back days and they are nice. I ordered a size large and wear a size 12. They wash up nicely.",
					"Really nice pair of yoga pants. Took one star off only because the material is a little thinner than you would get in a higher end pair but five for the price. I’m just under 5’3” and the length was perfect for me. Hem fell to just above the ground with running shoes on. I like that they are low compression (not too tight in the belly). Although compression fabric is great at times, I like to have a more comfortable fit for hanging on the couch or traveling.",
					"I",
					"I",
					"Loved these. Ordered several pair. No show through. Nice quality fabric. Dresses up or down. Fabulous price.",
					"I’m not crazy about the material as a usually like a softer touch fabric, but they are still very comfy. The high waist is at a great height and not an uncomfortable band. Very flattering overall I just wish the bootcut was a little more flared.",
					"Matériel léger et facile d entretient",
					"",
					"I",
					"Fits perfectly. Light weight. Comfortable.",
					"Buena calidad de la tela, se expande y no es tan delgada",
					""
				]
			}
		},
		{
			"id": "oR2WhZN",
			"title": "Amazon Brand - Core 10 Women's (XS-3X) Woven Jogger Pant Pants, -Black, 1X",
			"price": "$20.66",
			"image": "https://m.media-amazon.com/images/I/71BkSasQ3IS._AC_UX342_.jpg",
			"description": "An Amazon brand - This comfortable jogger pant was built for gym workouts and weekend wear\n\nEmpowering women to reach their full potential is at the heart of what we do. Because when you’re wearing Core 10, you’re ready to experience more. Be more. Live more.",
			"reviews": {
				"customerProfileNames": ["Taylor"],
				"customerProfilePictures": [
					"https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif"
				],
				"customerRatings": ["3.0 out of 5 stars"],
				"customerReviewTitles": ["Comfortable plastic"],
				"customerReviewBodies": [
					"They are a bit baggy on me as I'm pretty short (5' 0\") so they kind of look and sound like I'm wearing plastic pants. However I think they are incredibly comfortable and they have quickly become my favorite hiking pants."
				]
			}
		},
		{
			"id": "B01c_L-",
			"title": "Saloogoe Womens Sweatpants Baggy High Waisted Fall Pants Cinch Bottom Joggers with Pockets",
			"price": "$24.99",
			"image": "https://m.media-amazon.com/images/I/71FWGuhWi7L._AC_UY445_.jpg",
			"description": "✦Skin-Friendly Material: 78% polyester, 17% rayon, 5% Spandex. It's soft, comfortable, lightweight, elastic, breathable and no pilling. Please refer to Our Size Chart before Ordering(NOT AMAZON SIZE).\nImported\n✦The thickness is moderate(No Fleece Lining), ribbed fabric, perfect for lounging around the house and going out, not great for warmth, just right for summer/spring/fall.\n✦Elastic High Waist: The sweatpants with wide elastic waistband to flexiblely fit different waist circumferences. It prevents curling through the strengthening technology of waistband, comfy to wear all day.\n✦Two Slant Side Pockets: The jogger sweatpants for women feature two side pockets for easy storage of your essentials to free your hands, perfect blend of functional and stylish.\n✦Elastic Cinch Bottom: The cinch bottom provides greater freedom of movement without wetting the bottoms. The ankle cuffs are elastically designed to keep trouser legs in good shape, lengthen your legs visually.\n✦Match & Ocassion: Great to pair with any tops, shirts, sweatshirts, sweaters and so on. Suitable for workout, work, daily-wear, jogging, climbing, hiking, party, bicycling, travel, vacation, etc.\n✦Care Tips: Machine or hand wash in cold water, hang or line dry, no bleach/no dry clean for cinch bottom baggy sweat pants.",
			"reviews": {
				"customerProfileNames": [
					"LindaS.Hoffman",
					"jay",
					"PaulRKrutakJr",
					"MarieMacLeod",
					"MaddieParker",
					"vianeychi",
					"Patty",
					"MoniRoberts"
				],
				"customerProfilePictures": [
					"https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif"
				],
				"customerRatings": [
					"5.0 out of 5 stars",
					"3.0 out of 5 stars",
					"5.0 out of 5 stars",
					"5.0 out of 5 stars",
					"4.0 out of 5 stars",
					"4.0 out of 5 stars",
					"5.0 out of 5 stars",
					"3.0 out of 5 stars"
				],
				"customerReviewTitles": [
					"Sweatpants",
					"NOT sweatpants",
					"Pants are comfy and fit well.",
					"Super comfy!",
					"Love the ribbed fabric",
					"Es un algodón muy delgado",
					"",
					"A bit bigger than I usually wear but very comfortable and I love them",
					"Not as expected"
				],
				"customerReviewBodies": [
					"Perfect for after a long day at work. Baggy enough to be comfortable, elastic waist not too tight or loose. Washes nicely.",
					"These are not your traditional sweatpants that are made of the same material as your hoodies. These are lightweight knit. Very comfy but won't keep you warm.\nLove the pockets. Nice thick fabric used.\nI'll keep these for around the house but keep looking for traditional sweatpants.\nI'm a heavier person at 5'6\" and the xxl fits fine. Waist band has to be the most comfortable I've ever had. Does not twist or bind. These wash very well.",
					"My granddaughter (early teens) had a pair of these she loved, but outgrew them. We went up a size to medium and she's very happy with them.",
					"They are not thick like swear pant material, but still super soft and comfy!",
					"It fits great, if you like baggy sweats then size up. The fabric is a tad thinner than I would want but still amazing for the price. They do get pills easy but I’m obsessed with the color options. They’re the perfect sweats for lounging around the house and even going out, not great for warmth if you’re looking for something like that.",
					" Es un algodón mucho muy delgadito y vienen medida amplia Yo peso 140 libras y pienso que un mediano Fue la mejor porque encargué un Large y me queda muy grande",
					"",
					"These are a 2X and run a bit larger than I usually wear but that is OK since I just wear them around the house. The material is different too, not the usual sweat pant material. I like the feel of them. hey are really comfortable. Very happy with them. Love the dark green color too.",
					"These were a bit of a disappointment for the price. These aren’t anything special. They could be bought at Walmart. They collect the little fabric balls easily and I wish they were longer. If they’re going to be high on the waist they shouldn’t go up your calf when you cross your legs"
				]
			}
		},
		{
			"id": "-_AXllN",
			"title": "OFEEFAN Womens Fall Pants with Pockets Winter Elastic Waist Sweatpants Wide Leg Drawstring Pants S-XXL",
			"price": "$25.99",
			"image": "https://m.media-amazon.com/images/I/616NE8o1dnL._AC_UY445_.jpg",
			"description": "95% Polyester, 5% Spandex\n[Closure Type]--Elastic Waist Sweatpants for Women,Drawstring Long Pants with Pockets, Easy to Pull on and Off closure\nMachine Wash\n[Design]--Long pants for women, loose fitting, straight leg, skin-friendly, casual lounge pants, yoga pants, running pants, outdoor lounge pants, sleep night lounge pants,boot cut leg pants, sporting pants, workout pants for women\n[Feature]--Elastic waist pants with drawstring, adjusts the comfortable size according to the waistline. Two convenient side pockets pants,help to hold your cellphone,keys,coins and lipsticks easily, stop worrying about where to put your phone while you are working/sporting.\n[Stlye]--Deep pockets and wide leg,comfy and casual jogging pants which are designed to help you free your hands when workout or in casual wear. Straight leg will make you looks slimming fit and flattering on your curvy body.\n[Occasion]--Perfect for spring fall and winter, great for yoga, running, exercise, fitness and any type of workout. It is more versatile than a legging for work and lounging around the house. Great as loungewear.\n[Size guide]--Model Size: Small-Height:5'7'/ Weight-23.6\" / Hips-35.4\", Please refer to product image or description size guide before order,Please allow 0.4-1.2inches error due to the measurement error, thanks",
			"reviews": {
				"customerProfileNames": [
					"dahlialady",
					"KeyBelieve",
					"silviagirdley",
					"JB",
					"Memaw",
					"ElsaMendoza",
					"bbbright",
					"LolaFady"
				],
				"customerProfilePictures": [
					"https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif"
				],
				"customerRatings": [
					"5.0 out of 5 stars",
					"5.0 out of 5 stars",
					"5.0 out of 5 stars",
					"5.0 out of 5 stars",
					"5.0 out of 5 stars",
					"5.0 out of 5 stars",
					"5.0 out of 5 stars",
					"4.0 out of 5 stars"
				],
				"customerReviewTitles": [
					"Just what I was looking for!",
					"Elastic waistline extra long",
					"It fits",
					"Comfortable pants",
					"Perfect Casual Wear",
					"Cómodo",
					"",
					"Good fit and very comfortable.",
					"tight waist"
				],
				"customerReviewBodies": [
					"This pant is very comfortable and the M size fits my 5'6\", 132 lb. frame perfectly. The length is just right as well as the fit through the waist and hips. They are well-constructed, the fabric is soft and comfortable, and the pockets are a big plus. The fabric is a good quality knit, but lightweight, so if you are looking for a thicker, warmer fabric, traditional sweatpants are probably what you should search for.",
					"This pants fits perfectly and looks stylish. I nought two as workpants and i get many compliments.",
					"Love the color which doesn’t fade. It’s soft and comfortable and fits to the teeth. Glad I ordered those pants",
					"Pants are comfortable and have a loose fit.",
					"I now have 7 pairs of these pants. I wore a pair this morning and did a half hour workout of riding the bike and stretching. Then it was grocery shopping with the same outfit. A friend asked me to lunch, so I just changed tops and was ready to go again wearing the same pants. Instead of eating at home tonight, my husband suggested we go somewhere and grab a sandwich. I added a nice jacket over the lunch outfit and was ready to go again. These pants are comfortable, functional, and yes, can be dressed up or down and worn anywhere!",
					"Son cómodos pierna ancha tela suelta y puedes usarlo como Sport o cómo vestir lo compre muy lo devolví porque estaba buscando algo para el frío de lana grueso y este es tela liviana como para primavera",
					"",
					"Fabric is soft and comfortable. The fit is perfect.",
					"those pants are very soft and comfortable. I like them the only thing is that they're tight on the waist as mentioned on reviews. I thought it's not gonna be an issue for me since I'm size small and skinny but still feel them tight. I want to order more but I hesitate cause of that."
				]
			}
		},
		{
			"id": "HVrCGeB",
			"title": "NIMIN Yoga Pants for Women High Waisted Sweatpants Lightweight Joggers Pants Comfy Workout Lounge Pants with Pockets",
			"price": "$19.99",
			"image": "https://m.media-amazon.com/images/I/51QJp9jw5qL._AC_UY445_.jpg",
			"description": "💗 Comfy Material: 60%Polyester, 35%Rayon, 5%Spandex. The loose beach pants is soft, lightweight and breathable. Durable enough for your gym or casual.\nDrawstring closure\nMachine Wash\n💗 Features: Comfy and soft, multifunctional summer pants. Cute womens joggers pants, high waisted, wide leg, elastic waistband, drawstring, two functional side pockets, easy to pull on, solid color, loose fitting. Easy to wear and suitable for most people's body type.\n💗 Stretchy & Drawstring Waist: Workout pants for women with drawstring elastic waist, easy to adjust for a better fit. Give you more freedom in your sports time. Skinny leg will keep the pants in place and show off your sneakers. High waisted yoga pants will increase your waistline and make your legs slender and longer.\n💗 Washing Tips: Mild Machine Wash Cold/ Do Not Bleach/ Hang Or Line Dry to increase the durability of your sweat pants.\n💗 Occasions & Match: The yoga pants with pockets for women is great for yoga, pilates, gym, jogging, vacation, beach, sleeping, lounge around, and relaxing at home. It is also a good choice for your daily casual wear. Suitable for spring, summer, fall. You can simply match a sports bra or vest, t-shirt for a chic look.\n💗 Size Guide & Customer Service: Waist: S-26.77’’, M-28.74’’, L-31.50’’, XL-34.65’’, 2XL-38.19’’. 📣📣📣We strongly suggest that you have your body measurements taken first, and then refer to our size chart before order. 💌Yoga pants women are sold with a 30-day, full-money-back warranty and can be returned no questions asked. Please feel free to contact us: )",
			"reviews": {
				"customerProfileNames": [
					"ArlingtonInk",
					"HollyLig",
					"KKNicolas",
					"RobertC.CuvoSr.",
					"Customer",
					"Lilly",
					"Customer",
					"RobinBallard"
				],
				"customerProfilePictures": [
					"https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif"
				],
				"customerRatings": [
					"3.0 out of 5 stars",
					"2.0 out of 5 stars",
					"4.0 out of 5 stars",
					"5.0 out of 5 stars",
					"5.0 out of 5 stars",
					"5.0 out of 5 stars",
					"5.0 out of 5 stars",
					"5.0 out of 5 stars"
				],
				"customerReviewTitles": [
					"It's okay..",
					"Run small, very thin.",
					"I love these comfy sweats",
					"Multi purpose",
					"pockets",
					"Love these",
					"Looks very",
					"softness of the pants and how they fit for my size."
				],
				"customerReviewBodies": [
					"I sized up just to be safe.. Order an extra large. They were not very flattering to my body. I usually fit a size 12 and they were a bit big and baggy. I'm curvy and these pants made me just look fat. I would return them but I'll keep them to just sleep in instead.",
					"These are definitely small, hug the hips a little bit too high making them look like grandpa pants, very very thin material, basically like a cheap legging material in a different design. I did keep them because they’re at least cute to throw on but poor quality and probably overpriced and not exactly what I expected.",
					"I’m 5’8 155-160 with a big butt and thighs. The large was surprisingly tight on my stomach which is small for my bottom size. I usually wear a medium. They are okay but I won’t wear them with a crop top. For fear of a muffin top. I also ordered an X-Large as well these one run kind of big but I tightened the draw string and love them. I only took off one star because the sizing was small on large but big on extra large. I kept them both but like the bigger size better.",
					"Great Item by size and quality",
					"soft and comfortable for Yoga class or lounging at home.",
					"They're amazing and comfy to wear while lazing around the house or sont feel like getting dressed",
					"Like the tapered look.",
					"They fit so nice and comfortable."
				]
			}
		},
		{
			"id": "zB9SuPy",
			"title": "ROSKIKI Womens Corduroy High Waist Stretchy Elastic Waist Flare Pants",
			"price": "$19.99",
			"image": "https://m.media-amazon.com/images/I/61rPCx3gvoL._AC_UY445_.jpg",
			"description": "93%Viscose+7%Elastane\n进口\n✔Material:This flare pants for women are made from high quality materials with 93%Viscose+7%Elastane.Stretch,soft and comfortable to wear.\n✔Features:Solid color, bootcut pant.The flatlook seams are comfortable and minimize rubbing and chafing.Combining fashion, function and performance.\n✔Occasion:The pants is suitable for casual wear, going out, yoga, vacation or beach wear. Lightweight and breathable material wicks away sweat to keep you comfortable with these active yoga joggers pants. perfect for yoga, exercise, fitness, rest and sleep or do housework.\n✔All-match: The flattering pants is slim style.Solid color makes it easy to match t-shirt or blouse tops. Pair with flats must be very gorgeous.\n✔Notes:Machine washable with cold water(like colors), and tumble dry low. Relaxed fit for great comfort and movement.",
			"reviews": {
				"customerProfileNames": ["HaleyFoxBlog"],
				"customerProfilePictures": [
					"https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif",
					"https://images-na.ssl-images-amazon.com/images/S/amazon-avatars-global/ce999c90-4fc0-4233-952e-98408c3bd187._CR0,0,500,500_SX48_.jpg"
				],
				"customerRatings": ["5.0 out of 5 stars"],
				"customerReviewTitles": ["Love them"],
				"customerReviewBodies": [
					"Very nice quality corduroy pants. Not too thick so they’re comfortable to wear. They originally go on fairly tight, but they are stretchy and loosen up after a few minutes. Super fashionable, goes with just about anything. Very good price, highly recommend."
				]
			}
		},
		{
			"id": "Tg9ZXm1",
			"title": "Danskin Women's Sleek-Fit Yoga Pant",
			"price": "$24.99",
			"image": "https://m.media-amazon.com/images/I/51YoRmnnIiL._AC_UX342_.jpg",
			"description": "",
			"reviews": {
				"customerProfileNames": [
					"Folantin",
					"SusanBybeeBabcock",
					"Dawn",
					"NewEnglandNative",
					"RedMre",
					"SunnyGirl70",
					"Donna",
					"SamWoodieFlowe"
				],
				"customerProfilePictures": [
					"https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif",
					"https://images-na.ssl-images-amazon.com/images/S/amazon-avatars/a9d5833d-a861-4aec-97f9-f3e6ab9e5d43._CR88,0,324,324_SX48_.jpg"
				],
				"customerRatings": [
					"5.0 out of 5 stars",
					"5.0 out of 5 stars",
					"2.0 out of 5 stars",
					"5.0 out of 5 stars",
					"5.0 out of 5 stars",
					"5.0 out of 5 stars",
					"5.0 out of 5 stars",
					"5.0 out of 5 stars"
				],
				"customerReviewTitles": [
					"will buy more.",
					"I LOVE these so I ordered two",
					"HELP.....",
					"Great comfortable pants",
					"Great pants -- I will order again!",
					"Nice Yoga Pants... holding up well with wash and wear!",
					"I absolutely love these pants",
					"Looooooove!"
				],
				"customerReviewBodies": [
					"It's so hard to buy online. Small/medium etc mean nothing these days. So here goes:\nI'm 5 ' 6\" tall. 117 bs. Hips 36\" I take a 31\" or 31 1/2 inseam.\nI have many yoga pants but I was looking for something to wear around house and also if I need to run errands. So in other words not too tight. I am in my 60s.\nI bought small and they are almost perfect.\nThe material is soft and stretchy. They are not too terribly loose around my thighs but not too tight either. At the top of my thighs I can pinch an extra bit of material that is less than an inch (that's loose). Can't believe I am doing this but at the widest point my thighs are 19 inches. Hope that helps someone else out there.\nThese fall just below my ankle bone so perfect for me.\nThe waistband is a little loose but I'm not going to get anything that's perfect. The waistband measures about 31 inches. It has plenty of stretch (measures about 2 1/2 inches high). When I lay the pants on the bed, it's obvious that the waistband doesn't curve in enough. However, these are not too loose on me but I wish the waistband was a bit tighter. May end up pinning in the band a bit.\nI am not a huge fan of boot cut pants as I start thinking about bell bottoms. These are 16\" wide at the base.",
					"I LOVE these so I ordered two. I ordered XL. I'm 5'8 1/2 and fluctuate from 180-200 pounds. They are comfortable and not too snug. The length is great too. I feel very comfortable to work out in these or wear as lounge pants or run errands in them. Brillant find! So go buy them!",
					"W",
					"I love these pants. Very comfortable for hanging around or for exercise. I ordered a Large, even though my pant size is usually 8-10. I like the slightly looser fit, it makes them look more like pants and less like exercise clothes for a quick trip out to the store or something.\n\nI'm 5' 8\" and weigh 140 to give you some idea of the sizing.",
					"I love these pants! The fit is sleek but not as form-fitting as leggings, the fabric is heavy and has a bit of a drape. Because the logo is up near the waistband, it is easily covered by a top, and so I feel OK wearing them for daily wear vs just a workout wear. I also like the wide waistband because I am not constantly having to pull my pants back into place every time I stretch. As for care, I wash them normally with other dark items, but I let them line dry vs using the dryer (as I would with lingerie) to preserve elastic properties.",
					"These are very nice yoga pants. I am 5'9\" and 175lb and ordered a size Large (12/14). I feel good in these and wore them to the gym today. They were very comfortable to work out in. The waistband is just under 3\" thick and the pants come up nicely and stay put. I have a long torso and I liked the fact that these came up high enough on my waist. When I bend over, I don't have a \"gap\" in the back.\n\nI have washed these yoga pants at least half a dozen times and the length is still great. I wash mine on a cold water wash and hang to dry, so that may be why they are still 32.5\" long. The seams and hem are stitched very well and I expect to be wearing these for a long time.",
					"I absolutely love these pants. I have several Danskin pants each with different fits and I love this sleek fit the most. It is not as wide or flare cut at the bottoms which I like and the waistband is thicker and has a good amount of stretch, making it very comfortable and not restrictive. It fits just as I like and the length is great too as I am 5'6\" and they are plenty long enough. I can't imagine anyone being disappointed with the fit, except if you are short, then it may be too long.",
					"PERFECT for lounging, walking, yoga. I'm 5'3\", 120lbs. and the medium was too big around the waist for me and a little too long. I exchanged for a small and they are perfect! They could be about half and inch shorter, but with shoes on (even flat house shoes) these are a fine length. They come up about an inch below my belly button, so I consider them mid-rise. Very comfortable with a thick band at the top. They're soft and stretchy and surprisingly warm. They do collect some dog hair, but I just use them around the house anyway and can pretty easily get it off with a lint roller. All in all, I love them and would DEFINITELY buy them again!",
					"I love these pants. I got my first pair at the beginning of the lock downs. They got a lot of wear as we were stuck at home. They have the comfort of pajamas, but they look much nicer. I ordered a second pair so that I have a pair to wear while I wash the other pair. They held up very well to the constant use of lockdown. I bought my third pair recently when I was finally able to return to the football pitch. I had assumed that they would really start to show their age from playing football in them. I am glad to have a third pair, but they've held up even to football.\n\nThese pants fit as expected, they have the perfect amount of give to not be too tight or too loose.",
					"I've had a pair of Danskin yoga pants for years, & love them...until I ripped them. I ordered these as a replacement. They're not the same however. The material is much thinner, & poorer quality. The fit is also much smaller than previous. They were sent back unfotunately.",
					"Just bought this Danskin along with a similar Spalding pant. Here are the differences:\n\n- The material for both is a similar weight, neither thick nor thin.\n- Danskin waistband = 2.75 in/7 cm with a wide elastic that is sewn in top and bottom.\n- Spalding waistband = 2.4 in/6 cm with a 3/4-inch elastic (see first photo with arrows)\n- inseam is 31 inches or 79 cm for both.\n- Danskin hem width is narrower than the Spalding (see 2nd photo with tape measure) but tops of legs are similar.\n\nAnyway, I'm curious to see if the elastic in the Spalding will eventually begin to roll. Had I known that it was not sewn top and bottom prior, I would not have bought these pants. That's the problem with buying online. Overall, I'm happy with both for now.",
					"I liked Danskin in the past. I have worn it for years. The quality has changed. I was happy to find pants in Navy blue. I have allergies to some chemicals companies use to make the colour black. So Navy Blue is very good. These pants are good but there is a big problem with the outer leg centre seam hip to hem. The seam looks decorative in same colour stitching, Navy. It starts off centred at the hip and as it goes down the pant leg it ends up off centre and ends up at the side of the knee. From the knee down to the hem it’s not centred.",
					"I purchased the 3XL size because of the length advertised. I ended up returning the product because the waistband is wide, elastic and tight, small for a 3XL, likely a 2XL. the rest of the pant is fine, but the length is too short for me at 5'10\". Plus these are not flared at the bottom, but straight wide leg, not quite like the picture shows. For a smaller person they might fit fine."
				]
			}
		},
		{
			"id": "J1dHROo",
			"title": "GRACE KARIN Womens Casual High Waist Pencil Pants with Bow-Knot Pockets for Work",
			"price": "$32.99",
			"image": "https://m.media-amazon.com/images/I/61PXz9eIdCL._AC_UX342_.jpg",
			"description": "95% Polyester, 5% Spandex\nImported\nPull On closure\n【Materials】95%Polyester+5%Spandex, the fabric is soft and safe. It is smooth and has medium elasticity, and fits the body\n【Waist Design】High waist with ruffled, back elastic waist, and with a removable belt. It looks elegant and stylish, stretches close to the body, does not wear too tightly, and is suitable for most people\n【Shirred Detail 】The slightly looser trouser legs are tightened at the ankles, which not only modifies the shape of the legs, but is also super comfortable and easy to wear, and it is in line with the current young people's fashion concept: casual\n【Occasion】The pant is suitable for office, negotiation, party, work, outing, dating, and other formal occasions and daily wear\n【Match】In terms of collocation, whether it is casual or formal wear, it will not look abrupt, and it can also bring a different style to your dress. It can be said to be a really versatile item",
			"reviews": {
				"customerProfileNames": [
					"Aly",
					"Sandy",
					"CaraFiller",
					"MaceyM.",
					"Stephanie",
					"Marcus",
					"destinyyautumn",
					"LolitaS."
				],
				"customerProfilePictures": [
					"https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif",
					"https://images-na.ssl-images-amazon.com/images/S/amazon-avatars-global/a5cdaa60-3867-47d9-8e79-4cab8dc6d4aa._CR0,0,479,479_SX48_.jpg",
					"https://images-na.ssl-images-amazon.com/images/S/amazon-avatars-global/51a9f49f-f33d-4a46-acd6-eff427484338._CR0,0,375,375_SX48_.jpg"
				],
				"customerRatings": [
					"5.0 out of 5 stars",
					"5.0 out of 5 stars",
					"5.0 out of 5 stars",
					"5.0 out of 5 stars",
					"5.0 out of 5 stars",
					"4.0 out of 5 stars",
					"5.0 out of 5 stars",
					"5.0 out of 5 stars"
				],
				"customerReviewTitles": [
					"Cute, comfortable, and so stylish!",
					"Good fit, good quality",
					"These pants are sleek, stretchy and fit perfectly! Love them so much I had to write a review!",
					"Really cute and well made!",
					"Cute pants, I'd give 4.5 stars",
					"They might run small, maybe.",
					"MY FAVORITE WORK PANTS!",
					"Perfection and classy"
				],
				"customerReviewBodies": [
					"I am absolutely in love with these pants! It took me a couple tries to get the sizing/fit right for my body but the XXL ended up being perfect.\n\nFor reference, I’m 5’8” weigh 190 lbs, have a long torso, and carry a lot of excess skin on my stomach from large weight loss. I wanted a bit looser fit so as to not hug my problem area (stomach). The XL fit but had a tighter fit. The ones in the picture are XXL.\n\nThe material is so soft and durable. Seriously, so comfortable, I love them. The pockets are large, the belt fits nicely and the ties in the ankles stay all day. I got so many compliments on these pants I will for sure be buying other colors now that I’ve found the right fit. Great work pants!",
					"I read various good reviews before ordering, and I'm glad I did. I really enjoy these pants. I am 5'7\" and about 185 lbs, normally a size 12 pant, and I ordered an XL. They fit really well. Maybe a bit big in the waist, but I didn't want anything smaller to be tight on my thighs/behind, so I'm really happy with the sizing. The pictures don't really do justice, and I don't love this top with these pants as much (it's a looser fit, and I need something that tucks in better), but I am so pleased with these pants. I haven't washed them yet, so I don't know how they wash, but other reviews have said they wash good. If I had one complaint, it'd be that they're a touch long for me, but I just tied the bottom bow a little tighter so they don't fall down. The length would be perfect with sandals. I also LOVE the pockets. They are big enough to put my phone in (iphone 7) AND to put my hand in at the same time. Overall, the material lays/wears in a flattering way, and I love that. I couldn't be happier with these pants.",
					"T",
					"Good quality, cute dressy pants! I couldn’t believe they fit so well considering online purchase. The material is very sturdy and nice. I’ve washed them on delicate twice without issues. I get lots of compliments at work. You could dress them up or down. I really really like these and will prob get other colors. Only problem was that the waist was a little tighter than it probably should be to have the full ruffled look, but a size bigger would probably swallow me. Still super happy. I’m 5’4” and size 2 normally. I bought a small. Can be worn with heels or flats.",
					"I bought two pairs of these pants, one in army green and one in black, I ordered both styles. I sized up and got an XL on both, they fit the same and I like how they look on me. For reference I'm 5'6 and about 160lbs, and I have a decent amount of curve where my hips are. The pants look on me like they do in the pictures and they're comfortable to wear. Only complaint is that they tend to flatten your butt out a little but other than that they're good pants to wear to work or out around town. They have a decent amount of elastic but for curvier women I'd recommend sizing up so that you don't feel like it squeezes you in an unflattering way when you pull the belt to tighten it.",
					"I bought these for my gf. She liked them and her family loved the color (pinkish pants). However, either they run a tad too small or she's a bit bigger than I thought lol. I had to return them and get a size larger (1X-Large). She's 5'6 185 pounds. She has fairly muscular legs from crossfit, junk in the trunk, and is as thick as a bowl of oatmeal. Hope this helps.",
					"I LOVE these pants. They’re so comfortable and STRETCHY! They look very professional and are perfect for my business casual work attire. I’m 5’2”, 125lbs (thick build) and ordered a small. The pants are a perfect length (also stretchy at the ankles) and sit right above my hips. I can’t wait to get every color! ❤️",
					"Soooo, to help everyone, I am a size 12/13. I buy size 12 skinny pull on jeans at Old Navy for size reference. I’m 5’4. I weight 183 pounds on the thick side. The tie at the ankles can be tied higher to where you like. I purchased an XL based on the reviews. I am I LOVE with this. And I am planning to buy the beige, black and another in green so I can wear the green as casual and keep one for dressy. Here are my measurements to help choose the size for you. I believe if I would have got a large, it would have been too tough to sit without ripping the seams in the behind area. You have to put a tiny effort to get them up your hips. 41 in Belly (around belly button)\n39 in waist\n46 Buttock\n42 thigh to thigh under butt\n26 Left and right thigh",
					"These can’t even be considered pants. They’re see through. I have never seen such poor quality. I’ve never even tried them on because looking at them is so appalling.",
					"Pour toutes occasions. Va à la perfection!",
					"",
					"wrong colour advertised - not correct"
				]
			}
		},
		{
			"id": "B3Q0A3c",
			"title": "Skechers Women's Go Walk Pant",
			"price": "$11.35",
			"image": "https://m.media-amazon.com/images/I/71FAivnqo7L._AC_UX342_.jpg",
			"description": "88% Nylon, 12% Spandex\nImported\nPull On closure\nMachine Wash\nGOFLEX fabric features a soft “cotton-like” hand feel and matte finish\nExterior side pockets and back patch pockets\nSlight flare opening\nShow more",
			"reviews": {
				"customerProfileNames": [
					"Moonbouncer",
					"CarolyneJ.",
					"MaryF.",
					"linknk",
					"Holly",
					"Tami",
					"Cassie",
					"MI"
				],
				"customerProfilePictures": [
					"https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif"
				],
				"customerRatings": [
					"5.0 out of 5 stars",
					"5.0 out of 5 stars",
					"5.0 out of 5 stars",
					"5.0 out of 5 stars",
					"5.0 out of 5 stars",
					"5.0 out of 5 stars",
					"3.0 out of 5 stars",
					"5.0 out of 5 stars"
				],
				"customerReviewTitles": [
					"Love these pants!",
					"It has 4 pockets! Very versatile, thick, stretchy and comfy!",
					"Soft fabric, good weight",
					"Wonderful pants!!",
					"comfortable fit & lots of stretch",
					"Very satisfied!",
					"They were amazing until.....",
					"Great all around athletic pants"
				],
				"customerReviewBodies": [
					"I have these in all 3 colors because they fit my body perfectly. Not tight in the legs like leggings but fitted in the rear and are slim fitting just the way I like my pants to be. The material is thick and good quality. I use these for my everyday pants",
					"I like these pants. They are a thick Lycra blend and stretchy, great for working out. I like to buy my pants a size larger so I can wear them as lounge wear around the house. These pants are XL and I’m 5’5” and 165. I like pants that don’t grab or grip making me look extra sausage-ey, so I bought this in XL even though a L would have been more comfortable for actually working out. I was surprised to find that these have 4 pockets, 1 on each side and 2 in the back. These make a great pair of stay home everyday pant, soft and comfy and very versatile.",
					"Soft fabric. Doesn't swish when I walk!\n\nAm 5'3\" and 180 lbs. Ordered XL but think a L would've provided a better fit. They are a bit loose from just above the knee down, as expected. But fabric bunches slightly at back of leg and thigh which is why I think a smaller size would fit perfectly. I give them a little tug to smooth the leg. There's good rebound in fabric so no saggy knees. Hoping they may shrink a little in wash.\n\nOf course I love the pockets. But wish they placed them further down the leg cause it adds bulk to my already curvy thighs if I'm carrying keys or phone.\n\nBut otherwise are a good value for the price.",
					"Wow - I can't say enough good things about these Skecher pants. They are comfortable, sized well, and very attractive. There's something about the cut down the leg that makes for a finer look. They're good with sporty shoes or with boots - again, the cut and the way the pants are made around the top is too good to believe, really.",
					"Very comfortable and stretch a lot. No rolling or digging in waistband. Thankfully! I read other reviews and hoped these would work, I am on the verge of 12-14 and I ordered a large and they were not difficult to put on (even with recent hand surgery making my hands weak and painful to stress). Exactly what I hoped for in terms of my “get back on shape after surgery” pants without having to wear huge sloppy baggy sweats or tight uncomfortable gear that I plan to shrink out of in a few months. I feel like I will be able to wear these pants at about any size and they will flatter any figure. Love the real back pockets and the phone pockets on upper thigh/hip!",
					"Love these boot cut boots pants. I like the fabric they are a little more thicker than the average yoga pant. The pockets are nice also. I washed and also put them in the dryer. They come out looking great and did not shrink. I bought two pair to take on an international trip. We were going to do a lot of walking and I wanted to be comfortable. I ordered large. Perfect!",
					"I've never had this happen.... my fingernail punctured the back pocket as I was putting them on. I love them but now I question the integrity of the fabric and stitching. I've had them for a few months but haven't worn them a lot and they haven't been washed a lot either.",
					"Purchased a large based on size chart (size 12-large; 5'7\"). I love the fit! I love the 31\" inseam. I NEVER see the inseam long enough. I ordered two more colors; kind of dumb the price increases based on color. However, I love how the pants form to your body & then open up below the knee. I love the fabric quality & they look good with tennis shoes as opposed to regular leggings. I can wear them bike riding as well...any flared legs get caught in the spokes. I love the pockets... especially the sides for my cell phone, credit, etc. If they had a concealed carry pocket that would put them over the top!",
					"These are a snug fit, if I was to get again I'd size up. I got medium and I am a UK 12. The leg length is the real issue, at 5'4\" they almost puddled on the floor, I reckon I'd have to take them up an inch to wear with trainers (presumably the intended footwear). The pockets are a great feature, you can leave the house without a handbag and still be hands free, so that is a plus. Also the fabric is soft and comfortable and they look well made.",
					"Really comfortable. Easy washed, perfect",
					"Really comfortable looks good on, washed and appears to be just as good as new!",
					"Very easy to wear. Looks good, feels soft and fits as expected. Bought 2 more in different colours.",
					"I already have these pants in black and bought these just for Variety. They are extremely comfortable and the only pants like these to have pockets. It is really nice to be able to go for a walk with phone, keys etc in the pockets. Would recommend them for comfort and practicality."
				]
			}
		},
		{
			"id": "dpMpYo8",
			"title": "AJISAI Women's Joggers Pants Drawstring Running Sweatpants with Pockets Lounge Wear",
			"price": "$31.98",
			"image": "https://m.media-amazon.com/images/I/51uigkUDycL._AC_UX342_.jpg",
			"description": "75% Nylon, 25% Spandex\nImported\nDrawstring closure\nInseam: 27.5\"; Ankle Rib Cuff Style endows these joggers a casual chic looking\nGetting rid of annoying lint or pilling with AJISAI Pro fabric material\nFour-way Stretch Opaque Fabric for easy movement in your workout\nLightweight & quick-dry fabric combines the comfort of loungewear with the performance of workout gear\nAJISAI Sport Pants will be the perfect companion for your morning runs and jogging,trips to the post office or just lounging around the house",
			"reviews": {
				"customerProfileNames": [
					"Mimi",
					"M.s.",
					"mdh0017",
					"AmberKraft",
					"BB923",
					"Birdie",
					"Secretsquirrel",
					"CuongNguyen"
				],
				"customerProfilePictures": [
					"https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif"
				],
				"customerRatings": [
					"5.0 out of 5 stars",
					"5.0 out of 5 stars",
					"5.0 out of 5 stars",
					"5.0 out of 5 stars",
					"5.0 out of 5 stars",
					"4.0 out of 5 stars",
					"4.0 out of 5 stars",
					"5.0 out of 5 stars"
				],
				"customerReviewTitles": [
					"Comparable to Lululemon!",
					"The best joggers out there",
					"Favorite pants, purchased in two colors.",
					"Amazing Quality Joggers",
					"Must buy",
					"Inconsistent sizing, but nice joggers for the price point",
					"These are 5 stair pants that don't fit me: cuz I'm short",
					"Love these pants!"
				],
				"customerReviewBodies": [
					"I have not written a review in sooooo long, but after purchasing these I just had to. I am as loyal as they come for lululemon joggers and leggings. It IS the only leggings I wear to work out and for loungewear. I kid you not. I have even gone to their headquarters in Canada just for their store to be able to buy their one of a kind items. I am not joking when I say these joggers have the exact same feel and wear as Lululemons.\n\nI didn't even know about these joggers until one of my friends recommended it and even then, I didn't give it a try. Another girl in our group decided to buy it and after seeing her wear it, I thought, fine, I'll order some and we'll see. To my surprise... these are really the real deal. I'm 5'4 and typically am between a small and medium... i call myself a shmedium and I ordered a small and it fits perfectly. The length is exactly where you want it to hit you at your ankles. I can't believe it. This is seriously amazing!! I highly recommend these! These are no joke! So comfortable, no itchiness, nothing irritating while wearing. Crotch is a perfect lenght, tucks in your belly. I mean, what else could you ask for. MUST BUY.",
					"I ordered several pairs of joggers from different brands and these were hands down my favorites. They fit perfectly, were super comfy and looked great. I'm 5'3\" 115lbs, with short chunky legs, narrow waist and hips. I ordered an extra small. These made me feel awesome without looking sloppy or like I was wearing sweatpants. Washed and hang dried, and they held up fine. They are slim fit and not baggy. The material is soft, stretchy and a good thickness. Ordered more pairs immediately. The pockets are huge. Great quality. Hope they hold up.",
					"These pants are perfect for travel, casual wear, and authentic. Feel great and look great. Would highly recommend.",
					"I rarely take the time to write a review, but these are amazinggggggg joggers! I’ve been searching for a long time, and I finally found the perfect ones. Great cut and fit. Surprised by the quality of the fabric...thick enough to where they hold their shape, but not too thick so that they make me uncomfortably hot; not thin and cheap feeling at all. I’d even go as far as saying that the fabric is comparable to Lululemon and Athleta joggers. They run small, so order a size up. I’m usually a large in pants, but can wear a medium if the material stretches out a lot (Cotton/twill/linen blends). I got an XL in these based on other reviews and they fit perfectly. These are a slimmer fit, but still fit well even though I have thick thighs and a big butt.",
					"I LOVE these pants. I've purchased a few pairs with different leg openings. Sizing is consistent across each style. These are so comfortable to wear and look put together. The pockets aren't bulky and hold my phone well. They are a little thicker than your average legging, which I appreciate. These are very soft material and have held up to frequent wear. So far, no pulling or snagging. I'm 5'2 so these are full length on me, but don't look bunched at he ankles.",
					" These are nice joggers for the price. I have purchased some slightly nicer joggers in the past from Gap, etc., but in the middle of a pandemic, these are a convenient option for the price point. As others have said, these don’t attract pet hair, which is fantastic in a home with two cats. They’re a nice medium weight technical fabric, which is perfect for TX Fall.\n\nSizing notes: I’m around 5’5” and 120 lbs and found that I was sort of in-between sizes. I tried these in XS and S in navy and S in black; I ended up keeping only the navy in S (pictures and video of this size and color). The sizing was different between the navy and the black, with the black size S being a bit bigger than the navy size S. The navy XS were just bit snug in the hips, but weirdly looser in the ankle than the size small. They’re just a little loose in navy S, but the adjustable drawstring waist helps resolve that. They do stretch out a bit throughout the day, but not so much that they look overly sloppy — just a tiny bit sloppy. I’m using them for casual wear anyway, so it’s not a huge concern. Overall, I’m happy with the fit and appearance of the navy size S. If I end up ordering another pair in black, I’ll likely try the XS, as the sizing seems to run bigger in black.",
					"I am 5'2, 140 lbs, size 8, little waist, with hips. These ankle length joggers bagged at my ankles - they also had wider cut legs than expected. The material was lovely. Fit true to size, very well made. I think 5'6\" or taller would fit/hang really nicely. Returned, handled perfectly and would have kept had they had a short size option.",
					"I really love these pants. I read the reviews therefore the pants were exactly as I expected. I ordered a medium which fit perfectly. I typically wear a size 8.",
					"these pants are super soft!!! they feel like lulu material, i saw so many reviews comparing them to lulu joggers and i agree! im 5’10 and most of my height is in my legs so i was worried about the length but they dont hit at an awkward spot, theyre just at my ankle so taller peeps shouldnt be worried! definitely buying more pairs",
					"I wasn’t too sure about buying it bc of the price mostly, I saw few reviews, but wow let me tell you this is one of the most comfy pants. I do not regret at all. I mostly wear them at home. Sizing was perfect. It arrived quickly. I am 5’4, 155lbs, athletic body type meaning I have a bum and thighs. Medium size is what I ordered.",
					"These are very cute, well-made pants. I like the material, look and fit throughout the legs but I find the waist digs into my gut and it’s quite uncomfortable, especially when sitting. If I sized up, they’d fit weird everywhere else. I ordered a large. If you have a pre-baby stomach, you should be good to go with these 👍",
					"I was so pleasantly surprised with these pants that I bought a second pair right after I received the first pair. The pants are soft, they feel really comfortable on, they wash well, and I feel good in them. I use them for hiking and they never chafe or ride up. I think these are a great buy.",
					"I had to order up a size im normally large and had to get xl. They are soft and comfy my new favorite and staple in my wardrobe. I have 5 pairs in different Colours and love them, just not happy with inconsistent sizing as one pair is medium and others are xl."
				]
			}
		},
		{
			"id": "_pFHlX1",
			"title": "Skechers Women's GO Walk High Waisted Joy Pant",
			"price": "$28.00",
			"image": "https://m.media-amazon.com/images/I/61APmLf6T4L._AC_UX385_.jpg",
			"description": "88% Nylon, 12% Spandex\nImported\nPull On closure\nMachine Wash\nGOFLEX features a soft “cotton-like” hand feel and matte finish\nExterior side pockets and back patch pockets\nSlight flare opening\nShow more",
			"reviews": {
				"customerProfileNames": [
					"philipshaw",
					"AMB",
					"PollyWoggy",
					"Reviewer",
					"LisaD",
					"alluchette",
					"JacquelineG.",
					"PeggyGarvin"
				],
				"customerProfilePictures": [
					"https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif"
				],
				"customerRatings": [
					"5.0 out of 5 stars",
					"5.0 out of 5 stars",
					"5.0 out of 5 stars",
					"5.0 out of 5 stars",
					"5.0 out of 5 stars",
					"5.0 out of 5 stars",
					"5.0 out of 5 stars",
					"5.0 out of 5 stars"
				],
				"customerReviewTitles": [
					"Immediately Ordered Again!!",
					"Best Pants Ever",
					"At 5’4” pants were too long.",
					"Love these pants!",
					"My favorite pants!",
					"I love these pants",
					"Same as go walk pant",
					"So comfortable and look GREAT"
				],
				"customerReviewBodies": [
					"I put these on and immediately went and ordered a second pair! I’m 5’3-147lbs with a Mom butt. I am 66 after all. I ordered a large and they fit perfect although A tiny lose in the waist. I do a lot of traveling and these will be perfect!!!",
					"Love these pants. The side pockets are great for holding my cell phone and keys. They are a nice weight and can I can wear them for work as well as working out and walking/hiking. They wash and dry well and don’t wrinkle.",
					"At 5’4”, the GoWalk pants were too long. The tag indicated a Tall. I will return in hopes of ordering a medium height. Otherwise, fabric an fit were perfect!",
					"I love these pants so much that I now have 6 pair. First, the fit is wonderful. I’m 5’6” & weigh around 157 lbs. & the Large size fits perfectly. The are long enough to work with some of my boots with a clunky heel — definitely not ankle pants. I like the straight leg design as a nice change from leggings. Second, the colors are nice. The Navy is a true dark navy, the dark purple almost works as a neutral and the black is also dark & a classic. I’ve washed all colors several times without fading, piling or shrinkage although I wash only in cold water and line dry (no dryer). I’ve worn these pants for walking, working out, with a sweater or T for a casual look & a printed blouse for a slightly dressier look. These pants might also work for office wear as long as casual wear is acceptable.",
					"I",
					"I have these pants in almost every color and love every pair. Best work pants I own. The waste stays in place and doesn't roll so I am not hiking them up all day long. They feel like yoga pants but look dressy enough that they pass for dress pants for work. Wash well and do not stretch out after time and the color does not fade. I've tried lots of other brands and none compare",
					"I ordered these because I thought they were different than the plain go walk pant. These which are labeled Joy are identical to the plain go walk pant. Just letting you know in case you think these are different like I did. I still love them and will keep them.",
					"I love these pants. They have a high waist which makes you look slimmer. I hate workout pants that are low waisted and then slip down when you work out. I'm an instructor so they look professional but are still comfortable.",
					"Love these pants. So comfortable.",
					"Había comprado estos pantalones de yoga en morado para combinar con algunas blusas que ya tenía. Me gustaron tanto que pedí dos pares de azul marino. Ambos colores son mucho más oscuros y ricos que en las fotos, que es lo que quería. Me encantan los bolsillos delantero y trasero para mi teléfono celular y cualquier cosa pequeña que quiera llevar. Pedí una talla más grande de la recomendada para que me quedaran más como pantalones que como pantalones de yoga. Mido 5 pies y 7 pulgadas, peso 150 libras y pedí XL. Solo necesitaban ser dobladillados para que encajaran perfectamente. Son de talle alto, muy suaves y cómodos de usar, además se lavan y secan como un sueño. Sin duda los recomiendo.",
					"",
					"These pants are super comfortable. There are slash pockets on each side of the upper pant leg for your phone. There is plenty of room to stretch, you can go down a size and still have room to bend, etc. The pants keep their shape, they are not saggy in any way. Excellent pants.",
					"Did not expect them to be as heavy weight material...my fault for assuming they could be worn summertime. Appeared to be well made, but exceptionally 'long of leg' as others stated. Just not what I expected , nor wanted.",
					"These fit true size. The waist is high so no muffin top. Very flattering around the butt. Lots of pockets for phone and keys. Love these pants. I only buy the Joy style. The other styles don't fit as comfortable."
				]
			}
		},
		{
			"id": "cR4_pst",
			"title": "Rafaella Women's Curvy Fit Gabardine Bootcut Dress Pants (Size 4-16)",
			"price": "$29.99",
			"image": "https://m.media-amazon.com/images/I/61Zubal1SvL._AC_UY445_.jpg",
			"description": "Designed to flatter your figure, these ladies trousers feature a contoured waist that doesn’t gape and are fuller through the hip and thigh to compliment your curves. Their gabardine fabrication is soft to the touch, holds its shape, does not wrinkle easily and is designed to last. Two-way stretch provides a comfortable fit you will appreciate from your morning meeting to cocktails after dinner. The bootcut dress pants for curvy women are available in two inseams for the perfect fit.",
			"reviews": {
				"customerProfileNames": [
					"Nikki",
					"Mandy",
					"HC",
					"Customer",
					"bri",
					"everything.is.bright",
					"MirandaStadley",
					"bananafrog99"
				],
				"customerProfilePictures": [
					"https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif"
				],
				"customerRatings": [
					"5.0 out of 5 stars",
					"5.0 out of 5 stars",
					"5.0 out of 5 stars",
					"5.0 out of 5 stars",
					"5.0 out of 5 stars",
					"5.0 out of 5 stars",
					"5.0 out of 5 stars",
					"5.0 out of 5 stars"
				],
				"customerReviewTitles": [
					"I love these pants",
					"Absolutely perfect fit for me",
					"Perfect and exactly what I was looking for!",
					"Best purchase ever on Amazon!!!",
					"To the ladies who are curvy...",
					"My favorite work pants for years",
					"A little long but amazing!!",
					"I was skeptical but I read the reviews and glad I did!"
				],
				"customerReviewBodies": [
					"I love these pants! The material is thick and drapes very nicely. I am 5'6 150 lbs and usually wear a size 8. The 8 was too long and big, but the 6 fits very well. (Photo is off the too large pair)",
					"Absolutely perfect fit for me! I’m 5’5 & 190 lbs, I usually wear size 16, that’s what I bought & love these pants. The curves fit is perfect for my curves hips & butt. The length is great for medium height heel. I’m extremely pleased with these pants. Great quality! Look & feel amazing!",
					"These pants fit awesome! I’m a curvy pant size 14, and they fit exactly as expected. They’re flattering on the butt and look very professional. They’re soft and a thick material. The double front button helps everything remain secure. I would totally buy them again.",
					"I don’t think I’ve ever written a review on something so fast before. The pants fit amazing. For reference I’m:\n\n5’9\n220lbs\nMuffin top.. lil.. booty and thighs\nSize ordered 16\n\nThey fit perfect in all areas. Just enough height in the waist to go over my muffin top but not too high that is under my boob it doesn’t fit tight around my hips to cause my rules to fall over just enough to give to wear if I was to squat down I would not feel like it was going to rip. Most of the pants I wear flare out too much or not enough so it’s either very wide at the bottom or it makes my thighs look super big but this has the perfect size to flare ratio LOL. It’s not super long but if it Long enough that if I was to sit down my ankles wouldn’t show. I would definitely recommend these. I ordered a size 14 also but haven’t tried it on yet.. I will hold on to it just in case I ever lose a little weight... I will definitely add pictures later in.. good luck girls",
					"Oh my lanta... my curvy friends... THESE ARE YOUR PANTS!!! Its so hard for me.to find the right fit. I always order up because my thighs are too thick for my hips and waist. These pants... they are too big... and only because I ordered a size up.. they are the perfect pants!!!! if you are curvy buy these!!!! You will not be disappointed!!!",
					"I",
					"These pants are great I've been wearing them for about a week or two and they have held up well to washes with out shrinking at all. They are high waist so they sit on my natural waist which I love. I do need to get them tailored as they are 2-3 inches too long but that doesn't bother me much since they fit so nicely. The pockets do come sewn up but they are easy to open as long as you are careful. They are fantastic and I will defiantly order more (I already have 2 pairs)",
					"Needed some comfy - but professional- pants for an interview.\nShopping for pants online is hit or miss so I was extra thankful and surprised these were a hit.\nI read the reviews and bought the higher end of my normal size and they fit perfectly. I am between a 14 curvy fit to16 regular fit with waist gap so I ordered the 16.\nThey are very comfortable and flattering so I had more confidence going into my interview than I would have had with some ill-fitting, cheaply made pants. They are very good quality for the price and I’m sure I will get quite a few wears out of them.\nI did not have any kind of waist gap and they stretched enough to go over my curvy hips without looking like I was going to bust out of them like a can of biscuits.\nThe length was perfect - socks weren’t showing when I sat down and I wasn’t walking on them. I could have even worn a little heel with them if I felt like breaking an ankle to make an lasting impression on my interviewers.\nFor reference, I am 5’5 and about 190lbs.",
					"I ended up returning these pants because they were too big, but they would be a 5 star for a truly curvy body. I’m 5’7 and 140 pounds. The size 6 fit in the waist, but they were just too baggy in the legs. If you have a truly curvy body, these would be great. Nice quality and they didn’t need hemming first me",
					"Ordered my usual size and pant stated that size but you could put two of me inside.\nAlso said shorter inner leg length but I would be a very tall person to wear these pants.\nVery disappointed with this purchase so returning them.",
					"Perfect black pants! They are comfortable, have a button and zip fastening waist, nice flattering fit above the hip. I'm tall and these are fitting wonderfully. Great quality!",
					"Me encantaron. Son muy cómodos y favorecedores. Tienen el largo perfecto para usar con tacón bajo, medio o con bota. Se lavan fácil y mantienen forma. Son ideales para clima templado, pero si hay humedad y sube la temperatura pueden ser un poco calurosos. Los compré en dos colores porque me fascinaron!",
					"",
					"I’m normally a size 10 so bought large. The waist fit perfectly but the hips were way too wide. I have a boyish figure - these pants are made for curvier women with hips."
				]
			}
		},
		{
			"id": "loCbQKN",
			"title": "Womens Yoga Pants with Pockets Straight-Leg Loose Comfy Modal Drawstring Lounge Running Long Active Casual Sweatpants",
			"price": "$18.99",
			"image": "https://m.media-amazon.com/images/I/512vqe2So9L._AC_UY445_.jpg",
			"description": "Modal\nImported\nDrawstring closure\nMaterial: Lightweight, breathable comfortable stretch modal fabric, soft and comfy yoga casual lounge pants\nUnique Design:Two convenient side pockets,Practical drawstring adjusts the comfortable size according to the waistline,Loose Straight Leg design, make you looks slimming fit\nHigh Quality:Loose fitting, solid color,elastic waist, loose straight, casual lounge pants, yoga pants, running pants, outdoor lounge pants, pajamas pants, soft and stretchy sleep night lounge pants, sporting pants, workout legging for women\nComfy & Casual Style:Casual yoga pants with pockets,great for yoga, pilates, sporting, vacation, beach, sleep, lounge around, and relaxing at home.Suitable for any season wear. This casual wild leg legging will be a favorite in your loungewear wardrobe.\nPlease see our descriptions to choose right size:M (Waist-30' Length-40'); L (Waist-31' Length-41'); XL (Waist-33' Length-41.6'); 2XL (Waist-34' Length-42'),The model is 5.74ft tall and weight 123.5lb. Bust:34.6 Waist:24.4 Hip:35.4inch.",
			"reviews": {
				"customerProfileNames": [
					"Rhiannon",
					"SharonWhite/Smith",
					"Keris",
					"ebony_hd",
					"Erica",
					"Diana",
					"TheDiscerningConsumer",
					"Isabel"
				],
				"customerProfilePictures": [
					"https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif",
					"https://images-na.ssl-images-amazon.com/images/S/amazon-avatars-global/7a5d3a0f-ad9f-409b-ae30-1a82a0c95faa._CR0,0,500,500_SX48_.jpg",
					"https://images-na.ssl-images-amazon.com/images/S/amazon-avatars-global/00e6cf4b-7496-44bb-a08e-a4f2582ad77a._CR0,0,375,375_SX48_.jpg"
				],
				"customerRatings": [
					"5.0 out of 5 stars",
					"5.0 out of 5 stars",
					"5.0 out of 5 stars",
					"2.0 out of 5 stars",
					"4.0 out of 5 stars",
					"3.0 out of 5 stars",
					"4.0 out of 5 stars",
					"5.0 out of 5 stars"
				],
				"customerReviewTitles": [
					"Pants that stay in place !",
					"The most comfortable pants I own right now!",
					"Very easy to move in any way with these on",
					"Stallions Beware...",
					"Comfy pants but I’d order up a size",
					"Description not quite accurate",
					"Beware... “coffee” is a medium brown. SO COMFY",
					"Super comfy house pants."
				],
				"customerReviewBodies": [
					"I love yoga pants . Sadly most of them do not love me back . I am a size 14 and have very shapely hips, I needed a pair that would stay comfortable, still look good , not show anything .... well.... inappropriate if I happen to bend over , still look dressy.\nThese pants are all that AND they have pockets .\nThey’re made of very soft and comfortable light weight materials , yet they can endure the washer and the dryer just fine and still look brand new afterwards .\nI am relieved , finally a pair of pants that do not need to be pulled back up every time my child tosses something on the floor and I have to retrieve that .\nWhatever ended up on the floor is now the only thing I get to pick up , but my pants stay in place .\nI get asked by all my friends where I found them .",
					"So comfy! Feels like pajama pants but looks beautiful... Can dress them up or trust them down not too short not too long. I really like the front pockets and the drawstring, also as a grown woman I'd like the fact that the waste is at the actual waistline not low like most pants for young people. I'm going to order more colors they're great!if you want pants to lounge around the house and go out to the supermarket and these are very versatile..",
					"My leg length is 32, and these are long enough for me. Has tie string to make it more snug around the waist. Airy light material. Great for working out. Stretchy and freely to move as needed in any way.",
					"Bought a size medium. Not sure how these are labeled as tall because they flood like crazy on me. I’m 5’10” and 180 pounds. The pants are very soft and what I was looking for but as someone who specifically looked for pants that were made for tall people and the length of these pants said 41-44, I’m confused. Will be returning",
					"I was worried about these pants because of some of the reviews and because they are a clingy material. I ordered up a size. I am 5’9 155 pounds and usually wear a medium in clothes. I ordered a large and they fit well. They are a clingy material so a larger size works well. There’s a drawstring to help with the waist. I love how soft they are and flowey. I am tall and the length is perfect. I usually have trouble with pants being too short. I’m glad I purchased! Plus they have pockets. Small pockets but pockets.",
					"The quality of the pants seemed to be fine; however, the description used the term \"sweatpants\" as part of their descriptive terms. These pants are more like a silky pajama bottom. I certainly would not wear them out in public. I have purchased items with \"Modal\" in the before, so I was a bit surprised. They are quite long in the leg, which is a nice feature if you're a bit taller. They may indeed wear like iron, but if you're the slightest bit overweight, I don't think you would be happy wearing these pants, as they will show more than you'd like.",
					"These pants are UNBELIEVABLELY comfortable. Yes, they are too long and I knew that going in due to other reviews. These would be perfect except the color for “coffee” looks purple-ish on my screen (and my sister’s) but is a medium brown when delivered. I am returning and going with a safe “black” color.",
					"Super comfy. Great soft fabric and ample pockets. They run long so you either need to hitch them up, roll them up or get them hemmed. But for the cost, they’re great.",
					"Buena caída, son largos, cómodos, viene ligeramente amplio, si tienes problemas de mucha celulitis no recomiendo este pantalón ya que no disimula nada está situación de la piel.",
					""
				]
			}
		},
		{
			"id": "ZFeGlR2",
			"title": "Dickies Women's Relaxed Straight Stretch Twill Pant",
			"price": "$19.99",
			"image": "https://m.media-amazon.com/images/I/61IjEra8ilL._AC_UX342_.jpg",
			"description": "Inseam length: Short 30\", Regular 32\", Long 34\". Fit tip: Recommend larger size if measurements are in between those listed in the size chart.",
			"reviews": {
				"customerProfileNames": [
					"CarrieByrnes",
					"MERC",
					"Niki",
					"KristyH.",
					"Amy",
					"Tina",
					"Lunapony",
					"MarisaJohnston"
				],
				"customerProfilePictures": [
					"https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif",
					"https://images-na.ssl-images-amazon.com/images/S/amazon-avatars/default._CR0,0,1024,1024_SX48_.png"
				],
				"customerRatings": [
					"5.0 out of 5 stars",
					"5.0 out of 5 stars",
					"3.0 out of 5 stars",
					"4.0 out of 5 stars",
					"5.0 out of 5 stars",
					"5.0 out of 5 stars",
					"5.0 out of 5 stars",
					"5.0 out of 5 stars"
				],
				"customerReviewTitles": [
					"Info you may want",
					"WoW! Just wow!",
					"Not fitted well for curvy women",
					"Good quality, very comfortable, runs large",
					"Nice pants",
					"Comfortable",
					"Nice work pants. Recommended.",
					"Comfortable, stretchy, good fit"
				],
				"customerReviewBodies": [
					"I thought I would write a review because I know how difficult it can be to buy pants online. I, all my life, have been super skinny but hello mid 40's and some medication I have to take; when I went to put on cold weather pants, nothing fit ugh...so I ordered these since sometimes the world requires more than yoga pants. I have always found dickies to be great quality. So! I'm a little shy of 5'4 and about 130 lbs. They fit and the length for my height can take a heel or a flat. They were a little snug (pockets popped a bit) but that's not the pants fault! Walk Carrie...keep walking :) There was no gap on the waist and they have some stretch so they are forgiving. They are comfortable. I haven't washed them yet but until I shed a couple more pounds I might wash in cold and dry low since they have a lot of cotton. I bought 4 short.",
					"T",
					"I bought a 22 and it fit true to size. As other plus size women can maybe appreciate, the first place my pants wear down is the inner thigh. I bought these pants in the hopes that they would wear better. It's only been about 2 months, so it's too soon to know how they will hold up. I can vouch that the fabric feels sturdy. I have three complaints about these pants. One: I don't see how they are relaxed fit. They are form fitting from waist to knee, at least on my body which is curvy with plenty of hip, butt, and thigh. Two: the placement of the pockets makes it clear they were not made with any understanding of how the pants would sit on a curvy woman. When I am standing, the pocket openings do not lie flat against my hips. Because of the combination of my belly and the curve of my hips, they tend to gape open very slightly, which only becomes more pronounced after sitting for a while. I have uploaded pictures of my left pocket when I am standing and sitting- please excuse the dog and cat fur on my clothing. Three: they are very slightly shorter than I'd like. They're not floods or anything, but I have a lot more shoe showing than I like while standing, and my socks always show when I sit.",
					"(purchased: 4 short)\n\nPersonally I do not like these for fit reasons but I am rating them higher because:\n1) the material does feel very sturdy\n2) the relaxed fit is relaxed and comfortable\n3) nice pockets!\n\nI thought this would fit since I'm 5'2\" and the size 4 measurements were only a little larger than I am, but there is still a gap at the back (my photo makes it look manageable but in reality I can loosely fit my fist between the band and my back). This can probably be fixed by a belt, but the gap is wide enough to feel kind of uncomfortable. They are also longer than expected and would have to roll the hem up at least six inches (although I am probably just too short). I will be returning these.",
					"I bought these pants for work. After reading the reviews, I bought one size larger than I normally wear. They fit my hips great, but the waist is a little big. No worries. I have to tuck my shirt in for work and I can use a belt. The material is a good weight. Not cheap and flimsy. They do stretch out after washing them, so if they feel snug when you first put them on, don’t worry, they’ll stretch out. All and all a nice pair of pants at a good price.",
					"I bought these because I didn’t like the ones my work provided, for one they were mens, so they had absolutely no stretch to them, and stiff. These were just a hair to big, but nothing a belt couldn’t fix. 🤷‍♀️\nI’m 5’5 and in the 170lb range, and bought a size 14. Probably could have gotten away with a 13.",
					"I ordered the pants (size 4-regular) based on reviews and found them very helpful. The pants is heavy, simple, really good quality for the price. It fits perfectly for 5'5, 112lbs, will order two more.",
					"I tried the petites on in a store and they were much too short. I'm 5'5\" 125lbs and these were a tad long (which is much better than being too short since you can always hem them). Otherwise these fit great, loose fit through the legs but not baggy, and plenty of stretch. Definitely comfortable. They made it through the dryer without shrinking. Pockets are a little big so they don't hold things very well; anytime you lean over anything in your pocket falls right out. Sadly I made this discovery with my phone- it popped right out and hit the floor, cracking my screen :( Other than that these have been great. I do notice they tend to loosen up as the day goes on. And they are a hair/lint magnet! You will definitely want to have a lint roller on hand with these. Overall I'm satisfied and would purchase them again.",
					"Estos pantalones tienen casi el mismo corte que los dockers, con esto te das una buena idea de qué talla comprar. Por ejemplo, una talla 8 (mediana) de dockers corresponde a una talla 8 de esta marca (mediana).\nVienen súper largos, eso sí, hay que ajustarlos.\nEstupenda calidad de gabardina de algodón y el color es exactamente como se ve en la pantalla.\nLos recomiendo ampliamente.",
					"",
					"I had to return these.\nI bought a 14Long and while the length was great (I'm 5'10\"), the waist was extremely tight -- much smaller than any size 14. Feels at least 1 size smaller.\nI also bought the Dickies Women's Relaxed Straight Carpenter Duck Pant in a 14Regular, which fit great.\nThese pants (advertised as \"CHEROKEE Dickies Women's Relaxed Straight Stretch Twill Pant\") fit much much tighter than the Carpenter Pant.\nI also found the leg to be wider than a straight leg -- borders on boot cut.",
					"Es de pierna ancha desde el muslo queda flojito, encoge un poco si lo metes a secadora, pedi largo y arrastraba y quedaba flojo en cintura , un par de lavadas y secadas y quedó bien (la pierna sigue flojita, el corte es asi)",
					"",
					"Buena tela, lo que esperaba. Llegó el día indicado. La talla 8 es un poco más justa en comparación a la marca dockers de la misma talla (8), pero aún así queda muy bien. Más económico que dockers pero calidad comparable. Lo volvería a comprar",
					"",
					"I ordered a size up from my usual size and they fit perfectly. I’m 150 lbs and ordered a size 8. They are perfectly comfortable. I think they look great! They are thin so will be perfect pants for the summer months at work. I work in a mill and am open to the elements. Can’t wait to wear them."
				]
			}
		},
		{
			"id": "vDBMBDr",
			"title": "FROGG TOGGS Women's Classic Pro Action Waterproof Breathable Rain Pant",
			"price": "$19.99",
			"image": "https://m.media-amazon.com/images/I/61k4A1YOU6L._AC_UX385_.jpg",
			"description": "The Frogg Toggs Classic Pro Action Rain Pant is perfect for hunting, fishing, jogging, hiking, biking, camping and many more outdoor activities. The pants feature an adjustable, elastic waist that allows for a customized and secure fit. The expanded 4\" back rise ensures the pants will fit under any rain jacket for overall coverage to keep you dry. Oversized leg openings with hook-and-loop adjustments allow the pant to fit easily over your favorite pair of rain boots or shoes, providing a level of convenience you’ll only experience with Frogg Toggs.",
			"reviews": {
				"customerProfileNames": [
					"GlobalGirl",
					"JoleneStewart,Owner-PawshPetsHoboken",
					"Callie",
					"Gooniegirl37",
					"Cflynn",
					"Kirsten",
					"dominique"
				],
				"customerProfilePictures": [
					"https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif"
				],
				"customerRatings": [
					"4.0 out of 5 stars",
					"5.0 out of 5 stars",
					"2.0 out of 5 stars",
					"5.0 out of 5 stars",
					"5.0 out of 5 stars",
					"5.0 out of 5 stars",
					"5.0 out of 5 stars"
				],
				"customerReviewTitles": [
					"GREAT value!",
					"A bit odd, yes, but they work!",
					"Not for curvy girls",
					"Great pants!",
					"Went down the Colorado River in these. Kept dry ...",
					"Through Hiker / backpacking Secret Weapon",
					"Nice rain pants, good quality."
				],
				"customerReviewBodies": [
					"Wow, great bang for your buck! I ordered these at the last minute when I saw that there would be significant rain on my multi-day hike. I wore them over my hiking pants, between 4-8 hours a day, hiking in the rain for 4 days and they stood the test for sure. At first they felt a bit restrictive (but you're wearing 2 pants, so come on), then I got used to them; they were definitely breathable as well.\n\nI knock off a star for a couple of reasons: 1) you have to take your shoes off in order to put these on-- no wide pant cuffs; and 2) no pockets. The pants do seem to be \"stitched\" together in the seams by tape-- I'm not sure if they're sewn underneath and the tape is for reinforcement. If these pants would have ripped in the butt, the majority of my lower half would still have been dry. If they were to have broken on me on the 2nd or 3rd day I still would have gotten my money's worth because I really put them through rough conditions for a significant period of time. If you don't plan on tons of outdoor activities in the rain and don't want to invest in super expensive pants, then these are for you.\n\nLastly, I'll share that I'm approximately 130 lbs and a size 6-8. I bought a small, and they were just right. If I were about 5 lbs heavier or wearing insulated pants, they would not have fit and would have to size up. Hope this helps!\n\nP.S. to the people who say these are not fashionable.... who ARE you?! They're RAIN PANTS!",
					"These are definitely not for fashion and many people have given these bad reviews saying they feel weird or whatever but I love them.\n\nI am a professional dog walker and I ride my bike to travel to the dogs I walk. I am out in the rain and snow, riding the bike and then walking. I live in Northern New Jersey and it rains and snows here a lot!\n\nI got these because I thought I had decent rain gear but after a few heavy rain storms I ended up drenched on my bike and walks and knew I had to get some more high-tech gear. Originally I was looking for one of those rubber rain suits or gaiters that fishermen wear because I couldn't think of an alternative way to have waterproof pants while riding the bike or walking in a rain storm.\n\nWhen searching waterproof pants these came up. I liked that they weren't PVC or rubber and decided to give them a shot.\n\nI am so happy I did!\n\nHere's some things to know:\nThese are not terribly cute, but they do the job. Definitely function over fashion in this case! That being said, they aren't too hideous either, they look sort of like track suit pants and aren't so stiff that upon first glance it doesn't look like your wearing weird pants or anything.\n\nThe material is like those envelopes like other people have said. It is kind of funny feeling and weird at first which is to be expected if they are to be 100% waterproof. They couldn't be soft regular cloth and still be waterproof. So for them to be waterproof and as wearable as they are, is great. They are much more flexible then the PVC or rubber suits I first looked at.\n\nThey can be hot because they do not breathe much but they are not too bad if you dress correctly. Because of the material, they are meant to be worn over other clothes or pants. I wear cotton leggings underneath in a cold rain and that is perfect, especially riding the bike. On a snow day, fleece pants or sweats would probably do the trick and keep you plenty warm.\n\nThe wearing of other clothes underneath is nice because you can take these off at your destination and be dressed normally so I can be dry on my bike but still have normal clothes when I get where I am going. They also roll up very small and can be easily thrown into a bag.\n\nThey have nice Velcro on the bottoms so you can secure them at ankles. They are a bit long but with rain boots and them velcroed, they don't drag at all. They also have an elastic band at the waist that can be tightened.\n\nI also bought the Frog Toggs jacket and a Frog Toggs pack able poncho to go with these pants to make a full rain suit.\n\nI have walked and ridden in very heavy rain and some snow this season and have been 100% dry and warm. After hours of bike riding and walking in heavy rain, I had no water soak through and I remained completely dry.\n\nThese seem to be holding up great so far and have not ripped or fallen apart after a good amount of use. However, even if they only last one season, I would definitely buy these again next year as they are totally worth it. Even if I only get one season of use out of them I will feel I got my money's worth.",
					"These pants were not made for anyone with hips. I ordered the xxl, which should have been large enough to fit leggings or skinny jeans underneath, according to the size chart. What the size chart doesn't tell you is the hip measurements, which are the same as the waist measurement. They are straight up and down, and have no stretch. They were also at least 6 inches too long on the bottom, and 6 inches too short on the back rise; they didn't even come up to my underwear in the back. I am 5'4\" and very pear shaped, so I am used to pants running a little long, but these are unusable. I could barely walk in them, let alone sit down.",
					"Solid heavy material. Sturdy construction. Kept me dry while running thru rain and waterfalls in Iceland.",
					"Went down the Colorado River in these. Kept dry the whole time. People with more expensive pants got wet. No complaints.",
					"These were some of the best things I brought with me on my PCT through hike adventure this year. They are CHEAP and yet work just as well if not better than so many other types of gear.\nI used them for wind, cold, rain and snow. They were so many different pieces of gear I felt like I could handle anything that came my way when I had these around.\nDid I mention durable. They are actually a pretty trough material and as long as you don’t snag on a tree you are climbing or take a knife to them you won’t have any problems.\nHikers around me who ran cold swore by these!",
					"I’ve been on strike for 140 days and had to picket for hours at n all kinds of weather. I’ve used these in many downpours with great results. They are thin enough for the warmer weather and I haven’t had any issues with them tearing. Plenty of room to go over your clothes. the gathering at the ankles is helpful because I am not tall and helps keep the rain out.",
					"Too thick and not at all comfortable.",
					"I agree with all the reviews about these pants not being fashionable as the pant material is not at all form fitting. They slide over jeans easily and are very lightweight but offer you super protection from the wet and cold. I love them! The only thing I wish they had was a pocket. I would recommend them.",
					"Do NOT order this product! First, let me say that I'm in no way a clothing diva. I want what I wear to be comfortable, long lasting and if possible, decent enough looking. I am very comfortable ordering clothing online but these pants are by far the worst product I've ever ordered.\n\nI wanted a nylon type pant to wear while walking my dogs... simply to cut the wind and offer some waterproofing of my legs. I believed the description of these pants and thought I'd found the perfect item.\n\nWhen I received it I actually thought that the pants were the packing material... so much like paper I couldn't believe it was what I'd ordered. But I decided to give them a chance... they are so noisy to walk in and not at all comfortable.\nI didn't want to give them any stars but had to in order to write the review.",
					"I",
					"The only thing I can compare this material to is the cheap bags blow up beds come in! On-top the company want to charge shipping again for a return. So disappointed."
				]
			}
		},
		{
			"id": "a2uv6Qv",
			"title": "LEXISLOVE Capris for Women Casual Summer Wide Leg Crop Pants Loose Comfy Drawstring Yoga Jogger Capri Pants with Pockets",
			"price": "$23.99",
			"image": "https://m.media-amazon.com/images/I/518+WPmFT5S._AC_UX342_.jpg",
			"description": "Drawstring closure\nSize Chart - S (Waist-26.77”, Length-29.53”,Hip-39.37” ); M (Waist-28.35”, Length-29.92”, Hip-40.94”); L (Waist-30.71”, Length-30.31”,Hip-43.31” ); XL (Waist-33.07”, Length-30.71”, Hip-45.67”); 2XL (Waist-36.02”, Length-31.10”, Hip-48.62”).\nMaterial - 65% Polyester + 35% Cotton. Comfy fabric, Skin-friendly, Lightweight, Stretchy, Breathable, Soft and Durable.\nFeatures - Capri length, loose fit, elastic waist, drawstring, straight leg, solid color, cropped pants, womens capri yoga pants, lounge pants.\nDesign - Two deep pockets for secure storage of your phone or other essentials. Special side split detail adds to the sense of relaxed fit and stylish.\nOccasion - The comfy capris are comfortable, perfect for yoga, sporting, jogging, running, walking, camping, hiking, office, work, school, sleep, lounging around and relaxing at home, daily wear.",
			"reviews": {
				"customerProfileNames": [
					"TanyaBoydKoch",
					"caroleJoyce",
					"Sparky",
					"ANGEL",
					"MaryA",
					"M.Lincoln",
					"Tess",
					"KindleCustomer"
				],
				"customerProfilePictures": [
					"https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif"
				],
				"customerRatings": [
					"5.0 out of 5 stars",
					"5.0 out of 5 stars",
					"5.0 out of 5 stars",
					"4.0 out of 5 stars",
					"5.0 out of 5 stars",
					"5.0 out of 5 stars",
					"5.0 out of 5 stars",
					"5.0 out of 5 stars"
				],
				"customerReviewTitles": [
					"Fit as expected and comfortable",
					"Will buy more.",
					"Love these!!!",
					"These Fit True-To-Size! & Very Comfortable!",
					"Great feeling capris that fix perfectly!",
					"Comfy",
					"Great capris!",
					"soft and comfy"
				],
				"customerReviewBodies": [
					"I am 5'5 and 165 pounds. I ordered a large and they fit well and are nice and soft. They look great with a summer shirt and my sandels.",
					"The color so nice as shown. Fit is perfect large . I’m going to buy more.",
					"The only thing wrong with these is that they don’t come in more colors . These are sooooooo comfortable & flattering & are very well made. Don’t hesitate",
					"I was very surprised that the small fit me! The waist is very stretchy (it looked very small but it fit perfectly). These pants are very comfortable and are a very loose fit. The blue is almost a navy though, I wish it was brighter. But, I liked them so much that I got them in the grey also but the grey is a \"heather\" grey which doesn't show up in the photo so that's a disappointment! The material seems to be kind of thick for summer but I wore them on a warm day and they were not hot at all (for me).",
					"I washed these (always do before wearing after received) and hung them up to dry. They came out just fine and looked good, no wrinkles. I really like these! Bought two.",
					"These are so comfortable! Just perfect for a casual outing, hanging around the house, or going to the beach! Love them!",
					"Great fit, color! Thanks!",
					"Fit was perfect...soft material and comfy."
				]
			}
		},
		{
			"id": "NFjAhel",
			"title": "Lee Women's Petite Flex-to-go Mid-Rise Relaxed Fit Cargo Capri Pant",
			"price": "$29.99",
			"image": "https://m.media-amazon.com/images/I/71s-MUcYw8L._AC_UY445_.jpg",
			"description": "Lee is an iconic American denim and casual apparel brand that's been making legendary product for legendary people since 1889. With over 125 years of purposeful design and craftsmanship, we know a thing or two about style. Driven by our core values of authenticity, integrity, and drive, we create products our customers love, time and time again. From uniquely styled jeans, pants, and shorts to on-trend shirts and jackets, our movement-inspired innovations, versatile styling, and superior fit have inspired generations of brand loyalists. So what are you waiting for? Move your Lee.",
			"reviews": {
				"customerProfileNames": [
					"S.Schelander",
					"Kathy",
					"JuleeHoulton",
					"Karen",
					"LittleVista",
					"AlinaMcCabe",
					"Merilegs",
					"jlbinvt"
				],
				"customerProfilePictures": [
					"https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif"
				],
				"customerRatings": [
					"2.0 out of 5 stars",
					"5.0 out of 5 stars",
					"4.0 out of 5 stars",
					"5.0 out of 5 stars",
					"2.0 out of 5 stars",
					"4.0 out of 5 stars",
					"5.0 out of 5 stars",
					"5.0 out of 5 stars"
				],
				"customerReviewTitles": [
					"Baggy legs - not as shown on model, again!",
					"They fit very true to size.",
					"Run really big!",
					"Perfect fit for me",
					"Petite 8 measuring exactly the same as the Regular 8",
					"Stretch throughout the day",
					"Fit a little big. Read this review",
					"Comfortable"
				],
				"customerReviewBodies": [
					"I loved the cinnamon color so much, so I took a chance on these even though I read the reviews that cited baggy legs. And, guess what - that is totally true about these capris. Beautiful color; the waist, hips & thighs fit, however, any lower than that and the legs go straight down and are wide. They are not tapered in the least. If you don't like baggy legs, don't even give this a try. You'll be disappointed unless you have very heavy legs. Now I have to return them. Why do these advertisers show a model with pants that have tapered leg when that is not the case?!?!? SO frustrating.",
					"I bought 3 pair and love them! They fit perfectly and are very well made. Also, they don’t shrink or fade!",
					"I love Lee pants and I love these capris! Do keep in mind they may be 2 sizes larger than your normal size. I am 5 ft. tall and weigh around 130 pounds. I started with a 10, I don't like tight clothes, but swam in them. So ordered an 8, still too big. Dropped down to a 6, and they are only slightly big. I would have tried a 4 next if the pants needed a belt to stay up, but so far so good. I really love all the pockets. I am training our new dog and I have a pocket for her training treats, one for her disposal bags, one for my phone, one for keys and one for my snack, plus more if needed.",
					"The teal is darker than the photo shows, which is fine. With my flabby thighs and full abdomen, ordering pants/trousers is always iffy, but these Lee capris fit very well. I usually wear a 12 Petite in most pants. At 152 lbs & 5'4, the 12P fits well in these Lee's. Hoping the knitted waist lasts.",
					"photo of new navy blue Petite 8 measured the same as the Regular 8 (?). We love the design of Lee's Flex to go, mid rise, cargo capris! But, some are sized incorrectly. A month ago we ordered the Lee denim capris from a different online provider and they were sized wrong as well - the size 6 was possibly a size 4 as I couldn't begin to zip them up. Go to stores to try them on first if you're not prepared for discrepancies like this in ordering them online.",
					"I am pleased with my purchase. It took me a few orders to figure out what size I would be. I wasn't sure how the fit in waist would be with the elastic flex waistband. I ended up with a size smaller than what I would have expected. Main reason I went with the size is because there is spandex in the fabric. It gets a little stretched out throughput the day. I am definitely considering buying another pair in a different color.",
					"I like them. Next time I will order a 6petite. I am 5'1\"and weight 115. A little loose.",
					"The pants fit as expected, I was hoping the color was more like the picture, but it is more of a rust color which is fine, I can incorporate them into my wardrobe. Had they been the pinkish I would of preferred, cinnamon color is fine for fall! But over all they are great.",
					"Arrived in great time…and they fit me perfectly…I’m 67, 5ft 2” and 140lbs with an average build…this 10 petit fit in all the right places…I’m thrilled…would recommend.",
					"These cargo capris are very comfortable. They fit as expected, wear and wash well. I bought five pair of these capris in different colours because I liked them so much. Love that I can wear them rolled up and buttoned or unbuttoned for a longer length. I'm not a fan of a mid-rise waist on anything, but with these cargos, I am able to roll the waistband down and they look just fine. Arrived on the estimated delivery date both times. I had to send the first set back that I had ordered because I ordered the wrong size. Refund and exchange wasn't a problem with this company at all. It was a bigger hassle getting the Delivery Company to pick them up for exchange than receiving a refund from the company itself. Would definitely purchase again.......and did!",
					"These capris are great, I bought them for a tip I am going. Worth the money",
					"Great quality color darker then shown but like them so much just ordered another pair.",
					"I love it and ordered the cinnamon colour too"
				]
			}
		},
		{
			"id": "xh0reRe",
			"title": "adidas Women's Tiro 21 Track Pants",
			"price": "$16.04",
			"image": "https://m.media-amazon.com/images/I/61xmfyFRLAL._AC_UX385_.jpg",
			"description": "A classic look that keeps you comfortable. These soccer track pants for women have 3-Stripes on the legs and an adidas Badge of Sport on the hip for sporty style. Moisture-absorbing AEROREADY keeps you dry. Ankle zips make them easy to slip on and off over your shoes.",
			"reviews": {
				"customerProfileNames": [
					"stormie2003",
					"Jona",
					"Jesus",
					"LPalmer",
					"Customer",
					"TerriDinSanDiego",
					"RiverPlains"
				],
				"customerProfilePictures": [
					"https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif"
				],
				"customerRatings": [
					"5.0 out of 5 stars",
					"5.0 out of 5 stars",
					"5.0 out of 5 stars",
					"5.0 out of 5 stars",
					"5.0 out of 5 stars",
					"5.0 out of 5 stars",
					"5.0 out of 5 stars",
					"5.0 out of 5 stars"
				],
				"customerReviewTitles": [
					"Great joggers!",
					"Medium",
					"true to size!",
					"Fits as Expected",
					"Love these",
					"Love These!",
					"Comfortable",
					"very comfortable, nice stretch for movement"
				],
				"customerReviewBodies": [
					"The pair I bought and they have a mesh inset over the top portion of the addidas 3-stripes (behind the pocket) which I was not aware of from the product photo, however it is actually a lot nicer looking in person than on that photo. Both side pockets are deep and have concealed zippers; when zippers are in \"open\" position the pockets are still comfortable to put your hands in (nothing scratchy). Also both legs are very tapered so the zippers run from hem to knee on the outside of each leg; this makes it so much easier to put these over shoes, etc. Overall I just love these; the fit, the feel and they wash up so well. I am a happy customer.\nAlso, I am 5'-10\" (155#) and usually wear a size 30 jeans, size 10 slacks or size MED for leggins; These joggers fit me perfect in MED. These are made in Vietnam & have no objectionable smell right out of the package.",
					"I love it! Finally got my perfect size.\nIm 5'4, 160lbs.",
					"I love it fit true to size Im 5'2\" 300lbs big butt big belly omg this fit perfect!\nNot see through at all!.",
					"Too big. Ordered an XL Had to order a smaller size. But they fit nice.",
					"Fit as expected. I’m a housekeeper so I need to move easily for hours at a time. The zip pockets are great for holding a phone. I like the roominess in the thigh, but tapered lower leg. I ordered two pairs, but will order more as needed for my uniform.",
					"They are true to fit and are so comfortable, flattering to the figure. I have 3 pairs (black, gray, maroon). I am 5'2\" and 120 pounds and get the XS.",
					"D",
					"Very comfortable for walking, running and vigorous movement activities. They fit well. I like the tapered leg and side zipper to cool down. The zipper also makes it easy to get feet when removing the pants. Zippered pockets are deep and keep the stuff carried safe.",
					"I like the triple stripe styling on these track pants, but be aware they are cut very shallow through the crotch, so ride low. This is a problem if you are curvy as they will constantly pull down in the back. Less curvy figures would suit the athletic cut.",
					"Got these to coach my sons soccer. I’m 160lbs and 5’5 and got size large, they fit with a bit of room in the waist.",
					"I’m a M/L and these fit perfectly — good length, too, for those with longer legs.",
					"These Spring & early Fall pants are very light and very comfy but too light for sub-zero temperatures. Adidas sizes are «big», so if you are normally choosing 2X because Chinese 1X is too small, here don't size up.",
					"Me demande si réplique du a la place de fabrication et au niveau des mollets il n'y a pas de ligne comme mes autres modèles.\nMais fit très bien au grandeur habituelle.",
					""
				]
			}
		},
		{
			"id": "eGs-7pr",
			"title": "Mizuno Adult Women's Belted Low Rise Fastpitch Softball Pant",
			"price": "$22.99",
			"image": "https://m.media-amazon.com/images/I/41DtyYmr0dL._AC_UY445_.jpg",
			"description": "The Mizuno Select Belted Low Rise Fastpitch Pant features a low rise fit exclusively for women. Performance Plus padding adds extra comfort and protection in the seat. Features include a tunnel belt-loop waistband, double-layer knees, and 2 set-in back pockets.",
			"reviews": {
				"customerProfileNames": [
					"MindyB",
					"H.Urlocker",
					"T.Evans",
					"AuroraVales",
					"Customer",
					"Marge",
					"StefanieA",
					"Customer"
				],
				"customerProfilePictures": [
					"https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif"
				],
				"customerRatings": [
					"5.0 out of 5 stars",
					"5.0 out of 5 stars",
					"5.0 out of 5 stars",
					"5.0 out of 5 stars",
					"5.0 out of 5 stars",
					"5.0 out of 5 stars",
					"5.0 out of 5 stars",
					"5.0 out of 5 stars"
				],
				"customerReviewTitles": [
					"Great for bigger girls",
					"Mizuno, our go to for softball pants",
					"My daughter's favorite",
					"Fits GREAT!!!!!!",
					"Perfect Fit - Great Quality",
					"Nice pant",
					"Best softball pants around",
					"My daughter loves them! NOT SEE THROUGH!!"
				],
				"customerReviewBodies": [
					"Writing this review for the moms like me that have tried and returned a blue million pairs of pants. These are NOT low waisted, which my girls love, and have thigh and butt room. They’re still “fitted” but made for girls that aren’t tiny. My girls are 5’ 7” and 5’ 9” and both weigh around 200 pounds. They have sturdy, softball physiques with the shorter one having a bigger bottom and thighs, but the XL works great for both of them. Hope this helps!",
					"Mizuno is my daughter's go to brand for softball pants. They fit her so flatteringly..(is that a word?!) She wears a small and is and a size 2, and is 5'2\", about 108lbs. 2 Are fairly thick, but have nice stretch and usually last more than one season!!",
					"My daughter is 15 and plays for her high school as well as a club league. These are her favorite pants. She likes the built in padding for sliding as she hates sliding shorts. I like her happy and comfortable so they're a win.\nAs the one paying for them, they are pricey. Rip it brand is cheaper and also has padding but it's a little smaller and the material is a little thinner overall.\nThe knees do end up with holes cause she slides and dives but I don't think much can be done there. Reinforced knees would be awesome..the same padding on the backside/hips could be sewn in to the knees.\nThese were a replacement for her favorite pair that ripped when she got cleated by another girl sliding into 2nd (she got the out though!). It was cold so she had leggings underneath but the metal cleats tore these pants but not the leggings underneath and not her skin.",
					"I was nervous about ordering these for my daughter, she is 12, is 5'4, weighs about 225 lbs, and wears a size 18 in her school uniform pants. I was surprised to see that they fit her perfectly! She says they are the comfiest softball pants she's ever worn! I highly recommend!!!!",
					"Since there was no real sizing guide just a comparison of what size you wear in other product lines I was a little skeptical but did find a few reviews that came close to my height and weight, which is 5' 5\" 125 lbs. Women's Size \"SMALL\" fit perfect, although I was a little disappointed since the description read low rise and the waistband (belt loops) came up just over my hip bones versus sitting on or below hip bones. I wear a medium in 3N2 and they fit perfect so that is why I was a little skeptical in sizing. The quality of the Mizuno pants is great. Very comfortable fit for someone with muscular thighs, not too tight. I will definitely purchase again.",
					"Not like older Mizunio pants. But worth the purchase. My daughter is 5’1. 112 lbs\nAnd wears a size zero in most pants. We ordered the womens xtra small.\nFit is good, a little snug. Waist has room but her belt fixes that. She could probably go with a small but likes a tighter fitting pant",
					"I have bought these same pants fir my daughter for several years now. From youth to adult, these are high quality and the perfect fit. They look great and are comfortable on the field.",
					"These have been great pants, we keep coming back for more as she grows out of them and as she needs new colors. White softball pants that are not see through are hard to find, these are nice and solid. She loves that they have some extra cushion in the hips for sliding. The elastic at calf is snug enough to stay in place but not too tight for comfort. She plays almost year round between school ball and travel ball. These get washed at least weekly and have held up very well to both a significant amount of playing time as well as the washing. Size seems true to retail sizing. Overall, great product.",
					"I love these pants, I don’t have very much of a butt lol so they fit me well, I’m usually a size 30-32 in pants and the mediums fit snug, I could have probably gone with a large but the mediums fit high waisted so don t have to worry about “spillage” lol I’m also 5’8” and 145-150lbs or so",
					"Sizing chart is a bit inaccurate, but overall these pants just didn't have the amount of flexibility I was looking for with active sports pants. I went with under Armour instead.",
					"Die Hose ist sehr gut verarbeitet, hat eine gute Qualität und Passform. Vielleicht sind die Beine etwas zu lang geschnitten. Bei mir ist die Beinlänge bei einer Körpergröße von 165 eher 3/4 statt 1/2.\nEinzig negativer Punkt: Es ist, obwohl so im Angebot beschrieben, kein Gürtel dabei. Daher 4 statt 5 Sterne.",
					"",
					"Ordered an xxl because it says the waist was 30”. It most definitely was not! Waaaaay too big. Could have fit 2 of my daughter in there.",
					"They are decent pants. However they ripped after my daughter's first game while sliding."
				]
			}
		},
		{
			"id": "qvKoaxs",
			"title": "Lee Women's Plus-Size Relaxed Fit All Day Pant",
			"price": "$28.16",
			"image": "https://m.media-amazon.com/images/I/61JElCfWExL._AC_UY445_.jpg",
			"description": "",
			"reviews": {
				"customerProfileNames": [
					"YaniTorres",
					"A.K.Armitage",
					"KittyLynn",
					"Kameo",
					"D.K",
					"Lee",
					"RhondaThissen",
					"CNewbould"
				],
				"customerProfilePictures": [
					"https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif"
				],
				"customerRatings": [
					"5.0 out of 5 stars",
					"4.0 out of 5 stars",
					"4.0 out of 5 stars",
					"3.0 out of 5 stars",
					"5.0 out of 5 stars",
					"5.0 out of 5 stars",
					"4.0 out of 5 stars",
					"5.0 out of 5 stars"
				],
				"customerReviewTitles": [
					"Really confortable!!!",
					"Good fit",
					"Durable work pants that get the job done.",
					"disappointing fit",
					"Great fit for a hard to fit girl.",
					"Good casual or business casual work pants",
					"Very nice pants!",
					"Great fitting pants!"
				],
				"customerReviewBodies": [
					"I am a size 18 on regular clothes and I use the same size on this pants. They fit great. I really recommend them for daily use.",
					"I wear a 16 or 18 and I bought the 18w in this pant. It's not too baggy around the waist but it has room in the butt/thighs. I'm more of an hourglass figure. It's a good straight leg, not pegged and not overly wide. The fabric is a decent weight. It's not super light where it will wrinkle easily and show every bump. But it's also not super stiff.",
					"As a petite woman who's also plus size, buying pants is often a nightmare. Many plus size pants are way too long, and many pants that are sold as petite don't come in the size I need. These pants eliminate both of these problems entirely! Quality, durable pants that wear and wash well, and are also lightweight and cool. If I have just one criticism, it would be that they seem to expand a bit after wearing them for a number of hours. If that doesn't bother you though, these are a great choice.",
					"Extremely comfortable but unfortunately the material shows EVERYTHING. Pocket lining and underwear lines galore. The fit in the stomach is very poor. Pockets gape open, and the rise comes up almost to under my bra. Really unflattering in the front. I wear a size medium/large top and a size 20 pant and have never had pants be this unflattering around my stomach before.",
					"I always have a difficult time finding any pants that fit me right. I am both petite and plus size but carry my weight in my hips and legs not my waist. So finding any bottoms that fit over my hips/legs while also not being large and gapping in the waist has always been a struggle for me. These pants fit amazing if you're shaped like me. Perfect in the waist, no gapping and perfect in both length and width in all other areas. Waist does sit a little higher up than other pants but I'm fine with that. If you like a lower rise than these are not the pants for you. I ordered my normal size 20w petite and the size was spot on. Ordered 4 more pairs.",
					"These are nice, casual to business casual, pants. I have two in different colors, both of the 98% cotton fabric blend, and they are a nice material and fit. The rise is a little longer than I would prefer, but only by a little so it's not a big issue. I wear them to work or out to dinner all the time. The fabric is a little thin, but that's great for summer. In winter I do prefer a little heavier pants for the warmth, but I live in a cold climate. Easy machine wash and dry, hang or fold, and ready to wear. Good value for the price.",
					"I really like these pants. I first bought the parchment color and liked them so much I ordered the indigo rinse and black. The fabric on the parchment and black is very nice - soft to the touch with a slight sheen and stretch that moves with the body. The indigo rinse isn't as soft as it's a kind of mock denim - those are stiffer, but still nice and fit well. I ordered them in petite since I'm 5'3\" with short legs and they are nearly the perfect length - generally capris are the only pants I can wear off the rack without hemming, but these are just slightly longer than I like so they should allow for shrinkage. The only reason I'm giving them four stars is that they're baggy in the waist - it seems slightly out of proportion with the overall cut of the pants and I have to wear a belt, even under sweaters or untucked blouses, so they don't fall down. Other than that one thing, I'm very satisfied with my purchase. Great for work in a business casual environment, or for weekend wear.",
					"These are my \"to go\" pants for work. They have what I need.. decent front pockets for phone and keys, back pockets , belt loops, variety of colors and they wash great. I ordered the size 16 regular in grey and love them. Also have them in black.",
					"M",
					"",
					"they ended up a little big, so I washed them thinking the cotton in them would shrink down some...guess I was wrong...material is a cat hair magnet and has a bit of a sheen to the material.",
					"Great fit, a bit too long but I just roll them up. Love the quality, nice and thick but not too thick. I’ll be buying more colours. One thing to note is that they are a bit long (I’m 5’4) but I just roll them up.",
					"Very happy that the don't gap at the waist and that they are roomy in the hips and backside. Been wearing this brand and style for years.",
					"Me encantan estos pantalones porque están hechos para personas de tallas extras, muchos modelos son diseños de tallas regulares solo grandes pero estos son diseños para talla grande así que me quedan perfectos",
					""
				]
			}
		},
		{
			"id": "Vtymhft",
			"title": "Energy Zone Women's Cotton Stretch Yoga Pant",
			"price": "$13.41",
			"image": "https://m.media-amazon.com/images/I/71IGzKXRwtS._AC_UX342_.jpg",
			"description": "This Cotton Stretch Classic Yoga Pant is great for your fitness training and makes a good base layer for everyday fashion. Made of a cotton/polyester/spandex blend fabric for a supportive yet flexible fit, it wicks moisture away from the body for extra comfort.",
			"reviews": {
				"customerProfileNames": [
					"CJ",
					"KellyKeefe",
					"MissLisaMBK",
					"RachaelFjoser",
					"PamelaAnn",
					"greg",
					"SuzyQ",
					"PJ"
				],
				"customerProfilePictures": [
					"https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif"
				],
				"customerRatings": [
					"5.0 out of 5 stars",
					"5.0 out of 5 stars",
					"5.0 out of 5 stars",
					"5.0 out of 5 stars",
					"5.0 out of 5 stars",
					"5.0 out of 5 stars",
					"5.0 out of 5 stars",
					"5.0 out of 5 stars"
				],
				"customerReviewTitles": [
					"Energy zone yoga pants.",
					"I’ve now purchased 12 pairs of these!",
					"best yoga pants",
					"My favorite brand for years now!",
					"Love these and they fit!",
					"Finally!",
					"The Real Deal!",
					"PERFECT!"
				],
				"customerReviewBodies": [
					"With a thyroid problem my weight goes up and down. Love these pants. Very comfortable and lightweight. Not see through in any way. Wish they had more colors. I bought one Gray and one black in extra large. I fluctuate from 150 to 175 lb at 5 ft 4. Highly recommend.",
					"I bought these trying to find a replacement for Old Navy’s yoga pants that they don’t sell anymore. These are made from a wonderfully soft cotton material that washes beautifully (my first pair is more than a year old and they are still jet black with no pilling).\n\nThey are very flattering, even for a fuller figure. Although they are soft and stretchy, they provide nice support in the abdomen so you don’t feel like you’re hanging out everywhere. The waist lands at a good spot so you avoid muffin top but they also don’t come up too high.\n\nI love these so much I’ve purchased several other pairs for myself (including the heather grey ones) and bought some for my daughters and daughter-in-law for Christmas.\n\nThey run a wee bit big (better than too small!) I’m 5’5” and 195 and comfortably wear an L in these.",
					"B",
					"T",
					"I have a long torso and shorter legs. Typically all yoga pants are too long unless I order \"short\". These fote perfect with shoes on. Yes, a little long without shoes but I'm ok with that.\n\nIm a size 14 and the large fit me just fine.",
					"Finally I have found a pair of black pants that are comfortable and fit me well!! I typically wear a large/size 12 in pants and these are close to perfect. The only slight downfall is that they are a bit long. I am 5’5. With shoes on they are really ok. I got them at a gift and ordered two more pairs immediately.",
					"Looking for Spalding yoga pants like they used to make but changed the fabric & fit? This is them! Perfect! Most comfy yoga pants. I looked for fabric content and happily found these. I did order a size up from L to XL cause having surgery and didn’t want anything right over stomach area. Buy..you won’t be sorry!",
					"I have purchased these pants several times because they're so comfortable and versatile. With a nice shirt they can serve as dress pants -- comfortable dress pants! They're also great for every day or for working out. I love them! I do purchase 1 size bigger than normal for me because I'm not getting them for support but for comfort."
				]
			}
		},
		{
			"id": "i8hBpQq",
			"title": "Levi's Women's Classic Straight Jeans Pants (Standard and Plus)",
			"price": "$24.00",
			"image": "https://m.media-amazon.com/images/I/51OAis1dPML._AC_UX385_.jpg",
			"description": "Levi's® Plus Women's Size Guide If you liked the 505™ Straight jean, you'll love the new 414 Relaxed Straight − designed for style and comfort. Sometimes, life demands that you take it easy. When the day is right, step out in effortless cool with the 414™ Relaxed Straight Jean. The 414™ features a mid rise and a loose, relaxed fit that runs straight from the hip through the leg. Leather brand patch at the back waist. Woven flag patch set at the back right pocket. Five-pocket design with signature arcuate stitch. Belt-loop waistband. Zip fly and button closure. Soft Clean White: 97% cotton, 3% elastane;Oak Blues, Thistle Lake: 60% cotton, 23% viscose, 16% polyester, 1% elastane;Northwest Sky, Soft Parade: 52% cotton, 29% viscose, 18% polyester, 1% elastane. Machine wash and tumble dry. Imported. Measurements: Waist Measurement: 36 in Outseam: 42 in Inseam: 32 in Front Rise: 10 3⁄4 in Back Rise: 16 7⁄8 in Leg Opening: 17 in Product measurements were taken using size 16W, inseam S. Please note that measurements may vary by size.",
			"reviews": {
				"customerProfileNames": [
					"Spark",
					"DeniseB",
					"Amazoncustomer",
					"LLB",
					"Brittni",
					"Amazonjunkie",
					"Bettesue",
					"Sandy"
				],
				"customerProfilePictures": [
					"https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif",
					"https://images-na.ssl-images-amazon.com/images/S/amazon-avatars-global/d29ac3dd-ec1b-49d2-a395-26d49bcf0a2f._CR62,0,375,375_SX48_.jpg"
				],
				"customerRatings": [
					"1.0 out of 5 stars",
					"2.0 out of 5 stars",
					"5.0 out of 5 stars",
					"3.0 out of 5 stars",
					"5.0 out of 5 stars",
					"1.0 out of 5 stars",
					"5.0 out of 5 stars",
					"5.0 out of 5 stars"
				],
				"customerReviewTitles": [
					"Jeans need REAL pockets",
					"Whelp! These are not the thick, traditional jeans I'm looking for . . .",
					"THANK YOU LEVI'S FOR THESE FLATTERING YET COMFORTABLE JEANS!!!!! LOVE THEM!!!!!",
					"Compare & Contrast",
					"Nice Fit",
					"Length is wrong",
					"White classic straight leg levis",
					"Fits well in the thighs!"
				],
				"customerReviewBodies": [
					"I returned these jeans because in my opinion, they're not jeans. They have those 'faux' pockets. You know the ones, you only get your finger tips in before you've hit the bottom of the pocket. Do these designers think that women don't need pockets? Where are we suppose to put our stuff if we don't want to carry a purse or clutch? Women like/want pockets too!",
					"I",
					"Some great things about these jeans: the knees are neither tight, nor baggy. The ankles are a true straight cut that is not flaired, so comfy and easy to get into, but with a nice long straight line from hip to ankle that flatters the figure, and way more appropriate for grown up women to wear than all those spray-painted-on looking jeans that are miserable to get on and off. The waist is fairly high in a way that shapes the back view beautifully. Grateful to find these flattering, comfortable jeans that are stylish and can be dressed up or casual. I bought one size smaller than normal, after having tried them on and purchasing my first pair at Macy's in a size 4, which is comfy and great on me but not as flattering as the snugger size 2 here. I am 5'5\" and 129lbs (this week, ha!) The \"Island\" rinse dark color is so nice, with no fake wear-spots on the thighs and rear, and a crisp, neat look. I did try on the kind one shade lighter with a washed look, and they were actually quite nice too but I'd prefer to use up my own clothes rather than to buy them already worn-looking.",
					"I",
					"I am 5'4 and usually wear a size 16. I got these in a 16 short and am very pleased. They are the perfect length and fit comfortably. I have wider hips than my waist, so I always have to wear a belt with other jeans. These are cinched in slightly ad the waist so I dont have to wear a belt! I will buy again in more colors.",
					"I ordered two pairs of this pants. One in black and one in dark blue. I only wear Levi’s and love them but have not tried this style before. It said they were long and they were far from that. One measured a 30 inseam and the other measured 32. 2 inches is a lot of difference from the same pants style. The long is 34 inches inseam so this product was missed marked and clearly inconsistent length",
					"I own many pairs of Levi’s. I was hesitant to order these as I just lost some weight and these don’t have as much stretch as some styles. They are 97% cotton. Nice medium weight denim glad I didn’t size down and ordered my regular 8 short I’m 5 2.5 and 140 lbs. these fit me perfect. I’ll be careful not to shrink them until I lose more weight. Not sure why the white is different but I like them.",
					"I was nervous buying jeans online because they are almost always too tight in my thighs, so I was really happy to get these and have them fit perfectly. I wear a 14 or 16 depending on the brand of pants and I bought a 16 in these and they fit nicely. Also, usually if I find jeans that fit my thighs they are huge in the waist. These were not! So, if you are looking for jeans that are fuller in the butt and thigh but not huge in the waist, give these a try. They fit a bit snug at first but they have stretch so, they are still comfortable and stretched a nice amount within a short amount of time.",
					"Ordered this model of colour Island Rinse. As ''pluss'' I can mention really nice dark blue colour and good quality thick yeans material, quite stretchy. As well very good production quality.\nBut I have to return these jeans because of too large fit. Ordered size W26, as I already have good fitting Levis model No. 714 of this size (also straight fit and the same % of elastane). But these model is too big both in waist and in hips as well...\nAlso I would like to mention, that the jeans are more close to high rise than mid rise, but this also could depend of individual body shape, of course.\nSo, I advise to order one or even two sizes below, if You like fitting look.",
					"I bought my usual size, returned because they were too big, and bought 1 size down. Seemed okay, but they stretch as you wear them. Thought they might be okay after washing... NO... feel frumpy in them.. don't wear them",
					"Classic cut Levi’s jeans, straight leg but not skinny, waistband sits at my waist. Fit is a tiny bit generous (to my surprise, since my measurements match the size chart exactly) but not so generous as to be sloppy. Fabric is more stretchy than I had expected. Someone who’s a size larger than me tried them on and while they could be done up, the jeans looked way too tight on her. Result: if you’re at or a little bigger than the size chart, you’ll be fine with the stated size.",
					"I am going to have to sell them. They were huge. Perhaps the cut. I had the same size in my dark wash Levi’s but these were more like an 18 than a 14. They are really nice and I am reluctant to return them as they will probably just be discarded. Not going to order another pair, as I have learned my lesson about ordering pants online! Hopefully I can find someone to buy them. The price and quality were great.",
					"I've always ordered at 29\" in a Levis (size 8). I have a small waist and larger hips and Levis were the only jean that gave me the perfect fit. The fabric has a lot more stretch in it than the older cotton denims. With a belt the 29\" work okay but I did order a size 28\" (size 6) and they are a much better fit. Watch out for the stretchy waist band."
				]
			}
		},
		{
			"id": "2Z2rSps",
			"title": "EASTON PROWESS Fastpitch Game/Practice Softball Pant | Women's | Solid |",
			"price": "$34.08",
			"image": "https://m.media-amazon.com/images/I/71hQQPaOwGL._AC_UX385_.jpg",
			"description": "Easton prowess softball pant Women's solid White small",
			"reviews": {
				"customerProfileNames": [
					"Customer",
					"MrsRintheHudsonValley",
					"Tymantha",
					"MissLyss",
					"Ashleymoultrup",
					"Melissa",
					"A.O.",
					"Tjmiller"
				],
				"customerProfilePictures": [
					"https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif"
				],
				"customerRatings": [
					"5.0 out of 5 stars",
					"5.0 out of 5 stars",
					"5.0 out of 5 stars",
					"5.0 out of 5 stars",
					"5.0 out of 5 stars",
					"5.0 out of 5 stars",
					"5.0 out of 5 stars",
					"1.0 out of 5 stars"
				],
				"customerReviewTitles": [
					"Great quality pant",
					"This is her 2nd pair bc these are Perfect for my daughter",
					"Softball pants",
					"True to size",
					"Great fit",
					"Size up",
					"Perfect!",
					"Nothing like the photo!"
				],
				"customerReviewBodies": [
					"Well made pants. Run on the small side for us. Granddaughter bigger in thighs from all the sports she does. However she has a smaller waist. We bought a belt and that worked for us. Bought two pair.",
					"My daughter has been on Varsity Softball since she was in 7th grade. This year she is a freshman and needed another pair of practice pants. The first pair were her favorites so I just bought her another. She is 5'2\" and appx 135lbs (although you'd never guess her weight to look at her, as she's very muscular). She normally wears petite, pants ranging in sizes from 0 to 4, making her normally an x-small or small, yet in these she needs a medium~and a belt. The legs are fitted, without bagging out behind her knees. The length is ideal for her, as many other softball pants look like either baggy pantaloons or are the length of peddle pushers on her. Her original pair have lasted through the past 2 seasons and are heading into season 3 with little to no show of wear, despite being worn & slid in at least 3-4 times/weekly during each seasons. I was able to confirm that these were the same pants I bought her 2 years ago, using the RN number that was in the waist of the first pair.",
					"They run small but were super easy to return.",
					"True to size they were a great fit. Good elastic on the legs. My daughter wears a size 3/5 in teens and I ordered small they fit perfect!",
					"These pants fit great. East to run and move in. I will be purchasing again as my girls grow.",
					"You definitely need to size up. Otherwise they are good quality and have held up very good.",
					"Comfortable and fits good.",
					"The pair of softball pants we received was nothing like the photo or description. Nor did it match the q&a page. The pair we got had no zipper or Button just a drawstring. Only one pocket in the back, not two. The belt loops are different. The material was VERY thin, when I held the pants up they were so thin you could see light shining through them. If you look up this same pants on the Easton website it says it has silicone grippers inside the waistline to help hold jersey in place - the pair we got has a just a generic waistline - no grippers. Looks nothing like the original picture. These are more like $10 or $15 pair of softball pants instead of $40. Very disappointed! Returned same day. Frustrating for those that need softball pants quickly then have to deal with the hassle of returning and start the ordering process completely over! Update your description so people know what they will be receiving.",
					"This brand has mesh on the inner thighs, which is see through. I do not recommend for anyone, even if wearing sliding shorts under the pants. The back side is very thin as well and likely won't last half the season if sliding into bases.",
					"I ordered my true to size large and they were at best between a 4-6.\nI ordered the XXL thinking these would be fit perfectly. No they were way too big. Would not reorder",
					"I really liked them but they fit small. I’m a large and they were very tight I would size up from your normal size. After wearing them for a couple of hours I discovered that the zipper is missing teeth and kept popping off. Hopefully this was just a defective pair as they are nice pants.",
					"Moins bonne qualité que ceux en magasin. Moins confortable et tissus moins élastique.",
					""
				]
			}
		},
		{
			"id": "nPcrng2",
			"title": "Gloria Vanderbilt Women's Misses Amanda Ponte High Rise Knit Pant",
			"price": "$24.48",
			"image": "https://m.media-amazon.com/images/I/714TbtQ7oYL._AC_UX385_.jpg",
			"description": "Gloria Vanderbilt Women's Amanda Ponte High Rise Knit Pant sits at natural waistline with fully functional pockets, front zipper fly, belt loops and contoured hips on a relaxed taper fit body for that comfort fit you've come to love. This High rise pant goes great with all tops from fashionable to Tee shirts and all footwear from your favorite flats to stylish heels and boots, perfect for work, class or happy hour. The stretch fabric gives you comfortable movement with maximum recovery. Available in assorted solid colors, prints, stripes and embellishments, see color name for specifics. Gloria Vanderbilt is a versatile yet classic look that attracts and connects with the modern sensibility of consumers of all ages.",
			"reviews": {
				"customerProfileNames": [
					"TF",
					"Customer",
					"gvs",
					"Kathy",
					"VickieEvans",
					"PB2020",
					"J.Anthes",
					"Customer"
				],
				"customerProfilePictures": [
					"https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif"
				],
				"customerRatings": [
					"4.0 out of 5 stars",
					"5.0 out of 5 stars",
					"5.0 out of 5 stars",
					"5.0 out of 5 stars",
					"5.0 out of 5 stars",
					"5.0 out of 5 stars",
					"5.0 out of 5 stars",
					"5.0 out of 5 stars"
				],
				"customerReviewTitles": [
					"Affordable pants, inconsistent sizes",
					"Soft, waist has NO give",
					"Very good for Office wear",
					"Elegant jeans",
					"Great fit",
					"Look and feel great.",
					"Love them wish I could find more.",
					"Great comfort!!!"
				],
				"customerReviewBodies": [
					"I ordered three pair of these pants in all three colors, all in the same size. The black and gray fit very well, the plaid were way too small.\nPros - comfortable, stretchy material, affordable\nCons - limited colors, inconsistent sizes\nEven if I order the exact same Gloria Vanderbilt pants or jeans in the exact same size, one pair with fit, one will not. I really don't understand how there can be such a big variance in fit.",
					"I love them. They are perfect for my uniform and I hope to find more to purchase. I also hope to lose an inch before I need to wear them. I am a 35\" waist. These are about a 33-34\"",
					"Was sceptical of how it would turn out to be but glad to have purchased..it is strechy,comfortable and flaterring too unlike some of the office wear that makes you look baggy!",
					"These jeans are made with a nice, perhaps dressy denim. Thet fit great. They also have a higher rise, which I like.",
					"The fit was perfect. The material is soft and the pants are Very comfortable. I got average length. I’m 5’3” so they are a little long but with a heal they’ll fit Perfectly.",
					"Feel and look great. Soft flat knit fabric. Seemed to hold shape with few hours of wear.",
					"Love them. Great fit and stretchy",
					"Very comfortable nice looking psnt",
					"I ordered a size 14 since that is what I normally wear in this brand/fit. When laid out flat the hip and waist were 2 1/2 inches smaller than my pair of size 14 Amanda cotton twill pants (so that’s 5 inches smaller in the waist, when you take into account the reverse side as well). I have previously purchased the knit version of this pant in blue and black. Both still fit, one pair is size 10 and the other size 12. The new grey pair that I ordered was smaller than each of these. Very disappointed in the lack of consistency in sizing for this brand. Overall the proportions are good for my body type. I don’t know if the ones I ordered were miss sized or if they have changed the cut and I need to order size 18. The fabric and colour were nice but I returned them due to the size issue",
					"Perfect fit, quality fabric with a little stretch. My third pair of these pants that can be dressed up or down. Highly recommend.",
					"Me encanto! Me quedo un poquito amplio y largo, nada que no se pueda solucionar.. creo que una talla menos habría sido perfecto.",
					"",
					"Pantalón comodo Con buena caída mi única queja es que en la cintura le falta rigidez o cuerpo",
					"",
					"Hermoso y cómodo\nLa talla perfecta",
					""
				]
			}
		},
		{
			"id": "w34SLSG",
			"title": "neezeelee Dress Pants for Women Comfort Stretch Slim Fit Leg Skinny High Waist Pull on Pants with Pockets for Work",
			"price": "$38.99",
			"image": "https://m.media-amazon.com/images/I/612uP51RUAL._AC_UX385_.jpg",
			"description": "62.8% Viscose, 32.3% Polyester, 4.9% Spandex\nMade in USA or Imported\nPull On closure\nMachine Wash\nFlattering Skinny Fit: 4-Way Stretch Knit makes these stretchy pants fit like a dream. Modern Leg, High-rise, Fitted through the hip and thigh. Making them a quick and comfortable option for starting any outfit with style\nClassic Comfort: Pull-on style, (No zipper, no closure). They pull on like leggings, Elasticized waistband that moves with you, and smooths out any imperfections. Now you can look office-ready while enjoying all the comfort of your favorite yoga pants.\nAdded Features: Elastic and durable waist elastic with front pockets, Comfortable Fit with Skinny leg pants for touch of chic. Higher rise designed to keep them from slipping down when bending or crouching. Added back yoke seam for a better fit- No gaping!\nShow more",
			"reviews": {
				"customerProfileNames": [
					"R🧿🧿💭",
					"cassie",
					"Marie",
					"SWilke",
					"Kim",
					"Sam",
					"Amber",
					"JamesCullen"
				],
				"customerProfilePictures": [
					"https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif",
					"https://images-na.ssl-images-amazon.com/images/S/amazon-avatars-global/97d34974-9cb2-43d7-a514-f60fcc6a23cc._CR75,0,350,350_SX48_.jpg",
					"https://images-na.ssl-images-amazon.com/images/S/amazon-avatars-global/07beb561-69ef-490b-9352-02bf72f75338._CR0,0,960,960_SX48_.jpg"
				],
				"customerRatings": [
					"5.0 out of 5 stars",
					"5.0 out of 5 stars",
					"5.0 out of 5 stars",
					"5.0 out of 5 stars",
					"5.0 out of 5 stars",
					"5.0 out of 5 stars",
					"5.0 out of 5 stars",
					"5.0 out of 5 stars"
				],
				"customerReviewTitles": [
					"Comfy, good for many occasions.",
					"Beyond comfortable",
					"LOVE these pants (just check the pockets)",
					"Thick material - super comfortable",
					"Great length and fit",
					"So impressed with the length and fit!",
					"Love them… most of the time.",
					"BUY THEM BUY THEM"
				],
				"customerReviewBodies": [
					"T",
					"I immediately purchased a second pair. And then told my mom and friends to order them. These pants feel like BUTTA! They are so comfortable and have a coolness to them which is perfect for someone who works in the Florida heat. I’m 5’8 and probably about 160 (thank you quarantine weight) and I am very bottom heavy.",
					"I am in love with these pants. I'm 5'11'' and 198 lbs, and a size 12 fits me. They do all the right things for the lower half of my body. Plus they're so comfortable, but still work-appropriate. I get compliments on them all the time, and people ask me where to get them. The only thing you have to do is check the pockets. There's an older version of the pants with satin pockets and those pockets will fray. I got a couple pairs of the older version after I reordered the pants (because I loved them so much), and had to return them. I contacted the seller and they assured me they aren't selling the older version anymore and the next two pairs I got were the newer version that I loved. These are the only brand of pants that I will wear to work; I loved them so much that I just ordered a bunch in black and a bunch in blue. So, definitely try out these pants (just check the pockets).",
					"These pants are AWESOME! I was not expecting the thickness of these pants! They DO NOT look or feel like yoga pants, but like real dress pants, but are EXTREMELY comfortable and have a good bit of tummy control! I’m pleasantly surprised by this purchase. I would suggest sizing down if you want a good snug fit in the leg. I am 5’3” 137lb and bought both a 2 & 4 just to try. I’m keeping the 2 (Im a 4/6 or 7/9 in jeans).",
					"Good quality, not too tight for professional wear, nice length and overall fit - I’m 5’9, but usually wear a regular leg length, I find many Ponte pants run short, but these are great.",
					"I am 5’7, 145 lbs and am mostly just legs. I have been searching everywhere for work pants that are comfortable but are also long enough to reach my ankles. Everywhere I go, I find office pants that are either too short, fit me too tight in weird places, and are not high waisted if they’re long. I’m usually a 4 in pant sizes, and these fit me perfectly. They feel really comfortable to wear walk around in and sit in all day. I am so impressed with these pants, I will absolutely be buying more. 10/10 highly recommended.",
					"The pants are extremely comfortable, perfect for business casual environment, and look great with flats or heels,\nHowever, beware of inconsistent size and length as well as material from one pair to another. One will be perfect but the next might be a 1/2 inch too short, or the legs may fit slimmer than the last pair, and the material may be heavier than others, etc. I simply return and purchase another until I get the correct size/length. Overall I give them 4 stars due to the inconsistencies.",
					"I usually don’t like shopping for pants and ESPECIALLY hate online but these are the pants! They are so stretchy and comfortable while being flattering and professional looking. They fit and curve to your body like leggings but also make sure to smooth out all your cellulite and little rolls! They fit really nicely except sometimes, they don’t stay up super well but tucking the shirt in is such a cute look with them! You can also try to add a belt which i’ve done a few times; honestly just an amazing product and so many cute ways to wear them! I’ve worn these casually and to work, if you’re interested in them totally get them!",
					"Fue lo que esperaba y se siente muy bien la tela.",
					"",
					"Love the cut & fit!"
				]
			}
		},
		{
			"id": "Q5RCKLy",
			"title": "Alfred Dunner Women's Medium Pant",
			"price": "$18.03",
			"image": "https://m.media-amazon.com/images/I/61NFu63lL3S._AC_UX342_.jpg",
			"description": "Our super soft, relaxed fit pants are easy on the eyes and the body; Constructed of high quality polyester fabric for long-lasting wear; Stay wrinkle-free all day long with these easy to care for polyester pants",
			"reviews": {
				"customerProfileNames": [
					"RetiredandLovingIt",
					"Pettigree",
					"RodBeals",
					"Jello",
					"Betmatrho",
					"RoxanneG",
					"JoAnnE.Lewis",
					"CherylWills"
				],
				"customerProfilePictures": [
					"https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif"
				],
				"customerRatings": [
					"5.0 out of 5 stars",
					"5.0 out of 5 stars",
					"5.0 out of 5 stars",
					"5.0 out of 5 stars",
					"5.0 out of 5 stars",
					"5.0 out of 5 stars",
					"5.0 out of 5 stars",
					"5.0 out of 5 stars"
				],
				"customerReviewTitles": [
					"I am 5 ft 4 inches and the length is perfect for me (don't like ankle pants) Great for travel",
					"Yes, these are your mother’s slacks!",
					"The pants are great get a smaller size",
					"Perfecto",
					"Very nice pants -",
					"True to size, nice fit",
					"Comfortable",
					"Beautifully made"
				],
				"customerReviewBodies": [
					"These are wrinkle resistant and do not catch lint. The pocket holds my iPhone 7+ securely. I am 5 ft 4 inches and the length is perfect for me (don't like ankle pants) Great for travel. I now have 3 pair and may get more. Love them.",
					"These pants are exactly what I’ve been looking for for my elderly (90s) mother, the roomy style she has worn and loved through the years. No zipper, elastic comfort waist and an easy-launder fabric. The length, even though described as “short,” was still too long for her just under 5’ stature and will require shortening but is an easy fix. Very pleased with this pant for her.",
					"Pants fits great had to get smaller size not true to size",
					"Date night excursion , relax fit great quality",
					"First ordered a size too large and returned the next day - they promptly sent out a smaller size and was received in two days - outstanding - thank you.\nThe pants are very nice for traveling - almost wrinkle free. They color was perfect (tan) to go with the blouse I plan to wear with these slacks. Had to hem the pants as they didn't have them in petite sizes.\nYes, would recommend these pants and I have other Alfred Dunner items well - usually good quality.",
					"I purchased 3 pairs of these pants. Nice quality, great price, comfortable fit. Got the large for my mother and she’s happy with the purchase. But, they are a tad long. Not a deal breaker.",
					"These pants in medium short fit perfectly. The material is comfortable and perfect for any weather. The pants look good enough for any occasion- work or casual. I plan to order many more in different colors.",
					"The quality of these pants still amazes me. They look good, are creased down the front and go from day to night easily.",
					"With the sudden closure of TanJay and Alia, I'm in search of comfy dress pants I can wear to work for the remainder of my working life. Tried these and they're just okay. I'm not happy with the boxy shape of them or the width of the legs but they're comfortable enough and will do until I find something better. Just hope Alfred Dunner doesn't go out of business now...grr.",
					"Really disappointed in the quality of polyester that these pants are made of. Today you can find polyester pants that are much softer to the touch and more comfortable. I thought Alfred Dunner produced better quality pants. The pants I received are the kind you can find at Walmart for much lower prices.",
					"Je me suis croisée les doigts en les commandant. La coupe du pantalon est ok, mais le tissus et de ceux qui tiennent la statique et qui sont inconfortable. C'est pour ma maman. Elle va chialer, mais bon. Quoi de neuf.",
					"",
					"This product was a terrible fit and material was rough to the touch. Fit my waist and that was all........way too large and poor styling",
					"Material is very coarse and actually hurt my skin as I was trying it on. Could not imagine wearing this for a full day ."
				]
			}
		},
		{
			"id": "O0DFG8q",
			"title": "JUST MY SIZE Women's Plus Size Active Stretch Capri",
			"price": "$14.00",
			"image": "https://m.media-amazon.com/images/I/71p+6XkPnSL._AC_UX342_.jpg",
			"description": "Performance that feels better. Jms active, an energetic new sub-brand of performance clothing for active women, with the famous fit of jms. Easy to wear tops and bottoms. Dynamic range of go-to-styles. Pricing as comfortable as the garments themselves.",
			"reviews": {
				"customerProfileNames": [
					"PreciseDisarray",
					"StephanieGilbert",
					"Zetasweet16",
					"Bronte",
					"PickledOnions"
				],
				"customerProfilePictures": [
					"https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif",
					"https://images-na.ssl-images-amazon.com/images/S/amazon-avatars-global/966a5c7c-eaea-41b2-a459-c0e9f56f3716._CR0,26.0,281,281_SX48_.jpg",
					"https://images-na.ssl-images-amazon.com/images/S/amazon-avatars-global/1dea98e3-08c8-4585-a729-397d4075c8fb._CR0,0,2208,2208_SX48_.jpg"
				],
				"customerRatings": [
					"5.0 out of 5 stars",
					"4.0 out of 5 stars",
					"5.0 out of 5 stars",
					"5.0 out of 5 stars",
					"5.0 out of 5 stars",
					"5.0 out of 5 stars"
				],
				"customerReviewTitles": [
					"generously sized, fits at true size but could go size smaller if need more compression",
					"Love these pants!",
					"Great fit!",
					"GREAT fit, 12% spandex provides comfy compression, high waist, stays in place for range of motion",
					"I need more of these!",
					"Perfect for the ladies with the larger hips!"
				],
				"customerReviewBodies": [
					"These are quality leggings (I have two pair, about to have three). I haven't had them for long, but I've worn them several times all day long under various circumstances--so far so good. I put them on and forget about them. The product description mentioned a draw string closure. No such thing. It is just a regular pair of (quality) leggings that are pulled on. No need to fuss with anything else. They are real comfortable, not binding anywhere, and they stay up. I am not pulling them up constantly, or making any adjustments. Generous sizing. Go with your size if you dont want too much compression, or try a size smaller if you want more compression. These stretch for days :) I am ordering a size smaller to see how much they differ. I will report back when I receive those.(I did this, my update/edit is below)\n\nA little about my body:\n\nI am 5'10, 300 lbs, and have a belly \"apron\"- lots of loose skin that makes sizing awkward. I have an hourglass (leaning pear shape)- for the most part my body is in balance --save the for the large flappy skin hanging at my belly. I will include pics of these on me.\n\nBecause of this belly, no matter my size, I use compression to hold that in place. It is less to do about look, and more to do about feel. The loose flapping skin apron is uncomfortable to walk around with if I am wearing a loose pair of shorts or pants. Also makes it more likely that my shorts or pants will fall off. So I go for compression. Looks better, feels better. I say all this because I had to really consider which size to select based on their size chart. I wear about a 2x, and I think I am in size 22, maybe closer to 20. I went with a 2X which correlates with a size 20, because I remember most of the leggings I have purchased over my life have fit a little large. This remains true here.\n\nThe size 20/2xl in these leggings provide a fair amount of compression and the overall fit feels great. They have a lot of additional stretch without feeling loose or too big. However, as mentioned earlier, I am ordering a 1X to see how much they differ. These fit a little looser that what I am used to. But they do fit well and are comfy!\n\n*******EDIT*****: I purchased the 1XL (blue) and they fit as comfortably as the 2XL (gray) but clearly with a more snug fit, yet doesn't bite in, roll, or smash down my butt too much (but smashes down my belly nicely), AlSO, the color doesn't stretch away to nothing (some colored leggings if they have a white, or light colored interior, that color will come through when the leggings are stretched, which looks awful. These dont do that, and for that I am doubly impressed). I like either. I am now going to buy the purple, and I decided to go with that in the 1XL again. For me the added compression just makes me feel even better. But both sizes work, and I am super pleased with this style from Just My Size. There are pics of the gray pants and the blue pants included here, but they look similar in the pics and may be hard to tell which is which.\n\nHigh rise, waist stays up, leg length hits me about mid calf. Leg stays in place too.\n\n88% Polyester, 12% Spandex\n\nI wash my leggings in cool or cold water. Directions say to wash in cold water. Anything with spandex should not be washed in hot water, or dried on hot. Maybe medium setting at most. Heat kills spandex over time.\n\nThese will not shrink in wash. NO PILLING so far!",
					"These pants are almost perfect! I ordered two pair for a trip to LEGOLAND. The printed pair was perfect- however the gray pair showed sweating and wetness from water rides. That made me slightly self-conscious. They kept me cool and dried quickly.",
					"Perfect fit and soft feel! Great for my walking!",
					"T",
					"I've never worn leggings. I'm short and plus size. I've always been too self conscious to wear leggings but I've been walking more and I see women of all sizes wearing leggings to exercise. I knew they'd be more comfortable so I decided to take a chance. These fit true to size using the size chart. They are thick enough that they aren't see through at all. And they do breathe well when getting sweaty. I was still unsure though about wearing them in public. When I walked out of the bedroom wearing them, my fiance said \"Wow! Look at you!\" with a big smile. And they were so much more comfortable walking in than my usual baggy jersey capri pants. I'm getting more of these for sure!",
					"These pants are perfect for the ladies with larger hips! These are the first active stretch pants I have found that have a slight longer rise which means that they sit on the hips and not around your knees. I've done a lot of activity in them - mowing lawn, gardening, yoga and jogging and these pants stay put. No loss of stretch or color after repeated wearing and washing. Bought a second pair in the butterfly print and plan on getting a second set in the black!",
					"I read previous reviews and ordered a size larger, they fit great, stay in place as I bend and stretch. I don't do yoga but I do garden, so having something that doesn't get in the way and keeps everything appropriately covered is important",
					"I found the capris to be a little on the small side. I bought my usual size 4X but they really were a tight fit. They are a nice pant but you may want to consider going up a size if ordering.",
					"Omg , so glad that i purchased these pants! They are confy, stretchy and perfect !\nSizing is on point, they fit lilke a glove and i have a big big tummy! ( size : 3X )",
					"These leggings are so soft and comfortable. the color / pattern looks just like the photo.\nColor Name: Wingspan Odyssey\nSize 5x: I normally wear a 4x, but I sized up because you never know with these things. Glad I did, I think a 4x might have fit, but it would have been tight.\n\nHighly recommend these. they are beautiful.",
					"I have bought these pants 4 times in the past year. The first pair was amazing so I got another pair. The second pair was totally different! The pants were long, too small and so I gave them to a friend. The 3rd pair was good and as expected but the 4th pair that I just received was totally different again! Wrong fabric, size would fit a petite teenager! Definitely a love/hate for these pants!!"
				]
			}
		},
		{
			"id": "R6lraEl",
			"title": "Gloria Vanderbilt Women's Amanda Classic High Rise Tapered Jean",
			"price": "$12.50",
			"image": "https://m.media-amazon.com/images/I/51Q-9t61AfL._AC_UX385_.jpg",
			"description": "Gloria Vanderbilt's # 1 selling women's jean in America with over 60 million sold nationwide the Amanda Classic High Rise Tapered Jean. This pant sits at your natural waistline with fully functional pockets, easy front zipper fly, belt loops for your favorite belt and contoured hips for that comfort fit you've come to love. Pairs great with all tops from fashionable to your basic tee shirt and all footwear from stylish heels and trendy boot to your favorite flats! The Amanda high rise Jean gives you the mid section confidence you want and versatility you need in any wardrobe, perfect to wear to work, attending a class or spending time with friends for family. Available in various colors, prints, embroidery and embellishments. Effortlessly fun and stylish. A versatile yet classic look that attracts and connects with the modern sensibility of consumers of all ages.",
			"reviews": {
				"customerProfileNames": [
					"Kae0_o.",
					"OhioAnn",
					"DebbieD",
					"anitaj",
					"WM",
					"RLA",
					"AnnShamrock"
				],
				"customerProfilePictures": [
					"https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif",
					"https://images-na.ssl-images-amazon.com/images/S/amazon-avatars-global/6dcc9568-056e-4354-940b-c1bb3546faf6._CR0,0,375,375_SX48_.jpg"
				],
				"customerRatings": [
					"3.0 out of 5 stars",
					"4.0 out of 5 stars",
					"1.0 out of 5 stars",
					"5.0 out of 5 stars",
					"5.0 out of 5 stars",
					"2.0 out of 5 stars",
					"5.0 out of 5 stars",
					"5.0 out of 5 stars"
				],
				"customerReviewTitles": [
					"Dont Think This Style's Good for Petites/Shorts, Otherwise Nice",
					"Great jeans but sizing cannot be trusted",
					"Not what I expected.",
					"flattering with just the right amount of stretch",
					"Great price, comfort and fit",
					"Size is not Consistent!",
					"Comfy fit.",
					"LOVE LOVE LOVE!!!"
				],
				"customerReviewBodies": [
					"Im 5'5\" a little over 35.5\" in waist, 45\" hips, 24\" diameter thighs and 16\" diameter legs/calves, no thigh gap.\n\nWhat drew me to these pants were that they were high waisted and on a lightning deal for like 20 bucks. I didnt think much about the cut beyond the waist but figured tapered legs would be attractive.\n\nI think the deal breaker for me is the style. They look kind of like straight legs on me, and since I have large thighs it's just more fabric than I want in the leg area. I dont like how the fabric bunches behind my knee and though this isn't entirely on the jeans I don't think they're doing my bum any favors.\n\nI did go a size larger than i probably should have with the 16, I just hated the idea of the top of the jeans pinching my stomach. I also got the regular instead of the short but I dont think the tapers sharp enough for the extra length to make a difference here, meaning to give shape to my legs.\n\nI think the taper's only really attractive if your thighs arent super disproportionate to your legs. Maybe like 2 or 3 inches max wider diameter in the thighs in relation to your calves. At least for the fit I want. I was gonna send these back in exchange for some 14's but I think I'll have to go with one of the other cuts to get the fit I'm looking for.\n\nBesides the fit I think these were a good buy for the price. Nice stretch and color. not as thick as some denim blends, a bit thicker than like denim leggings. Comfortable to move around in, liked fit at the waist. Better than most things you'd find between 20 - 30. If I had to recommend based on fabric and comfort vs leg fit I'd recommend.",
					"I",
					"I was very excited to receive these jeans because I figured the fit would be perfect because I had bought them at a local store in the dark wash. The Amanda Jean details were exactly what I had purchased so I believed that it would be a perfect fit. No way are these the same jeans. They are wide all around. NOT tapered at all. Almost 33 1/2 inches in length. So disappointed. Back they go.",
					"These are the best pants ever!! I have several pairs in different colors & LOVE them!! They're super soft & the colored \"jeans\" do not look like jeans at all. Very figure flattering with just the right amount of stretch.",
					"These jeans are very comfortable and fit nicely. They are high waisted which is exactly what I need for my “older lady mom bod”. These go over my belly and since at my natural waist. I gave long legs and a short torso and the cut in the “long” was perfect. They wash well and are soft with a nice stretch so you don’t feel pinched or squeezed.",
					"I am trying to get the same size 16 W Amanda jeans. This seems to be a huge issue with this company. In the last four days I have ordered five pairs of jeans. All of them have been exactly the same style, and exactly the same size. The problem is that some are made in Jordan, And some are made in Sri Lanka. The jeans that are made in Jordan fit much smaller then the jeans that are made in Sri Lanka. The jeans that are made in Sri Lanka fit as they are supposed to fit. The ones made in Jordan are about 4 inches too tight! Both of these are exactly the same style of Jean, The same cut, and the same “size” from the same company. However, they fit entirely differently! At one point, I even tried to order an 18 W, thinking that it would fit better… It did not, it was too large. This is infuriating, as one does not know where the pants have been made when one orders the product.",
					"I really like the fit of these pants. I am 5'9\" but not with really long legs so I normally get average. Sometimes jeans can be a little skimpy on the length but these fit perfectly. The size is the size I would normally get and these are a comfortable fit. Other brands I can't wait to slip into something more comfortable but the little bit of spandex on these make them easy to wear all day. Since I do a lot of gardening I like that they not only look nice and fit well they seem to be holding up to doing outdoor activities. I bought a second pair after receiving these and will probably buy more in the future.",
					"I LOVE THESE JEANS!!! I recently ordered my 2nd pair and I'm pretty sure I'll order more.\nSo comfy!!! ADVICE. DO NOT dry in the dryer. When they are still wet, simply stretch the legs a bit\nby standing on the bottom and pulling up slightly. let air dry. they stay nice and long. The stretchy material is fabulous!!!",
					"This product is well made and quite heavy duty but not what I expected as the description says “tapered legs” and the picture shows them as tapered and quite elegant. Maybe I got the wrong size and style sent. These are not my style and they did not fit well so I have returned them. As I’ve had to send them to Las Vegas USA I’m hoping the postage is refunded. I would use them for horse riding as they are of heavy material and would probably fit over boots.",
					"Hope to wear once lost lockdown fat!!!",
					"It is definitely bigger than your normal size and the flares are baggy too.\nMaybe buy a size smaller. Also you have to consider that through a few washes, the size does change.\nMy previous one bought from America, did change size and was a good fit, so I bought it again.",
					"Fab jeans, I would love them in other colours (mine are black) but they are either unavailable in my size or they are a lot more expensive. They are comfy, look classy and I got the last pair for a reduced price.",
					"The jeans fit really well and I like the colour, the material is not to heavy, just right for the spring"
				]
			}
		},
		{
			"id": "6ytxHZd",
			"title": "UEU Women's Cozy Yoga Joggers Pants Loose Workout Sweatpants Comfy Lounge Pants with Pockets",
			"price": "$19.98",
			"image": "https://m.media-amazon.com/images/I/518a2gezRzL._AC_UY445_.jpg",
			"description": "90% Polyester, 10% Spandex\nImported\nElastic closure\nCold water, Gentle cycle, Low temp dryer.\nUS Size: S(4~6), M(8~10), L(12~14), XL(16~18), XXL(20~22), 3XL(24~26). All sizes are based on US size, Model is wearing a size Small, height is 5'8\".\n25 inch inseam. Available in tall and regular length.\nNice Material, Lightweight, Stretchy, Squat Proof, Buttery Soft, Semi-fitted, High Waisted, Wide Waistband, Fitted Cuffs, Side Deep Pockets, Full Length, Solid Color.\nShow more",
			"reviews": {
				"customerProfileNames": [
					"StaciGreene",
					"Julia",
					"NicoleParrotta",
					"CyndiLundeberg",
					"Zeldalover68",
					"S.Fessler",
					"M.B."
				],
				"customerProfilePictures": [
					"https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif",
					"https://images-na.ssl-images-amazon.com/images/S/amazon-avatars-global/fce0b8a3-00e3-4fb6-aec8-9350fbc43676._CR0,0,375,375_SX48_.jpg"
				],
				"customerRatings": [
					"5.0 out of 5 stars",
					"5.0 out of 5 stars",
					"5.0 out of 5 stars",
					"5.0 out of 5 stars",
					"5.0 out of 5 stars",
					"5.0 out of 5 stars",
					"5.0 out of 5 stars"
				],
				"customerReviewTitles": [
					"Pregnancy approved!",
					"The hunt for the perfect harem pant ends HERE!",
					"Get them. Please just do yourself a favor.",
					"I don't think I can describe how Comfortable these truly are",
					"BEST PANTS EVER!!!",
					"Perfect for post-cesarean!",
					"Soft, comfortable, stretchy"
				],
				"customerReviewBodies": [
					"So being pregnant and a tight skinned whale I hate all bottoms right now. Everything is uncomfortable to wear. I wanted to find a pair of pants like these that I could wear to the hospital and back home after giving birth! Or at-least for postpartum use if they were too small or tight on my tummy. My usual weight is in the 130s lbs but with baby number two I’m currently at 170 lbs at 8 months. I wasn’t sure what size to get so I just got my usual pre-pregnancy medium for the after birth. But surprisingly they fit my lower pregnant tummy just fine! No tightness or discomfort spandex pants give me. And they fit great under my tummy too so I know they’ll fit great once baby’s out. I’m just worried if my belly continues to grow these last 2 months it’ll stretch the waist elasticity so I’m not gonna wear it too much to preserve it’s youth lol. But definitely recommend for pregnant people! If you’re less weight or roundness than me medium should fit fine! Bigger than me I would say medium -large just so you don’t suffer from the compression if it gets too tight.",
					"At last, a pair of comfy, cute harem/boho pants that check all my boxes! I am 5’5” 160-165 lbs with a 30” waist, 40” hips, and a sizable booty, and shopping for pants online is always a gamble; the medium was completely perfect. You can wear these pants mid waist or high waist, they have a generous stretch, and the material feels genuinely cozy and well-made. I’ve been burned by cheap online retailers before and had pants fall apart after one use, but no more! I’ll be buying these in more colors ASAP.",
					"L",
					" I don't think I can adequately describe how comfortable these yoga joggers are. The material is the super soft cotton that just feels wonderful on. It has pockets and also cops around the ankle and a waistband up top. These are the most comfortable pants I own I am obsessed.",
					"These are the best pants I have ever purchased! My cousin recommended them to me and I'm so glad she did. She is newly pregnant and was looking for really comfortable stretchy pants that were lightweight and would adjust to her weight gain. She absolutely loved them and expressed just how SOFT they are, and she was not wrong! I purchased one to try it out and I just received them and they are already more comfortable than everything I own! I will be ordering more in different colors and my cousin has already started her collection....so maybe you should too!\nJust for reference I am 5'0\" and around 200lbs approx. and I bought an XXL. I have a tummy and these pants were in no way tight at all. Definitely enough elastic to keep your pants on, but not enough to cling at all. Gotta be honest, kind of feels like you're not wearing pants tbh.\nAlso, this was in no-way a paid review and is 100% all me and my own opinion and I did not receive any compensation for making this review. I am simply a customer who loves the product that I ordered and felt I NEEDED to share it with everyone else, especially since online shopping for clothes is super hard)",
					"I am obsessed with these. I bought them because I needed something loose and high waisted to wear after my c-section and these are perfection. I wore them in the hospital and have been living in them since coming back home! They are extremely soft, super high waisted, and they have pockets! Since they’re so stretchy, they fit me while I was still pregnant, as well as postpartum. Also very flattering! I already bought another pair, and I’m sure it won’t be my last. For size reference, I am 5’6” tall, 146 lbs pre-pregnancy and 175 at the end of my pregnancy, and M fit perfectly.",
					"I love these pants, they are soft and comfortable, a bit on the thinner side but that is fine with me. I was looking for light weight pants for around the house, with cuffed bottoms because I am short and hate when pants drag on the floor if I wear them out. The cuff is not tight at all. Pockets were also important, they are big enough for me to fit my phone in. I would consider buying a third pair!",
					"I've got some health issues that make it hard to wear anything right around my waist and hips. These are so comfortable, they are exactly what I needed! I may have to live in them.\n\nThe wine red is a very pretty colour, and the black is classic.\n\nI ordered a small and a medium to be safe, and both fit well. The small fit me better, but the mediums will stay on.",
					"Let me start off by saying how much I WANTED to love these pants. They're so soft and wash really well. The only thing is that they're too short for my 6'0\" frame. It's not their fault. It's never the clothes' fault. :) I'm still going to enjoy getting cozy in them this winter -- just making sure I have long socks to wear with them to cover that pesky ankle gap. So, if you're 5'9 and under, I'd say buy multiple pairs of these pants and enjoy!",
					"These are very soft & comfy pants but please note that they hold nothing in lol! They are also on the thinner side in terms of fabric. That all said, I was looking for a pair of comfy lounge pants, and I found them! I will order another pair, but might try a size down.",
					"Very stretchy, soft and comfy. Goog buy, would recommend and will buy again.",
					"These are very comfy, comfy enough to buy more. I think if I could, I would live in these sweat pants. The material is great too."
				]
			}
		},
		{
			"id": "T0vkFUC",
			"title": "Danskin Women's Drawcord Athletic Pant",
			"price": "$22.00",
			"image": "https://m.media-amazon.com/images/I/71hj1t3A+1L._AC_UX342_.jpg",
			"description": "Our relaxed draw cord pant is great for yoga, pilates and more. The carefree design includes two convenient front pickets and a neat side seaming detail. Working out or chilling out, the cozy fit sure does the trick",
			"reviews": {
				"customerProfileNames": [
					"BillysPixie",
					"Customer",
					"Customer",
					"Francine",
					"Customer",
					"jessi",
					"mwhit63",
					"artMom",
					"jogdiddy"
				],
				"customerProfilePictures": [
					"https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif",
					"https://images-na.ssl-images-amazon.com/images/S/amazon-avatars-global/0e1b5ff0-0216-4025-9d4a-9d0274fe1552._CR50,0,300,300_SX48_.jpg"
				],
				"customerRatings": [
					"4.0 out of 5 stars",
					"2.0 out of 5 stars",
					"1.0 out of 5 stars",
					"5.0 out of 5 stars",
					"5.0 out of 5 stars",
					"1.0 out of 5 stars",
					"5.0 out of 5 stars",
					"5.0 out of 5 stars"
				],
				"customerReviewTitles": [
					"Questionable",
					"Counterfeit or just loss of quality?",
					"HOLES with gentle washing! Also - NOT 32\" in length (it's 28 1/2\")",
					"Like them so much I bought them twice",
					"Get it!",
					"Knock offs! Not Danskin! No drawcord.",
					"Comfy pants",
					"Love these pants"
				],
				"customerReviewBodies": [
					"D",
					"I previously purchased two other pair of these sweatpants in black and gray. They are both of the same high-quality and well fitting and true to size. This navy pair is remarkably poor quality, with less stitching and reinforcement in the waist than the other two pair, and as can be seen in the photos, significantly shorter and thinner. The other two pair were made in Vietnam, this pair in China, but you can see the product number and style are all the same.These pants are less than $10 quality.",
					"I am 5'9\", so it was quite evident to me that the 32\" stated in the description was not accurate when I received the pants.\n\nUPDATE: 11/5/2020\nI washed the pants in a gentle cycle, cold water in a front loader, so little wear and tear on fabric - and suddenly noticed some white - what looked like spots - but in actuality is the fabric itself separating! In other words - HOLES! This last washing produced holes all over. These have to be disposed of. See the pictures.\n\nJuly, 2020\nThey are great quality, the pockets are useful and they feel good.\nHOWEVER, the length is NOT accurate and makes them less than perfect. The length pretty much only reaches my ankles.\n\nI would be very interested in those that are actually 32\" that have the rest of the same positive qualities of this pant.",
					"These pants are perfect! I bought the grey ones first and about 3 days after they arrived I bought the black pair. I'm 5'2\" and about 135 lbs, normally in a size 10 or 12, I bought a size medium and they fit great. They were too long (even after washing - in cold water) so I had to hem them, but I'm 5'2\" and usually surprised when I don't have to hem something. I also removed the draw string tie, I don't need it to hold the pants up and it didn't serve any other purpose. I was looking for yoga pants that had pockets because it's nice to have a place to put my mobile phone or keys in when I'm in lounge wear mode. Really never intended them to be for yoga. ;-) These are so comfortable! I'm very satisfied with them.",
					"I love these pants soooooo much! I am going to buy one in every color. These are so comfortable!! They fit me perfectly and are so soft! They aren’t too heavy or light. I believe the fabric is perfect for everyday and/or working out. Stretchy and the band at waist is very interesting. It’s not just one small band or one large band. It is a draw string and band. Honestly, just buy it! You will not regret this at all!",
					"NOT Danskin brand. I received off brand generic pants from China. They do NOT have a drawcord. Cheap elastic. Basically the only thing true about the listing is that they are in fact pants.",
					"These are nice pants. Had to order a size up as the 2x were too tight in the rear for me to be comfortable in public. The 3x fit better though a little long. (5’5”, 220.) They shrank some upon the first wash but that was ok because I dried them on medium heat. Comfy pants with decent waistband. Don’t buy them for the pockets - pockets are not deep and are angled oddly to me. Nice weight to the fabric - not too thick and not skintight thin. Overall, they fit the bill for exercising at the gym and working around the house in cold weather.",
					"Love these pants. Soft, smooth material & a very comfortable fit. Being 5'8\", 130 lbs., I usually wear a medium. I ordered a large because I was concerned about the length. Length is perfect, falling right below my ankle. Even tho' a large, the fit is perfect. So I would say they run a bit small.",
					"I have a pair of Danskin woman's pants for years, they so good that I thought I'd buy some more. I bought the same size XL but a different style. Although these as extremely comfortable too, they are a bit on the large side.",
					"Comfortable but a bit to wide on the leg",
					"Hace varios años había comprado este pantalón, lo uso mucho y como ya estaba viejito compré otro para reemplazarlo.\nMe quedé muy decepcionada porque no es ni de la misma calidad ni de la misma tela y el corte está raro.\nCabe recalcar que yo soy muy alta y precisamente me había gustado el pantalón porque la tela se ajustaba bien a mi cuerpo y la tela me cubría los tobillos. Este, en cambio tiene el tiro muy largo y lo tendría que usar hasta la cintura y las piernas me quedan de brincacharcos. No recomiendo el producto. Parece pantalón de hombre y no de mujer.",
					"",
					"I ordered size M after measuring myself and it turned out \"Somewhat large\" at the waist and \"Way too large\" at the legs. I'm a fit person, I would say the same body shape as the model in the picture, yet the pants look nothing like that on me. The waist would be OK-ish if I tie it, but the legs are really large and long. The whole thing looks like an oversized bag on me.\n\nBottom line, I think the size chart is not accurate. I was falling a little bit above the lower limit for M. I guess I should have ordered an S.",
					"I love the fit of the pants, I have purchased 4 pairs from this shop. I wear them hiking and unfortunately all 4 pairs are wearing down/thinning/pilling between the legs. If your legs touch when walking don’t expect these to last long. Thin material, but light enough for summer. Shame they don’t wear well, I won’t be buying more."
				]
			}
		},
		{
			"id": "Z3LdXB4",
			"title": "Skechers Women's GO Walk High Waisted Flare Pant",
			"price": "$12.30",
			"image": "https://m.media-amazon.com/images/I/610PYxBJVAL._AC_UX342_.jpg",
			"description": "The Skechers GOWALK Pant Evolution is the perfect pant for working out, hanging out, or tackling the weekend chores. The moisture wicking material keeps you cool and dry when you are at your most active. The go flex fabric features soft \"cotton-like\" Hand feel. The pockets are large enough to hold A smart phone. 31\" Inseam.",
			"reviews": {
				"customerProfileNames": [
					"Lisa",
					"AlienWife",
					"GGirl",
					"Ronda",
					"Memaw",
					"Leah",
					"Marissa",
					"Westielover"
				],
				"customerProfilePictures": [
					"https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif"
				],
				"customerRatings": [
					"5.0 out of 5 stars",
					"5.0 out of 5 stars",
					"5.0 out of 5 stars",
					"5.0 out of 5 stars",
					"5.0 out of 5 stars",
					"5.0 out of 5 stars",
					"5.0 out of 5 stars",
					"5.0 out of 5 stars"
				],
				"customerReviewTitles": [
					"Great pants.",
					"Very practical! Good quality",
					"Buy the pants",
					"They are quite long in the leg",
					"This is my 5th pair!",
					"The best fitting yoga pants I have ever used",
					"I just love them.",
					"Really cute"
				],
				"customerReviewBodies": [
					"I feel like I hit the lottery! I have been searching and searching for black slacks with some stretch that are stylish, comfortable and look flattering on me.\n\nI stumbled upon these while searching once again for the perfect black stretch pants.\nI'm so happy that I checked these out.\nI took a gamble and ordered 2 pairs. Not expecting much I tried the first pair on...Wow, I was so impressed.\nThe fit was spot on as well as the rich, black color.\nThe quality of the stretch material is superb..They arent thin, they have some weight to them..The bootcut has the perfect flare..Back pockets aren't too bulky, they are flat so they don't make your backside look big.\nThe length however is very long on me. I am 5ft 4in tall and have a 30 inch inseam and these were quite long.. It doesn't matter though, I will have them hemmed by my seamstress.\n\nAlthough I paid $45 a pair, it's worth the added cost to have them professionally hemmed.\nI ordered 2 more pairs..They arrived today..I tried them on and they fit the exact same way as the last 2 pairs did so the sizes are consistent.\nI usually take an XL for comfort and played it safe by ordering XXL because of the fitted style.\nThey run true to size ( besides the length)\nI may consider ordering 2 more pairs because I wear this color / style slacks 4 days a week at work and on other off days to do errands.\nI can finally bid farewell to my old, stretched out slacks.\n\nIf you're in need of a great pair of pants, take a chance on these. You won't be disappointed..\nIt's a sure bet you will love them.",
					"I have several pair of the non boot leg version from Costco. These are more everyday, non-sport wearable. They have two Jean style/positioned pockets on the back and a flattering boot cut. Length is average to slightly long. Rise is long, perfect for long waists and 5'7\"+ people fabric is thick enough for camouflaging underwear but can be worn in most summer months (in Seattle anyways).",
					"I'm an engineer working in an office, but I make frequent trips to the manufacturing floor. My normal work attire is a polo shirt and chinos. I bought a pair of these yoga pant at Costco as a lounge around the house or weekend pants, but one day I hadn't done the laundry and only had these to wear to work. I was hooked. I bought four more pair, and they are the only pants I wear to work now. The strength is good, but there's enough hold to keep their shape all day. The weight of the fabric is good for summer through winter. These pants are so comfortable and breathable. In my work and with menopause happening, they are perfect. I even wore them with a lace jacket to a concert. You can't go wrong with these. I bought the XXL and they fit great.",
					"I am only 5'-5\", 150lbs. I bought a size medium. They fit well and are definitely high waisted. I love that! However, they are about 5\" TOO LONG. I will have to hem them. That is the only draw back that I can see.",
					"LOVE these pants. The fit is snug but not tight, and they look nice enough to be worn as dress pants when paired with a nice top. The waistband is really wide, so nothing binds when sitting down. These are a little bit longer than most other brands and that is a huge plus for me because it's hard for me to find pants with that little extra length that I need. Sizing is very accurate for my fit. I have three different colors and the color has held up beautifully, wash after wash.",
					"The best yoga pants I have worn, I am 5’3 with 180 lb kind of a slightly big but, I ordered large and fit me just right. this pants make my tummy flatter without discomfort, they look very nice, I usually don’t go out with yoga pants around but this are nice looking I don’t look underdressed, I bought a second pair for me and another one to my daughter in love who loved them too!",
					"SO GOOD. I just loves these pants. They are so comfortable. The pockets size is a LITTLE small, but the pros definitely outweigh the one con.\nI ordered a few different sizes and even the sizes two sizes too small stretch to fit comfortably and act like control top leggings.\nI'll probably wear these every day of my life. Ordering more now.",
					"These do run long; I am 5'5\" and I need to wear a little heel to keep these off the ground. As such would not work as exercise wear but that is not why I wanted them. I grew up in bell bottoms and these \"take me back\"! I will be able to wear these in colder weather as the material feels warm. These are tight to pull over the hips but are fine once on. I got medium and weigh about 130. People shorter than 5'4\" will need heels to wear these. Also- mine have a pocket on each butt cheek but not a third pocket. EDIT: The third pocket is in the waistband. I found it when I took the pants off after wearing them all day. Will hold something the size of a credit card but not sure I'd put anything in there other than a piece of paper...",
					"Es un pantalón muy cómodo y la tela es bastante gruesa no es como los demás pantalones deportivos. Pedí mediano y me quedo a la medida, lo único malo fué el largo pero yo soy bajita y siempre me quedan así. Este lo compre en oferta y la verdad volvería a comprar otro.",
					"",
					"Excelente pants... y es original.. les recomiendo el producto... aun asi que viene un poco largo vale la penaaaa...... llega rapido... no se arrepentiran de su compraaaa.... adquiri la talla chica y amolda muy bien....",
					"",
					"El pantalón está muy bien, la tela es buena, el color es bonito, es vino, no es rojo. Solo que están demasiado demasiado acampanados.",
					"",
					"I bought a pair last year in red/wine and loved them so bought another pair in black. Too bad they don't come in navy.",
					"Super comfy. Great fit! Great length. Love the flair and pockets in the back. Material in crotch area is already starting to pill. Hope this isn’t a sign for the rest of the pants."
				]
			}
		},
		{
			"id": "S9ImbeY",
			"title": "Dragon Fit Joggers for Women with Pockets,High Waist Workout Yoga Tapered Sweatpants Women's Lounge Pants",
			"price": "$28.98",
			"image": "https://m.media-amazon.com/images/I/51tR6lQidZL._AC_UX342_.jpg",
			"description": "80% Polyamide, 20% Spandex\nImported",
			"reviews": {
				"customerProfileNames": [
					"B.Girard",
					"Karin",
					"Customer",
					"Customer",
					"zy",
					"Amy",
					"L.Tureaud",
					"EricaC",
					"AllieG."
				],
				"customerProfilePictures": [
					"https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif"
				],
				"customerRatings": [
					"3.0 out of 5 stars",
					"5.0 out of 5 stars",
					"5.0 out of 5 stars",
					"5.0 out of 5 stars",
					"5.0 out of 5 stars",
					"5.0 out of 5 stars",
					"3.0 out of 5 stars",
					"5.0 out of 5 stars"
				],
				"customerReviewTitles": [
					"TALL GIRLS READ THIS!",
					"Great material that doesn’t show imperfections",
					"Buy!",
					"Great design and quality",
					"Perfect to dress up or down and so comfy!",
					"May be my most comfortable joggers!",
					"Wanted to love the light colored ones but couldn’t",
					"The best lulu align jogger dupe"
				],
				"customerReviewBodies": [
					"Attention tall people. They are way shorter then they look. They are super soft and comfortable. Other than that they are way too short for someone like me (6ft tall). I checked to make sure I ordered the full length ones and I did. They are about 6-8 inches above my ankle. I would also say that are a little snug. I’m normally a size 4/6 and got a medium. I’m keeping them because I’m lazy, it’s a pandemic and no one will see me in them, and they are very soft and comfortable.",
					"Purchased a small. I’m 5’8 1/2” and 135#. Hips measure 37”. I wear a small to medium in Athleta brand of this helps. Pants are not thin which is nice. Taking them out of the package they looked sooo small at the hips but stretchy material so they actually fit. Look slightly snugger than model and a little shorter. I got the longer style. Ordering the grey next but may try a medium. The only slightly loose area is behind the knee. Otherwise fits more like leggings if this is how you want them. I’d go medium if you want anything looser.\n\nAddendum : wanted to try the grey and blue but only a size large left. Believe it or not they fit too but just looser in the legs like the model. I usually like a 32” inseam and wish these were longer. Hit about 3-4” above the ankle like 7/8 leggings. I’ll have to bring back the scrunchy sock trend of the 80’s if I want to wear these in the winter!\n\nAnother addendum: the largest kept slipping down so gave them to a friend. Ordered a medium in the graffiti and the olive green. Different material than the other black cameo ones. Fit a lot looser in the front area where a pant zipper would be and not as compressive of a material. Don’t expect that different colors will be the same material I guess. The grey large that I had were kind of shiny but not baggy in the zipper area and they were a size bigger!",
					"Just the kind of joggers I’ve been searching for!! They are amazing! Good quality and not too thick or thin. Fits snug on top (not too snug) and little looser going down. The band could have a little for give to it but I’m still pleased with it. I’m 140 lbs. usually a medium and got a medium.",
					"It looks like sweatpants but surprised me with the stretchable material which feels like a yoga legging but thicker. And the most important is it’s a lightweight pant and super comfortable. The pockets are easy to carry phones and keys when going outside.",
					"Awesome and fits so comfortably!! I wear it around or to the office, I will definitely buy more in other colors!",
					"I love these joggers. The feel of the material is smooth, silky, and ultra comfy! I purchased the gray and didn’t know if I should get the small or medium. I ended up getting the medium and I’m glad I did. As far as joggers go they run quite small, they’re baggy around the knees but other than that fit almost like regular leggings. I would’ve liked them to be a bit looser but they are so comfortable I will definitely order another pair in a different color. I’m 5’2 with muscular legs so if you’re smaller on the bottom you may have a more traditional jogger fit, but I don’t think that’s the intention since they are super stretchy. Also, I found the medium length works for me and normally being my legs are shorter most pants would run small, so you may want to consider that if you have really long legs. I’d highly recommend these though, they give me Lulu feel without the price tag!!",
					"I unfortunately do not like the light colors. You can easily “see through” them since they’re lighter color and thin material. I kept the dark color pair though!",
					"T",
					"These are nice. Very comfy. Sorta like lulu but not the same. Especially when it comes to fit. I am a size 6 in lulu and medium in pants these were huge in medium. I am glad I listened to the reviews. I tried a small and a medium just in case and ended up returning the medium. They’re big. I stuck with the small.",
					"The material of the joggers is nice whit some elasticity and not too thin. The fit is perfect and I'm delighted with the look. It is exactly as seen on the picture. I would recommend this product to others.",
					"These pants are so comfortable.I did go up a size but probably could have purchased my normal size.\nThat was not a problem as I still wear them often.",
					"Cheap stitching. A puff in the butt stitching looks stupid. Waste of money.",
					"Too loose around the crouch area, camel toes.. not a fan of that, will be returning"
				]
			}
		},
		{
			"id": "3FJp9mO",
			"title": "Lee Women's Wrinkle Free Relaxed Fit Straight Leg Pant, Black, 12 Long",
			"price": "$29.99",
			"image": "https://m.media-amazon.com/images/I/71qQHk-z-bL._AC_UX385_.jpg",
			"description": "Just like our founder,  H.D. Lee, our passion is helping can-do people do more. We are committed to designing clothing that conforms to your body, allowing you to move through life freely. We help you chase the things that bring you joy and laughter. The things that make you fearless and hopefully because your passion is what makes you unique. And what moves you, moves us. Move your Lee.",
			"reviews": {
				"customerProfileNames": [],
				"customerProfilePictures": [
					"https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif"
				],
				"customerRatings": [],
				"customerReviewTitles": [],
				"customerReviewBodies": [
					"I ordered 1 size smaller than what I normally wear. I am 5\"9 and the length was just right. Will buy again. I needed these for work."
				]
			}
		},
		{
			"id": "QkM83GS",
			"title": "Champion Women's Plus-Size Jersey Pant",
			"price": "$18.00",
			"image": "https://m.media-amazon.com/images/I/710oDaan0cL._AC_UX342_.jpg",
			"description": "The Champion plus-size jersey collection is lightweight and perfect for any activity. Whether you're running errands or hitting the gym, these jersey pants are going to keep you comfortable.",
			"reviews": {
				"customerProfileNames": [
					"KindleCustomer",
					"Jen",
					"A.Graham",
					"JennyJuice",
					"Connie",
					"TFox",
					"smartshopper",
					"TheHodgie"
				],
				"customerProfilePictures": [
					"https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif"
				],
				"customerRatings": [
					"5.0 out of 5 stars",
					"5.0 out of 5 stars",
					"3.0 out of 5 stars",
					"5.0 out of 5 stars",
					"5.0 out of 5 stars",
					"5.0 out of 5 stars",
					"5.0 out of 5 stars",
					"5.0 out of 5 stars"
				],
				"customerReviewTitles": [
					"Too Long!!",
					"Good quality and construction",
					"Not a good fit for me",
					"Great sweats for a great price!",
					"Pleased with product",
					"I can't say enough about these pants. They wash ...",
					"Five Stars",
					"Comfortable"
				],
				"customerReviewBodies": [
					"I'm 5'2 285 lbs and the length of the pants were way to long. I will have to cut about two inches off the bottom just to make them fit. Other then that the cloth is nice and soft and I can move freely in them.",
					"Perfect comfortable fit pant not too thick nor thin drawstring doesn’t slip good construction good quality material good price what more could you ask for",
					"F",
					"These fit perfectly! I ordered my usual size and am very pleased with them.",
					"Good fit5",
					"I can't say enough about these pants. They wash well but I don't dry them because I am over 6 feet. Highly recommend",
					"great",
					"Comfortable and easy.",
					"The pants came fast and are the quality I would expect from Champion. They fit well and though I have not washed them yet the fabric seems of good quality. My only complaint and why I rated it 4 stars is the advertisement here states 98% cotton and 2 % spandex. This is misleading as the pant has no spandex and is 100% cotton. This matters because the spandex helps them keep their shape over time. Only time will tell if they stay in nice shape.",
					"These pants are made of a mid weight cotton. Slightly wider leg fit, which I love. Unlike others, I find that these pants fit true to size and not small. I probably could have sized down, even. My only complaint is that the pants are a bit too high in the rise, so that they come up to the natural waist. I would love it if I could find a decent pair of plus sized pants that were wider legged and lower on the waist. Until i find these (probably in my dreams!) these will be my new go-to casual pants. Fairly well priced too.",
					"The pants are excellent quality. They are mid weight, probably a little heavy for Australian summers but perfect for spring and autumn. They are genuine 100% cotton and wash nicely. They are true to size, but are cut exceptionally wide from the hip to the ankle.",
					"Warm, comfortable, fit to size.",
					"The fit is as expected. The feel of the fabric is soft. I was looking forward to lounge around wearing these, However the fabric seemed to be of poor quality and the pants came out of the first wash with small holes in them. Perhaps i was bad lucky with a bad lot of the fabric. Thanks for the hassle-free return."
				]
			}
		},
		{
			"id": "j1LxaCg",
			"title": "Hanes ComfortSoft EcoSmart Women's Open Bottom Leg Fleece Sweatpants",
			"price": "$9.50",
			"image": "https://m.media-amazon.com/images/I/71g5Ae-KwgL._AC_UX385_.jpg",
			"description": "You'll want to wear these comfortable sweats every chance you get. After all, they come in plush, midweight cotton-blend fleece that’s low-pill, super-soft, and made with up to 5% polyester from recycled plastic bottles.",
			"reviews": {
				"customerProfileNames": [
					"NicoleDavenport",
					"DeniseR.Jackson",
					"GB",
					"T&BColem",
					"Nbacatty",
					"LINDACLAYTON",
					"Tabyrinth",
					"Customer",
					"Customer"
				],
				"customerProfilePictures": [
					"https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif",
					"https://images-na.ssl-images-amazon.com/images/S/amazon-avatars-global/70fda3a7-1ef4-48b5-b531-63356b3e9c7c._CR0,0,375,375_SX48_.jpg",
					"https://images-na.ssl-images-amazon.com/images/S/amazon-avatars-global/ce57254a-6f8e-47ab-ae3d-cac0c8e36c32._CR62,0,375,375_SX48_.jpg"
				],
				"customerRatings": [
					"5.0 out of 5 stars",
					"4.0 out of 5 stars",
					"5.0 out of 5 stars",
					"5.0 out of 5 stars",
					"5.0 out of 5 stars",
					"5.0 out of 5 stars",
					"4.0 out of 5 stars",
					"2.0 out of 5 stars"
				],
				"customerReviewTitles": [
					"Detailed Review",
					"Comfortable without being sloppy.",
					"X-Large Middle Rise Sweatpant - Great Look and Fit",
					"Runs large but excellent sweats!",
					"Great pants",
					"light weight and comfy",
					"How it fits, and how its doesn't.",
					"It's too large."
				],
				"customerReviewBodies": [
					"I am 5'4''. I weigh 155lbs. I wear a size 11/12 - 13/14 in my jeans. I ordered a size medium in these pants. The size chart said that I should order a large, but I read the reviews that said these run big. The reviews are right. Buy a size smaller than recommended on the chart. The medium fits me perfectly. The waist is not too big or small. They are perfect. They are nice and long, but they don't drag the floor. They are extremely soft and comfortable. Wash before wear because of the paint type of smell (I always do this anyways.). These are just a basic sweatpant. Not sexy or form fitting anywhere. These don't fit like the kind you would find at a junior clothing store. If you are looking for something basic and extremely comfortable then these are it. Don't forget to size down.",
					"5'7 female 230 pounds\nI ordered the extra large and these fall just below my ankle, stop just below my ribs, and fit at the crotch without droop.",
					"These pants are really comfortable and have a great fit. I'm 204 lbs and 5'6\" and the length and fit are perfect (I bought X-Large).I carry my weight in my legs and fitting in pants is always an issue, but these fit great right out of the box. I thought I'd miss having pockets and a drawstring but these offer a very smooth, slimming fit. They're a bit warm for sunny SoCal but we are having our share of rain and cooler weather. It's in the 60s today and the light fleece lining is perfect. They are comfy like pajamas but look great and I would not hesitate to go out wearing these, especially since the fleece makes them thick enough to not be see-through. I would definitely buy them again and you can't beat the price.",
					"These pants run large for sure. I’m 5’8, 155 pounds, a booty and then somewhat athletic build, and I wear a large in most skirts, dresses, or pants. Obviously with Sweats you want roomy and comfy but these were gigantic. I had to roll the waist band to get them to stay on. I am keeping the 2 pairs in size large that I bought and will give to my husband and I ordered 3 new pairs in medium and am hoping those fit better. They’re SUPER soft and I can’t wait to get the mediums! Worth the $7.50 per pair!",
					"Weight 144\nHeight 5'6\"\nSize large\nGot a perfect fit not to tight not to baggy\nWash nicely but lots of fizz in washer\nDid not shrink\nPurchased 2 pair\nWould buy again\nGreat for everyday wear sweats",
					"I liked these so much I just ordered 2 more pairs in other colors. I am 5'9\" but I wear a small so it is often difficult for me to get pants that fit. I took a chance with these because it said 31\" long which is a good length for me. These do run large but I don't mind. They are to wear around the house and hanging out. I am in Florida and can't stand anything tight or heavy in this heat. These are great. They are loose and light weight and no tie waists which I love.\nI would recommend.",
					"Maybe it's just me, but it feels like sweats are getting thinner and thinner as the years progress, and this is a good example of \"thinner sweats,\" I remember when the bulk factor for sweats was significant enough to consider what coats and other outerwear you could and couldn't wear with it. With that caveat, not bad. They are thinner than expected, but still can be used in 45 degree morning walks without another layer, as long as you keep moving. The legs were long enough, and the very large was just about the right size for larger hips. But this purchase made me realize WHY some many sweatpants include drawstrings: a good fit at the hips may or may not insure a good fit at the waist. Also, this is another example of what extra large doesn't mean: the length between the crotch and the top of the waist needs to be longer than it is currently. If I wanted that much definition of my groin area, I'd wear skinny jeans, not sweats. They are not as bad as some I've seen, but still, sweats are designed to be loose, not fitted. While I realize that is function of those hips again, still EXTRA LARGE should include extra larger for that area too. 4 stars though because even with those complaints, still wearable, functionable, and useable.",
					"This pants is too...too...too large.\nI usually wear M or L.\nSo I bought S, because of others review.\nBut its still too large for me.\nMaybe someone who wear L or XL can suit this Small pants.",
					"Pero el modelo L es sumamente amplio, considero que deben checar bien la talla que pedirán, si no son mujeres delgadas pero tampoco muy llenas, lo conveniente es la talla M; penosamente tuve que hacer la devolución del mismo a causa que si es demasiado amplio sinceramente. Referente a calidad de tela y acabados, conserva una magnífica relación precio/calidad, con lo que no dudo en recomendarles ampliamente éste modelo. Gracias por leer mi review, espero les sea de utilidad, saludos.",
					"",
					"base mi compra en los comentarios anteriores lo cuales están muy en lo cierto\nla talla viene muy grande, pedí talla chica y me quedo justo, no me quedo nada holgado, pero tampoco tan apretado\ncomo para que se me vaya a bajar cuando me agache , para mi gusto esta bien como me quedo, pero si prefieres la ropa holgada pues entonces considera pedir una talla mas, de largo cuando estoy descalza queda muy poco largo pero con tenis esta justo a la medida, este pants en comparación con el color gris es un poquito mas largo, el gris me quedo justo a la medida estando descalza , también quiero agregar que no es tan grueso es delgado y no estoy muy segura si se transparenta o no\ncomo referencia mido 1:55 y soy talla 9 de pantalón",
					"",
					"The quality is decent for the super cheap price, but the sizing is just weird. The waist band is HUGE and they’re so long!! I am 5ft7 and pretty thin, and the length is actually bordering on too long for me, even though I ordered small (I would normally get a medium in this type of clothing for the length! There is no smaller size than small available, and I know most women are shorter than I am, so I’m not really sure who these pants are meant for? I’m just going to put a dart in the waist because they’re so cheap I want to make them work! But if you don’t know how to sew and you don’t have a 30 inch+ waist they won’t fit you!\n\nWhat’s really weird is the matching sweatshirts are so short!! Almost like crop top length even when j ordered large! It’s all very strange.",
					"I bought these pants in size small/petite. They are lovely and warm, the fabric is nice and colour is really nice.\nUnfortunately, the waistband is almost 34 inches. The pants fit really well apart from this large waistband.\nIf the waistband had been proper size I would have given the pants 5 stars.\nToo bad they don't have a drawstring.",
					"Usualmente soy talla M, compré CH y se ve muy flojo, sobre todo en la parte de atrás (como referencia, tengo 100 cm de cadera) No me molesta porque lo quiero sobre todo para estar en casa y lo que más me interesaba es que fuera calentito y cómodo, cosas que cumple bastante bien.\nEl interior es suavecito.\nLo único que le hace falta son bolsillos.",
					""
				]
			}
		},
		{
			"id": "R8D40RF",
			"title": "adidas Women's Studio Fleece Pants",
			"price": "$13.10",
			"image": "https://m.media-amazon.com/images/I/81ehIQfxt0L._AC_UX342_.jpg",
			"description": "Warmth for the studio and beyond. These women's adidas pants have a fleece build that's cut loose, so your movement stays unrestricted no matter what pose you're doing or what errands you're running. A drawcord on the waist lets you adjust the fit how you like it.",
			"reviews": {
				"customerProfileNames": [
					"Dlegister",
					"Thea",
					"ChrisBurns",
					"Tina",
					"ZgKc",
					"KarenAcuff"
				],
				"customerProfilePictures": [
					"https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif",
					"https://images-na.ssl-images-amazon.com/images/S/amazon-avatars-global/b1e277bd-0c76-46b6-a4f9-e89e088499e3._CR0,0,375,375_SX48_.jpg"
				],
				"customerRatings": [
					"5.0 out of 5 stars",
					"4.0 out of 5 stars",
					"3.0 out of 5 stars",
					"5.0 out of 5 stars",
					"5.0 out of 5 stars",
					"4.0 out of 5 stars"
				],
				"customerReviewTitles": [
					"In love",
					"These joggers are really baggy & insanely comfortable!",
					"I Feel like MC Hammer in these!",
					"Love them",
					"Comfy",
					"Cozy for lounging"
				],
				"customerReviewBodies": [
					"For reference, I’m 5’9” and weigh 169 lbs, and generally wear a size 8 in pants. I ordered the size medium. It is a baggy fit, so in a size medium I still have plenty of room. Being on the taller side, I’m living these because they are long enough for me. The wide band on the bottom of the legs Allie me to either pull them up to ankle length or just full length. The sweats are soft and so comfortable. They are a bit on the thicker side, but I’m still wearing them in 85 degree weather because they are so darn comfortable. Waist band is wide and has a drawstring inside to allow for adjusting the waist. I ordered two pair in different colors, and definitely am ordering the other two colors.",
					"I purchased a size M just to be safe bc I’m in the gaining period unfortunately. I didn’t know how baggy these joggers were and I’m practically swimming in it, but I fricking love it so much!!! I’m not really a fan of the straight pleat/crease in the middle of the pant legs, but I just love how cozy & spacious it is! I’m pretty sure I could trade these for a small and it’d probably fit “better”(?), however, I’m totally happy w the oversized joggers so I’ll keep these!",
					"These are huge! I wear a medium and I am swimming in them, Way too big!",
					"So comfortable I would buy more colors if my size",
					"Comfortable and baggy!",
					"V"
				]
			}
		},
		{
			"id": "c8cwNi9",
			"title": "Gloria Vanderbilt Women's Anita Straight Leg Pant",
			"price": "$18.29",
			"image": "https://m.media-amazon.com/images/I/71lrO244aKL._AC_UX342_.jpg",
			"description": "The # 1 selling women's jean in America with over 60 million sold nationwide the Amanda classic jean. Tapered leg five pocket denim jean, that is contoured through hip and thigh and hits at natural waist line, for that comfort fit you've come to love. Effortlessly fun and stylish. A versatile yet classic look that attracts and connects with the modern sensibility of consumers of all ages. Available in various detailing like floral embroidery, prints, destruction, studs, stones, etc.",
			"reviews": {
				"customerProfileNames": [
					"Dreamfisher",
					"StellaB.",
					"JenniferRLukacs",
					"Zoe",
					"MichellaB",
					"Precious",
					"Emily",
					"A.Malone"
				],
				"customerProfilePictures": [
					"https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif"
				],
				"customerRatings": [
					"5.0 out of 5 stars",
					"3.0 out of 5 stars",
					"5.0 out of 5 stars",
					"5.0 out of 5 stars",
					"5.0 out of 5 stars",
					"5.0 out of 5 stars",
					"5.0 out of 5 stars",
					"5.0 out of 5 stars"
				],
				"customerReviewTitles": [
					"Flattering and Comfortable",
					"A very good fit. The fabric seems nice until you wash ...",
					"Perfect work pants.",
					"ideal pant",
					"Perfect fit",
					"I will be buying again!",
					"Pockets for days!",
					"Pants shrank slightly after washing"
				],
				"customerReviewBodies": [
					"As I age, my weight has been shifting around, mostly to the hip and tummy area. Even though I'm a grandma, I refuse to settle for \"granny\" style pants. After much searching, I came across these, and I must say, they are just Perfect. The color is true khaki, there is just enough spandex in the cotton to give, and recover, especially around my midsection,! I hemmed them to compliment low slip on shoes. The leg falls straight and measures 16\" at the bottom, which adds to the slimming effect. I liked these so much that I also ordered a pair of the Anita style in black. A side note, they do come out of the dryer slightly rumpled, so may need a touch up with iron if you wish. Great transition pant for spring and fall.",
					"A very good fit. The fabric seems nice until you wash it. Every bit of lint or dog hair within a mile will stick to the pants. My black pants are a pain as I have to wash separately, dry alone and still have to go over them with a clothes brush to make them look clean. This fabric attracts everything but men and money/",
					"These pants are great! I work in an engineering office so they go well with most of my tops.\nI purchased a tan pair first and then a black pair. They are everything I want in work pants. They aren't' to long or short, fit the hips really well, and aren't to tight or loose. After washing and wearing for a good year they have held up like the day I got them. They have a soft feel to the outside almost like a high quality sateen flannel, but wear like expensive brands. I sit Indian style at work and tend to be hard on pants with wiping my hands on them after snacking. No grease marks, splits anywhere, or wear spots. The button hasn't come loose which to me is important.\nOnly negative thing, the black pair seem to collect fuzzes while the tan pair didn't.",
					"if you are looking for a work pant, whether you work in an office or wait tables, look no further. these pants fit great, look great, and do not fade after washing many times. I am 5'7\", 150 pounds more athletic build and a 6 fits me great. I also wear a 6 in american eagle Jeans for comparison.",
					"I have a longer torso, and average length of legs. I’m curvy too so my thighs and calves feel too tight in pants and my butt often has no room. When I go up a size the waist is often too big and my butt fits in the pants.\n\nThese pants are perfect. I like that they aren’t too tight to hurt or rub; I can sit cross legged in them if I want and the material is soft. They aren’t so loose that I look like a potato either. No back pockets but the two front pockets are a nice depth and not that ridiculous angle cut where all of your things fall out of your pocket.\nI bought another pair because I like them so much. They seem to be of good quality; fabric and stitching feel sturdy. And they are breathable enough that I should be able to be in and out of the office this summer with no problems",
					"I really like these, the fit is really nice! And it doesn't gap at the waist (it's nice to know some pants are made for people who have big hips but small waists). The only thing I'd keep in mind when reordering (cause I will buy again) is that even though I'm 5'6\", the regular one was too long on me. I am good at alterations so I can hem it.",
					"T",
					"These are very nice looking pants and the fabric is especially soft and comfortable. I had ordered a size 12, but it shrank after washing. The size 14 is perfect. I am 5'7' and I ordered the short length so I didn't have to hem them.",
					"These are really nice pants with a great straight-leg cut if that’s what you’re after. Fits a bit large though. I ordered a 6 short. I’m 5’2” and about 120 lbs. they’re a little big in the waist even though I’m a little big through the waist (28”) also about 1 & 1/2” too long, but I have short legs and have to hem or roll most of my pants. I like them enough to keep them. Probably going to order the same pant in other colours, but size it down if a 4 is available.\nMight want to size down.",
					"These are great khaki pants for work. I was looking for chinos for comfort and versatility and these are really nice. After reading other reviews I went up a size but I didn't need to and I will order my regular size next time. I would have given 5 stars but the back pockets are just for show. I will get another pair in a different colour next time.",
					"I purchased these for use as work pants. They fit well, are VERY comfortable and seem durable, having held up well with almost daily washing (but they are starting to show wear, unsurprisingly). The main issue I have with them and why I deducted a star is that the black ones are lint/hair magnets, especially at first. I had to change into them right before I walked out the door because I have animals. They are better now but have started to fade as cotton does. Other then that I am quite happy with what I received in respect to the price point: a pair of cheap pants that fit great, are comfortable and look good. I am going to purchase more pairs for work soon (to alternate, not replace) and am thinking of getting different colours for personal.",
					"La calidad corresponde al precio, sin embargo las costuras no son resistentes. En la primera puesta se descosieron. La tela atrae pelusas. La talla está bien, el diseño también",
					"",
					"I started out with buying one pair for work and ended up liking them so much I bought two more. They’re very comfortable and I really like the fit. It’s hard to find pants that sit on my waist the way I want (almost aways they’re too low) and these are exactly what I’ve been looking for. I wash them on the gentle cycle and I think this has helped them to stay in good shape."
				]
			}
		},
		{
			"id": "ip6faxi",
			"title": "Bamans Dress Pants for Women Business Casual Stretch Skinny Work Pants with Pockets",
			"price": "$33.99",
			"image": "https://m.media-amazon.com/images/I/51cjZKakyUL._AC_UY445_.jpg",
			"description": "87% Polyester, 13% Spandex\nImported\nZipper closure\nMachine Wash\nWomens Stretch Slim Fit Ankle Office Casual Dress Pants Trousers for work.\nFeatures: Solid Black, Mid waist. Zipper fly with button closure, Belt loops, Front slant pockets, Decorative rear welt pockets.\nOccasions: A great choose for Work, Business, Office, Home, Celebrations, Dates, Cocktail night out and any occasions you want it for.\nShow more",
			"reviews": {
				"customerProfileNames": [
					"KristenE",
					"Customer",
					"HollieH.",
					"Sara",
					"JillWeikart",
					"Susan",
					"MelvysPortillo",
					"V.Ramirez"
				],
				"customerProfilePictures": [
					"https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif"
				],
				"customerRatings": [
					"5.0 out of 5 stars",
					"5.0 out of 5 stars",
					"5.0 out of 5 stars",
					"5.0 out of 5 stars",
					"5.0 out of 5 stars",
					"5.0 out of 5 stars",
					"5.0 out of 5 stars",
					"3.0 out of 5 stars"
				],
				"customerReviewTitles": [
					"Super comfortable, great pockets, lovely fabric, very stretchy",
					"Great first impression",
					"My new favorite work pants!",
					"Love them",
					"Looks better on than expected!",
					"I was so happy when these arrived",
					"Great!",
					"Great - but try them on ASAP to make sure they fit"
				],
				"customerReviewBodies": [
					"I love the fabric! The pockets are awesome. Stretchy and very comfortable. I felt it ran bigger in the waist than I usually expect from a medium. But they were so comfortable everywhere else I kept them. I wear a belt with my work outfit anyways. Plus I didn’t want to run the risk a small would be too small. I knew these pants weren’t going to go as long as I wanted, as I’m 5’11”, but I’m actually totally ok with the length they came to. Finding pants like this with longer lengths has been a challenge. I’m very happy with these pants!",
					"I haven't washed or worn these yet but first impression after trying them on is favorable. They are super comfortable and flattering. I'm 5'10 190lbs with slender legs and the XL fit perfectly. I usually wear a L in leggings but saw reviews about the waist being a tad tight which is true. The legs are a tad short on me, but I have slightly long legs. They totally look like work pants but are comfy like leggings!",
					"I was shocked these fit and looked as good as they did. I roll them every once in a while for a more casual/cooler look with flats. These were very flattering an I plan on purchasing more in other colors if available.",
					"I have a flat butt and it is always hard for me to find skinny pants for work without having them tailored. These fit like leggings but are professional enough to wear to the office. I wear them 2-3 times a week.",
					"These fit better than I expected! Right out of package, I thought they would go back. Put them on and they are very flattering on! Fabric has good stretch and thick enough holds everything in! Love there are real front pockets too!",
					"I wasn't sure what to expect when I ordered these, but I was so pleasantly surprised when they arrived. They are comfortable, look GREAT and seem to be constructed well. I love how they transition perfectly from casual wear to the office. They are snug, but not so tight you can't wear them in a semi-professional arena. Love them and will consider buying other garments from this same manufacture.",
					"It fits perfectly, everything in place, really comfortable",
					"OK. So I bought a pair at the beginning of this winter because walking with my doggo can be get cold. And this pair was great! It fit great, comfy, warm, shielded me from the elements. So I put a pair on my Christmas list - same pair, same size. Or so I thought.\n\nThe second pair came in, and it was a size too small. I’m adding some photos here so that you can see how exactly alike they look - but there was little to no stretch, really right. Still warm and protected me from the elements, but top to bottom I felt like it was a thick polyester and someone forgot to add the spandex part in the fabric mix. Of course by the time I realized this, I was way outside the window for returns 😔\n\nSo make sure to try these as soon as you receive them - they may all look alike, smell alike, even talk alike - but they’ll fit completely differently."
				]
			}
		},
		{
			"id": "fU-LQ1p",
			"title": "Amazon Essentials Women's Poplin Sleep Pant",
			"price": "$6.96",
			"image": "https://m.media-amazon.com/images/I/81clx77jr5L._AC_UX342_.jpg",
			"description": "We listen to customer feedback and fine-tune every detail to ensure our clothes are more comfortable, higher quality, and longer lasting—at affordable prices for the whole family.",
			"reviews": {
				"customerProfileNames": [
					"RuthorDare",
					"ReviewToaKill",
					"Krimpet",
					"OKBlondlady",
					"Cj",
					"Gabby4"
				],
				"customerProfilePictures": [
					"https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif",
					"https://images-na.ssl-images-amazon.com/images/S/amazon-avatars-global/bd2f1640-bba6-43e8-9586-d04ab7c9e103._CR0,0,381,381_SX48_.jpg",
					"https://images-na.ssl-images-amazon.com/images/S/amazon-avatars-global/969ea378-17f7-460e-9e9c-10afc715973a._CR53,0,393,393_SX48_.jpg"
				],
				"customerRatings": [
					"5.0 out of 5 stars",
					"3.0 out of 5 stars",
					"4.0 out of 5 stars",
					"5.0 out of 5 stars",
					"5.0 out of 5 stars",
					"5.0 out of 5 stars"
				],
				"customerReviewTitles": [
					"Nice enough to wear out of the house!",
					"I Shrink Therefore I Am",
					"Fabric is fading, I hope they last",
					"Great cotton poplin pj pants",
					"Awesome pants!",
					"Like Old Navy"
				],
				"customerReviewBodies": [
					"E",
					"I so loved these PJ bottoms. I wore them straight out of the package and the comfort and roominess were great. Living in a hot state, I am always looking for good, lightweight cotton poplin-type bottoms. We just roast here in the summer in anything else. The colors are cute and of the standard PJ-palette. I was smitten.\nThen they fell off the top of my “must review now” list. Then I washed them.\nThey shrunk. A lot. They shrunk to the point where if I’m lounging and want to sit cross-legged, the crotch seam pulls. They shrunk to the point where the drawstring that was previously very necessary and useful is now more of an embellishment.\nThey’re great bottoms, but y’all need to size up! Don’t be dismayed if they swallow you at first. Wash them and you’ll be fine.",
					"I",
					"These are absolutely wonderful!! As far as those saying they shrink, I'm not sure how they're washing them; I washed them n warm/dryed on low & they came out perfect! no wrinkles, no shrinking. In fact I was counting on shrinkage because they were a little large. Im a size 6 ordered a medium, really should have gotten a small but they're pj's so ok if somewhat baggy. They are poplin, w a small amt of stretch. THAT MEANS they are NOT knit. Cotton poplin is a crisp linen type finish, great for the hot weather, & if you personally do not like clingy pjs. If u are looking for poplin pj's pants these are the bomb!! of course there r no pockets u guys, its in the definition if u would read. Pockets would b great, I agree but for $14 we all have to b realistic, they're very economical, well made & comfortable. They do need to b washed several times to remove the sizing otherwise the scratchiness u feel is the SIZING not the actual fabric. Keep u expectations realistic & u will LOVE these! I just ordered 2 more pairs. They do run a tad large, I would order ur normal size if u plan to wash them correctly. If u insist on washing/drying on hot u may have some shrinkage and need to order a size up.",
					"T",
					"T",
					"These are well-made pj trousers with a nice brushed feel. The fabric is thick enough to feel like they won't fall apart anytime soon, but thin enough for summer. The legs are long enough to keep your ankles warm but don't drag on the ground. Overall, very comfy and good quality. On sizing, I'm basically a size 13 - 12 is a bit tight and 14 is too big - but the M-L size fits perfectly.",
					"Lovely fabric, good cut and wash well.\nThe negative reviews put me off initially but I'm so pleased that I went ahead and bought these lovely pyjama trousers. Good quality cotton fabric is hard to find at such reasonable prices so I was delighted to find them. Sweet dreams!",
					"The only thing wrong with these pyjamas for me was that the legs were too long, easily remedied, took the hems up. I'm only small anyway so most things are too long! They are very comfortable cool cotton and I'm very pleased with them.",
					"Was looking for comfort and good quality cotton, and that is what these are. Elastic waist with a drawstring is nice.\nHappily recommend these.",
					"These are good value for the price. The fit is as expected, however the length was too much - had to hem them. They wash well, did not shrink or change colour - overall happy with the purchase"
				]
			}
		},
		{
			"id": "S4Qsi4y",
			"title": "Acelitt Womens Casual Pants Capris Drawstring Elastic Waist Comfy Trousers with Pockets",
			"price": "$28.99",
			"image": "https://m.media-amazon.com/images/I/511MJAVmHbS._AC_UY445_.jpg",
			"description": "100% Polyester\n进口\nDrawstring closure\nMachine Wash\nThese lightweight linen pants are a must-have pick for laid-back looks\nPull-on skinny pants with elastic waistband elastic waist, high waist, solid color design, adjustable drawstring waistband for added comfort.\nOccasions: casual wear, home wear, going out, vacation or beach wear.You can wear it in any season for different use.\nShow more",
			"reviews": {
				"customerProfileNames": [
					"SallyD.Prosser",
					"KimJacobson",
					"Customer",
					"L.Mata",
					"DianaL.Middleton",
					"kristin",
					"Pamela",
					"Joe&DoloWhite"
				],
				"customerProfilePictures": [
					"https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif"
				],
				"customerRatings": [
					"5.0 out of 5 stars",
					"5.0 out of 5 stars",
					"5.0 out of 5 stars",
					"4.0 out of 5 stars",
					"5.0 out of 5 stars",
					"5.0 out of 5 stars",
					"5.0 out of 5 stars",
					"5.0 out of 5 stars"
				],
				"customerReviewTitles": [
					"Buy these pants!",
					"Perfect pants for hot summer!",
					"GREAT BUY",
					"Drawstring Elastic Waist Comfy Trousers",
					"These are my new comfy pants.",
					"So comfy",
					"Very loose and lightweight for hot summer days!",
					"Arizona Casual"
				],
				"customerReviewBodies": [
					"These have become my new favorite casual pants. My office is a casual environment and these are soooo comfy! Great value for the price and I plan to buy more in additional colors. Highly recommend!",
					"I bought a medium returned for a small. I usually wear a size 8 in pants.\nThey are loose without feeling baggy. Great for hot humid summer.",
					"THEY FIT LIGHTWEIGHT I FIRST ORDERED 2 PAIR, LIKED THEM SO WELL ORDERED 3 MORE",
					"I got the aforementioned trouser thinking they would be more linen-like, which is what I was searching for. This style, however, has a more silky feel to them and I have decided to keep them as I think they will be perfect summer wear. I am 5'7\" and usually wear 14 pant. I got these in the XL and they fit just fine. They have a high waist and do not pull in the stride.",
					"I was extremely pleased how comfortable these are. They even look good on. Bought them in three different colors.",
					"These pants are so comfy. They are slightly short for my preference, but you can't beat how they feel on. They are like linen pants, but they aren't linen. Don't expect super soft like pajama bottoms, yet that's exactly what they remind me of.... wearing comfy pajamas out of the house!",
					"I ordered a medium but found they are a bit too large--good in the waist and not too tight, but a bit long and large in the legs because the small was not available at the time. I did not receive these when delivered because they were left near a neighbor's property in error and were discovered a week later. I plan to wear these around the house in the mornings, especially, but they are too nice to wear outside for hard and dirty yard work. In case someone comes to the door, I will be able to throw these on quickly rather than arrive there in my pajamas, another reason why I purchased these.",
					"They are exactly what I was looking for, casual lightweight pants. I wanted loose fitting so I ordered an X-LARGE (normally wear a size14). The color states orange but they are more of a rust color. Ended up ordering a green pair too."
				]
			}
		},
		{
			"id": "I8gaXlu",
			"title": "MARMOT Women's Precip Waterproof Rain Jacket",
			"price": "$47.99",
			"image": "https://m.media-amazon.com/images/I/81o7EK3tssL._AC_UY445_.jpg",
			"description": "The PreCip Jacket is reliable, value-oriented, full-function rainwear for backcountry and urban travelers alike.",
			"reviews": {
				"customerProfileNames": [
					"Pat",
					"Smile",
					"Jack",
					"SuzyJackson",
					"JenniferWarren",
					"Narcoosseegal",
					"LC",
					"RebeccaWanagel"
				],
				"customerProfilePictures": [
					"https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif"
				],
				"customerRatings": [
					"5.0 out of 5 stars",
					"5.0 out of 5 stars",
					"4.0 out of 5 stars",
					"5.0 out of 5 stars",
					"5.0 out of 5 stars",
					"5.0 out of 5 stars",
					"5.0 out of 5 stars",
					"3.0 out of 5 stars"
				],
				"customerReviewTitles": [
					"This One's A Winner!",
					"Fitted waterproof rain jacket",
					"Seems to work better for lighter precipitation",
					"Great jacket",
					"Absolute favorite jacket, my most recent pre-cup lasted 5 years!",
					"High quality and comfort",
					"Works well",
					"Great pants except for velcro closures"
				],
				"customerReviewBodies": [
					"This was the winner of the 7 brands/styles of waterproof rain jackets I tried. (Others were the North Face Resolve 2, Resolve Plus & Ventura; Black Diamond Stormline; Columbia Arcadia II (solid & print, which were slightly different), & Patagonia TorrentShell.) The Marmot Pre-Cip's adjustable hood stows in the collar when not in use (a big plus), & the 2-part collar & hood are both more open feeling, yet also provide more coverage, than 1-piece versions do. This jacket is extremely light, & packs down small in it's own pocket, which is great for travel. In part this is b/c it lacks the mesh lining some other jackets have. But it doesn't need it, b/c it doesn't stick to your skin or feel clammy when the temp rises ~ it's waterproof, but also really breathable. This is one of the few (along with the Patagonia TorrentShell) that had sleeves the right (average) length. (North Face, Black Diamond & Columbia all ran long.) The sleeves are also easily adjustable with velcro tabs. The overall fit is flattering, but accommodates a sweater or down vest if it gets chilly. (I'm 5'5\", 118 lbs, & the small fit great. The medium also worked, & could even fit over my Patagonia NanoAir jacket. But since I'll wear it more often in the spring/summer/fall, & the MED sleeves were a little long on me, I opted for the small.) This jacket also comes in a nice range of colors, for those who want to brighten up a rainy day.",
					"This jacket was so much better than I expected, and I had high expectations. I wanted a packable, waterproof/breathable jacket that complemented my shape. The color is beautiful (Arctic Navy). I expected it to be cold since it does not have a fleece lining, however I wanted a jacket that I could use for travel and year round since I live in New England. I figured it was better to get a jacket that I could put a fleece under. This jacket kept me warm even without a fleece on a 40 degree day. I love the velcro sleeves and zippered collar to hide the hood when it is not being used. I am pear shaped, 5’5” and 139 lbs and chose a size medium, and it fits nicely. My recommendation is to size up if you are hippy since that is where it runs smaller. When I am not using it, I can fold it up into one of the interior pockets for use when I travel. I would definitely recommend this jacket.",
					"Worked well for running in the snow with multiple layers.\nDidn't hold up to prolonged exposure to continuous rain; it ended up soaking through after maybe an hour or so. Seems to work better for lighter precipitation.",
					"Tested this out recently on a backpacking trip that was pretty much all rain and this jacket handle perfectly. It was cold and rainy. It kept me warm and dry. Love the zipper pockets and hood that rolls up into the back if not needed. I went with a size larger to make sure what I was wearing under it would still have room to move my arms. I'm 5'8\" and 145 lbs, and the large was perfect when having a l/s shirt and sweatshirt on under it.",
					"I ordered a Small, it fits perfectly for my 5’4, 135 lbs frame. I have enough room for my down jacket or vest underneath. Pre-cip is my favorite rain jacket, my previous one lasted 5 years. It’s also the only rain jacket I’ve found that has adjustable hood, adjustable cuffs, AND is adjustable on the bottom of the jacket. So not only is it 100% waterproof, but the other adjustments allow to keep the heat in, as well as unzipping the armpits to get the heat out. I used my previous jacket in torrential rain/hurricane weather, wore it during snow/ice storms, wore it traveling abroad, and wore it for all the rain back home. I wore the heck out of it, it was worth every last penny!",
					"Top quality and style. This coat has waterproof ability along with breathe-abilty. The cut is flattering and the length is perfect to cover low back and waist. Hood, zippers, vents, drawstrings work as promised. Very light weight and folds small for travel. Sizing is small so consider next size up if you plan to wear a sweater underneath. My shirt size is 8-10 and I purchased a LARGE to fit my shoulders. Buy it. This coat will last many years.",
					"I'm 5'6\" 130lbs and got a medium. The medium is definitely loose on me but I wanted something that I could layer with a puffy jacket and this works perfectly. I went out in a Louisiana rainstorm for a couple of hours in this jacket and got a little bit damp but that may just have been the humidity. The only gripe I have is that the pockets are only mesh on the inside so they don't have any structure and my keys will catch on the mesh. For reference my measurements are 30 waist 37 bust and 39 hip.",
					"I am an extremely active volunteer trail crew leader in the Olympic Mountains, where it does actually rain a lot. Rain pants are critical for my trail work and backpacking. These are perfect in every possible way (fit, genuinely waterproof, etc). The one problem, which is a big one, is the way they are designed to stay closed, since they are full zip. Full zip is great - it allows me to put the pants on and off without having to remove my boots every time. This is the second time I've owned these pants (I literally wore the other ones out, which is hard to do) and I've had the same problem with the velcro closures both times. They simply don't hold well. Yes, I bought these a second time after I wore my first pair out, but I guess I was feeling optimistic that maybe I just wore the velcro out too and couldn't remember if they ever held well. They don't. If Marmot would fix those velcro closures to something more reliable, I would easily give these rain pants a 5 star. Meanwhile, I will now use these but I tend to use them with suspenders due to the weakness of the velcro closures.",
					"My brother bought me the black version of this for my Christmas last year. I liked it so much that I wanted another but in a different colour. Since I live mostly in black and blue (and that doesn't refer to bruises), I went for Arctic Navy. I have worn it once and a friend remarked that she was glad to see me in a 'bit of colour'.",
					"I really like these jackets. I bought two. One for me, and one for my girlfriend. Both male and female fits are good.\nOnly thing to remember is that one really needs the trouser to go with it if out in the rain. Otherwise the water just runs off it and makes your legs wet. But that is just an observation.\nFolds up into a small size for putting in backpack for travel.",
					"Bought to replace my old precip jacket that finally bit the dust after several years of keeping me totally dry and comfortable. Best lightweight waterproof jacket I have ever owned and I have had many over the years!",
					"Folds up properly small, has zips under arm pits for ventilation, decent sized pockets on either size,.fits over my down jacket and has a good sized hood for the rain! Perfect, good investment and comfortable",
					"So far, so great! Not as glamorous as some ladies jackets but certainly great at doing what it should- being very waterproof and also allows space for a thick jumper if necessary. It has already been brilliant on a number of walks and I have actually found that it breathes better than I was expecting. I'd definitely recommend it."
				]
			}
		},
		{
			"id": "1Extw2M",
			"title": "Mtsebmves Women Casual Wide Leg Palazzo Lounge Pants Elastic High Waist Wide Leg Yoga Trousers with Pockets",
			"price": "$16.98",
			"image": "https://m.media-amazon.com/images/I/61IxH8a5OtL._AC_UX385_.jpg",
			"description": "The wide leg palazzo long pants is made of high quality cotton and linen material, breathable and skin-friendly, comfortable to wear. Suitable for shopping, vacation, dating, travel, daily home life, etc. \n\nSpecifications\n\nMaterial: Cotton Linen\n\nGender: Women/Girls\n\nPattern Design: Solid Color\n\nStyle: Fashion, Simple\n\nSuitable Age: Adults\n\nSize: S, M, L, XL, XXL\n\nNote:\n\n1. All dimensions are measured by hand, there may be 2-3 cm deviations; \n\n2. Due to the difference between different monitors, the picture may not reflect the actual color of the item. Thank you!\n\nPackage Contents\n\n1 x Ladies Long Pants\n\nPromise:\n\nIf the product has any quality problems, please feel free to contact us, we will help you solve the problem as quickly as possible.",
			"reviews": {
				"customerProfileNames": [
					"catspurrfrench",
					"SamanthaThomas",
					"M.Stochl",
					"Julz",
					"Debra",
					"JaymieS.",
					"BettyK.",
					"MelissaThaxton"
				],
				"customerProfilePictures": [
					"https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif"
				],
				"customerRatings": [
					"5.0 out of 5 stars",
					"1.0 out of 5 stars",
					"5.0 out of 5 stars",
					"4.0 out of 5 stars",
					"3.0 out of 5 stars",
					"3.0 out of 5 stars",
					"5.0 out of 5 stars",
					"5.0 out of 5 stars"
				],
				"customerReviewTitles": [
					"Comfortable",
					"Quality",
					"US sizing!",
					"Not a light fabric. Good for Winter or early spring.",
					"Pockets too big, they bulge out at the upper thigh",
					"No down buy unless u are size 0 to 3",
					"Very cute.",
					"Go to black pants"
				],
				"customerReviewBodies": [
					"One of the coolest and most comfortable pairs of pants I've owned. Be sure to go by the size chart and not what you \"think\" you wear. The pants are cool this summer because they are made of linen and cotton, but that also makes them wrinkle easily. I don't mind the wrinkles, but if wrinkles bother you don't buy these. I'm 5'0\" so all pants are long on me unless I order a petite. These looked so appealing that I ordered them anyway. Since the elastic waist band is 3\", I can pull them up to make them shorter and they are still comfortable. I've just ordered a pair in another color!",
					"T",
					"These are awesome pants! Nice and flowy . Washed on delicate cold and dried on low, they are perfect. Will be ordering more!",
					"Material is very hot.",
					"Waist band too short and pocket width is too wide. Just a weird fit",
					"Junk clothes .. could be cute on skinnier people..",
					"Will order more and I'm an XL!",
					"These are my go to little black pants. You can dress them up or down. They are very comfortable, and lightweight."
				]
			}
		}
	]
}
