{
	"womensShirts": [
		{
			"id": "4hlyYgN",
			"title": "Amazon Essentials Women's Classic-Fit Long-Sleeve Button-Down Poplin Shirt",
			"price": "$21.80",
			"image": "https://m.media-amazon.com/images/I/81gKY1EhQGL._AC_UX342_.jpg",
			"description": "Amazon Essentials is focused on creating affordable, high-quality, and long-lasting everyday clothing you can rely on. Our line of women's apparel includes cashmere sweaters, fleece and down jackets, and more, including plus-size options. Our consistent sizing takes the guesswork out of shopping, and each piece is put to the test to maintain the highest standards in quality and comfort.",
			"reviews": {
				"customerProfileNames": [
					"HederaFemme",
					"ReviewerX",
					"TTR79",
					"IzzyandFinn",
					"Nyx",
					"LaurenFuquay",
					"HeidiS",
					"Claude"
				],
				"customerProfilePictures": [
					"https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif",
					"https://images-na.ssl-images-amazon.com/images/S/amazon-avatars-global/51227950-ac57-4ade-90e3-baeb2157489b._CR62,0,375,375_SX48_.jpg",
					"https://images-na.ssl-images-amazon.com/images/S/amazon-avatars-global/2345077d-8593-4ec6-adb2-d776e38a39c3._CR26,0,447,447_SX48_.jpg",
					"https://images-na.ssl-images-amazon.com/images/S/amazon-avatars-global/e9bfc5f9-0de0-4f88-bc32-b3a22e0b4cb7._CR0,0,363,363_SX48_.jpg"
				],
				"customerRatings": [
					"5.0 out of 5 stars",
					"4.0 out of 5 stars",
					"5.0 out of 5 stars",
					"5.0 out of 5 stars",
					"3.0 out of 5 stars",
					"5.0 out of 5 stars",
					"5.0 out of 5 stars",
					"5.0 out of 5 stars"
				],
				"customerReviewTitles": [
					"“boyfriend”/androgynous fit, excellent value",
					"A very decent \"Basic\"",
					"Good buy!",
					"Ordering more!",
					"Fit isn't for everyone",
					"@xosimplylo for more Amazon fashion",
					"Great shirt, Great price!",
					"So comfy, soft"
				],
				"customerReviewBodies": [
					"I love clothing cut to look kind of gender neutral, so these shirts are perfect for me. They have a somewhat androgynous fit, with a more or less straight cut from armpit to hip. I have a few slim fit men’s shirts because that’s my look, but these are far better, since they are made to fit a figure with hips (which means it fits all the way down without buttons straining to the bottom of the shirt). Bonus: great price.\n\nSo if you are looking for a straight fit (as opposed to tailored or princess seamed, which is made to create an hourglass), this is a great shirt with lots of fabric options. See pics for a few I got!",
					"I wear a lot of button-downs, mostly as over-shirts with cami's and tanks.\nThis one meets my expectations.\n\nThe fabric is a little thin, but not see-through by any means. I would consider it summer-weight.\nWrinkles sort of easily while worn, so this might be more suited for casual wear. Comes out of the dryer not needing to be ironed, if you remove it promptly. I launder on warm and dry on lukewarm and have noticed no shrinkage.\nStitching is top-notch - no flubbed seams or errant threads.\n\nI am 5'7\" and 175, very full B cup, waist is 37\" and hips are 45\" - I typically wear a L-XL top, in major US brands. I ordered this in the XL and the fit is pretty good. I have \"beefy\" arms, and this shirt is NOT too tight in the arm for me - I have plenty of arm room.\n\nManufactured in Bangladesh.\n\nGratefully received through the 🌿Vine Program🌿 for my *honest and unbiased* review.\nIf my opinion changes, I will be sure to update this review.",
					"Really nice reasonably thick good quality and pretty! Totally love these shirts. This is my second one in a different color/pattern. They need a light ironing after wash but really nice business casual and will probably get more.",
					"Presently surprised. This shirt sits perfectly. I have a hard time finding button up shirts. I wear a large but after reading the reviews I ordered a size down. I’m 36D and no gap.",
					"This shirt has an extremely baggy cut to it, and is also fairly thin in terms of material. I saw another review call it a \"boyfriend cut\". I'm 5'8 and about 120, and it's baggier than a lot of the standard cut men's Goodthread shirts. I know I didn't order the wrong size though because it fits just fine in the shoulders. I like the aqua striped pattern, it's a cute shirt overall but the fit/cut just isn't great for my body, so I'm probably gonna return it, since the slim fit men's Goodthreads in XS are so much better on me. It's probably a better shirt if you're plus sized or wider than you are tall, and I like the pocket and pattern. I wish there was just a little more of a women's shape or brought in on the waist.\n\nIt does wrinkle easily but I don't really mind, it's kinda cute. You could easily starch this to prevent that if you wanted.",
					"I love this top!\nIt's hard to find a button down that isn't thin and cheaply made, at an affordable price.\n\nThis one hits the mark. Great quality. Holds its structure and isnt thin.\n\nI'm 5'2 135lbs and wearing a medium",
					"I liked this shirt so much that I ordered another, one pink stripe, one blue stripe. I plan to wear it with my Levis and white chino shorts. I was on the fence between a SMALL and MED and ended up ordering SMALL. Glad that I did. Fits perfectly. I’m 5’6”, 150 lbs. 34C, 32 rib cage, 28 waist, 40 hips. I’ve got room under the arms. A Med would have been too big under the arms I’m sure. I am able to button all the way down, even around my ample behind but not too baggy around the waist and back! Feels nice, lightweight and crisp, cool enough for our 100+ days in Arizona right now.",
					"I love this shirt! Wore today for the first time. It is so soft and comfy. I'm a pear shape figured woman so I always buy large shirts. I'm 5'9\", 150#. Fit is good, not too bulky to tuck into my pants. Length was as described. I'm going to order more of these in other colors. I haven't washed it yet. If it's too wrinkly and I have to iron it...well...that won't do. 😜 But I'll get back on here and update if I need to. Otherwise I give the black/white gingham shirt 5 stars!\nUpdate: 2020, I just ordered the black in medium and am so happy! These wash up beautifully. I recommend popping them in the dryer alone for 2 minutes to begin drying then hang to release the wrinkles. They dry QUICKLY! LOVE THIS SHIRT. I'll be ordering more colors.",
					"Really good quality shirt. Did not lose shape, nor shrink after machine wash. Easy to iron. I wear it at work with jeans; received many compliments. I am a size 14 and the size Large fit me really well. I like it so much that I got a second one in a different pattern.",
					"Disappointed with this blouse.Parcel arrived intact but the blouse itself had been stuffed into a plastic bag and not folded as it should have been, so it was just a crumpled mess. It was clear to see that it had previously been folded round card to make it presentable. I can only assume someone has returned this blouse at some point and it has been sent out to me in the state it was returned, a crumpled mess. Very poor customer service. The sleeves were a good length and roomy for a comfortable fit. However the front buttons barely fastened. Overall a poor fit.",
					"I know the buttons are small on these shirts but the buttonholes are miniscule and it is really difficult to undo the buttons without breaking fingernails. That is the only fault with them - but it is enough that I won't buy more than the three I got this time",
					"I'm size 14uk & having read other reviews I bought the large size and fits perfectly. I couldn't make one for myself for this price! It's well made & checks all line up. button holes are a little tight but for this price its a fantastic quality bargain",
					"I like thin cotton in summer so this was just right the pink is same as photo which so often is not the case ....if I have one niggle a little big on hips for me but we all have different size hips.....I would really like shirts that are straight to wear outside over pants and skirts they are so hard to find and whoever comes out with them will have a winner (preferably cotton of course) all In all a good buy for £12..."
				]
			}
		},
		{
			"id": "E_V5Ef_",
			"title": "adidas Women's Performance Primegreen Polo Shirt",
			"price": "$17.87",
			"image": "https://m.media-amazon.com/images/I/81TiEnytXxL._AC_UX342_.jpg",
			"description": "Lightweight jersey fabric for moisture wicking comfort and breathability. Made with Primegreen recycled materials, part of adidas' commitment to ending plastic waste.",
			"reviews": {
				"customerProfileNames": [
					"j2w",
					"NCTransplant",
					"Customer",
					"KindleGirl",
					"samantha",
					"LISA"
				],
				"customerProfilePictures": [
					"https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif"
				],
				"customerRatings": [
					"4.0 out of 5 stars",
					"3.0 out of 5 stars",
					"5.0 out of 5 stars",
					"5.0 out of 5 stars",
					"3.0 out of 5 stars",
					"1.0 out of 5 stars"
				],
				"customerReviewTitles": [
					"Runs a Bit Small",
					"Dual issue",
					"Perfect green",
					"Fits Great!",
					"Not slimming",
					"See through material"
				],
				"customerReviewBodies": [
					"Standard golf shirt. The color is very vibrant. The shirt runs a bit small (across the shoulders, across the bust, length to waist), so if you can't decide which size to order, size up.",
					"There are a variety of Adidas women's polo shirt styles and I apparently selected a different one than those I have currently or have had previously. The size in general was spot-on, however this shirt was shorter than others and flared on the edge which doesn't work if worn untucked. Disappointing, but I am returning.",
					"I ordered 2 of these shirts. Fits perfectly. Nice and cool for summer.",
					"I love how this shirt fits - perfect and flattering!",
					"The quality of the shirt is great but the fit is very wide and boxy. Definitely will not be wearing.",
					"Must wear cami underneath it’s see through"
				]
			}
		},
		{
			"id": "GMyS4o1",
			"title": "Disney Mickey Mouse Icon Rainbow Tie-Dye T-Shirt",
			"price": "$22.99",
			"image": "https://m.media-amazon.com/images/I/A13usaonutL._CLa%7C2140%2C2000%7C91qgPG8qtFL.png%7C0%2C0%2C2140%2C2000%2B0.0%2C0.0%2C2140.0%2C2000.0_AC_UX342_.png",
			"description": "",
			"reviews": {
				"customerProfileNames": [
					"ch1s",
					"TraseeInTN",
					"PatriciaF.",
					"TerriLRussell",
					"davidlopez",
					"CarlaEverett",
					"NickolasEpps",
					"Jennifer"
				],
				"customerProfilePictures": [
					"https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif"
				],
				"customerRatings": [
					"5.0 out of 5 stars",
					"5.0 out of 5 stars",
					"5.0 out of 5 stars",
					"5.0 out of 5 stars",
					"5.0 out of 5 stars",
					"5.0 out of 5 stars",
					"5.0 out of 5 stars",
					"5.0 out of 5 stars"
				],
				"customerReviewTitles": [
					"Gorgeous shirt!",
					"It’s Mickey",
					"Comfort",
					"Great for Disney Fans",
					"quality tshirt",
					"My sister-in-law loves it - her two favorite things ~ Mickey and tie dye~ in one place",
					"True to size",
					"So cute!!"
				],
				"customerReviewBodies": [
					"The pictures don't do justice to this shirt. The tie dye work is beautiful and vibrant! I bought this for my son in the sky blue color and he absolutely loves it. The material is soft and the tag removable. Fits as expected. I'm definitely going to buy him another as soon as he wears this one out!",
					"Fit as expected, Disney shirts from any manufacturer seem to run about a size small. I always choose size based on that and get a good fit.",
					"Fits well, washes well",
					"Got these for our trip to Disney World. Got many nice comments on them. They were cool and comfortable.",
					"very good quality",
					"This was a great surprise gift",
					"Fits like expected. Can’t wait to ahow it off in Disney!",
					"Material is not cheap. Great color. Fits as expected."
				]
			}
		},
		{
			"id": "c_27CDO",
			"title": "5-Pack Women's Short Sleeve Dry Fit T-Shirt Moisture Wicking Athletic V-Neck Tee",
			"price": "$33.29",
			"image": "https://m.media-amazon.com/images/I/81OHXD6RVgL._AC_UY445_.jpg",
			"description": "Pull On closure\nDry flat\n【MATERIAL】These womens short sleeve v neck workout t-shirts are make of 47% cation,47% polyester and 6% spandex,the moisture wicking power fabric which is lightweight,stretch enough.This v-neck shirt for women short sleeve can bring you a comfortable, soft and breathable wearing experience.\n【FEATURES】Soft lightweight fabric with comfortable V-neck and embellish solid color monotone style make this basic short sleeve workout tops for women more vitality.Moisture-wicking tech stretch fabric with tag free that keeps you comfortable,cool and skin-friendly,abrasion-resistant and durable,this workout tee shirt women short sleeve is designed for all body types.\n【OCCASION】This active tee shirts for women is great for yoga, exercise, fitness, gym, any type of workout, or as a daily wear,it's your versatile essential every day.The short sleeve v-neck workout gym shirts for women combine fashion element,function and performance,so this women’s short-sleeve active tops also suitable for travel and shopping.\n【SIZE & FIT】 Model is wearing a size small.We keep improving to make it more comfortable for you,please check our size chart before purchasing if you are the first time to buy this short sleeve athletic top.This pack of 5 brilliant colors women daily short sleeve tees will be a basic choice for yourself, Or as a gift for girl-friend, family,relatives.\n【WASHING】Our 5 pack women’s active v-neck t-shirt should be washed by hand / Machine in gentle with cold water, hand wash would be better,dry flat, don’t bleach.Please contact us for any question about our active v-neck top short sleeve,we will reply you with in 12 hours and assist you further.",
			"reviews": {
				"customerProfileNames": [
					"Devin",
					"Nadine",
					"TC",
					"Customer",
					"Kinsie",
					"DanelleMcDaniel",
					"D.Weber",
					"Samantha"
				],
				"customerProfilePictures": [
					"https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif",
					"https://images-na.ssl-images-amazon.com/images/S/amazon-avatars-global/035d4b93-169a-42e6-afae-7189bdef6c41._CR0,0,500,500_SX48_.jpg",
					"https://images-na.ssl-images-amazon.com/images/S/amazon-avatars-global/a0598baf-0e23-4aa5-afff-42fd467e083f._CR0,26.0,281,281_SX48_.jpg",
					"https://images-na.ssl-images-amazon.com/images/S/amazon-avatars-global/588574c7-18f3-420c-8cd6-15e9db46e2c0._CR0,0,748,748_SX48_.jpg"
				],
				"customerRatings": [
					"5.0 out of 5 stars",
					"5.0 out of 5 stars",
					"5.0 out of 5 stars",
					"1.0 out of 5 stars",
					"5.0 out of 5 stars",
					"5.0 out of 5 stars",
					"5.0 out of 5 stars",
					"5.0 out of 5 stars"
				],
				"customerReviewTitles": [
					"Perfect for daily wear and workouts",
					"Moisture wicking wirks",
					"Perfect casual shirts!",
					"This shirt has permastank",
					"Grate buy, would recommend",
					"I love them! They are like my Under Armour ones but I like these better!",
					"Perfect for tennis",
					"Happy Camper"
				],
				"customerReviewBodies": [
					"The fit is great I’m 5’4 and 230lbs and got the XL. The dry fit of the shirt is perfect for workouts, trips to the farmers market, or taking the kids to the park. The fabric is breathable and comfortable, even my kids try to take my shirts.",
					"I’m 5’4-133 lbs. 34c and I ordered a small & love the fit, fit isn’t extremely loose just right. Fitted true to size in the bust and not body tight. I have a little bit of a belly and don’t like that second skin look on me. So these fit perfectly to flatter my body. Seems to be made well,,light weight but not see through. I laundered on normal cycle & hung to dry,,wrinkles free. Moisture wicking works well. I wish I could order them individually as I want all the colors but don’t want duplicates.\nThe cut isn’t low on chest a great cut tee shirt.",
					"Fabric is soft, somewhat stretchy, and very comfy. Long enough to feel comfortable doing workouts or stretches, but not baggy. Easy to wear under a cardigan for a pop of color or to go for a jog. Very versatile and high quality! I would buy more, no question. Great price for 5 well made shirts!",
					"The fit was great, the colors are great, but the fabric stinks. Even after washing, five minutes of wearing this shirt and the shirt smells, my body smells, everything smells awful.",
					"True to size.\nGreat for the gym.\nExactly as pictured, and a great deal.\nI will definitely be ordering more.",
					"These are great shirts for tennis. I'm 5'3\" 123 lbs. I usually buy small, but medium is a better fit in this brand if you don't want your workout clothes to be tight.",
					"These shirts are great! I ordered size XL and I am a size 18. I recently wore them on a camping trip to Arizona and they were very comfortable in the hotter climate. The material is soft and so far they have held up very well to two washings. I think I will order some more."
				]
			}
		},
		{
			"id": "wuYQfYd",
			"title": "NILOUFO Womens Summer T Shirts Short Sleeve Tunic Strappy Cold Shoulder Tops",
			"price": "$18.99",
			"image": "https://m.media-amazon.com/images/I/61KzXjJij0L._AC_UY445_.jpg",
			"description": "95% Rayon, 5% Spandex\nImported\ntunic closure\nMachine Wash\nFabric Material: 95% Rayon + 5% Spandex. Material is Lightweight, Flowy, Soft and Stretchy\nUS Size: X-Small/US 0-2, Small/US 4-6, Medium/US 8-10, Large/US 12-14, X-Large/US 16-18, XX-Large/US 20-22, 3X-Large/US 24. Attention: About the floral tunics, the \"Floral Print\" is random, we couldn't ensure the position of floral print on each tunic, but they are made of the same pattern fabric, the WHITE color is a little bit see-through, please use nude, lighter color underwear\nFeatures: Design with scoop neck, strappy cold shoulder, chic high-low cut, unique, and stylish design. Made of stretchy lightweight soft fabric and comfy to wear. Solid Color/Floral print tops, this cold shoulder t-shirt perfect length for Leggings, Jeans, Shorts Dress Pants, or caprice for a stylish look all seasons!\nShow more",
			"reviews": {
				"customerProfileNames": [
					"J.GaryF.",
					"QueenMagdeline",
					"megan",
					"Customer",
					"Customer",
					"JaydeCraig",
					"Morgan",
					"SarahEdkin",
					"JudyV."
				],
				"customerProfilePictures": [
					"https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif",
					"https://images-na.ssl-images-amazon.com/images/S/amazon-avatars-global/9d54ce64-996e-43bb-9a36-b9ba4e3bced5._CR0,0,375,375_SX48_.jpg",
					"https://images-na.ssl-images-amazon.com/images/S/amazon-avatars-global/173627e7-5b8f-4cb6-9dd9-69e2b4f124f3._CR0,26.0,281,281_SX48_.jpg"
				],
				"customerRatings": [
					"5.0 out of 5 stars",
					"5.0 out of 5 stars",
					"5.0 out of 5 stars",
					"5.0 out of 5 stars",
					"5.0 out of 5 stars",
					"5.0 out of 5 stars",
					"4.0 out of 5 stars",
					"5.0 out of 5 stars"
				],
				"customerReviewTitles": [
					"Sexy, flattering and cool for us thick chicks",
					"Beautiful top to wear at Magic Kingdom. 🖤🤍",
					"Perfect",
					"Great quality",
					"Super soft, fits perfectly",
					"Nice quality",
					"Adorable shirts!",
					"Love it!"
				],
				"customerReviewBodies": [
					"It is very flattering just what I was looking for. I am a 5'1 200lbs girl with very heavy bust area and I am uncomfortable with the way my arms look and wanted something sexy to cover them up and be cool in the summer. This shirt does that. It is clingy but thats the kinda material it is which I dont care but I would maybe order a 2x if u want less clingy especially for girls like me with back boobs lol",
					" Wore this top at MAGIC KINGDOM .Size M. Beautiful stretch fabric, I wasn’t too hot at all . Very comfortable. Received compliments 🖤🤍🙌🏾",
					"This shirt is very flattering! I love the way the shoulders show off just a little bit of skin. It’s also flowy enough to hide your tummy.",
					"Very flattering! Super soft. Love the way it fits can wear loose to hide your tummy or tucked in.",
					"Super soft, fits perfectly",
					"Nice, soft and with the slightly heavy feel quality(but not thick), silky feel, its hard to describe. Its a great shirt, especially for the price!\nI got a medium size, it fits nice at the waist and doesnt make you look wide.",
					"I bought 3 of these shirts and I love them!! They fit well though if you don't like them tight fitting( like I do) I'd size up. The only reason I gave 4 stars is because they are sheer. My bra pattern can be seen through the blue one which isn't a huge deal I will just wear a cami underneath.",
					"Love this cold shoulder top! I am 59 years old, 5'2\" ,145 lbs, 38C, and carry weight in tummy...got a size medium and fits perfect! Flattering, soft, and comfortable. Washes well in a garment bag, cold water on gentle, and hang to dry. Got lots of compliments!\nThat said, I did have to make the strings in the shoulders shorter by cutting them off on bottom of the sleeve side (not the shoulder area), moved them about a 1/4 to 1/2 inch and sewed them back on. I did not remove any stitches, just simply hand sewed the string right over the piece of string that was left behind after cutting as close as I could to the edge. You cant even tell I sewed it as I matched the thread color.\nGoing to buy more colors!"
				]
			}
		},
		{
			"id": "5TGZ0Cw",
			"title": "Amazon Essentials Women's Classic-Fit 3/4 Sleeve V-Neck T-Shirt",
			"price": "$16.30",
			"image": "https://m.media-amazon.com/images/I/71fdqdhLsPL._AC_UX342_.jpg",
			"description": "Amazon Essentials is focused on creating affordable, high-quality, and long-lasting everyday clothing you can rely on. Our line of women's apparel includes cashmere sweaters, fleece and down jackets, and more, including plus-size options. Our consistent sizing takes the guesswork out of shopping, and each piece is put to the test to maintain the highest standards in quality and comfort.",
			"reviews": {
				"customerProfileNames": [
					"M.Hill",
					"Heidi",
					"Cross-eyedcat",
					"JanetP.",
					"WhitMur",
					"Rachael",
					"mdrenna",
					"Anyolebird"
				],
				"customerProfilePictures": [
					"https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif",
					"https://images-na.ssl-images-amazon.com/images/S/amazon-avatars-global/21p09fW70eL._CR0,0,87,87_UX110_.gif",
					"https://images-na.ssl-images-amazon.com/images/S/amazon-avatars-global/48e42c6b-dfd7-4284-ac64-3e01e99530f5._CR15,0,469,469_SX48_.jpg"
				],
				"customerRatings": [
					"5.0 out of 5 stars",
					"5.0 out of 5 stars",
					"5.0 out of 5 stars",
					"5.0 out of 5 stars",
					"3.0 out of 5 stars",
					"5.0 out of 5 stars",
					"3.0 out of 5 stars",
					"5.0 out of 5 stars"
				],
				"customerReviewTitles": [
					"Amazon Essentials V Neck 3/4 Sleeve Top Classic Fit",
					"Great fitted tee",
					"fits slightly large",
					"Very comfortable!",
					"Very tight fitted",
					"Exactly what I was looking for!",
					"More of a tunic length",
					"Great basic 3/4 sleeve"
				],
				"customerReviewBodies": [
					"This long-sleeve V neck top is made from 56 percent cotton, 37 percent modal, 7 percent elastane. The fabric is medium tee-shirt weight, is super soft and stretchy. The material moves with the user so the top is very comfortable to wear. Classic fit means it has a looser fit through the torso.\n\nThe large size top is 27 inches in length and the chest circumference measured from the underarm seam all the way around is 41 to 42 inches. The bottom edge circumference is 44 inches and the hem on the bottom edge and sleeve opening is 1/2 inch as is the neckline band. Measured from the top of the shoulder the 3/4 length sleeves are 18 inches in long.\n\nMachine wash warm with like colors, non-chlorine bleach when needed, tumble dry low heat and cool iron if needed. Do not dry clean. This is a classic style that works well with casual or work clothing one of those wardrobe basics both comfortable and versatile. Excellent.",
					"T",
					"I am 5 ft. 5 inches tall and 127 lbs. I am wearing a size small. It is a bit roomy, and I think I could easily wear a size extra small in this as well if I wanted it to be more fitted.",
					"I originally purchased two of these tops (one black and the other white) thinking I would just wear them around the house. But, they are nice and comfortable, enough to wear out and about casually. I washed them and put them in the dryer and they didn’t shrink. A cool iron if you’re going to wear them out, but really, the wrinkles are very minimal. They are soft and not too heavy...perfect for cool weather. I am a 36 D, so I ordered a large which is a perfect fit...not too tight.",
					"I was looking for something to wear as an under shirt at work, and these are great for that purpose. I would never wear them as anything other than an under shirt though as they are skin tight. Every little detail and bulge is fully visible.",
					"This is one of the few products I've received that was exactly what I was hoping it to be. The fit is perfect. I sized down (went with the recommended size for my height, weight and body type) because I wanted it more fitted than the photo and it was still not too snug in the waist. The length is good as well. I'm 6'1\" and it fits nicely. Material is really nice (again exactly what I was looking for) smooth, soft and stretchy. I will be buying more in other colors. Great shirt at a great price!",
					"Very well made shirt but definitely for taller folks. I am 5'2\" and this was a tunic length shirt (ordered a small). If that is what you are looking for then definitely get this. Unfortunately that was not what I was wanting. Otherwise the quality was fantastic.",
					"I am 5'9\", 160lbs, size 36C, and a dress size 10-ish; I ordered a size Medium and it fits me well. It is slightly tighter in the sleeves (not in a way that restricts movement, just no loose fabric) and looser in the torso (not in a \"boxy\" way, just a feminine cut with a little extra room to not highlight any rolls). Like some of the other reviews mention, it has a slightly longer torso as well (great for the taller ladies, maybe not so much if you are shorter). The fabric is soft and stretchy, and light enough without being see-through. Overall for the price, this is the shirt you need if you are looking for a logo-less 3/4 sleeve.",
					"L",
					"I had gained a bit of weight due to medication,so opted for a larger size than usual.When it arrived I was horrified, it looked enormous! however when I tried it on it fitted very well.Not so sure I was happy about that! however I'd say it's probably true to size.It's a lovely colour and pretty good value for money.I haven't washed it yet so can't comment on how it will be once it's been through the washing machine but overall it fits well,colour looks good,value for money and arrived well packaged. Happy with purchase and would buy again in another colour.",
					"Lovely soft and stretchy. Slightly on the large side. I got an xl, I'm a size 14 and think I will be buying another one in large. Not returning this one as is too comfy! Very pleased.",
					"Firstly, it is not easy to find a tshirt in this style so I was delighted to find it at a reasonable price. The material is soft and stretchy and fits really well. I bought a small and am 10-12 usually.\nThe only downside, in my opinion, is that it is quite long. Fine if you want to wear tucked in but outside it reaches the top of your leg and I’m 5’5’. If it was 2-3’’ shorter it would be perfect.",
					"I love the colour of this top and 3/4 sleeves. I'm a size 12, my measurements are well within those given on the listing for a Medium. So I ordered an M. Sadly it was not true to size, very tight, very long, much longer than shown on the listing. Fabric very thin. Returning the top. Debating whether to order a larger size, if it was thicker fabric and not so long in the body I wouldn't hesitate. Shame."
				]
			}
		},
		{
			"id": "sYKlBKJ",
			"title": "Amazon Essentials Women's Classic-Fit Short-Sleeve Crewneck T-Shirt, Pack of 2",
			"price": "$9.62",
			"image": "https://m.media-amazon.com/images/I/71f0TDHZk3L._AC_UX342_.jpg",
			"description": "Amazon Essentials is focused on creating affordable, high-quality, and long-lasting everyday clothing you can rely on. Our line of women's apparel includes cashmere sweaters, fleece and down jackets, and more, including plus-size options. Our consistent sizing takes the guesswork out of shopping, and each piece is put to the test to maintain the highest standards in quality and comfort.",
			"reviews": {
				"customerProfileNames": [
					"Saki",
					"KH",
					"Kelliar",
					"Deez",
					"Vi",
					"CyndyRodriguez",
					"ElizabethGrover",
					"KatieV."
				],
				"customerProfilePictures": [
					"https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif",
					"https://images-na.ssl-images-amazon.com/images/S/amazon-avatars-global/fd0125ae-45c4-4d90-beb3-e5fcbe357fb1._CR0,0,2322,2322_SX48_.jpg",
					"https://images-na.ssl-images-amazon.com/images/S/amazon-avatars-global/26f09b40-b977-4407-b7d1-28266dc5b8ed._CR62,0,375,375_SX48_.jpg"
				],
				"customerRatings": [
					"5.0 out of 5 stars",
					"5.0 out of 5 stars",
					"4.0 out of 5 stars",
					"3.0 out of 5 stars",
					"5.0 out of 5 stars",
					"5.0 out of 5 stars",
					"5.0 out of 5 stars",
					"4.0 out of 5 stars"
				],
				"customerReviewTitles": [
					"Soft, comfy and long enough to covers my hips",
					"Can I tell you how much I HATE wearing an undershirt on a hot day",
					"Very comfortable but very not flattering",
					"Good quality, clingy fit, meh colors",
					"Pure Perfection",
					"Can’t beat the price!",
					"Excellent basic shirt",
					"Good basic tee- if you find your size"
				],
				"customerReviewBodies": [
					"I’m 5’1 and weighs about 170lbs( please don’t judge). I wear size 10 on my pants and usually wear Medium on top. Since I gave a birth to my son AND recently gained 3-5lbs from staying at home because of this quarantine, my medium tops are getting tight. I wanted to wear something soft and comfy so I decided to go with size large this time. I was worried if it’s gonna be too baggy especially around my chest. I’m not busty so I was worried that part especially when I go up the size. This shirt fits just fine! Yay! It’s very stretchy materials(56% cotton, 37% modal, 7%elastane) and very soft and nice. The best part of this shirt is that this shirt covers my butt! I haven’t washed them yet but instruction says machine wash cold, tumble dry low so hopefully it won’t shrink too much. Hopefully this review helps somebody out there :)",
					"Can I tell you how much I HATE wearing an undershirt on a hot day?! It’s so frustrating to look to look for shirts in the store and have them all be translucent, too tight, too baggy, or have words on them. I saw these and figured I could send them back if I hated them. Well, I LOVE THEM. They are soft, they aren’t see through, and they fit amazingly well. I get complimented on them every time I wear them. Can’t beat the price either. I can even wear the white ones without an undershirt. I have several colors and will buy more.",
					"I'm 5'5 about 118 lbs with a long torso and I generally wear a size small in tops. I ordered this in xsmall after looking at the photos and other reviews. 3.5 stars would be a more accurate rating but that wasn't an option so I bumped it up instead of down due to the nice fabric.\n\nThe bad: It does my figure NO favors. I don't like tight t shirts but ones that just have a little bit of shape that hint at there being a female form underneath and not a cardboard box. Unfortunately this tshirt gives me a \"shoebox\" body shape. I've attached a photo of how it hangs naturally vs when I pull it back at the waist so show how my body is actually shaped. If it was just tapered in around the waist even a tad more I'd be much happier with the silhouette.\n\nThe good : It's SUPER SOFT. Extremely comfortable. The sleeves are the perfect length in my opinion. The neckline is also perfect for a casual tshirt. Not constricting at all but not flashy either. Great length. I'm wearing a nude bra underneath in my photos and I could not see it at all through the shirt. It has a nice thickness, but as you can see at the bottom you can see my shorts through it so don't expect to be able to wear a black bra without noticing it.\n\nAll in all I think I will keep these as \"around the house\" shirts since they are affordable and so comfortable. If you want a nice weight, soft, non-sheer tee and don't care about it having any shape whatsoever, then it's a great option.",
					"Good quality shirt, true to size but clingier than I had expected. If you want to camouflage your stomach, try a different shirt. I like that the shirt is longer than most Ts, which pairs nicely with leggings. I'm 5'6, 190lbs with a gut and ordered the XL.\n\nThe colors are kind of muted, with the 'purple' being more of a periwinkle in good lighting. The blue is your standard navy.\n\nThe material is on the thicker side, so i plan on saving the shirts for the end of summer/fall. It'll pair well with items that will give belly coverage like a hoodie, jean jacket, or cardigan. I wouldn't order again, but I'm not considering a return either.",
					"I absolutely love them. I had read a lot of reviews, but I was still genuinely surprised at the quality of the material as soon as I opened the package. The material has some weight to it - doesn't feel cheap, thin or flimsy at all, and is soft to the touch. Be warned though on hot humid days it'll really cling to you if you're sweating a lot.\n\nThe fit is perfect for what I wanted. I ended up getting the xxl because I wanted it to be huge on me and it did not disappoint - it goes well past my hips and fits very loose. I wanted something that was comfortable to do some working out in and lounging in and these turned out to be perfect. The color is absolutely beautiful as well. As soon as I got these and tried them I had immediately ordered another set! I'm contemplating ordering another one too.\n\nFor the quality and quantity the price is definitely worth it and I say its a really good deal. Buy these and I guarantee you won't regret it.",
					"These shirts are extremely high quality for the price you pay. I’m 98lbs and 5’2 and the XS are slightly a little loose on me but I’m very petite so I run into that a lot. Still it’s not a problem and they feel and fit great! Very stretchy and they are a little long but I am short. Get these though! You won’t be sorry!",
					"These shirts are AWESOME. Super soft comfortable fabric that is thick enough you can wear over light colored bra without it showing. Great length and just tailored enough to not fit as baggy as a dude's shirt. I have been on the hunt for a flattering decent basic t-shirt & I finally found it!",
					"I needed a few nice basic tees to round out my wardrobe. I ordered these and a 2 pack of the v-neck as well, based on reviews I went with a medium. I'm 5'5 140 lbs and 34B and the medium fit loose and was just too boxy for me, I'm going to reorder in small to see if it's a more flattering and feminine fit. The fabric is nice and light, not too spandex-y like workout tops. As to the white being see through- I was wearing a nude bra and could not see it, however the waistband of my black pants was clearly visible through it, so if that sort of thing bugs you these probably wouldnot bee good for you. They were long (mid hip), but I personally like alittle extra coverage over my hips especially with skinny jeans. The fit of these really reminded me of Old Navy - the vanity sizing kings of retail. I always get size small in tops there, if that helps anyone.",
					"Good quality T-shirts. The fabric is stretchy and silky, and the white T-shirt is not see through. They are on the longer side with a loose fit. Good value for a 2-pack - ordered it again in another colour. They wash well - with this type of fabric I was a bit concerned about pilling but so far so good after a few washes. The black colour started to fade slightly after about five washes. The only downside is that the t-shirt is a lint magnet - I wore a fluffy sweater over a black T-shirt and it was covered in lint which didn’t happen with other fully cotton t-shirts.",
					"These are a smooth silky material, not plain cotton, so they wear well and creases drop out easily. I ordered 2xl and I am a size 18/20. They fit well (material is a little clingy so I had ordered next size up). Will buy in other colours when available.",
					"W",
					"J",
					"Je suis satisfaite de ce produit mais mécontente du prix, le même modèle en homme est à 20€ pour 6 alors que pour femme 2 pour 20€. Mon mari ayant acheté le version homme on a comparé et ceux sont de même qualité ! Pourquoi une telle différence de prix?",
					""
				]
			}
		},
		{
			"id": "wgGTSxj",
			"title": "Bofell Womens Tshirts Short Sleeve Summer Tops Color Block Side Split Shirts Crew Neck",
			"price": "$9.99",
			"image": "https://m.media-amazon.com/images/I/71JzqvjNsaL._AC_UX342_.jpg",
			"description": "【Fabric】-60% Polyester,35% Rayon,5% Spandex. Skin-Friendly fabric which is stretchable, lightweight and breathable, brings you a pleasant wearing experience.\nPull On closure\nLine Dry\n【Features】-Short Sleeve Shirts with Crew Neck, Side Split, Stripe Color Block, Flowy and Loose Fit.Runs true to size.\n【Match】Perfect length for leggings,jeans,shorts or pants. You can tuck the tshirt into your shorts or skirts for a stylish look all seasons!\n【Occasions】:Dailywear,Casual,Shopping,Date,Workout,Office,Work,Party,Outdoor,School etc. Wearing on all seasons especially spring and Summer.\n【Washing Care】-Machine Washable in Gentle, Recommend Hand Wash in Cold Water, Line Dry, Do Not Bleach.\n【Note】-Please Refer to the Picture of Size Chart Below in Description and Choose Your Size According to it.",
			"reviews": {
				"customerProfileNames": [
					"ClarkImaginations,LLC",
					"Mert",
					"BMcFarland",
					"Kim",
					"ChristianLawson",
					"Customer",
					"LC",
					"JudyA.Grabski"
				],
				"customerProfilePictures": [
					"https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif",
					"https://images-na.ssl-images-amazon.com/images/S/amazon-avatars-global/0d0e4bb6-f67c-4122-a6ee-d59457e14f7f._CR0,0,500,500_SX48_.jpg"
				],
				"customerRatings": [
					"5.0 out of 5 stars",
					"5.0 out of 5 stars",
					"5.0 out of 5 stars",
					"5.0 out of 5 stars",
					"5.0 out of 5 stars",
					"5.0 out of 5 stars",
					"5.0 out of 5 stars",
					"5.0 out of 5 stars"
				],
				"customerReviewTitles": [
					"SPORTY VIBES 🌟",
					"Really nice.",
					"Yes buy these.",
					"Very soft, true to size",
					"Looks and fits GREAT but issue with delivery",
					"A big oversized",
					"It doesn’t run small",
					"Comfy flattering top!"
				],
				"customerReviewBodies": [
					" Cute “sporty” top, nice change up for my wardrobe. Very soft & extremely comfortable. Sleeves loose & don’t ride up into armpits. I sized down for a more fitted look & it fits perfectly. I’d say order your usual size for a more relaxed/loose fit & size down for a more fitted look. I like the slits on the sides giving it a more feminine & flattering look. Color is accurate to stock photo. I was pleasantly surprised when I put this top on, its definitely cuter in-person. Overall, love this top & will most likely become a fav to grab often, very happy with this purchase. Great product, good condition & fast shipping! If you found my review helpful, I would appreciate you clicking “helpful” - thanks!!!",
					"Better than I had expected. I ordered the large in Green & another one in Black (I’m 5’4, 140 pounds) & it fits nicely. Feels soft & very comfortable to wear. Definitely can style this up or wear casual.",
					"I bought 3 of these. I am 5’5” and 135 I bought the large because I know China has no clue how to measure anything. It’s a little big but looks really nice. The white is a little bit see through but the grey strip can’t be seen through. A bit thin but perfect for the Texas summer. I haven’t seen my other two shirts yet will post when I get those.",
					"Surprisingly true to size considering all the other reviews. I am 5'5\" and 170#, I ordered the Large based on all of the other feedback and it fits exactly like the model in the video, a little loose and roomy. I probably could have gone with my normal medium size but then it might have been snug. I am very happy with this purchae.",
					"L",
					"I love it. But I am finding some blouses say 2xl but they are really large some tigher so it's really hit and miss. This one I would love if it was a little smaller but I can wear this for my comfy days.",
					"After reading several reviews stating that the shirt sizes ran small, I ordered the Large in anticipation of a slightly loose fit. It was huge and I was swimming in it so returned and got the Medium which fits great. Needless to say, I love the shirt. It’s soft, comfortable and flattering. Will probably order another in a different color.",
					"Great, comfortable top! Just as pictured. I like the length. Many tops are short and boxy and this is longer and the material is soft and it washes beautifully!"
				]
			}
		},
		{
			"id": "8J7Kzjp",
			"title": "Saloogoe Womens Loose Fit Tshirts Short Sleeve Summer Tops Casual Workout Yoga Tunic T Shirts Tops",
			"price": "$15.99",
			"image": "https://m.media-amazon.com/images/I/61rhWx1iY1L._AC_UX342_.jpg",
			"description": "60% Polyester, 35% Rayon, 5% Spandex\nDrawstring closure\nFeatures: Crew Neck Plain T Shirts/Soild Color/Basic Tee/Casual Workout Tops/Tunic Tops for Leggings/Everyday Wear\nMatch: Match with Leggings/Pants/Shorts/Jeans/Sweatpants.Perfect for Exercise/Yoga/Everyday Wear and Front Tucked or Tie a Knot at The Bottom of The T-Shirts. Also Can as an Undershirt and Match with Coat Which Makes You Look More Stylish and Chic!\nOccasion: Suitable for Casual Daily/Workout/Travel/Exercise and Fitness/Outdoor Lifestyle/Home/Office/Weekend Plan, Etc.The Best Gifts for Family and Friends.\nExperience: This T-shirts is Super Soft/Lightweight/Loose fit/Comfortable and Breathable to Wear.The Size is True/Long Enough for Legggings\nNote: Please Refer to the Saloogoe Size Chart Before Ordering.Any other questions, please contact us freely!",
			"reviews": {
				"customerProfileNames": [
					"k.d.",
					"JandePauw",
					"CeliaD.Goodell",
					"Theslap",
					"Carolyn",
					"Tara",
					"Dee",
					"ah"
				],
				"customerProfilePictures": [
					"https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif"
				],
				"customerRatings": [
					"5.0 out of 5 stars",
					"5.0 out of 5 stars",
					"5.0 out of 5 stars",
					"5.0 out of 5 stars",
					"5.0 out of 5 stars",
					"5.0 out of 5 stars",
					"5.0 out of 5 stars",
					"5.0 out of 5 stars"
				],
				"customerReviewTitles": [
					"Beautiful Blouse",
					"Love the fit",
					"Comfortable and versatile",
					"Really nice shirt!",
					"The shirt is so soft and washes really well.",
					"Cute top",
					"Beautiful",
					"Love!"
				],
				"customerReviewBodies": [
					"Beautiful blouse, bright color blue. I love this but unfortunately I was not able to wear it. I ordered an XL which is my size but because it has a lot of elasticity it fit tighter than I wanted. However, I will not be returning it but will gift it to someone. It really is a beautiful blouse.",
					"I purchased 3 of these. Opened one up first to make sure of the fit then decided to wash in cold water and place in the dryer on low heat. The shape, size and color remained the same.I’m 5’4 150 36in bust, wide shoulders. I just purchased 2 other colors. I’d recommend.",
					"I have paired this with nice pants and jeans. Depending on the accessories, I have made it dress up or dress down. Very pleased!",
					"Love the material! Fits exactly like described. It's a little longer and covers my back end just right. Will be buying more in different colors.",
					"The shirt is so soft and washes really well",
					"Fits as expected and comfortable.",
					"Love it it is perfect!",
					"I bought several in different colors. Fits well and is flattering. Seem pretty decent quality."
				]
			}
		},
		{
			"id": "Ftb47pv",
			"title": "WIHOLL Womens Tops V Neck Summer Petal Sleeve Casual Tshirts",
			"price": "$20.99",
			"image": "https://m.media-amazon.com/images/I/51EXBQflQzL._AC_UY445_.jpg",
			"description": "Solid Color: 60% Polyester, 35% Rayon, 5% Spandex. Striped/Floral Print: 95% Polyester, 5% Spandex\nPull On closure\nFeatures: Sexy V Neck T-shirts with Tulip Sleeves. Basic short sleeve tops, solid color, plain, trendy and elegant.\nMaterial: Solid Color: 60% Polyester, 35% Rayon, 5% Spandex. Striped/Floral Print: 95% Polyester, 5% Spandex. Super soft fabric, stretchy, lightweight and breathable. Not see-through.\nOcassion: Simple Design Makes it Perfect for Any Casual Occasions. Good for work, daily, office, travel, running, home wear.\nMatch: Goes Well with Jeans, Shorts, Leggings, Sweatpants or Skirts. Suitable to wear in spring, summer and fall.\nSize Note: S-2XL Are Available, Loose Fit T-shirts. Please reference the size chart below on \"Product description\" before ordering.",
			"reviews": {
				"customerProfileNames": [
					"ClarkImaginations,LLC",
					"Ohsugarcc",
					"Stacey",
					"BetsyRyan",
					"Mommahayes",
					"KatieRobersonMacCartee",
					"tanyaaustin",
					"MikeB"
				],
				"customerProfilePictures": [
					"https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif",
					"https://images-na.ssl-images-amazon.com/images/S/amazon-avatars-global/0d0e4bb6-f67c-4122-a6ee-d59457e14f7f._CR0,0,500,500_SX48_.jpg"
				],
				"customerRatings": [
					"5.0 out of 5 stars",
					"5.0 out of 5 stars",
					"5.0 out of 5 stars",
					"5.0 out of 5 stars",
					"5.0 out of 5 stars",
					"3.0 out of 5 stars",
					"5.0 out of 5 stars",
					"5.0 out of 5 stars"
				],
				"customerReviewTitles": [
					"LOVE THE SLEEVES!!! 😍",
					"Would buy again!",
					"Super cute",
					"Very flattering!",
					"True to size. Nice length not too short",
					"Order size up for curvy. Not as flattering but I'll keep it",
					"Love it",
					"Get this shirt!"
				],
				"customerReviewBodies": [
					" This top is so pretty, absolutely LOVE the petal sleeves! This top is like a t-shirt but with fancier sleeves, which makes it easy to dress up but you still get the comfort of a tee. The material is very soft, fairly lightweight & loose fit. I’m a big fan of v-neck shirts, I think they are more feminine. The v-neckline combined with the petal sleeves makes this top very flattering & pretty. True to size & color is accurate to stock photo. Overall, I am very happy with this purchase. Great product, good condition & fast shipping! If you found my review helpful, I would appreciate you clicking “helpful” - thanks!!!",
					"Great tee! I never know what to expect, even after reading reviews. This one was a pleasant surprise. It’s soft and comfortable. The sleeve detail gives it a little personality. It is a little longer than I expected, but that means it will pair well with leggings. I would purchase again for sure!\nFor reference, I am 5’3 140, 36D and I bought a M",
					"Soft material, nice quality, love the poof sleeve. I'll definitely purchase in more colors. I purchased a large, I'm 38dd",
					"Absolutely love this shirt! I recently lost 85 pounds so it’s fun to get things that are a little fitted. The Medium shows off my shape but isn’t tight. I also really like the sleeves - they add a little visual interest but also are enough to cover my upper arms loosely which I appreciate now that I have some loose skin there that I don’t want to draw attention to. Definitely getting more colors!",
					"Love this top, nice length it’s not short n wide like some xxl. Great material will purchase more colors",
					"I ordered XL and I'm 5'5 215lbs most of my weight is in my middle tummy and arms, so I try to hide them. I loved the sleeves but they're a little short and not as flattering. I'm wearing a shaper underneath here so I can make it look cuter than it is. It is comfy and with different pants the shirt will be fine on its own. Def not see thru or anything. I prob should order a size up but I didn't want it to be too large and frumpy. I'm always torn between things being too tight or too potato sack loose so it's a struggle. Cute shirt tho I'll keep it",
					"Love this shirt. Skeptical about buying online but it’s perfect and soft and very comfortable. Going to definitely buy more colors!",
					"Awesome tshirt! Love the sleeves on the shirt. Adds more interest to a basic V-neck T. I was worried the white might be see-through, but it’s not. If you wear it untucked over jeans or something dark, it will peek through a little, but I tuck the front in a little. The shirt is also a great length. And it’s roomy. I am 5’9”, 150 lbs and Medium is nice and loose. I have a long torso, and this top is plenty long enough. I will be ordering more colors. Highly recommend!"
				]
			}
		},
		{
			"id": "nOsilGx",
			"title": "Bofell Womens T Shirts Short Sleeve V Neck Summer Tops Casual Loose S-2XL",
			"price": "$13.99",
			"image": "https://m.media-amazon.com/images/I/71vVzvJwtdL._AC_UY445_.jpg",
			"description": "【Fabric Type】-Polyester + rayon + spandex. Super Soft Fabric Moves with You for All-day Ease. Unbelievable Softness and Coolness.\nPull On closure\nDo Not Bleach\n【Design Details】- Embroidered pockets are unique, leading the fashion trend, V Neck,Simple and Feminine Summer Top,Modified Face Shape,Revealing Sexy Collarbone.\n【Perfect Piece for Your Wardrobe】- Basic Tees for women,Flattering on Any Body Type,Loose fit,Casual Daily Wear All Seasons.\n【Garment Care】-Hand Wash or Machine Wash in a Laundry Bag and Cold Water. Do not Bleach.\n【Size Note】- Please Attention The Size Chart In Product Description, Select The Size According To It. Amazon Size Chart Is Not Ours, DO NOT USE IT !!!",
			"reviews": {
				"customerProfileNames": [
					"ClarkImaginations,LLC",
					"Allgurls1",
					"Customer",
					"Anotherconsumerjustlikeyou",
					"wrwaters2006",
					"C.Hooks",
					"francescamanfredi",
					"ERIKATHORNBURG"
				],
				"customerProfilePictures": [
					"https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif",
					"https://images-na.ssl-images-amazon.com/images/S/amazon-avatars-global/0d0e4bb6-f67c-4122-a6ee-d59457e14f7f._CR0,0,500,500_SX48_.jpg"
				],
				"customerRatings": [
					"5.0 out of 5 stars",
					"5.0 out of 5 stars",
					"5.0 out of 5 stars",
					"2.0 out of 5 stars",
					"5.0 out of 5 stars",
					"5.0 out of 5 stars",
					"5.0 out of 5 stars",
					"5.0 out of 5 stars"
				],
				"customerReviewTitles": [
					"NICE TOP!",
					"Nicer than expected",
					"I purchased the white and now have the black",
					"Bad return policy, nice shirt",
					"My new favorite top!",
					"Great casual top",
					"Order a size up if you want the fit like on the model",
					"Love it!"
				],
				"customerReviewBodies": [
					" Nice top! I love a good v neck, I think they are very flattering & feminine; this one sits closer to the neck making this top easy to dress up. Sleeves loose & don’t ride up in the armpits. It’s definitely long enough to wear with leggings & cover your bottom about halfway (but I’m short so maybe that’s just me). The material is thin, soft & comfortable. True to size, I sized down for a more fitted look. I’d say order your usual size for a more relaxed/loose fit & size down for a more fitted look. Color I purchased is accurate to stock photo but, color is off in my photos, color is a dark navy. I tried to get a good video of the stitching on the pocket which is black, I thought that was a nice detail to this top. Overall, I am very happy with this purchase. Great product, good condition & fast shipping! If you found my review helpful, I would appreciate you clicking “helpful” - thanks!!!",
					"Nice sleek fit that doesn’t cling, didn’t pill in the wash and isn’t see through. I like mainly because it has a nice shape and isn’t just a big square oversized shirt - this is tapered. It does show my flaws so I would not be comfortable wearing when I’m heavier but I like after I lose a few pounds (which I seem to do more easily in the summer, and this is lightweight so it works out). Would buy again but not if I was at my “winter weight”.",
					"This is my second top. Material is soft and nice. Fits loose as seen on the model. Washes well. I have the white and now the black. I am petite so I got the small.",
					"Nice shirt. Didn't fit, tighter then I like. Unable to return as return labels and info provided all in Chinese. Usps, FedEx and ups couldn't help. Good trick seller, good trick",
					"I ordered this shirt in a large. I am 5’7, 175 lbs. it fits perfect. It is very flattering and it doesn’t hug me in the wrong areas. I will be buying it in more colors.",
					"Love this too. I’m glad I brought 2. The other in grey. Fits perfect for a medium not sheer and love stretch in the material",
					"Love this shirt. Looks great with anything. Lots of compliments. Super lightweight. I work in busy retail store. I do not get hot in this .",
					"Very comfortable casual shirt! I liked the first one so much that I bought more in other colors!"
				]
			}
		},
		{
			"id": "D9Xu2qP",
			"title": "Amazon Essentials Women's Classic-Fit Short-Sleeve Scoop Neck T-Shirt, Pack of 2 (Available in Plus Size)",
			"price": "$14.50",
			"image": "https://m.media-amazon.com/images/I/810ohhuDMqL._AC_UY445_.jpg",
			"description": "Amazon Essentials is focused on creating affordable, high-quality, and long-lasting everyday clothing you can rely on. Our line of women's apparel includes cashmere sweaters, fleece and down jackets, and more, including plus-size options. Our consistent sizing takes the guesswork out of shopping, and each piece is put to the test to maintain the highest standards in quality and comfort.",
			"reviews": {
				"customerProfileNames": [
					"Andrea",
					"K.",
					"Hallie20",
					"CaseyinNewport",
					"kttiekat",
					"KJ",
					"sliquejo",
					"BklynGirl"
				],
				"customerProfilePictures": [
					"https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif"
				],
				"customerRatings": [
					"5.0 out of 5 stars",
					"5.0 out of 5 stars",
					"5.0 out of 5 stars",
					"5.0 out of 5 stars",
					"5.0 out of 5 stars",
					"5.0 out of 5 stars",
					"5.0 out of 5 stars",
					"5.0 out of 5 stars"
				],
				"customerReviewTitles": [
					"Good shirts!",
					"Great quality and fit.",
					"Nice shirts",
					"Love these Ts.",
					"More fitted than expected but true to size",
					"Fantastic tee",
					"I love these shirts!",
					"Great t-shirt, but fitted"
				],
				"customerReviewBodies": [
					"General info: I'm 5'9, 163lbs, 34D, usually wear a size 10 long in pants and medium in shirts. In these pictures I'm wearing medium.\n\nSome good things:\nThe scoop neck is narrow enough that it doesn't show bra straps or cleavage. (Win!)\nThe yellow is not see through.\nThe fabric is a medium weight.\nThey both wash and dry well.\nI have broad shoulders and the sleeves aren't tight.\n\nThese shirts are slightly wider at the bottom and stomach. The yellow is warmer with a little bit of orange added to it. It's not a lemon yellow.\n\nOverall, I'm very happy with this purchase.",
					"I",
					"I was impressed with the quality of this shirt. Are usually go between a medium or a large shirt, depending on the brand and I was pleased that the large was roomy enough to be comfortable but not too baggy. The shirt is very comfortable and I like the length of the sleeves. The shirt is also just a little bit longer than some of my other T-shirts which I appreciate as a tall person. Will buy again in white!",
					"Washed and dried in dryer today. Nice and thick but not too thick. I love the length. This is a XS. I am 5’2”weigh and 110lb. I’m going to buy more colors.",
					"I",
					"These tees are slightly thicker then the flimsy tees from Target. They hold their shape and are long enough that you don't need to worry about putting them in the dryer. I like that there's a little give in the tummy area so mommy/bloated tummies aren't obvious. My only complaint is that most sizes and options are sold out and never restocked. I've bought 4 colors in these tees and plan to buy as many more as I can! I am 5'8 around 140 and the medium is very comfortable. A small would work, but I like the fit to be a little looser.",
					"I am forever having to buy new t-shirts because, without fail, I end up with little holes where my jeans rub in front. These shirts fit great, they’re not clingy, they hang nicely. The fabric is really nice and soft for a t-shirt. I’m super happy I tried these. I don’t have to look any further. These are now my go-to tops. I do wish there were more of a selection though",
					"These were great quality, basic t-shirts so that’s why they get 5 stars. Unfortunately, I had to return them due to my muffin top and I wouldn’t deduct a star for that! These shirts are slightly fitted, which is great if you have a slender torso, no matter your size. Since I’m not gifted that way, it accentuated what I was trying to hide. For reference I’m a size 10, 5’3” and 150 pounds. I purchase Large and they fit, but I don’t wear my clothes tight or too close to my mid section, so they didn’t work for me for that reason only.",
					"At last, a white T-shirt that is not transparent, and can be worn without embarrassment ! I've been looking for something like it everywhere, but materials seem to be so thinly made in many other brands, it was a hard search to find this. The grey T-shirt that comes with it was not my first choice, but comes in useful for easy days. Both T-shirts true to size and comfortable. Also semi-fitted, so not too boxy. Highly recommended.",
					"I really like these T-shirts as they are a good fit and come in a great choice of colours. I'm a size 10/12 in tops so I ordered a medium size and it fits me just right. Delivery time was quick too with no delays.",
					"I've bought a number of these T-shirt duos (grey camo & white / navy & black / olive & black). They fit nicely (I'm a UK 12 and bought the medium) and wash well.",
					"I love these -shirts. I have scoop and V neck versions. I am dress size 10/12 but top size 14/16. I ordered size S.\n\nThese t-shirts stretch over an ample bosom without going thin or riding up, they are a good length to hide muffin tops and very soft. I purchased all black versions last year and wore them constantly, they have not shrunk or lost elasticity and only faded slightly, far less than more expensive brands.",
					"Really like these tops the only thing a bit disappointed with is that more clingy than I thought they would be. Overall I am happy in every other respect."
				]
			}
		},
		{
			"id": "5Jwb-3_",
			"title": "Heymiss Womens Shirts Casual Tunic Tops Color Block Crewneck Summer Loose Fitting Workout Tee Shirts",
			"price": "$18.99",
			"image": "https://m.media-amazon.com/images/I/71EYnXmx0MS._AC_UY445_.jpg",
			"description": "Polyester,Spandex,Rayon\nImported\nPull On closure\nMachine Wash\nMaterials: 60% Polyester&35%rayon&5%spandex, casual, lightweight, soft, breathable and comfortable to wear.\nDesigns: Classic crewneck/round neck t shirts, striped on the short sleeve shirts, loose fit tunic tops. This simple shirts is casual, chic and never out of date.\nFeatures: Casual sports style, crew neck tee, color block, short sleeve T-shirt, striped design, loose fit. Basic summer tees for women. Perfect option during various indoor activities and outdoor excursion.\nShow more",
			"reviews": {
				"customerProfileNames": [
					"Jason&Stefanie",
					"Cait",
					"KandyByas",
					"AmyWatts",
					"dbeach",
					"TriciaJoseph",
					"VE",
					"P.Switzer"
				],
				"customerProfilePictures": [
					"https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif"
				],
				"customerRatings": [
					"5.0 out of 5 stars",
					"5.0 out of 5 stars",
					"5.0 out of 5 stars",
					"5.0 out of 5 stars",
					"5.0 out of 5 stars",
					"5.0 out of 5 stars",
					"5.0 out of 5 stars",
					"5.0 out of 5 stars"
				],
				"customerReviewTitles": [
					"Goes with everything",
					"super cute and comfy",
					"great t-shirt",
					"Really comfortable and fits well",
					"Love it",
					"Love this shirt",
					"Comfortable",
					"Fits perfectly!"
				],
				"customerReviewBodies": [
					"This short os super comfortable and goes with so many things! I like that the front is plain because I plan on personalizing it with my cricut machine at a later time when I find a cute quote I like. I am 5’4 145 and I ordered the medium. For me it is the perfect size where it is not too loose or tight. Very versatile and comes in many colors",
					"While this is not a true tunic top, it's very cute and comfortable. After reading the reviews and seeing the sizing chart I measured my bust and ordered an XL, it fits perfectly. I was afraid the sleeves would be way too long, but they are perfect as well. I'm 4'10 and the sleeves hit above my elbows and the shirt covers my butt. It also arrived the next day so I will be ordering more in other colors.",
					"I loved this T-shirt, but it was too big. I am always having to send back clothes because the sizes are never right. Normally, I don't bother reordering, but I'm going to on this T. It was super soft! Just going down a size.",
					"It fits well and feels so soft and comfortable. I would buy this in many colors because it’s a great comfy shirt!",
					"Love this style and fits great. The blue is bright and looks vibrant!",
					"Nice fit. Nice shirt",
					"This shirt is one of the most comfortable I have gotten online. It fits true to size. I would definitely order again.",
					"I love this shirt. It fits perfectly and looks great on!"
				]
			}
		},
		{
			"id": "NSp1ckr",
			"title": "Amazon Essentials Women's Tech Stretch Short-Sleeve V-Neck T-Shirt, Pack of 2",
			"price": "$14.11",
			"image": "https://m.media-amazon.com/images/I/91GvpyYlfEL._AC_UX342_.jpg",
			"description": "Amazon Essentials is focused on creating affordable, high-quality, and long-lasting everyday clothing you can rely on. Our line of women's apparel includes cashmere sweaters, fleece and down jackets, and more, including plus-size options. Our consistent sizing takes the guesswork out of shopping, and each piece is put to the test to maintain the highest standards in quality and comfort.",
			"reviews": {
				"customerProfileNames": [
					"LaurenW.",
					"Jangler",
					"RIGal",
					"LynnK",
					"M.Tait",
					"Courtney",
					"Tina",
					"Debbie"
				],
				"customerProfilePictures": [
					"https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif",
					"https://images-na.ssl-images-amazon.com/images/S/amazon-avatars-global/e4ae37e3-98f9-4d6a-91ae-9736d1491458._CR0,0,500,500_SX48_.jpg"
				],
				"customerRatings": [
					"5.0 out of 5 stars",
					"5.0 out of 5 stars",
					"5.0 out of 5 stars",
					"5.0 out of 5 stars",
					"5.0 out of 5 stars",
					"5.0 out of 5 stars",
					"5.0 out of 5 stars",
					"3.0 out of 5 stars"
				],
				"customerReviewTitles": [
					"I LOOOOOVE THESE!!!",
					"This is a good buy for me",
					"Wow...pleasantly surprised!",
					"I want all the colors! Soft, comfortable, and fit well.",
					"Perfect workout or casual shirt",
					"Runs a little large, good wicking, doesn't lose shape.",
					"Great tech shirts for the price",
					"White shirt is rather see through. Black one was ok."
				],
				"customerReviewBodies": [
					"I bought a medium for a more fitted look. I am 5’3” and 175lbs after recently losing 30lbs. This shirt along with high waisted leggings made me feel so confident and proud of what I’ve accomplished so far! I will definitely be buying more colors and keeping my eye out for a long sleeve version! So comfy to wear every day.",
					"This is a good buy for me. I normaly don't get good results from online clothing purchases but this time I lucked out. The shirt looks like it will stand the test of time. Will see. I may update in a few months. I'm a pear shaped past half century mark woman. T-shirts do not look good on me because of my shape unless it's oversized, then again it makes me look frumpy. This one hides unflattering curves.",
					"I bought the shirts and a couple of different colors to see if I would like them. I am so happy to say they are great shirts. One of the things I like most about them is they are links which for those of us with a bit of a belly it’s great to have something that comes down a little bit lower. These are true to size and a looser fit I’m normally a size 14 to 16 and ordered the XL‘s to have some room to move in. I find many of the athletic shirts are slim fit and a little too snug. These are great quality, A good length, and are a great fit over all! Highly recommend!",
					"Great dry-wick shirts! Perfect for everyday casual wear. They feel really soft and comfortable. I’m typically a size small and ordered a small. They fit well, a little looser than some small shirts, but I’m happy about that. I didn’t want something skin tight. They are pretty straight cut which is perfect for me since I’ve never had tons of curves and shirts that flare at the waist always look ridiculous on me. For reference, I’m 5’7”, 128 lbs.",
					"I swear these come from the same manufacturer as Under Armour - the fit, color and design are nearly identical. These are the BEST work out shirts ever - not too tight, perfect length. I will be buying all of the colors.",
					"I'm 5'8\" 170lbs and usually wear a size 12 in bottoms, or M/L in tops. Got this in both medium and large sizes: M is fitted and would show any muffin top, the large is loose but not baggy. The v-neck is a modest cut, which was perfect for the conservative culture in SE Asia. The shirts are soft and kept me feeling great in 90 degree 70% humidity days.",
					"I",
					"This 2 pack had one solid white shirt and one solid black shirt. They were a Large size and fit about like I expected, though a bit on the larger side of that. I'm 5'4\" and the hem reached low enough cover a lower-cut waistline when you bend over. The black shirt is sufficiently modest, but the white one is fairly see through. It'd probably be okay with a white sports bra, but it still reveals more than I care to show. The stitching was neat. The material is 94% polyester, 6% % elastane. Made in China.\n\nCare instructions: machine wash cold with like colors. Gentle cycle. Use non-chlorine bleach when needed. Tumble dry low. Cool iron when needed.",
					"These are great value technical Ts. Lovely soft feel and drape. Machine washable AND you can put them in the tumble dryer unlike lots of technical wear (ideal if long term travelling) though I doubt they would take long to air dry. They do come up rather large. I am size 16/18 on top and ordered an XL, but the L would have sufficed.",
					"I first purchased these T Shirts in size S and returned them for XS because they were so large. The problem is in the sewing. The orchid colour has too much fabric on one side of the neck and it is poorly stitched on top. The navy colour's neck is not centre. It's too bad because I like the fabric and style.",
					"Liked these tops, ordered a small I’m normally a size 10 but I could have gone XS as a little loose round the tummy area however I have bigger boobs so fitted well. Only brought to lounge round the house in for comfort and they are perfect. Don’t think of use them for the gym as the material tends to make you sweat a little. I prefer vests to workout tho.\nWashed a few times and they seem to wash well so far.\nI would recommend for the price.",
					"Ordered two of these tee shirts as i likes the fact that they looked longer in length. From that point of view they are great as they are not too long - but do come to the hips which is what i wanred. The material is light & feels quite cool and comfortable to wear. The only negative thing for me is that they are rather clingy so they do show every lump and bump, especially around my stomach, so not very flattering. They will be ok under a jacket though.",
					"I love these so much snd have a dozen or more of them. They were unavailable for a lung time snd I am replenishing my stock now that they are back. I use them for yoga and Pilates so they are constantly washed without losing their shape.\nThey are nice enough to use for normal wear snd have been great during lockdown with leggings. Don’t need ironing and dry very quickly."
				]
			}
		},
		{
			"id": "_e0M1Ea",
			"title": "Women's Sunflower Summer T Shirt Plus Size Loose Blouse Tops Girl Short Sleeve Graphic Casual Tees",
			"price": "$21.99",
			"image": "https://m.media-amazon.com/images/I/618m05bNSJL._AC_UX385_.jpg",
			"description": "65% Cotton, 35% Polyester\nImported\nPull On closure\nMachine Wash\n🌼【Premium Fabrics】This summer sunflower graphic tops for women is made of high-quality material. Soft and smooth. 65% Cotton, 35% Polyester t-shirt. Comfortable and has a good stretch. Comfy sunflower printed tee tops, novelty funny sunflower shirts top women.Soft fabric with a little stretchy, breathable to wear. It's not only light but also absorbs sweat.\n🌼【Design】Sunflower shirts for women. Unique and cute design.Classic round neck design tee, short sleeves shirts. Women's camping graphic T-shirt is simple but energetic, show your charm. Basic tees with front sunflower print decoration, you will love it.\n🌼【Occasion】This sunflower blouse shirt for women are very suitable for any occasion, especially for dating, shopping, work, school, beach, vacation holiday, traveling, parties, concert, sports, coffee cafe, gym, etc. Perfect gift for Mother’s Day, Birthday, Carnival，Anniversary, Graduation, Valentine's Day, Halloween , Thanksgiving, Christmas, New Year, etc. These funny letter tops are suitable for giving your lover or female friends around, they will really like them.\nShow more",
			"reviews": {
				"customerProfileNames": [
					"Lori",
					"CynthiaC.Grimm",
					"ToriC.",
					"Linda",
					"Nicole",
					"EricaRose",
					"ShellyP.",
					"Brendan"
				],
				"customerProfilePictures": [
					"https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif"
				],
				"customerRatings": [
					"3.0 out of 5 stars",
					"5.0 out of 5 stars",
					"5.0 out of 5 stars",
					"5.0 out of 5 stars",
					"5.0 out of 5 stars",
					"5.0 out of 5 stars",
					"5.0 out of 5 stars",
					"5.0 out of 5 stars"
				],
				"customerReviewTitles": [
					"Order up a size",
					"Not over-sized",
					"Soft, soft, soft.",
					"Nice T-shirt",
					"Great shirt",
					"Love love love!!!",
					"Soft and comfy!",
					"MUST WANT BURGUNDY"
				],
				"customerReviewBodies": [
					"The shirt I received does not look as described. The color is supposed to be purple, and the picture is a true purple, which is what I wanted. But the shirt I got is a soft heathered purple. Also, the shirt as shown has the sleeves rolled. The shirt I got doesn't look at all the same when I try to roll them. The sleeves end up small and tight. I normally wear a medium, but a medium in this shirt is too fitted. I would order up a size if you want it to look like the pictures.",
					"I'm between a M and a L. I ordered a M thinking it was over-sized. It's not. I'm going to exchange for a L. Hope this helps!",
					"I love this t-shirt. It is such a soft fabric and it washed well. I hung it to dry, as I do all my tops. No wrinkles and it kept its shape. Planning to order more.\n\nFit as expected and was true to the color depicted.. I’m in-between a L and Xl and ordered XL for a bit more room.",
					"Cute, soft, and stretchy shirt. Im 5’4” height and 160lbs. Ordered a large to get that loose look.",
					"This shirt is a nice weight. Not too thin. Super soft. Good stretch. I usually wear a medium and that’s what ordered. Fits perfectly. Would buy again.",
					"Absolutely love this shirt. It looks exactly like the picture. I bought my normal size and the fit is right on. For reference, I’m 5’2”, 145lbs and bought a medium. The color is absolutely beautiful.",
					"I love this shirt. The color is great and the material is soft and comfortable. Definitely recommend!",
					"Very nice T-shirt but the color was much more burgundy than I expected. I was after more of a red color. I took a chance that it was not quite as dark and lost. And this is why I love being a prime member. If it doesn't work you can send it back. It truly is a lovely tee..."
				]
			}
		},
		{
			"id": "UKhEydb",
			"title": "Under Armour Women's Tech Short Sleeve V-neck - Twist",
			"price": "$14.99",
			"image": "https://m.media-amazon.com/images/I/71j1ZlkQR0L._AC_UX385_.jpg",
			"description": "UA Tech™ fabric is quick-drying, ultra-soft & has a more natural feel. Material wicks sweat & dries really fast. Anti-odor technology is a superlative innovation which helps prevents odor. Deep V-neck collar. All-over twist effect",
			"reviews": {
				"customerProfileNames": [
					"KristinB.",
					"AndreaB.",
					"Holly",
					"Elen",
					"BrandyWortham",
					"KramerLois",
					"Bev",
					"Dealinthebag"
				],
				"customerProfilePictures": [
					"https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif",
					"https://images-na.ssl-images-amazon.com/images/S/amazon-avatars-global/6e3057ab-ac28-4ef1-9b3c-0a68933bd750._CR0,79.0,843,843_SX48_.jpg",
					"https://images-na.ssl-images-amazon.com/images/S/amazon-avatars-global/c5d3ffaa-4c4d-4d3a-9b9a-6288bafcfae6._CR0,0,500,500_SX48_.jpg",
					"https://images-na.ssl-images-amazon.com/images/S/amazon-avatars/default._CR0,0,1024,1024_SX48_.png"
				],
				"customerRatings": [
					"5.0 out of 5 stars",
					"1.0 out of 5 stars",
					"5.0 out of 5 stars",
					"5.0 out of 5 stars",
					"4.0 out of 5 stars",
					"5.0 out of 5 stars",
					"5.0 out of 5 stars",
					"5.0 out of 5 stars"
				],
				"customerReviewTitles": [
					"These Shirts are Perfect for Working Out and For Everyday Wear!",
					"Low quality knockoff?",
					"Loooove it!",
					"Great shirt for runs and workouts",
					"Comfy..",
					"Comfortable and attractive",
					"Perfect everyday shirt, they last forever.",
					"Great fit and ease of mobility. Looks good, too!"
				],
				"customerReviewBodies": [
					"Last year, I bought a number of Under Armour clothing and since then, Under Armour has become my favorite workout clothing brand! I love the quality of the clothes, color selection, and how they are designed to keep you cool (or warm, depending on the line). I decided to get some more workout shirts this year and wanted to try some with a pattern rather than just the solid shirts, since I have some of those already. I didn't have any of the Twist Tech shirts and decided to give them a try.\n\nThis Under Armour Twist Tech shirt is part of Under Armour's HeatGear line, which is designed to keep you cool in warm weather. This shirt is considered a LOOSE fit, which means you will most likely want to purchase a smaller size for a more comfortable fit. The shirt has a flattering V-neck cut and has a twisted, or heathered, pattern that makes it different than a solid color shirt. These shirts are made in Jordan of 100% polyester. Washing instructions say to wash with similar colors. I always put these in the washing machine on a normal cycle, hang them up to dry, and I've never had a problem with shrinking.\n\nI initially purchased one of these shirts to make sure I had the right size and loved it so much I ordered two more! For size reference, I am 5'6\", 165 pounds, with a 36D chest and some extra belly fat from my twin pregnancy and I purchased a medium. I typically wear a medium or large in shirts and, since this shirt is a loose fit, I went with the medium and it fits perfectly! These shirts are so comfortable and I wear them a lot for working out. They keep me as cool and dry as possible (of course, I still sweat). They wash up well and I am also able to wear them for everyday wear with yoga pants. My mom is in her early 60s and wears these shirts for everyday wear, along with under her scrubs for work. She loves them as much as I do and wants to get some more! The fit is nice and comes down to the top of my rear, which is just how I like. I purchased the colors Pink Shock/Metallic Silver, Mediterranean/Metallic Silver, and Absinthe Green/Metallic Silver and I'm considering purchasing a couple more.\n\nI love these shirts and feel they are great for working out or for everyday wear. Please note, this shirt is a LOOSE fit so you will want to purchase a smaller size for a more flattering fit. I'd say if you have two sizes of shirts you normally wear, purchase the smaller size for this shirt. The shirt is nice enough to wear in public and I also purchased ",
					" so I could color-coordinate with my shirts. I love these shirts and highly recommend them!",
					"E",
					"I’ll be ordering more of these! :) super comfy! Nice and loose so you can breathe. The V neck is not too low, the fabric is soft and light. I thought it would be see-through holding it up but it’s not at all. I have a little belly so shirts like these are usually not flattering at all on me. This one hangs just right! I’m so happy with this purchase.",
					"I recently started running (been a bit over 2 months) and I purchase more and more appropriate clothing. I came across this one and really liked the look and the price so decided to try it out. I am about 165 Ibs (75 kg) and 5'2\"(158 cm) and the medium size first me very well.\n\nThe shirt is very lightweight and comfortable. It doesn’t take in much sweat and dries out fairly quickly, which is very handy with my hour long exercise sessions. I owe a gray one, and it is not transparent at all.\n\nI have had this shirt for a bit over 3 weeks, absolutely love it and workout with it almost every day. So far I have no complaints at all, but will update if I get any! Absolutely recommend!",
					"I",
					"Bought for working out as I needed some \"new generation\" wicking technology and my other shirts are a few years old. I itch profusely if sweat remains on my skin but was hoping I wouldn't have to spend $50 per shirt. I did not and I'm very happy. They can also run errands as they're a flattering cut, length, and thickness.",
					"I personally love Under Armor shirts. I wear these almost everyday. In the winter under long sleeve shirts for extra warmth and in the summer to keep cool. I am 5’3”, 128lbs, size large. I like shirts a little loose and the fit is perfect.",
					"Excellent and comfortable for working out. I'm usually a medium and it fits perfectly. I'm 5'2\" 139 pounds. I don't like my shirts tight... I HATE the feeling that my shoulder joint is constricted. Or having the shirt tight against my serratus anterior region or having the shirt ride up my armpits. This shirt is perfect for working out. I have two of these in different colors and a couple of other brands, too. This is my favorite.",
					"I ordered this top as I was looking for one of the same colour in the image advertised. It arrived today, and the colour is bright shocking orange, day-glo, or luminous. . It looks so bright I had to squint my eyes slightly when looking at it. It is nothing like the colour in the image. It is however a lovely top in that it feels sooo comfortable to wear. It is light, and would be perfect for when running, at the gym, yoga or even when walking in the warm weather. It is not tight fitting, and is quite loose, slightly longer so mostly covered my behind, which is a good thing! It is just a shame that the colour is overwhelmingly bright.",
					"I like the colour and the fact that the material dries so quickly but the cut is a little too loose for my liking. The shirt looks like it is too big when it actually isn't. It also makes me feel like I have to watch it when playing as I feel it moves with me when I jump or have my arms in the air. I don't know if it actually does but I much prefer Under Armour's fitted cut t-shirts as they sit a bit more securely on me.",
					"I have several UA tops in various styles and colours, they are always of excellent quality, are light and comfortable to wear, wash beautifully and dry really quickly.\nThis particular top does not disappoint; nice colour, a slightly roomier fit than some other styles. Perfect for walking the dogs, hiking, gardening etc.\nhighly recommend 👍🏼",
					"This top is quite a loose fit. Not a complaint, just thought people might want to know. The material feels soft but very polyester-y and even though it is very very thin, it makes me sweat a bit more than with the more cotton like tops. It looks just like the picture and it's very silky. Not my cup of tea but if you like very light tops and loose fitting this might be your thing.",
					"I did get the small, even though I am usually a medium size 10, and the small fits so comfortably. Someone said it might be tight around the arms, but it isn't at all for me. I chose the small because I wanted a tight fit, and I have to admit that it is somewhat a bit loose still, but I'm not bothered by that. Really soft and light material!"
				]
			}
		},
		{
			"id": "UOXbPB-",
			"title": "Made By Johnny Women's Solid Short Sleeve Boat Neck V Neck Dolman Top with Side Shirring",
			"price": "$18.75",
			"image": "https://m.media-amazon.com/images/I/71z3kpMAYsL._AC_UX342_.jpg",
			"description": "95% Rayon, 5% Spandex\nMade in U.S.A. or Imported.\nDo Not Bleach\nLightweight fabric with great stretch for comfort\nRibbed on sleeves and neckline / Double stitching on bottom hem\nElastic shirring details at sides / Fit and flare fit\nHAND WASH IN COLD WATER / DO NOT BLEACH / LAY FLAT TO DRY / DRY CLEAN IF NEEDED\nPlease check the size chart below to ensure your order / Color Disclaimer : Due to monitor settings, monitor pixel definitions, we cannot guarantee that the color you see on your screen as an exact color of the product. We strive to make our colors as accurate as possible. however, colors are approximations of actual colors.",
			"reviews": {
				"customerProfileNames": [
					"AlwaysHonest!",
					"LeticiaMadrigal",
					"DNJMiller",
					"Rachael",
					"Helena",
					"jennifer",
					"kate",
					"LisaLD"
				],
				"customerProfilePictures": [
					"https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif",
					"https://images-na.ssl-images-amazon.com/images/S/amazon-avatars-global/a2cb4dec-ad3d-4591-8510-363cbc95b1a8._CR62,0,375,375_SX48_.jpg",
					"https://images-na.ssl-images-amazon.com/images/I/41CQSclPa1L._CR62,0,375,375_SX48_.jpg"
				],
				"customerRatings": [
					"5.0 out of 5 stars",
					"5.0 out of 5 stars",
					"5.0 out of 5 stars",
					"5.0 out of 5 stars",
					"5.0 out of 5 stars",
					"4.0 out of 5 stars",
					"5.0 out of 5 stars",
					"5.0 out of 5 stars"
				],
				"customerReviewTitles": [
					"XXL - Great top - Hopefully this helps with your sizing questions",
					"Love this COZY top!",
					"Pleasantly surprised!",
					"Comfortable and light shirt.",
					"Hourglass! Finally!",
					"Great shirt but color was off",
					"Love the shirt",
					"They are comfortable tops, perfect for summer or hot climates (I ..."
				],
				"customerReviewBodies": [
					"LOVE this top. For those with sizing questions, I hope this helps. I ordered the XXL size. I am 5'4\", 204 lbs., 42C. I usually wear an XL or 0X. With that being said, this top fits great on the upper part, however, please know that if you have a \"spare tire\" around the middle, this top will accentuate this part of your body. I loved the sleeve length for those who have heavier upper arms and the arm holes are large enough to accommodate heavier arms. The v-neck is respectable and not too low whatsoever. This top is somewhat longer but does bunch up at the bottom which of course it is intended to do. It does narrow greatly at the bottom so the material does cling to mid portion of your waistline so if you have larger tummy area or spare tire, it will show more. The top is not very see through at all so you do not have to wear a cami under it if you don't want to. I do hope this helps those with sizing questions like I did when I ordered it. Great summer top!",
					"Wanted something professional enough to wear during online teaching yet comfortable enough to hide COVID weight. I carry my weight in my belly, have always had curvy hips & a round bottom. If you do not want to draw attention to the belly, this top tapers at that spot but shirring helps hide it a bit. Material is stretchy. I am a 36C & bought a large. Fits PERFECTLY! Has plenty of space on top if you are a bit bustier.",
					"Ordered this shirt to wear for Christmas Eve. It was packaged nicely. I tried it on straight out of the bag and it looks great. Material is soft and nice and the style is flattering. I ordered a medium and I’m 147lbs, 5’ 6” and it fit perfectly. I orders the wine color for something different but I like this so much I may order another color! Liked that the company was out of The USA. I submitted pictures to help ppl. I know it’s hard shopping for clothes online.",
					"I am overweight and I am 330 lbs and 5'2 if that helps anyone. I got 4x size.I know there is not many reviews where people are my size and try and buy clothes. I am pretty happy with these shirts. I got three colors. The sleeves are even better then I expected, sometimes I feel shirts will have tiny sleeves and these were just how I would like them to be. The shirt is long and can cover my butt when I wear leggings too. The shirt does cling to my belly but I just do have a big belly I guess, I carry most of my weight there. The shirt is still very comfortable and breathable. Its light and I like that because I live in very hot weather. I am very happy with these and I am glad I chose these tops because I spent a very very long time deciding on what ones to buy.",
					"Ladies if you’re an hourglass shape this is for you, and for those of you who aren’t well this would probably give that illusion. And size down! I am 5’8, 170+ lbs, 40-32-46. I usually get a L tops but decided to go with M (I don’t remember why lol) and IT’S PERFECT. Fitted and sooooo soft and stretchy that it hugs all the curves. Usually if I find a top that fits in the waist it’s too tight on the hips, or fits on hips but sags around waist. This is PERFECT and super flattering. I’d say even for non hourglass shapes it would still stretch in just the right places. Lengthwise it hits below hips and I’m on the tall side. Looks super with leggings. Material is not heavy, I got purple but light colors might be a bit see thru. I’m in love and I’m ordering more.",
					"I bought the grey one in large. I'm a size 10 and a large chest and it fit perfectly. I ordered the heather grey but when it arrives it was much lighter than expected. The fabric is clingy and unforgiving if you have curves or bumps you don't like pointed out, I recommend a darker shirt. I thought this one was darker so that is why I bought it.",
					"Love the shirt, I normally wear a large (for reference in 150# 5'4\", large bust with broad back) and this large is on the big size. There is a tag on inside that Says \"xxl\" while tag on back of neck says large. I don't know if this is meaningful or not, but I think it runs a little big (which I'm ok with, very forgiving to the extra weight I carry around in my stomach and upper body.",
					"I got this in a XXL in a few colors. The material of these tops are light and airy. They are comfortable tops, perfect for summer or hot climates (I have summer year round). I'm 5ft 11\" and wear 42DD and find this top adequately roomy in the bust area. It also falls great at the waist with enough material to sit above the hips or below if that's what you prefer. I do wish that I had bought a few of my tops in a XXXL so that it would have fall off the shoulders a bit. I found the sizing in all 13 of the tops that I bought to be the same. Whether I wear these casual with jeans or dressy casual, this is a great top.",
					"I love how soft this shirt is. Size up though it looks room but I could of used a smidge more. I am wearing it but slightly larger size would of been awesome.",
					"I bought the dark grey in Xl I am 145 pounds with a mum tum this shirt far exceeded my expectations . I bought larger as I didn’t want the bottom of the shirt too tight and I wanted the top portion to be looser. It fit exactly as expected and is very flattering. The material is lightweight enough for summer but the quality is slightly weighted. Super comfortable and will buy more colours!",
					"I. Love. This. Top.\nI'm ordering more.\nI cannot get over how sleek it feels, how comfortable it is, how perfectly it fits.\nThis drapes those curves in such a flattering way. If you're looking at this shirt, go ahead and put a few in your cart!",
					"Il est parfait et de la bonne taille, mais la teinture n'est pas égale et on peu clairement voir les bande plus claire et inégale. Je l'ai essayé de soir et n'ai pas remarqué jusqu'à me retrouver à la lumière du jour. La date pour les retours étant passé depuis longtemps, je ne pouvais plus le retourner. Extrêmement dessus pour le prix payé. Ne pas acheter.",
					"",
					"Au premier lavage, des taches sont apparues ,comme des taches que du javel aurait pu faire, mais je n'utilise JAMAIS de javélisant. Problème de teinture du tissu? je ne le retournerai pas, car on dirait presque du Tie-Dye ,et je le porterai quand même ,mais je suis déçue. Le modèle est très confortable, et beau, et j'aurais commandé une autre couleur, mais la j'hésite...\nUne étoile a cause de la décoloration, sinon ce serait 5.",
					""
				]
			}
		},
		{
			"id": "6NmCiFz",
			"title": "Hanes Women’s Perfect-T Short Sleeve T-shirt",
			"price": "$6.24",
			"image": "https://m.media-amazon.com/images/I/713MSgKc5BL._AC_UX385_.jpg",
			"description": "This Hanes Nano t-shirt for women is so light and soft you'll fall in love with it. Ultra-light 100 percent ring-spun cotton jersey feels great on your skin and drapes beautifully.",
			"reviews": {
				"customerProfileNames": [
					"FamilyFirst",
					"Nancy",
					"Jeri",
					"Allison",
					"SallyJ.VoorheisBrunner",
					"Customer",
					"ML-L",
					"MariahNicole"
				],
				"customerProfilePictures": [
					"https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif",
					"https://images-na.ssl-images-amazon.com/images/S/amazon-avatars-global/d87a0ff6-d87a-464e-b922-61a4fce6fbc7._CR90,0,540,540_SX48_.jpg"
				],
				"customerRatings": [
					"5.0 out of 5 stars",
					"3.0 out of 5 stars",
					"5.0 out of 5 stars",
					"3.0 out of 5 stars",
					"5.0 out of 5 stars",
					"3.0 out of 5 stars",
					"1.0 out of 5 stars",
					"5.0 out of 5 stars"
				],
				"customerReviewTitles": [
					"Great for HOT BLOODED ladies. Look great without looking over heated!",
					"CURVY GIRLS PLEASE READ.",
					"PERFECT T SHIRT",
					"Shrunk after first use",
					"white t shirt transfomation",
					"Decent tee, not worth the price when purchased in bulk",
					"Cheap, see-through. Has cap sleeves not full sized sleeves.",
					"Very nice! Perfect!"
				],
				"customerReviewBodies": [
					"Check out Grandma in her Women's T-shirt. She's rockin it and Grandpa's loving it! Grandma is shown wearing a large. I ordered her normal size to make sure that Grandma was comfortable in her shirt. She was and she loved it!\n\nThis turned out to be a very nice womanly fit. Not a snug fitting junior style, but shorter sleeves and some curve to it, it's a nice fitting t-shirt without out it looking manly! Soft, nicely fitting t-shirts. I ordered multiple sizes in these shirts for multiple people and they fit as expected. I had pre-washed them and then put iron-on vinyl and tie-dyed them. No major shrinkage in the wash, no fading or bleeding since they've been tie-dyed. They are great.\nThese shirts arrived as expected.\nMy favorite quality is that these shirts REALLY ARE BREATHABLE. They do wear cooler than most cotton t-shirt. I put it on not expecting a large difference, but it's there. And for a mama bear that gets HOT.....this is a great t-shirt!\nThey are reasonably soft (about a 8 on the scale of 1-10)\nSoftly shaped womanly fit\nNice round neckline\nCrisp clean color.\nNo off-white yellow color.\nI'd order them again.",
					"I am 5'5, 38D and 180 pounds with an hourglass body. My hips are much wider in compared to my waist. I usually stick to a large in any women's top and it always works out. However, I am disappointed in this. First off, the chest fits more tightly than a t shirt should. The hip area is VERY form fitting. Overall, I would suggest to size up at least one size if you have a curvy body.\n\nAlso, let's talk material. It's NOT soft at all. Do not listen to any reviews here. I'll save you the time. You are paying for a $5 HANES t-shirt. The quality won't be great, so don't expect it to hold up after 1-2 washes.\n\nOverall? Sending back my tees I ordered. You can go to much better stores, even Target's Universal Thread for a $5 tee with much softer material.",
					"This top had a beautiful fit, easy to wash, affordable and felt like it was made out of quality material, not cheap and see through. I will be getting more in other colors. I am busty and ordered a medium, you can use pictures for reference (38 C). Very flattering. I would not consider this stretchy so please check your sizing and measurements though it does have some stretch, not much of you are in between sizes.",
					"Shrunk after first use. So I turned it into a baby tee. Otherwise, shirt quality is nice and softcrew neck is a little high. If you’re wondering, it shrunk up NOT in. Purchased size small, I’m 5’5”.",
					"I tye dyed this t for a friend. 100% cotton. looks great!",
					"I purchased ten of these shirts after trying various other brands of women's bulk tee shirts and being disappointed. Due to the fact that these are sold individually, my costs were higher than I would have preferred, but I assumed based on the pictures that this would be worth it. These tee shirts are not as pictured. In the photo of the white tee it looks like it is made of a thicker fabric than ordinary tee shirts, and this is why I purchased them. However, these shirts are as thin as any other cheap tee shirt that you might find out there, which I know because I have purchased several kinds of those shirts while trying to find something thicker. The white shirt is transparent to the point of being inappropriate when worn alone and would need to be worn as a layer. That said, there are several redeeming qualities for this shirt. The first is that they make an excellent undershirt and are very thin and breathable for that purpose. The second is that they are cut as a woman's tee shirt rather than a man's and this makes a big difference. Overall, I would say that this is an okay tee shirt, but probably not worth the money if you are buying them in bulk.",
					"Cheap, see-through. Has cap sleeves not full sized sleeves. Returned it same day I got it.",
					"This shirt was exactly what I'd expect, but it was too big for me. I ordered a large, but now I am returning it for a medium. Its a nice thick tee shirt (not see through at all). Perfect length, 100% cotton, and casual. I highly reccomend.",
					"The listing for the shirts says that it’s 100% cotton but it isn’t. It’s misleading to write that in the description when that’s not the case for every colour. I purchased this shirt specifically for that reason. I also have the shirt in white and that one is 100% cotton.\n\nI bought both shirts in a medium size and it fits on the smaller side. I’m normally a size small to medium. If you’re looking for a more relaxed fit I would go up two sizes",
					"Fit well initially, but after washing in warm and warm tumble drying, it shrunk. A lot. Thought it being preshrunk would minimize the shrinking, but it still shrunk a ton. I would suggest ordering one or even two sizes up. We bought the shirts for tie dying (which worked great for that!) but sadly, they don’t fit the way they were intended :( The quality of the shirts is great though - they’re not cheap or thin. Would buy again, just would order bigger :)",
					"Nice basic Tshirt, very soft and brilliant colour. Mine has no tag but instead has it printed on the inside of the shirt.\nI'm nowhere near a size 12-14 (L) but got it in large because I like my T's loose. So if your like me, order a size or even two up as they are on the small side and I'm sure it'll shrink in the wash. Happy with purchase.",
					"La blusa es bonita y cómoda pero vine demasiado grande. La talla mediana bien le queda a una persona que usa talla grande. Si no te gustan las blusas demasiado holgadas sino más justas al cuerpo (no entalladas sino talla normal), te sugiero pedir una talla menos porque sí vienen muy grandes.",
					"",
					"A"
				]
			}
		},
		{
			"id": "Pb5A2Hx",
			"title": "MIHOLL Women's Short Sleeve V-Neck Shirts Loose Casual Tee T-Shirt",
			"price": "$9.99",
			"image": "https://m.media-amazon.com/images/I/81GNOK-KwGL._AC_UX342_.jpg",
			"description": "Cotton+Polyester\n进口\nPull On closure\nMachine Wash\nGood quality. The fabric is soft and comfortable wear, We accept 30 days money back!\nSexy V Neck tees, Short sleeve T-shirt, Plain, roll sleeve, Basic tees with front pocket decoration, So cute tops\nLoose fit shirts. You can Pair this basic tops under a jacket, with jeans, leggings or a skirt in spring, summer, fall and winter. A wardrobe must-have!\nShow more",
			"reviews": {
				"customerProfileNames": [
					"Meema21",
					"G",
					"Gunda",
					"RachelCuocco",
					"JoniWauhop",
					"CLS",
					"MKM",
					"KindleCustomer"
				],
				"customerProfilePictures": [
					"https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif",
					"https://images-na.ssl-images-amazon.com/images/S/amazon-avatars-global/661b767b-6498-493d-94e8-92a270e6f75a._CR0,0,375,375_SX48_.jpg",
					"https://images-na.ssl-images-amazon.com/images/S/amazon-avatars-global/f54fc21e-3ffc-4443-aa0c-1986cb8abe69._CR0,0,500,500_SX48_.jpg"
				],
				"customerRatings": [
					"4.0 out of 5 stars",
					"5.0 out of 5 stars",
					"5.0 out of 5 stars",
					"5.0 out of 5 stars",
					"4.0 out of 5 stars",
					"5.0 out of 5 stars",
					"3.0 out of 5 stars",
					"5.0 out of 5 stars"
				],
				"customerReviewTitles": [
					"Ok, not really worth the price",
					"Order up one size. If you want a little more room.",
					"Green, red, yellow ... Want them all",
					"Cute and comfy shirt, buying more colors!",
					"Plus size review -size up!",
					"Sizing help for this nice soft shirt.",
					"Color isn't quite right",
					"Great White T-shirt!"
				],
				"customerReviewBodies": [
					"Nice loose/oversized fit. More see through than I expected. Haven’t decided if I’m going to keep it considering it’s pretty expensive for a white t-shirt...",
					"I like the material and the sleeves add an interesting detail. It covers my arms just at the right place. I love the v neck style of this shirt. I stayed true to size which was perfect but I also could go up a size and be ok with that. If your size is not Available try sizing up. I would not size down though",
					"That picture doesn't do this shirt justice. Ive brought tons of these \"throw \" on and go type of shirts but this shirt is so beyond comfortable and soft. It fit beautiful and has this posh look to it because of the cuffed sleeves. I so want another bright color for summer but sadly the medium option only has select colors. Fit greats... I'm 5' 5 and 140 and a medium fit great!!!!",
					"Very happy with this shirt. The color matched the Picture. It’s great when tucked in some like the picture model which is how I wear my shirts so this is perfect , but it’s not very shapely when left untucked. The shirt feels soft and comfortable with a nice thickness. I will be ordering more of different colors. Im 5’6 and 130 ordered a small and it’s perfect!",
					"I am plus size, a true XL/16. I love the Luxe shirts from old navy and this is very similar to that in feel. Size up one if you want it loose like that model wears, I ordered a XXL even tho I typically wear XL and it fits perfectly. Loose enough for a front tuck, hides my mom pooch and lumps but can also wear untucked and not look huge. 10/10 would recommend for bigger gals like myself. It’s always hard to tell when the models are a size 2 but I can say this was a great buy, and I now have this T-shirt in 5 colors.\nMy only negative is that I ordered it in black recently and it is not the same as my other 4. The fabric is not super soft and slinky and the black one came almost 2” shorter than the tie dye one I ordered at the same time. (See review pic) It’s definitely not the same soft forgiving fabric. So I will return and try it again- obviously some quality control issues there. But if you get the correct soft slinky material you’ll love it!! I intend on ordering more! They are very flattering on my plus size body- but size up!",
					"I read through the reviews before buying but I couldn't get a definitive answer to sizing since some said to size up and some said to size down so hopefully this will help. I'm 5'8\", 150lbs and my measurements are approximately 37-30-40. I wear size 8 to10 in jeans. I normally buy Small or Medium tops so I ordered a Medium in this and it's pretty much perfect, like on the model. I don't like tight fits at all or baggy, just neat looking. The length hits at the bottom of my butt which is good for leggings as others have mentioned and it is also cute knotted at the bottom. It is well made and soft. I ordered the dark gray which the tag says is 95%cotton and 5% spandex, hand wash and hang dry. After washing I throw it in the dryer for 5 minutes to remove wrinkles and then hang dry. Works like a charm. I hope this helps.",
					"I live the shirt! Great fit, great cut. However. Let's talk about the color. Green, is apparently coffee fit army green. Please see photo.\nI'm not apposed to army, so I keeping the shirt. I definitely would've preferred the green captured in the actual photo of product being sold.",
					"Just got this tee yesterday and I love it! It's super soft and fits perfect. I am 5'11\" and a size (10) medium. I ordered the medium and the shirt fits true to size. It is not, however, as big and loose as shown in the picture. That's not to say it is a fitted shirt either. It is loose, just not as much as shown in the picture. I think if you want the look shown in the picture order one size up. This is a very well made shirt.",
					"This took a long time to arrive and the seller gave me the run around for a while. It finally arrived and I hate it, but, of course, cannot return it. The material is a polyester and spandex blend that feels gross. The fit is not flattering if you have any bumps largely due to the material used and cut. I will be cutting this shirt into strips and using the material to tie up my vegetables as it is good for nothing else (not even as a dishrag). Extremely disappointed, but it is my fault as I should have double-checked the return policy. I will never take a chance on this seller again.",
					"These are ridiculously large. The large is for size 18. I usually get women’s large as I’m a 10. Size down at least one size. I know they are supposed to be loose fit but the shirt has no shape to it. It is very boxy. The colors are pretty though.",
					"The shirt is not supposed to be tight-fitting, it is supposed to drape a little, so the sizing is absolutely perfect in my opinion!\nGreat quality and is perfect for a good mix of casual and dressy (great for casual Fridays at the office… whenever/if we go back, lol)",
					"I was hoping this was going to be a nice t-shirt, but the fit and quality didn't impress me that much. I wasn't fond of the feel of the fabric. I'm using it as a gardening t-shirt now.",
					"Zero quality control went into the production of this product. Stitch lines do not line up threads and basting stitches hanging out. Material sewed at stretched angles. Poor, poor quality. Company would not accept product return only 10% discount. Quality is so poor I will never wear it. Item has been donated."
				]
			}
		},
		{
			"id": "1v930Gr",
			"title": "LEANI Women’s Short Sleeve T Shirts Crewneck Striped Color Block Tunic Tops Loose Casual Summer Tee",
			"price": "$16.99",
			"image": "https://m.media-amazon.com/images/I/718dUiHmLXL._AC_UY445_.jpg",
			"description": "60% Polyester, 35% Rayon, 5% Spandex\nPull On closure\nMachine Wash\nSoft Material: This short sleeve top is made of 60% Polyester+35% Rayon+5% Spandex, lightweight, stretchy, breathable and skin friendly\nUnique Design: Round neck, short sleeves, basic tops with stripes on the front, color block, curved hemline, loose fit tshirts, tunic length, casual; This summer tee is easy to pair with jeans, shorts, leggings, sandals, heels or wedges for a simple and stylish look\nOccasion: The casual loose shirts are suitable for daily wear, work, shopping, party, vacation and date, etc; Great for ladies and teen girls to wear in spring, summer and autumn\nSize Guide: S=US 4-6, M=US 8-10, L=US 12-14, XL=US 16, please check the size chart before ordering, we accept 30 days money back!\nGarment Care: Machine washable with laundry bag, using mild gentle soap, please do not bleach.",
			"reviews": {
				"customerProfileNames": [
					"CourtneyLefler",
					"KarenJ",
					"NormaDiljak",
					"RideRed",
					"JulieAnn",
					"Kellie",
					"Customer",
					"Kimking"
				],
				"customerProfilePictures": [
					"https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif"
				],
				"customerRatings": [
					"5.0 out of 5 stars",
					"5.0 out of 5 stars",
					"5.0 out of 5 stars",
					"5.0 out of 5 stars",
					"5.0 out of 5 stars",
					"5.0 out of 5 stars",
					"5.0 out of 5 stars",
					"5.0 out of 5 stars"
				],
				"customerReviewTitles": [
					"Fits a little big",
					"Comfortable",
					"it's a great tee",
					"Great shirt.",
					"Nice tee shirt",
					"Cute and comfortable!",
					"Nice Shirt",
					"That the products is worth the buy"
				],
				"customerReviewBodies": [
					"5’3 and 120 pounds. The small was pretty baggy still, but the material is so soft and comfortable. Would buy again",
					"Nice soft shirt, comfortable for casual wear. I’m 5’2”/125 and it’s a little big but nothing major.",
					"this tee shirt is soft, lays nice and feels great. washes well",
					"Love the fit and softness of this shirt.",
					"Love this tee! Material is soft, fits me well. I usually wear medium but based on recommendations I got a large and I’m glad I did because it fits in the bust area and is not tight.",
					"Very comfortable! The fit was true to size. I’m tall (5’9) and it was the perfect length. Cute top!",
					"I love this shirt. It is very soft and fits as expected. Washed up really nice with little shrinking.",
					"Liked the product I wear it with jeans or shorts"
				]
			}
		},
		{
			"id": "_KIB-cP",
			"title": "Levi's Women's Ultimate Western Shirt (Standard and Plus)",
			"price": "$38.37",
			"image": "https://m.media-amazon.com/images/I/61fJcaQlocL._AC_UX385_.jpg",
			"description": "Worn by pioneers, outliers and outcasts, Levi's Western shirts have been tested by generations and represent rugged American cool. It bears classic Western features like pearl snaps and pointed pocket flaps, which reflect the arcuate stitches on the back pockets of our jeans.",
			"reviews": {
				"customerProfileNames": [
					"JessicaR",
					"Meaghan",
					"MS",
					"Anne",
					"MadethCastillo",
					"Steffi",
					"Deej",
					"Samantha"
				],
				"customerProfilePictures": [
					"https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif",
					"https://images-na.ssl-images-amazon.com/images/S/amazon-avatars-global/d545d919-7fee-48cd-ae35-0961f0209299._CR0,0,463,463_SX48_.jpg"
				],
				"customerRatings": [
					"5.0 out of 5 stars",
					"4.0 out of 5 stars",
					"5.0 out of 5 stars",
					"5.0 out of 5 stars",
					"3.0 out of 5 stars",
					"5.0 out of 5 stars",
					"5.0 out of 5 stars",
					"5.0 out of 5 stars"
				],
				"customerReviewTitles": [
					"Perfect denim button down",
					"A happy accident",
					"Very nice",
					"Runs VERY SMALL after shrinkage in hot water",
					"Sizing is off",
					"Best Shirt Ever!",
					"Good for Tomboy Style On an Hourglass Shape",
					"Not really a shirt"
				],
				"customerReviewBodies": [
					"This shirt is THE BEST. I was looking for something a little cheaper but decided to try this. LOVE. Perfect fit, just the right amount of stretch. Great color. Snaps are a great touch. Soooooo worth the extra money. I bought the xl, I'm 5'3\" 160-165#",
					"I",
					"Just what I was looking for. I'm not a huge denim shirt fan, but I thought to make the outfiMindy1210, I should give it a try.... it worked. Comfy all day and washes well.",
					"Purchased a medium based on reviews regarding shrinkage. I usually wear Women’s 4-6 or mens XS.\n\nI am 4’10 115lbs with largish busT 34Dish so I expected to buy a smaller size but-\n\nWhen it arrived it looked too big; however, after I washed in extra hot water and machine dried it fit perfectly across my shoulders and sleeve length (minor miracle) with enough bust room for movement without popping snaps.\n\nSo. Buy 1-2 sizes larger to allow for shrinkage.",
					"This runs small, particularly in the shoulder area, I am normally size small and medium and the medium is snugged on the shoulders and I can’t barely move my arms, i have to return it but other than that everything is perfect, quality and how comfortable the fabric is, the sizing is just off but if you get the perfect size it’s a pretty shirt, a must have in every wardrobe",
					"I read some reviews doubting the authenticity of this shirt. I received the Levi’s shirt I recall from the 1980’s … a true Levi’s denim shirt, mother of pearl snap buttons, the back has traditional V, red tag on left pocket. I’m 5’5”, 135lbs, I ordered a Small, it was too small, so exchanged for Medium, which fits a bit tight, as I like. It’s broken in perfectly - in this color at least.",
					"Excellent shacket, perfect for fall. If you’re in between sizes go with the size up for a more “boyfriend” type fit. I wear it open but it looks good closed too. I’m a nonbinary AFAB and I do the “tomboy” look but I have an hourglass figure so it’s difficult to find styles that fit right and look good. This shacket helps to straighten out the hourglass without looking frumpy. For reference Im almost 5’7”, 147lbs and my measurements are 37-28-38, I wear between a small and medium in women’s shirts and a 28-29 in Levis jeans.",
					"This is a serious denim shirt. It's not light weight so it is very warm and somewhat stiff. This is the type of shirt you'd wear as a jacket over a tank or tshirt. It's still cute but it's August and will have to wait til fall to really get wear out of the 2 colors I bought. As others have mentioned these are short and not tuckable.",
					"I’m usually a small or medium but since others said it fits small, I ordered a large and I’m glad I did. I could have probably got away with a medium for my waist and hips but it definitely wouldn’t have done up in the bust so the large does look a little oversized which I like anyways. I deducted one star just because of the sizing but it’s a very cute and comfy shirt.",
					"This is actually the best fitting shirt I’ve ever put on. I have wider ribs, and a lot of shirts need to be too big everywhere else to fit my across my back and chest. This one fits perfectly without any pulling across my back or bust. The arms fit well without being tight or baggy. This is a gem! If Levi’s has other shirts in this fit, I’m grabbing them!",
					"I bought this for my mom and it ended up being the perfect fit. I had bought her the light blue one first which she loved and wanted a darker color one to add to her wardrobe. The only difference was the dark blue one was a little thicker or rather harder in material. Once washed a couple of times it softened a bit. It is great as a second layer or a light jacket for spring and fall.",
					"Quality seems good. The look is great. Again, a little snug in the mid-drift even though I sized it up being that it is denim. Some snaps pop up open with some movement, especially bending over. Will wear it open with t-shirt.",
					"The shirt met all my expectations. It fit perfectly--I wanted a bit of a roomy fit without it being too overly big. The material has good weight and is very \"comfy.\" Altogether, a excellent buy for me. A good quality product."
				]
			}
		},
		{
			"id": "GEpRYcv",
			"title": "Disney Mickey Mouse Classic Pose T-Shirt",
			"price": "$22.99",
			"image": "https://m.media-amazon.com/images/I/A13usaonutL._CLa%7C2140%2C2000%7C71AMC10iuOL.png%7C0%2C0%2C2140%2C2000%2B0.0%2C0.0%2C2140.0%2C2000.0_AC_UX342_.png",
			"description": "Strike a swell pose with every wear of this Disney t-shirt. Featuring classic art of Mickey Mouse showing off his signature pose. This playful tee shirt will lend timeless flair to your everyday attire! Planning a trip to Disney Parks? This tee will add a-mouse-ing style to your trip down Main Street at Disneyland Resort or Walt Disney World!",
			"reviews": {
				"customerProfileNames": [
					"TrekandTech",
					"eprkeeper",
					"BlueJay",
					"Amy",
					"Customer",
					"JacquelynCuellar",
					"RondaClark",
					"TonyHaberman"
				],
				"customerProfilePictures": [
					"https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif"
				],
				"customerRatings": [
					"5.0 out of 5 stars",
					"5.0 out of 5 stars",
					"5.0 out of 5 stars",
					"5.0 out of 5 stars",
					"5.0 out of 5 stars",
					"5.0 out of 5 stars",
					"5.0 out of 5 stars",
					"5.0 out of 5 stars"
				],
				"customerReviewTitles": [
					"Runs big but it’s cute",
					"Mickey",
					"My son loves this!!!!",
					"Mickey Mouse",
					"was small",
					"Perfect shirt for our Disneyland trip",
					"Great pajamas!",
					"Classic Mickey Tee"
				],
				"customerReviewBodies": [
					"The shirt is cute and good quality but it does run quite big. I fluctuate between a size small or medium depending on how many burritos I’ve eaten that month but got a small bc you know... wishful thinking. Anyway it’s too big on me and I’m a bit chonk these days with quarantine and all. If you’re looking for the oversized shirt look it’s probably perfect but I’d otherwise order a size down.",
					"Bought these t-shirts for the spouse. Initially the men’s large was to small but exchanged for x-large and they fit perfect. Material is slightly heavy which the spouse says feels great. Spouse likes them enough, I bought three more in different colors.",
					"My son who tends to be really picky about his clothes really likes this shirt. He sleeps in it, he wears it in the daytime. Yeah, lots of washing but well worth it!!! I have never seen him act this way about clothes. He likes to change up his clothes several times a day until this came along. He finds it, obviously, very comfortable and this just makes me smile. Definitely buying more in different styles. Thank you!!!!! 😊",
					"This shirt was true to size...fast shipping and matched perfectly the pajama pants I ordered from another vendor. It is very well made. Not thin like some shirts that come from vendors. Would definitely buy again!",
					"some of the reviews said the women size ran small and I thought they were exaggerating but the shirt was the size of a kids shirt. this was bought for a kid though so that's the reason why this has 5 stars",
					"Perfect for our Disneyland trip\nArrived right on time\nComfortable and sizes were perfect\nThanks",
					"My son loves Mickey Mouse and he was so happy to receive these pajamas for Christmas! Fit great!",
					"Finally made it back to Disneyland post Covid and needed a classic Mickey Tee. Loved the fit and feel."
				]
			}
		},
		{
			"id": "YJL_ltW",
			"title": "PrinStory Summer Tops Knit Shirts Casual Ruffle Short Sleeve Top Round Neck Tunic Tank Tops Tee Blouse for Women",
			"price": "$18.98",
			"image": "https://m.media-amazon.com/images/I/61VyuZbegZL._AC_UY445_.jpg",
			"description": "【Fabric】:61% polyester, 33% rayon, 6% spandex.summer tops Knit Fabric, light weight and stretchy, and it's skin friendly, you will feel soft and comfort.\nImported\nDrawstring closure\n【US SIZE】: Small=(US 4-6), Medium=(US 8-10), Large=(US 12-14), X-Large=(US 16-18) true size, please purchase according to your normal size.\n【Features】: Knit Tops, Ruffle Short Sleeves, Round Neck, Curved hem design, Loose Fit, Fashion Simple Design.Basic cute blouse, Show your confidence and Charming appearance.\n【Match】: Womens basic tops are paired with jeans, denim shorts and leggings,some beautiful accessories, shoulder bags and cute hats to spend a beautiful and casual holiday\n【Occasions】:This is a perfect summer casual top that can be worn as a daily wear, suitable for outdoor activities, shopping, dating, parties and any other occasions. This ruffle slevess tops can also be given as a gift to friends and family.\n【Washing】: Machine wash or hand wash /Line Dry /Do Not Bleach.",
			"reviews": {
				"customerProfileNames": [
					"PauletteBigby",
					"ValerieInMaine",
					"Customer",
					"Heather",
					"cls",
					"Hailee",
					"Julie",
					"Betty"
				],
				"customerProfilePictures": [
					"https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif",
					"https://images-na.ssl-images-amazon.com/images/S/amazon-avatars-global/8bf8f10b-4c2c-45e6-8bcb-37e02f2e1e79._CR0,0,375,375_SX48_.jpg",
					"https://images-na.ssl-images-amazon.com/images/S/amazon-avatars-global/e24fe4c1-9b0c-40a3-90e2-88dd28ace4c0._CR0,0,425,425_SX48_.jpg"
				],
				"customerRatings": [
					"5.0 out of 5 stars",
					"5.0 out of 5 stars",
					"5.0 out of 5 stars",
					"5.0 out of 5 stars",
					"5.0 out of 5 stars",
					"5.0 out of 5 stars",
					"4.0 out of 5 stars",
					"5.0 out of 5 stars"
				],
				"customerReviewTitles": [
					"Absolutely perfect👌🏼",
					"Gorgeous royal blue ruffle top",
					"Perfect!",
					"Perfect shirt with black leggings!",
					"Adorable and good quality",
					"Soooo comfy!",
					"Liked the print, not the solid",
					"Love it"
				],
				"customerReviewBodies": [
					"I don't have large breast...size 38c...but I do have a lil gut and my hips are 52in. I'm often skeptical as to buying a whole dress or jumpsuit as if I buy a 3x to fit for my hips, then the top is overly big. Thus, I'm always having to buy a separate top and separate skirt, pants or shorts.\nI'm 5'7\" & 235lbs. I purchased the black top & grey top in a size 2xl and it falls down on me perfectly!! It's not tight at all around my gut and not tight around my armpits, as there is plenty of room there I believe if you have bigger arms than mine. I'm a truck driver so after I wash & dry (I washed it in cold water), I just fold it up straight outta the dryer while it's nice & hot and placed it in my clothes cabinet inside my truck I don't have to worry about it being wrinkled!\nI wear it with my shorts & jeans or pair it with my pencil skirts to dress up a little bit👍🏼! I love this blouse!!!",
					"The color of this top is gorgeous. The length makes it easy to tuck into pants or wear long over leggings. It can be worn causal or dressed up. Great buy",
					"I like my clothes a little baggy, usually I would wear a Medium which would be fitted but I got a Large for the comfort factor and it was just as expected! I’m very happy! The material is like a very soft, cool, thin cottony canvas. It is very comfy on the skin and not scratchy. The shirt isn’t see through, but I recommend wearing a tan bra still. A darker one would definitely show through. I’m very happy! It’s modest, long, comfy, stylish, and perfect for a casual work environment!",
					"Loved the color, the blue looks just like it does online. The fit is very nice, not too tight but not too loose. It is perfectly flowy. I am 5’2” and it isn’t super long but long enough to wear with my black leggings and look super cute. Very happy with this purchase!! I am considering ordering more!!",
					"I love this top! It's just as pictured and just as cute. I wear either small or medium depending on the top (small more often than not if a women's top). I ordered a small after reading reviews and it was the right choice and looks so cute on! It fits perfectly and lays well. I'm 5'10\", 155 lb, size 36B.",
					"This shirt is super nice! Was worried it would be see through like most womens shirts but it's not! It's so soft and cute and will definitely be one of my go to shirts now!! I weigh 210 and am about 5'7 I got XL but I feel like I could have fit large too but I love the bagginess 10/10.",
					"I’m 5’4”, 155lbs, curvy and the medium fit fine. It’s a looser fit without being baggy. Soft material and love the sleeves. I’m going to try in a solid next.\nUpdate: solid color not as soft and arm green was very dark, more a forest green. Didn’t care for the solid sadly. But recommend the print ones.",
					"Fits perfect. I am 5'2\", 200 lb. I usually get printed tops to disguise my stomach. This is perfect. They bottom has a bit of flare. I ordered another color. Good fit!"
				]
			}
		},
		{
			"id": "4pRlPQa",
			"title": "Disney Mickey And Friends Minnie Mouse Leopard Bow Portrait T-Shirt",
			"price": "$19.99",
			"image": "https://m.media-amazon.com/images/I/A1ntnF3PJOL._CLa%7C2140%2C2000%7CA16GZGw8m%2BL.png%7C0%2C0%2C2140%2C2000%2B0.0%2C0.0%2C2140.0%2C2000.0_AC_UX342_.png",
			"description": "Join Mickey Mouse, his counterpart Minnie Mouse, his lovable dog, Pluto, and all his friends in their awesome adventures with these classic officially licensed Disney Mickey And Friends graphic tee shirts!",
			"reviews": {
				"customerProfileNames": [
					"CatalinaAA",
					"MsBrittany15",
					"JessedBlessed",
					"AnaisRamirez",
					"Carli",
					"NicoleC.",
					"Micheline",
					"ScarlettChludzinski"
				],
				"customerProfilePictures": [
					"https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif"
				],
				"customerRatings": [
					"5.0 out of 5 stars",
					"5.0 out of 5 stars",
					"5.0 out of 5 stars",
					"5.0 out of 5 stars",
					"5.0 out of 5 stars",
					"5.0 out of 5 stars",
					"5.0 out of 5 stars",
					"5.0 out of 5 stars"
				],
				"customerReviewTitles": [
					"Fits well, cute graphic",
					"Mommy and Me Minnie Mouse Tees",
					"Cute Large Graphic Shirt",
					"Loved it! Perfect for Disneyland!",
					"Runs small",
					"Super cute",
					"Great shirt",
					"Great quality"
				],
				"customerReviewBodies": [
					"The graphic on both tees wasn't damaged but it does have a little distressing you don't notice in the picture. Loved the shirt and it was comfortable to wear for a day at Disney World. I have a bigger chest so I bought an adult medium and large to try. Both were roomy, but the large was longer than I wanted. I ended up keeping the large and turning it into a crop top.",
					"My daughter and I both love leopard print and Minnie Mouse so these matching shirts were a no brainer. The quality is very nice and comfortable for both of us. I highly recommend this product if you and your child are leopard loving Disney people. XO",
					"Comfortable and cute shirt! Great quality cotton and love the large size of Minnie on it! Very happy with this cute shirt. Next time I’ll wear it to animal Kingdom! Runs try to size. Longer shirt.",
					"Was a little iffy at first about purchasing this shirt due to the bad reviews but I still went ahead & bought it. I’m so glad I did though because the shirt was perfect! No rips & no stains, & the material was great!",
					"Super cute shirt for Disney! Paired with leggings and boom cute outfit with little effort haha. Shirt runs a little small though if you ask me, don’t stretch much either. I would size up if you’re looking for an over the butt look with leggings.",
					"Super cute, fits true to size, comfortable! Perfect for a day at animal kingdom!!",
					"I bought one of every size and they all fit my girls perfectly when we went to Disney it was great",
					"Fits perfectly and the imagine on the shirt is large and wonderful! Shirt is soft and fit like unisex medium."
				]
			}
		},
		{
			"id": "-mU2Doa",
			"title": "Blooming Jelly Womens White Blouse V Neck Ruffle Sleeve Flowy Shirts Dressy Casual Cute Summer Tops",
			"price": "$22.99",
			"image": "https://m.media-amazon.com/images/I/71qX0vKnR-L._AC_UY445_.jpg",
			"description": "Chiffon\nImported\nButton closure\nMaterial: Chiffon. This business casual tops for women is lightweight, flowy, soft and skin-friendly, hugging you all through the day.\nFeatures: The casual summer shirts trendy tops features with v neck, ruffle short sleeve to shape the perfect outline of your arms, swiss dot deorations to add loveliness for this dressy shirt.\nStyle: The siwss dot shirts is perfect for business casual style to show experienced and convinced. It can match your skirt,jeans and high-heeled shoes with a look that is not out of date.\nOccasions: Fashion dressy casual shirts suitable for business, uniform, vacation, school, party, office, work or just casual everyday wear in spring/summer/autumn.\nNote: We strongly suggest that you have your body measurements taken first, and then refer to our size chart before order, S=us 2-4, M=us 6-8, L=us 10, XL=us 12",
			"reviews": {
				"customerProfileNames": [
					"KindleCustomer",
					"A.Pinon",
					"Customer",
					"Becca",
					"Candice",
					"Shannon",
					"lizw.",
					"LindaJ."
				],
				"customerProfilePictures": [
					"https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif"
				],
				"customerRatings": [
					"5.0 out of 5 stars",
					"5.0 out of 5 stars",
					"5.0 out of 5 stars",
					"5.0 out of 5 stars",
					"5.0 out of 5 stars",
					"5.0 out of 5 stars",
					"5.0 out of 5 stars",
					"5.0 out of 5 stars"
				],
				"customerReviewTitles": [
					"Very impressed",
					"So cute!",
					"Adorable!",
					"Great white top",
					"Stylish and easy to wear",
					"Beautiful top",
					"Very cute and versatile",
					"Received lots on compliments wearing this"
				],
				"customerReviewBodies": [
					"Nice top. Fits well. Material light and flows. I got the white and it wasn’t see through.\nI’ll 5’4” 170 lbs and large fit perfect. A little snug on hips but not bad enough to return. Dressy and casual.\nI most loved the sleeves, as I have large arms, and they looked very very good.",
					"This shirt has a tiny bit of stretch to it making it super comfortable to wear! The little fluttery sleeve is a gorgeous and feminine detail!",
					"Really, really cute top! Definitely true to size, and I was surprised that I did not need a cami underneath! (white) Plenty of room, looks great one, and the sleeves add just the right touch! Adorable!",
					"Very cute top. Can be dressed up or down. Not see Through. I loved it so much, I ordered 3 more colors. Size small fit great.",
					"I love the fit of this top. It is fun and flattering, a little on the sheer side so I wear a shirt under it if I am wearing to work. Love this addition to my wardrobe.",
					"Beautiful top for work or wear casual with jeans. Flattering fit, not boxy. A little short for leggings but very cute. Not sheer-I bought the white; doesn't need an undershirt. I bought medium, could have probably went with a small but didn't want snug fit. Looks great with a sweater and dress pants for work.",
					"Just got this today and haven’t washed it yet but super cute! I was worried it might be sheer and it’s not at all. I plan on wearing it tucked in for work but will probably also wear with jeans and sandals for cute but casual. Probably getting more colors! 5’9, 195 and the XL is perfect.",
					"I love the look and feel of this top. It washes nicely and I hang it to dry Great for causal wear but can easily be more dressy with the right jewerly and shoes. Planning to purchase a couple more in different colors. It is sheer but no see through",
					"I this this is my favourite piece in my closet, it looks so good and so faltering. I love it!"
				]
			}
		},
		{
			"id": "h0SqGxc",
			"title": "Under Armour Women's Tech V-Neck Short-Sleeve T-Shirt",
			"price": "$17.55",
			"image": "https://m.media-amazon.com/images/I/41bM71mpCpL._AC_SY355_.jpg",
			"description": "UA Tech™ is our original go-to training gear: loose, light, and it keeps you cool. It's everything you need. UA Tech™ fabric is quick-drying, ultra-soft & has a more natural feel. Material wicks sweat & dries really fast. 4-way stretch construction moves better in every direction. Deep V-neck collar & slimmer fit deliver a sleek, more feminine silhouette. Metallic silver front chest logo. Loose: Fuller cut for complete comfort. 100% Polyester.",
			"reviews": {
				"customerProfileNames": [
					"M3",
					"KristinB.",
					"JulieA.",
					"LilDelVillar",
					"C.A.Emerson",
					"DeeLiteK",
					"Victoria",
					"SouthernBelle"
				],
				"customerProfilePictures": [
					"https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif",
					"https://images-na.ssl-images-amazon.com/images/S/amazon-avatars-global/6e3057ab-ac28-4ef1-9b3c-0a68933bd750._CR0,79.0,843,843_SX48_.jpg"
				],
				"customerRatings": [
					"1.0 out of 5 stars",
					"5.0 out of 5 stars",
					"5.0 out of 5 stars",
					"5.0 out of 5 stars",
					"5.0 out of 5 stars",
					"5.0 out of 5 stars",
					"5.0 out of 5 stars",
					"5.0 out of 5 stars"
				],
				"customerReviewTitles": [
					"Not an authentic Under Armour shirt",
					"Great Shirt but This One Runs Big!",
					"One of my favorite workout tops!",
					"Perfect for working out!",
					"My go-to shirts",
					"Good fabric, attractive v-neck",
					"Outstanding product!",
					"As good as it gets"
				],
				"customerReviewBodies": [
					"I",
					"I'm an active person and I love to walk and exercise whenever I can. I typically opt for the racerback tank top style for my workout shirts but I'm also very fair-skinned and I wanted a bit more protection from the sun for my shoulders and back when I'm outside during peak sunshine hours. I own a number of Under Armour products so I was well aware of the quality when I decided to purchase this shirt. Like a lot of people, I was hesitant on the sizing since Under Armour's clothes fit differently depending on the style. Under Armour classifies this shirt as a loose fit as opposed to semi-fitted, fitted, or compression fit.\n\nFor reference, I am 5'6\", 150 pounds, with a 36D chest and a medium fits me perfectly! I wear a medium or large depending on the style and fit of the shirt but, thanks to the help of other reviewers, I was able to successfully order my correct size for this shirt. This shirt is part of UA's Heatgear line which is meant to keep you cool when it's warm out. I've already worn this shirt several times and it is incredibly comfortable. It is made in Jordan of 100% polyester and is very soft and lightweight. It is so comfortable that I don't have any problems with range of motion or anything while exercising. This shirt is a V-neck style which is nice since it adds a little bit of a design over the scoop neck style shirts and it still has good chest coverage so I don't feel like I'm indecent while bending over. It has an UA logo on the left side of the chest as well as one on the back of the shirt, just below the neck. The length is also really nice and comfortably rests on my upper thighs. I've worn this shirt while walking and playing basketball and have still managed to stay fairly cool. Even though this shirt is lightweight, I don't feel that it's sheer and would show anything that's not meant to be seen. The shirt also washes up nicely. I typically hang dry these shirts so they don't get caught on anything in the dryer and so far, they've been great!\n\nI'm so happy I found this shirt because it's become my go-to t-shirt for working out when I don't want to wear my racerbacks. I originally ordered the Montana Teal/Metallic Silver color and loved it so much that I also ordered Flint/Metallic Silver and Coho/Metallic Silver. I've included a picture of my three shirts so you can see what they look like. At first I thought the Flint/Metallic Silver was a gray color but when I got it, it's actually more of a dusky lilac and, since I love purple, I am even happier! I think the hardest thing for most people is to figure out what size to order for this shirt. My thoughts are, if you have two sizes of shirts that you normally order depending on the brand and style, order the smaller size for this shirt. That's what I did and these shirts ended up fitting me perfectly. They are even nice enough to wear out in public so they are definitely versatile. I highly recommend these shirts because they are great for exercising, there are a lot of colors to choose from, and the price is perfect so you can order more than one!",
					"I really love this top - it's one of my favorite workout tops! It's lightweight and wicks moisture really well. It's flattering, with the v-neck and the flattering, feminine cut, and it's VERY comfortable to wear. I'm a 40C, usually wear a L/12 or XL/14 top and I purchased this in the XL. It's loose enough around my curves that it's comfortable and doesn't make me self-conscious. The only thing I'd change is for it to be just an inch or two longer. I'm 5' 5\" and this hits right at the top of my thigh/mid-butt, but because I've got a curvy backside it does tend to ride up a little when I'm working out (especially when walking/running). I really wish it was available in more colors - I would buy them all!",
					"Perfect fit! I think I'm somewhat muscular and love this shirt. Quality is amazing for working out. You can seey sports bra and tattoos but can really seey actual skin so not too transparent. But overall, love it. I'm 180, pretty flat belly and I'm 5'1\". My arms are bigger than a normal female and the sleeve are a bit tight but that's just cuz I have bigger than norm arms.",
					"Under Armour makes some of the best t-shirts around and for a really great price. I own several different styles and sizes and often wear these to the gym or for a walk around my neighborhood. They are stylish yet modest. I wear mediums and larges in most UA shirts but ordered two of these (black and gray) in XL because the description states they are fitted and sometimes \"fitted\" on me is a bit tight. They fit well....with just the right amount of room...and feel so comfy. I will probably order more of these in different colors. For reference I am currently 5'4\" and 150 lbs.",
					"I love this shirt for working out, not too tight in the bust (36D) and not too tight overall. For some with smaller busts, the medium might be too large. It's very slimming and the fabric, though you can tell it's a sweat wicking type, it's not too synthetic feeling. I like the feel of cotton and this is a good substitute blend. The v-neck is attractive and this goes with myriad workout bottoms. I wish there were more colors!",
					"Outstanding! I am 53 years old, 5'7\" , 170 lbs , size 14 all around. I wear an extra large. It fits loosely on me.\nI have about six in several colors. I do a lot of walking, 4 to 5 miles a day. They are so comfortable! I wash them in cold and hang dry them :-)",
					"Perfect fit! I was not actually expecting to like this shirt so much, but now I can't wait to get other colors. It came out of the package without a wrinkle so it will be perfect for my purposes. In planning for an upcoming trip, I needed to find some shirts for tours in a hot climate. I intend to wash in the bathroom sink and drip dry to keep my luggage as light as possible. This shirt weighs next to nothing, will dry very quickly, and still looks great. While on this trip, we will be doing some cycling so this shirt is a win-win, and is needed for additional cycling after our return home later. My husband has had to similar UA shirt for a couple of years... now I see why he loves it!\n\nIn certain styles of women's shirts, I have to buy an XL due to broad shoulders. In this shirt, the Lg fits me perfectly. It is NOT a compression shirt, but it is not boxy. It shows a lady's shape well, but doesn't cling at all so it nicely hides those extra unsightly bulges at the waistline. What's better than that?\n\nIf you find any information in this review to be helpful, please click \"yes\". Thanks!!",
					"I wear this top under my scrubs in the hospital and it's perfect. The V neck means you can't see it under them.\nThe material means it's also great to keep perspiration at bay too as it's very lightweight & breathable.\n\nIt's really soft & washes brilliantly. After nearly a year the colour hasn't faded & it's kept its shape. I'm a size 14/16 and went with XL which was perfect.\n\nWorth the money!",
					"I had been looking for an exercise top since giving birth that skimmed over my big belly but didn’t look like a tent at the same time - and I have found it. This top is nicely moisture wicking and dries very quickly after washing. The v-neck is flattering without being too revealing. I am 5’5” with a generous bust and the top just covers my bum. A great find!!",
					"Terrific lightweight running top and long enough to not ride up when I move. Women's tops can often feel a bit short or sit above the backside and I never feel comfortable with that. Love this top because it is a decent length as well as comfortable when wearing it to run.",
					"✔️Material:\nDer verwendete Stoff ist sehr leicht und atmungsaktiv. Er trägt sich zudem sehr angenehm auf der Haut und ist auch nach einigen Runden in der Waschmaschine immer noch in Form. Die Farbe ist zudem kräftig und gleichmäßig. So soll es auch sein!\n✔️Passform:\nDie Passform ist sehr gut! Die normale Größe bestellt und es passt super.\n\n🏁Fazit:\nTolle Verarbeitung und ein angenehmer Stoff, für den Sport einfach bestens geeignet😇\n\n⭐️Anmerkung⭐️\nIch hoffe meine ehrliche Rezension war für Sie hilfreich. Mein Ziel ist es, die positiven sowie negativen Eigenschaften des Produktes aufzuzeigen und vor einem Fehlkauf zu bewahren.\n\nBesten Dank und viele Grüße\n\nStarfox 🥰",
					"",
					"It's an ok product. Good fit and nice material. I'm a size 8 -10 and the small was perfect - not to tight or baggy.\n\nBe careful as when I purchased it was described as a pack of two however I only received the one shirt."
				]
			}
		},
		{
			"id": "srwb9gQ",
			"title": "Gildan Women's Softstyle Cotton T-Shirt, Style G64000l, 2-Pack",
			"price": "$9.35",
			"image": "https://m.media-amazon.com/images/I/31ff2ROq7xL._AC_UX342_.jpg",
			"description": "For a shirt that looks equally stylish paired with jeans or a skirt, the Gildan Women’s Softstyle Cotton T-Shirt offers a lot. Its 100% ring spun cotton feels soft against your skin; and the semi-fitted, side-seamed construction provides a comfortable fit. Decorate it using screen printing, DTG, embroidery, iron-on decorations, bleaching or discharge.",
			"reviews": {
				"customerProfileNames": [
					"Lauren",
					"ChrisMoriarty",
					"Lindsey",
					"Lk",
					"Parlezvous",
					"DonnaG.",
					"AlisonArthur",
					"AprilG."
				],
				"customerProfilePictures": [
					"https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif",
					"https://images-na.ssl-images-amazon.com/images/S/amazon-avatars-global/4cfcc6f7-ea53-40e2-a323-bc0989a434d6._CR0,0,960,960_SX48_.jpg",
					"https://images-na.ssl-images-amazon.com/images/S/amazon-avatars-global/ebe3c97b-2aef-45fe-995d-3758a8bc54d1._CR0,26.0,281,281_SX48_.jpg"
				],
				"customerRatings": [
					"5.0 out of 5 stars",
					"2.0 out of 5 stars",
					"5.0 out of 5 stars",
					"4.0 out of 5 stars",
					"4.0 out of 5 stars",
					"5.0 out of 5 stars",
					"5.0 out of 5 stars",
					"5.0 out of 5 stars"
				],
				"customerReviewTitles": [
					"YES IS A JUNIOR FIT",
					"Runs 2 sizes smaller!",
					"Great buy - very soft. Runs super small.",
					"Great quality but definitely small",
					"Not fitted",
					"Great t-shirt, sized small though!",
					"Great shirt, a staple for your closet",
					"Perfect Size!"
				],
				"customerReviewBodies": [
					"Ok yes this shirt fits small. But by all the reviews this is EXACTLY what I was looking for. My measurements are 34-25-39, weigh 116 pounds and this fits me perfectly. This is a junior type style, not a regular “adult” unisex top or women’s typical fit. It is not thin, fits great for the petite and just what I was looking for.",
					"Runs at least 2 sizes too small. Wish I had read the other reviews. Ordered a large runs more like a small. Very disappointed. Gave the shirts to my daughter. Pictured is the shirt on top of a normal large size t-shirt.",
					"Shirt was way better than expected. I ordered an X-Large, because of other reviews that said that it ran extremely small. When I unboxed it, I forgot about that and was surprised that I ordered an extra large and it looked really big. When I tried it on, it fit perfectly. It’s very snug but I think it works well. I can loosen it a little bit by pulling it up, or pull it down tighter. Very soft material. Let’s hope it doesn’t shrink!!!",
					"They’re not kidding when they say this is a junior size. I ordered up from medium to large and it fits perfectly but VERY VERY snugly. I’m a little worried about what will happen after I wash it. Having said that the quality is very nice so I just ordered the black in XL. Keep in mind I’m a solid medium so adjust accordingly.\n\nUPDATE: I decided to return the large and exchanged for XL. I usually wear mediums and these now fit great, loose but a nice slim fit. I now have four: two white, two black.",
					"I wanted a white tee that was form fitting across the entire torso. These are cut straight down from the bust area, so unless your body is shaped like a rectangle, don't expect it to be form fitting anywhere beside the bust and shoulders.",
					"I love plain white t shirts but they have to fit right. I read the reviews on these t shirts and ordered accordingly. Glad I did. I'm small... Size 2 and 34A...and long waisted. I always wear small or extra small t shirts and have to make sure they aren't too short. I ordered these in a medium and it's the right fit. They aren't necessarily a fitted cut as advertised, more a slim cut. Narrow, not smaller at the waist. They're also a longer cut. All in all perfect for me. But I can't imagine they be great if you have great curves. Definitely order one or two sides up. It's a great price for a basic tee, but sizing is a consideration.",
					"Really nice cotton fabric, appropriate stretch, and nice length. I hate shirts that are too short or look to boxy, but this shirt has a flattering shape while not being too clingy. If you don't like shirts that are form-fitting, order a size up, but typically the sizes are as marked. I usually wear a size medium and the medium shirts were great. So far they've been washed many times and they have held their shape wonderfully!",
					"Just got these in the mail today. I didn't realize I ordered a two pack so it was a very nice surprise. The small fit my daughter perfectly-She's a juniors size small. The reviews had me a bit worried but I'm glad I ordered. It looks cute and it's nice and thick.",
					"These t-shirts are perfect!! I am glad I sized up one size, based on the reviews/recommendations. I normally wear a women’s Large so I ordered XL. They are pretty well perfect!! The cut is still feminine & fitted, and they are nice & long too, not cropped at all. The red is a gorgeous true red, perhaps a little more blue-red than orange-red, but it is really a gorgeous red. These are absolutely fabulous value for the money, soft and just perfect for a basic t-shirt! I will order more!",
					"Buy size bigger than your normal size. Bought medium thinking it will be bigger on me yet it fits exactly to me. Disappointed on how small the neckline of this shirt. I like the thickness of it",
					"Belle qualité de coton et j'aime l'encolure ronde près du cou. Son épaisseur est bonne et on ne voit pas à travers même avec le T-shirt de couleur blanche. Cependant, il est fait petit. Je mesure 5 pieds 9 po et pèse 169 lbs et j'ai dû commander un XX large (normalement je porte du large ou X large). J'ai juste un peu d'amplitude avec cette grandeur. Le chandail est cependant un peu long à mon goût. Je recommande ce produit.",
					"",
					"I'm 5ft2inches, 120lbs\nOrdered large as reading other reviews said fit was small. I'm normally a medium. Shouldve gone 2 sizes up. Large was okay but after putting it in the laundry, it shrunk by 1.5 inches in length.\nThe color didn't fade though and it's an alright softness. A little bit thin as well.\nHopefully it doesn't shrink further next time I wash it.",
					"So what I mean by fit small is you absolutely have to \"size up'. Look at the measurements on the size chart I went up 2 sizes based on the measurements for a perfect fit; shapely but not clingy. Now if you want a very tight fit then only go up one size. For reference I normally wear a medium comfortably and went up to a XL. Glad I did."
				]
			}
		},
		{
			"id": "-Bt4U2f",
			"title": "VIVIfashion Women' s Business Casual Tops Split V Neck Ruffle Sleeve Chiffon Blouses Dressy Shirts Loose Tunic Oversized…",
			"price": "$19.99",
			"image": "https://m.media-amazon.com/images/I/81LUPxYDLnL._AC_UY445_.jpg",
			"description": "100% Polyester\nPull On closure\nHand Wash Only\nAttention!：Based on the feedback from our customers, our clothes are Oversized. So VIVIfashion recommends that you could buy one size smaller than the normal size when purchasing this tops.\nFeatures: Split V Neck Blouse, Short Ruffle Sleeve T Shirt, Womens Tops and Blouses, Simple and Classic Summer loose fit Tunic Tops, Blouses for women fashion 2022, Blouse Casual Work Tops for Women. Womens V Neck T Shirt Business Casual Blouse Tops is made with Lightweight and Stretchy, Keep Comfy and Cool in All Days.\nStyle: The ladies tops and blouses makes the perfect elegant & casual style. Perfect matched well with jeans, tight pants, casual pants, leggings and shorts for a fashion, or you can pair it with black pants and high heels for office work.\nOccasion: Simple and nature design is perfect for daily style, business, work office, home wear, work at home, casual wear or party, night out, summer or winter holidays, going out, New Year, back to school, street look, etc.\nClothing Care: Machine or Hand Wash with Cold Water/Hang or Line Dry/No Bleach. Please Refer to the Size Chart before Ordering. If have any questions, please free to contact us.",
			"reviews": {
				"customerProfileNames": [
					"Melinda_D",
					"JenniB",
					"JackieEwald",
					"Chastity",
					"MAGantt",
					"Customer",
					"LisaKDalton",
					"Nett"
				],
				"customerProfilePictures": [
					"https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif",
					"https://images-na.ssl-images-amazon.com/images/S/amazon-avatars-global/71017d0e-85f5-48a1-b700-a7c0f117c91b._CR62,0,375,375_SX48_.jpg",
					"https://images-na.ssl-images-amazon.com/images/S/amazon-avatars-global/88442342-930f-4b8a-a272-eed5d9672959._CR0,0,202,202_SX48_.jpg"
				],
				"customerRatings": [
					"5.0 out of 5 stars",
					"5.0 out of 5 stars",
					"5.0 out of 5 stars",
					"5.0 out of 5 stars",
					"5.0 out of 5 stars",
					"5.0 out of 5 stars",
					"5.0 out of 5 stars",
					"5.0 out of 5 stars"
				],
				"customerReviewTitles": [
					"So happy I bought this!",
					"Great shirt",
					"Very comfortable and flowy!",
					"Great top!",
					"Figure flattering and comfortable top",
					"Very nice light shirt.",
					"Great quality!",
					"Looks and feels lovely"
				],
				"customerReviewBodies": [
					"I feel like I am on a never ending quest for “the perfect black shirt”. Requirements: sleeves that are substantial without being tight or too poofy, length must be at least to my hips, fabric must have some stretch but breathable and not super clingy, and bonus points are given if it’s flattering. This shirt checks all the boxes! The sleeves are fluttery without being poofy or looking like they’re non-existent. It’s a nice length- longer than a lot of blouses, but not quite tunic-length. It hangs nicely without clinging. The fabric is 100% polyester, but hard to describe. It’s almost airy and looks like gauze, but it’s breathable and has some stretch to it. Yet I’m pretty sure I could wad it up in a suitcase and wear it three days later. It’s really nice. And it’s not only flattering, but also super cute! Really happy with this, and planning to purchase it in other colors.",
					"I like this shirt very much and plan to order other colors. It’s not sheer, has just the right shape and personally I like the opening of the arm. It will show your armpit if you raise your hands above your head which is not an issue for me but could be for some. Without hesitation I recommend this shirt.",
					"Very flowy and comfortable. It was a little larger than I wanted and I’m 5’6 165 lbs. not sure if medium would be too tight but I plan on wearing it with leggings and I think it’ll look super cute that way!",
					"This top was a little big but the top was great material. It will be nice to wear in the summer because it is so light weight! I will return for a smaller size.",
					"I really like this versatile top. It can be dressed up or down. I like the weight of the fabric. It’s not too heavy or too sheer. It is constructed to flatter many body types. I plan to purchase it in other colors.",
					"This shirt is nice and it can be worn with jeans or a pair of dress pants.",
					"Very comfortable, washed up really nice",
					"I got this for myself for my birthday. I love the design of this shirt. And after a wash and dry, it feels amazing to wear. The garment is so light and flowing it is the most comfortable shirt I have. This VIVIfashion Womens Business Casual Top is the best shirt I have bought in a long time and got me many compliments on it when I wore it to my birthday lunch with my daughter and sister."
				]
			}
		},
		{
			"id": "2__TxYK",
			"title": "Amazon Essentials Women's Studio Relaxed-Fit Short-Sleeve Lightweight V-Neck T-Shirt",
			"price": "$12.80",
			"image": "https://m.media-amazon.com/images/I/71vC+3PyDxL._AC_UX342_.jpg",
			"description": "Amazon Essentials is focused on creating affordable, high-quality, and long-lasting everyday clothing you can rely on. Our line of women's apparel includes cashmere sweaters, fleece and down jackets, and more, including plus-size options. Our consistent sizing takes the guesswork out of shopping, and each piece is put to the test to maintain the highest standards in quality and comfort.",
			"reviews": {
				"customerProfileNames": [
					"SylvieF.",
					"MWGal",
					"E.Fox",
					"Deb",
					"MelissaL.Curtis",
					"Jayde",
					"KST",
					"Goodbyeandgoodnight"
				],
				"customerProfilePictures": [
					"https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif"
				],
				"customerRatings": [
					"2.0 out of 5 stars",
					"3.0 out of 5 stars",
					"5.0 out of 5 stars",
					"2.0 out of 5 stars",
					"1.0 out of 5 stars",
					"5.0 out of 5 stars",
					"5.0 out of 5 stars",
					"3.0 out of 5 stars"
				],
				"customerReviewTitles": [
					"Decent quality but fits way too large",
					"Nothing special but certainly practical",
					"Perfect shirt, longer length, pull-down for breastfeeding",
					"Flattering T-Shirt. Quality Issues",
					"Hole in shirt after wearing",
					"Great basic shirt for workouts or casual wear",
					"Love these tops",
					"Thin and see-through in white but good moisture wicking"
				],
				"customerReviewBodies": [
					"I usually wear a size 6/8 or medium so I ordered that. I’m 5’9, 145lbs, 34DD, and the medium I ordered is way too big everywhere (chest, waist, sleeves). It looks more like an XL lol. I’ll keep it cause it’s a hassle to return it an wait again, but I’m a bit disappointed.",
					"I",
					"I always struggle to find longer length T's, so this is a huge win! I am postpartum and living in comfy clothes (I work from home) and these are my go-to shirts. First, they are longer, they cover my butt in leggings, and I don't have to worry about flashing a muffin-top at any time. They are SO soft and comfortable (likely to the blend material) and don't show sweat badly. My favorite (and unexpected) thing about these tops is that you can pull them down to breastfeed, which is AWESOME. I would wear these on hikes/runs too, although I would prefer to work out in something more form-fitting. I mostly wear these casually. I am a postpartum 10/12, 5'7 with a large chest and floppy middle bits, and I ordered a Large.",
					"I bought several of these T-shirts in various colors. Very flattering fit! It does run slightly large. I bought this in a large and exchanged it for a medium. I like my T-shirts slightly fitted depending on the style. The quality could be a little better, but overall, the cut of the T-shirt looks great on my body type. I'm 5'2\" and 140 pounds. I usually wear a large in tops and a 8-10 in jeans. I am updating this review due to quality issues and dropping from 5 stars down to 2 stars. After 3-4 washings, the T-Shirt is badly pilling. I always wash my shirts on gently cycle. It's too bad that this shirt has quality issues with the fabric since it is such a great fit and flattering T-Shirt, however it doesn't wash well or last very long!",
					"S",
					"I have several of these in different colors. They work great with leggings. Long enough to cover your rear without looking sloppy. They're thin and lightweight, which I prefer for summer in the south. They wash and dry fast and easy. Note these are not dressy T shirts. They're more like athleisure wear for running errands, around the house, exercising, etc. I did find the plain colored ones run slightly larger than the striped ones, but not enough difference to change sizes. I'm 5'2\", 135lbs, 38D and the large fits comfortably for me, which means a little extra room to move. Could possibly get by with a medium if I wanted a very close fit.",
					"Love the fir. The lower back hem is flattering, just the right V neck, love all the colors but can’t get them anymore. Bought two white ones recently they were different, way thinner material. Are these being discontinued? I buy the XL",
					"The fabric is very thin. I got the white medium and could read the text on my phone through it. I can see my bra clearly. I will only wear this under layers. I am usually a medium and this fit but showed every lump and bump and stretched over my chest. Next time I will get something darker and larger because I like the moisture wicking and raglan sleeves styling, just not showing the world my Maidenform",
					"I ordered 2 of these, hoping that they will feel comfortable and fit nicely.\nUnfortunately once I tried them on, washed them and wore one again, it felt that it was still containing the chemicals used to make it.\nThe fir didn't feel right, as it had shrunk in the wash.",
					"This is an ok t-shirt for the price but it is very thin and doesn't feel great quality. I know it's described as lightweight but it just feels cheap.",
					"good t shirts easy to wash dry quick to",
					"100% Happy with the item.",
					"I got the dark blue white lines Short. It bled ink on all my clothing in the wash. All my other workout shirts are now destroyed. And I washed it per instructions, with similar colours. Not colour safe. Literally every other shirt looks like it's got pen ink on it."
				]
			}
		},
		{
			"id": "4m6WRA2",
			"title": "Hanes womens Sport Cool Dri Performance Long Sleeve T-shirt Shirt, White, Medium US",
			"price": "$10.70",
			"image": "https://m.media-amazon.com/images/I/81v+73DXTiL._AC_UX342_.jpg",
			"description": "Hanes Sport: performance. Style. Comfort. Hanes Sport builds on our comfort heritage with innovative technologies to give you the looks that fit your life, your sport, and your style.",
			"reviews": {
				"customerProfileNames": [
					"MMac",
					"M.Johnson",
					"Caitlin",
					"GrandmaC",
					"Catalina",
					"BlueMist828",
					"EileenL",
					"E-shopper"
				],
				"customerProfilePictures": [
					"https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif"
				],
				"customerRatings": [
					"5.0 out of 5 stars",
					"5.0 out of 5 stars",
					"5.0 out of 5 stars",
					"5.0 out of 5 stars",
					"5.0 out of 5 stars",
					"5.0 out of 5 stars",
					"5.0 out of 5 stars",
					"5.0 out of 5 stars"
				],
				"customerReviewTitles": [
					"Great buy",
					"Don't spend $80 at REI.",
					"Great for running in the heat",
					"Fits well, silky smooth fit.",
					"Great for layering or sun protection while exercising",
					"Protects against sunburn effectively and very well-priced",
					"Best long sleeved shirts for working in and out",
					"Great Basic Athletic T-Shirt"
				],
				"customerReviewBodies": [
					"The size is perfect, the fabric is nice and soft and the price was great. The length was especially what I liked as it isn’t too long. I am wearing it as a casual shirt. I will me ordering 2 more. I am 5’6” 140 lbs and I ordered a medium.",
					"This tshirt is perfect for your first layer. I wore it hiking in Scotland where we'd be climbing hills and sweating, then in cold wind and rain. I was never cold or wet--perfectly wicked away any sweat. I was going to spend much more at REI, but couldn't bring myself to do it. Thank goodness. I'm buying 2 more as they will be perfect in the warm winters here in Texas. I don't know if they protect from sunburn, will update if that info becomes available. I'm 5'6\" and weight 132. The medium was a prefect fit.",
					"I was worried about running in long sleeves during the summer, but this shirt is great. Four miles in the eighties with high humidity with no problem. I wear a small or medium depending on the shirt, so I ordered a medium in this because I hate feeling constricted when I run. Close fitting with a little extra room. If I was buying for fashion, I’d probably go down to a small.",
					"Love the soft feel. Bought to use as pajama top. I am 5’ tall, weigh 124. I bought medium which fits perfect. Also bought large for if the medium felt tighter than I would like fir pajamas. I have medical issues which can cause extreme swelling in the belly area but so far the medium has been good. The large is also a good fit. Not so big that it slides off my shoulder area. Both shirts were white. I hope they keep other colors in stock as they are so reasonably priced I want to buy different colors. I’m sure a medium size is great for Hanes brand.",
					"These are perfect for layering on a cool day. 5ft,140lbs and 34b, I normally wear a small in tops, however based on reviews I ordered a medium. Glad I did, arms fit great and it is slightly loose fitting in belly area which is great. Bought the V-Neck and basic round neck, I like both equally. Will buy one more in black! These are a great material that will dry quickly when sweating.",
					"This shirt protects me from burning in direct sun. It is cool and lightweight. I have since purchased two more. I am a 38D and 135 lbs and the large fits me comfortably. The medium was too tight in the chest and kept creeping up.\n\nI tried the HISKYWIN Women's UPF 50+ Sun Protection Long Sleeve Outdoor T-Shirt Athletic Top Rashguards White-L and got a sunburn on my chest while wearing it. This Hanes shirt is half the price and superior.\n\nUpdate: I am still loving these! I just bought three more. The price can’t be beat.",
					"I love the wicking and fast drying of these shirts. I have about a dozen to wear under scrubs at work. I hate the feel of wet sleeves and since my hands are always in water, I get a lot of them. But these shirts wick away the moisture and dry in no time. They are comfortable: even in summer they keep you cool in the sun and in winter they act as another layer to insulate against the cold. Highly recommended!",
					"I've really come to love these basic athletic T-Shirts from Hanes. The price is hard to beat and they are comfortable and come in some really nice colors. I recently bought a few in the lighter shades including white for the hot summer months. I like that the white is not sheer like some I've tried. Hoping they offer some more light shades in the future.",
					"I just received the white. One con is that it is fairly see through as they are very light weight and maybe the other colours are not. They are still great for layering over athletic wear or under my scrubs.\nThe sleeves are long and its long in the torso which I like. The neckline is a bit wide but not too bad. I would order again.",
					"Its light weight. I will wear it under my scrub shirts. It runs small. I wear a medium and the medium I ordered was\ntight fitting and sleeves a bit short. I dont mind the sleeves however\nIf you wear a medium shirt...buy the large",
					"This shirt has turned out to be better than expected. It is light and I bought it for golf so I would not get a sunburn. It is so comfortable and light I wear it under sweaters. I would buy it again.",
					"Bough it as a nursing student for under the scrub wear. Amazing! Light, sleek, soft . Will order more for sure,",
					"Fits well and is comfortable when worn for a work out or just on its own."
				]
			}
		},
		{
			"id": "izss4wS",
			"title": "Saloogoe Womens Loose Fit Tshirts Short Sleeve Summer Tops Casual Workout Yoga Tunic T Shirts Tops",
			"price": "$15.99",
			"image": "https://m.media-amazon.com/images/I/612AYeVWH1L._AC_UX342_.jpg",
			"description": "60% Polyester, 35% Rayon, 5% Spandex\nDrawstring closure\nFeatures: Crew Neck Plain T Shirts/Soild Color/Basic Tee/Casual Workout Tops/Tunic Tops for Leggings/Everyday Wear\nMatch: Match with Leggings/Pants/Shorts/Jeans/Sweatpants.Perfect for Exercise/Yoga/Everyday Wear and Front Tucked or Tie a Knot at The Bottom of The T-Shirts. Also Can as an Undershirt and Match with Coat Which Makes You Look More Stylish and Chic!\nOccasion: Suitable for Casual Daily/Workout/Travel/Exercise and Fitness/Outdoor Lifestyle/Home/Office/Weekend Plan, Etc.The Best Gifts for Family and Friends.\nExperience: This T-shirts is Super Soft/Lightweight/Loose fit/Comfortable and Breathable to Wear.The Size is True/Long Enough for Legggings\nNote: Please Refer to the Saloogoe Size Chart Before Ordering.Any other questions, please contact us freely!",
			"reviews": {
				"customerProfileNames": [
					"k.d.",
					"JandePauw",
					"CeliaD.Goodell",
					"Theslap",
					"Carolyn",
					"Tara",
					"Dee",
					"ah"
				],
				"customerProfilePictures": [
					"https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif"
				],
				"customerRatings": [
					"5.0 out of 5 stars",
					"5.0 out of 5 stars",
					"5.0 out of 5 stars",
					"5.0 out of 5 stars",
					"5.0 out of 5 stars",
					"5.0 out of 5 stars",
					"5.0 out of 5 stars",
					"5.0 out of 5 stars"
				],
				"customerReviewTitles": [
					"Beautiful Blouse",
					"Love the fit",
					"Comfortable and versatile",
					"Really nice shirt!",
					"The shirt is so soft and washes really well.",
					"Cute top",
					"Beautiful",
					"Love!"
				],
				"customerReviewBodies": [
					"Beautiful blouse, bright color blue. I love this but unfortunately I was not able to wear it. I ordered an XL which is my size but because it has a lot of elasticity it fit tighter than I wanted. However, I will not be returning it but will gift it to someone. It really is a beautiful blouse.",
					"I purchased 3 of these. Opened one up first to make sure of the fit then decided to wash in cold water and place in the dryer on low heat. The shape, size and color remained the same.I’m 5’4 150 36in bust, wide shoulders. I just purchased 2 other colors. I’d recommend.",
					"I have paired this with nice pants and jeans. Depending on the accessories, I have made it dress up or dress down. Very pleased!",
					"Love the material! Fits exactly like described. It's a little longer and covers my back end just right. Will be buying more in different colors.",
					"The shirt is so soft and washes really well",
					"Fits as expected and comfortable.",
					"Love it it is perfect!",
					"I bought several in different colors. Fits well and is flattering. Seem pretty decent quality."
				]
			}
		},
		{
			"id": "-YrxBta",
			"title": "Hanes womens Sport Cool Dri Performance Long Sleeve T-shirt",
			"price": "$9.99",
			"image": "https://m.media-amazon.com/images/I/81wH34A-eGL._AC_UX342_.jpg",
			"description": "",
			"reviews": {
				"customerProfileNames": [
					"Amy",
					"Zennifer",
					"KellyfromTX",
					"GrandKathy",
					"AHelms",
					"Customer",
					"Customer",
					"AReviewer",
					"Slammer"
				],
				"customerProfilePictures": [
					"https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif",
					"https://images-na.ssl-images-amazon.com/images/S/amazon-avatars-global/e8d15164-c248-49a1-bb2e-628c4f58a64f._CR62,0,375,375_SX48_.jpg",
					"https://images-na.ssl-images-amazon.com/images/S/amazon-avatars-global/c762251c-0139-42dc-ac0f-c9aeb169e767._CR0,0,375,375_SX48_.jpg"
				],
				"customerRatings": [
					"5.0 out of 5 stars",
					"5.0 out of 5 stars",
					"5.0 out of 5 stars",
					"5.0 out of 5 stars",
					"5.0 out of 5 stars",
					"5.0 out of 5 stars",
					"5.0 out of 5 stars",
					"5.0 out of 5 stars"
				],
				"customerReviewTitles": [
					"Nice activewear shirt.",
					"Seems well made, loose fit especially on arms.",
					"Love it.",
					"Cool and comfortable",
					"Great shirt",
					"Good buy",
					"Great inexpensive sun shirt",
					"Soft and True to size."
				],
				"customerReviewBodies": [
					"Based on other peoples reviews I got a large instead of a medium. It is too big for me but it will fit over other shirts when the weather turns cooler. For reference I am 5'7\" and 147 pounds. I think it depends on how you are built through the midsection. If your waistline is fairly trim order your regular size. If you tend to carry a little more around the middle for the same weight and height then order up you will be more comfortable. Also, my arms are fairly thin because of my work. Perhaps a typical arm build at this weight and height would be more comfortable in a large. It really just depends on your build and how loose you like your activewear. I like mine a little loose but not baggy. I think the sizes run true. A medium would have fit much better. Otherwise, the seams lay flat and the fabric is smooth. Perfect for running without chafing. Color does not matter to me, only function. I do find that the color runs true to what I see on my screen. I am using an iPad if that helps anyone. Different screens embue different color shades.",
					"The color is great, the fit is good. This picture is of a large- I ordered both xl and lot try on. I am 175# and 5’4”. The hanes website claims upf 50....",
					"I guess I didn’t read the description because I thought I was getting just a plain long sleeve T-shirt. I ordered it because of the price. When I took it out of the box, man was it soft. I tried it on right away and it feels so good against my skin. I’m about 5’ 7.5” and 125 pounds and I got a small. It fits great in the torso, but it would be nice if the sleeves were about an inch longer. I think I may just have longer than average arms though. The color is true black. So overall I’m pleasantly surprised with this low cost shirt.",
					"Hanes delivered a perfect shirt for my morning walk. Light weight, it's getting warm outside, soft, no friction, super comfortable, fits perfectly even after washing in cold water and gentle cycle.\nI bought two and will definitely buy more.",
					"I",
					"I bought 3 of these and one arrived today. Perfect fit just about everywhere, except sleeve length. It's a bit short. Or maybe it's just that the sleeve quickly rides up and you have to be readjusting it. But pretty good for the price! Nice material",
					"Got this as a much cheaper alternative to equestrian sun shirts. My skin is very sensitive to sunscreen, I don't want to get a farmer's tan, and I live in Texas riding horses. This is a no frills shirt but it is light, dries quickly and gives spf protection. Great option for riding horses or other outdoor activities. It's not super cute but it gets the job done. Would purchase again. I'm 5'7, 145, 34D and the small fits great.",
					"Very soft, nice feel even after washing. I bought Medium. I’m 5’3” about 132 38”bust.\nI don’t have small upper arms and the M fits. The arm length covers my wrist. The shirt length strikes me about 6” below my waist. if it shrank in the dryer at all (Normal setting) it was very little. I think it’s safe to buy your normal size. The fabric is what I expect a sweatshirt to be made of, it’s not T-shirt material. It’s medium-weight. I’m buying another one.",
					"Lightweight top which let’s you breath. perfect for our Inca Trail trek in Peru.",
					"Used for running. Lightweight and well fitted",
					"Size small, I'm 5'2... Thought it would be red like the picture\nNice fit, comfortable, it's what I expected but it's neon pink",
					"I’m usually an L but I didn’t want it to be skintight so I ordered an XL. I’m quite short so the sleeves on the XL were too long for me. I had to sew it up to make it shorter and it’s all good now. Other than than, it’s pretty great, very lightweight, and breathable. Can’t wait to use this for workouts! I’ll be buying more. Another review says that there’s 2 shirts included, it only comes with 1.",
					"Polyester gives shirt a sheen to it. But looks like a proper workout top. Fits nicely. Not too tight under arms which I hate. Nice length in torso so when you lift arms no midriff is showing. Overall good quality for price so long as you don't mind the sheen appearance"
				]
			}
		},
		{
			"id": "tGRjer0",
			"title": "Amazon Essentials Women's Classic-Fit Short-Sleeve Crewneck T-Shirt, Pack of 2",
			"price": "$9.62",
			"image": "https://m.media-amazon.com/images/I/61FDvGXmL8L._AC_UX342_.jpg",
			"description": "Amazon Essentials is focused on creating affordable, high-quality, and long-lasting everyday clothing you can rely on. Our line of women's apparel includes cashmere sweaters, fleece and down jackets, and more, including plus-size options. Our consistent sizing takes the guesswork out of shopping, and each piece is put to the test to maintain the highest standards in quality and comfort.",
			"reviews": {
				"customerProfileNames": [
					"Saki",
					"KH",
					"Kelliar",
					"Deez",
					"Vi",
					"CyndyRodriguez",
					"ElizabethGrover",
					"KatieV."
				],
				"customerProfilePictures": [
					"https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif",
					"https://images-na.ssl-images-amazon.com/images/S/amazon-avatars-global/fd0125ae-45c4-4d90-beb3-e5fcbe357fb1._CR0,0,2322,2322_SX48_.jpg",
					"https://images-na.ssl-images-amazon.com/images/S/amazon-avatars-global/26f09b40-b977-4407-b7d1-28266dc5b8ed._CR62,0,375,375_SX48_.jpg"
				],
				"customerRatings": [
					"5.0 out of 5 stars",
					"5.0 out of 5 stars",
					"4.0 out of 5 stars",
					"3.0 out of 5 stars",
					"5.0 out of 5 stars",
					"5.0 out of 5 stars",
					"5.0 out of 5 stars",
					"4.0 out of 5 stars"
				],
				"customerReviewTitles": [
					"Soft, comfy and long enough to covers my hips",
					"Can I tell you how much I HATE wearing an undershirt on a hot day",
					"Very comfortable but very not flattering",
					"Good quality, clingy fit, meh colors",
					"Pure Perfection",
					"Can’t beat the price!",
					"Excellent basic shirt",
					"Good basic tee- if you find your size"
				],
				"customerReviewBodies": [
					"I’m 5’1 and weighs about 170lbs( please don’t judge). I wear size 10 on my pants and usually wear Medium on top. Since I gave a birth to my son AND recently gained 3-5lbs from staying at home because of this quarantine, my medium tops are getting tight. I wanted to wear something soft and comfy so I decided to go with size large this time. I was worried if it’s gonna be too baggy especially around my chest. I’m not busty so I was worried that part especially when I go up the size. This shirt fits just fine! Yay! It’s very stretchy materials(56% cotton, 37% modal, 7%elastane) and very soft and nice. The best part of this shirt is that this shirt covers my butt! I haven’t washed them yet but instruction says machine wash cold, tumble dry low so hopefully it won’t shrink too much. Hopefully this review helps somebody out there :)",
					"Can I tell you how much I HATE wearing an undershirt on a hot day?! It’s so frustrating to look to look for shirts in the store and have them all be translucent, too tight, too baggy, or have words on them. I saw these and figured I could send them back if I hated them. Well, I LOVE THEM. They are soft, they aren’t see through, and they fit amazingly well. I get complimented on them every time I wear them. Can’t beat the price either. I can even wear the white ones without an undershirt. I have several colors and will buy more.",
					"I'm 5'5 about 118 lbs with a long torso and I generally wear a size small in tops. I ordered this in xsmall after looking at the photos and other reviews. 3.5 stars would be a more accurate rating but that wasn't an option so I bumped it up instead of down due to the nice fabric.\n\nThe bad: It does my figure NO favors. I don't like tight t shirts but ones that just have a little bit of shape that hint at there being a female form underneath and not a cardboard box. Unfortunately this tshirt gives me a \"shoebox\" body shape. I've attached a photo of how it hangs naturally vs when I pull it back at the waist so show how my body is actually shaped. If it was just tapered in around the waist even a tad more I'd be much happier with the silhouette.\n\nThe good : It's SUPER SOFT. Extremely comfortable. The sleeves are the perfect length in my opinion. The neckline is also perfect for a casual tshirt. Not constricting at all but not flashy either. Great length. I'm wearing a nude bra underneath in my photos and I could not see it at all through the shirt. It has a nice thickness, but as you can see at the bottom you can see my shorts through it so don't expect to be able to wear a black bra without noticing it.\n\nAll in all I think I will keep these as \"around the house\" shirts since they are affordable and so comfortable. If you want a nice weight, soft, non-sheer tee and don't care about it having any shape whatsoever, then it's a great option.",
					"Good quality shirt, true to size but clingier than I had expected. If you want to camouflage your stomach, try a different shirt. I like that the shirt is longer than most Ts, which pairs nicely with leggings. I'm 5'6, 190lbs with a gut and ordered the XL.\n\nThe colors are kind of muted, with the 'purple' being more of a periwinkle in good lighting. The blue is your standard navy.\n\nThe material is on the thicker side, so i plan on saving the shirts for the end of summer/fall. It'll pair well with items that will give belly coverage like a hoodie, jean jacket, or cardigan. I wouldn't order again, but I'm not considering a return either.",
					"I absolutely love them. I had read a lot of reviews, but I was still genuinely surprised at the quality of the material as soon as I opened the package. The material has some weight to it - doesn't feel cheap, thin or flimsy at all, and is soft to the touch. Be warned though on hot humid days it'll really cling to you if you're sweating a lot.\n\nThe fit is perfect for what I wanted. I ended up getting the xxl because I wanted it to be huge on me and it did not disappoint - it goes well past my hips and fits very loose. I wanted something that was comfortable to do some working out in and lounging in and these turned out to be perfect. The color is absolutely beautiful as well. As soon as I got these and tried them I had immediately ordered another set! I'm contemplating ordering another one too.\n\nFor the quality and quantity the price is definitely worth it and I say its a really good deal. Buy these and I guarantee you won't regret it.",
					"These shirts are extremely high quality for the price you pay. I’m 98lbs and 5’2 and the XS are slightly a little loose on me but I’m very petite so I run into that a lot. Still it’s not a problem and they feel and fit great! Very stretchy and they are a little long but I am short. Get these though! You won’t be sorry!",
					"These shirts are AWESOME. Super soft comfortable fabric that is thick enough you can wear over light colored bra without it showing. Great length and just tailored enough to not fit as baggy as a dude's shirt. I have been on the hunt for a flattering decent basic t-shirt & I finally found it!",
					"I needed a few nice basic tees to round out my wardrobe. I ordered these and a 2 pack of the v-neck as well, based on reviews I went with a medium. I'm 5'5 140 lbs and 34B and the medium fit loose and was just too boxy for me, I'm going to reorder in small to see if it's a more flattering and feminine fit. The fabric is nice and light, not too spandex-y like workout tops. As to the white being see through- I was wearing a nude bra and could not see it, however the waistband of my black pants was clearly visible through it, so if that sort of thing bugs you these probably wouldnot bee good for you. They were long (mid hip), but I personally like alittle extra coverage over my hips especially with skinny jeans. The fit of these really reminded me of Old Navy - the vanity sizing kings of retail. I always get size small in tops there, if that helps anyone.",
					"Good quality T-shirts. The fabric is stretchy and silky, and the white T-shirt is not see through. They are on the longer side with a loose fit. Good value for a 2-pack - ordered it again in another colour. They wash well - with this type of fabric I was a bit concerned about pilling but so far so good after a few washes. The black colour started to fade slightly after about five washes. The only downside is that the t-shirt is a lint magnet - I wore a fluffy sweater over a black T-shirt and it was covered in lint which didn’t happen with other fully cotton t-shirts.",
					"These are a smooth silky material, not plain cotton, so they wear well and creases drop out easily. I ordered 2xl and I am a size 18/20. They fit well (material is a little clingy so I had ordered next size up). Will buy in other colours when available.",
					"W",
					"J",
					"Je suis satisfaite de ce produit mais mécontente du prix, le même modèle en homme est à 20€ pour 6 alors que pour femme 2 pour 20€. Mon mari ayant acheté le version homme on a comparé et ceux sont de même qualité ! Pourquoi une telle différence de prix?",
					""
				]
			}
		},
		{
			"id": "Fv_Qmp6",
			"title": "ARRIVE GUIDE Crop Top Athletic Shirts for Women Cute Sleeveless Yoga Tops Running Gym Workout Shirts",
			"price": "$19.99",
			"image": "https://m.media-amazon.com/images/I/61ZUo08E-ML._AC_UX342_.jpg",
			"description": "Cotton+ Spandex\nPull On closure\nMachine Wash\nSoft & comfy baby French terry, Loose cropped shirts for women is made with high-quality cotton material with an added spandex elastic fiber, This sexy workout tops is non see through but soft, sweat-wicking and not to shrink. easy to care, machine wash cold.\nClassy and fashion workout tops: Cropped length design for a full range of motion. Cap sleeves & cinched waist to create sexy and beautiful body lines. sculpt your perfect body with trendy tops for women.\nStrong in the studio, sweet on the street. The Yoga Shirts has all the performance qualities you love, plus a baby tee silhouette and super-soft feel. It’s a yoga wardrobe staple.\nGoing out tops for women: Crop tops, Summer Cotton Tank Tops, Crew Neck, Solid Color, Basic, Sleeveless, Loose Fit, Womens Tops Dressy Casual, Beach Shirts, Cute, Muscle, Athletic Tops, Trendy and stylish tanks for women.\nAthletic tank tops for women: Whether your working from home or working out, yoga tank is your new friend! This Soft cute tops perfect for yoga, golf, workout, running, activewear, gym, fitness or casual at home or daily wear.",
			"reviews": {
				"customerProfileNames": [
					"Kellsei",
					"Edia",
					"BrittanyGibson",
					"Alex",
					"bettyboopster",
					"SummerLamar",
					"Emma",
					"Cecilia"
				],
				"customerProfilePictures": [
					"https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif",
					"https://images-na.ssl-images-amazon.com/images/S/amazon-avatars-global/3a4cfe33-7e7b-4e07-bf84-7e600e5f3a19._CR0,153.0,693,693_SX48_.jpg"
				],
				"customerRatings": [
					"5.0 out of 5 stars",
					"5.0 out of 5 stars",
					"5.0 out of 5 stars",
					"5.0 out of 5 stars",
					"5.0 out of 5 stars",
					"5.0 out of 5 stars",
					"5.0 out of 5 stars",
					"5.0 out of 5 stars"
				],
				"customerReviewTitles": [
					"So glad I got it",
					"Perfect",
					"My new favorite gym fit!",
					"SO FRIGGEN CUTE",
					"Simple and cute",
					"Perfect tank!",
					"I bought it in 3 colors",
					"Amazing cute top. High quality"
				],
				"customerReviewBodies": [
					" I was skeptical but I’m so happy I got it and now I want it in more colors!! I posted it on my YouTube channel because I love it that much!! So cute",
					"I love it, it's adjustable it's truly true to size, I'm 5'3 and I ordered a medium. 10/10",
					"I was worried about buying a crop top because I've never had one before, but this is SUPER flattering. I will be buying more in different colors now.",
					"I wore this in a TikTok and got so many questions about where it came from! I wore it to the gym, and it falls perfectly at the natural waist line which really cinches in the waist and flatters a broad shoulder line, just doing an all around stellar job of accentuating the X-frame or hourglass shape.\n\nMy favorite thing about this top is that it can easily transition from gym wear to street wear; I can't wait to pair it with some high waisted shorts this summer!",
					"Love this top! I ordered a medium on the recommendation of the reviews that it ran small but I wish I would’ve got the small. I’m a 34B for anyone who is on the fence about size.",
					"LOVE this tank! Worked out in it & it fits perfectly! Love the amount of stretch & it’s so flattering that you could dress it up! They’re perfect for everyday wear! I got the cream & black. Will definitely be ordering more!",
					"This top is so flattering and comfortable, it’s basically going to be my summer wardrobe. I am a thick waisted 190 lbs, but paired with some high waisted joggers, this makes me look like I really have a waist again!\nIt feels like it has more than 5% spandex. It is definitely more of an athletic fabric. The armholes are loose enough they are comfortable without showing my bra at all, and the tucks at the bottom both give a little puff that gives the illusion of a waist, but also makes it stay put when you raise your arms. Overall my favorite crop top ever!",
					"Love this cute crop top! Very flattering yet comfy. The fabric feels very nice and of high quality.",
					"Me gustó tanto como me queda, que pedí en mas colores. Pedi talla XL me quedó ligeramente grande. Pero me gusta como se ve. El material es de buena calidad.",
					""
				]
			}
		},
		{
			"id": "N5W3O-o",
			"title": "Haloumoning V Neck T Shirts for Women Henley Tees Tunic Tops Loose Casual Button Up Short Rolled Sleeve Solid Blouse",
			"price": "$19.95",
			"image": "https://m.media-amazon.com/images/I/61dLRf9c8PS._AC_UY445_.jpg",
			"description": "60% Polyester, 35% Rayon, 5% Spandex\nPull On closure\nDo Not Bleach\nFabric: Polyester+Spandex; Super soft, breathable and comfortable to wear.\nDesign: Casual and leisure style, notch v-neck tops, unique rolled sleeves, button up, ruched front, solid color, cute and loose.\nOccasion:Home, office, holiday, party, club, dating etc; Suitable for summer.\nCollocation: Perfect for jeans, shorts, leggings, capris, sneakers. It's also a good choice to wear a coat outside in spring and autumn night. A must-have womens t shirts in your wardrobe.\nGarment Care: Hand wash recommended with low temperature water, machine washable with like colors; Do not bleach; Hang to dry.",
			"reviews": {
				"customerProfileNames": [
					"Jenn",
					"EmilyMHarvey",
					"MicheleKowalski",
					"KindleCustomer",
					"MariaK.",
					"Janet",
					"ElizabethRiiz",
					"StormyWard"
				],
				"customerProfilePictures": [
					"https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif"
				],
				"customerRatings": [
					"3.0 out of 5 stars",
					"1.0 out of 5 stars",
					"1.0 out of 5 stars",
					"5.0 out of 5 stars",
					"5.0 out of 5 stars",
					"5.0 out of 5 stars",
					"5.0 out of 5 stars",
					"5.0 out of 5 stars"
				],
				"customerReviewTitles": [
					"Returned - poor fit",
					"Does not look like picture",
					"Strange fit",
					"Good quality",
					"cute",
					"Looks like the picture",
					"Buen producto",
					"",
					"It is a nice fit."
				],
				"customerReviewBodies": [
					"Ordered white t-shirt in XL… shirt in general fit as expected but sleeves were snug around my arms. V-neck of shirt fit awkwardly, not low cut enough for my preference. All buttons are decorative & not functional. Material is soft and not very see through, picture taken with skin tone bra underneath.",
					"The fabric is different, it lays different, the sleeves are too tight, the buttons aren’t functional. I’d return it but they say I’d only get $3 back",
					"Shirt fits a little bit oddly, tight across the chest very loose in the stomach seems more like a maternity top I dont like it. I will be returning",
					"Is a great summer shirt, good quality, well made.\nLove the color, looks exactly like the picture.",
					"Fits great washed well",
					"I love this shirt I bought two of them.",
					"Talla perfecta",
					"",
					"I really liked the product."
				]
			}
		},
		{
			"id": "dzvIJni",
			"title": "adidas Women's Badge of Sport Tee",
			"price": "$9.36",
			"image": "https://m.media-amazon.com/images/I/41-HSnXXVAL._AC_UX385_.jpg",
			"description": "An essential t-shirt for every day. This women's adidas tee has a soft cotton jersey build that keeps you comfortable from sunrise to sunset. A ribbed crewneck makes the look as classic as it comes.",
			"reviews": {
				"customerProfileNames": [
					"Nikki",
					"LaMariposa",
					"Brenda",
					"Gilliespie",
					"ShoppinMama",
					"KrisP.",
					"MelanieL.Waidler",
					"AngeliqueDThames"
				],
				"customerProfilePictures": [
					"https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif"
				],
				"customerRatings": [
					"5.0 out of 5 stars",
					"5.0 out of 5 stars",
					"5.0 out of 5 stars",
					"5.0 out of 5 stars",
					"5.0 out of 5 stars",
					"5.0 out of 5 stars",
					"5.0 out of 5 stars",
					"5.0 out of 5 stars"
				],
				"customerReviewTitles": [
					"Shrank in the dryer/size up",
					"Good material",
					"Love it",
					"Love it!! Fits perfectly and material keeps you cool",
					"Great t-shirt",
					"Nice comfortable well made athletic shirt",
					"Nice",
					"Soft and comfortable material"
				],
				"customerReviewBodies": [
					"Was true to size, ordered a Large. Material was soft, not stiff. I’m 5’5, 185lb and a 38C. I definitely have a rectangle body shape, with a longer torso area and this fit perfectly in the beginning. I would wash in cold water and then hang to dry. So the black color didn’t fade too quickly. The few times I accidentally dried in the dryer, it shrank upwards. Which makes me super sad! I loved this shirt and how it hugged all the right spots. I ended up giving to my 14yo, and it fits her perfectly.\n\nWould recommend sizing up if you plan to dry in the dryer, to possibly help with any shrinkage.",
					"I am 5'4\", about 130 lbs. I ordered a medium. It was loose fitting but not too baggy. The material is a good quality. It is not thin and flimsy. I have washed this shirt several times and it has not shrunk much. It is very comfortable.",
					"I ordered a small but it didn't fit how I wanted sent it back for xs and it fits just how I wanted I ended up ordering one in black and will order some other colors I really like these t-shirts I'm 5'7 bout 115 and a 32E bust and xs is perfect for me for a more former fitting shirt I don't like lose baggy fitting shirts.",
					"Very true to size, I wear a large and it fits perfectly, for who like lose clothing probably could go a size up. Very comfortable material however nt too stretchy, I made a knot on d side for style n had a warm time getting it to know. It did eventually which gives it a more unique look.",
					"The shirt is well made. Doesn't wrinkle too bad. Fits perfectly so it doesn't look so big it is sloppy but is not tight. I wear it to walk dogs in (my job) with the Adidas track pants or shorts. I feel like I look neat and tidy but am still comfortable",
					"My teen likes them so far. Hope the logo holds up in the wash. I would advise not drying in dryer because it could shrink or ruin logo. I also would suggest washing shirt with logo inside out. Runs true to size. The fabric is slightly heavier which is nice. We are satisfied with our purchase and ordered another in another color.",
					"I got this for my daughter for Christmas. She loves it and says it's very comfortable. It doesn't feel cheap either as the material isn't see through and the perfect thickness for a cotton t-shirt. She has washed it a couple of times and said it didn't shrink. Adidas products are great!",
					"Do not put in Dryer it will crack the pattern hang dry only for longer wear. It fits nice only iron inside out I am happy with the price and delivery time.",
					"This t-shirt is reliable Adidas brand in fit and quality HOWEVER, the lovely minty greeney blue is not true to colour. This colour is actually a muted bluey green and it's not very nice. I needed summer tshirts after I retired so I guess I'll wear this one in the garden since I hate the colour so much. I gave it three stars for the fit and quality.",
					"Excelente playera de algodón, realmente calidad. No despinta, queda a la medida, no encoge con las lavadas. La conseguí a excelente precio.",
					"",
					"Really nice t-shirt for spring and summer for exercise or just kicking around. Nice thickness--not too thick or too thin, just right. Wish it came in other colours. Also ordered an Adidas zip hooded jacket but it has yet to arrive.",
					"Je porte habituellement médium et la grandeur est parfait, la longeur aussi je le recommande!",
					"",
					"Me gusto esta bonita pedí una grande por q soy de busto grande y me quedo justa pero si la quieres más olgada una extra grande hubiera sido perfecta",
					""
				]
			}
		},
		{
			"id": "GQUurjC",
			"title": "WIHOLL Womens Tops Casual Short Sleeve V Neck T Shirts",
			"price": "$20.99",
			"image": "https://m.media-amazon.com/images/I/71TSE-EPaCL._AC_UY445_.jpg",
			"description": "100% Polyester\nPull On closure\nMaterial: Polyester + Spandex. The Fabric is Smooth and Soft and Stretchy. Unbelievable Softness and Coolness.\nBasic Tshirts: You Will Love This Flowy Look, Perfect to Front Tuck or Leave Out. Easy to Match, Suitable for All Occasions, Is a Must-have Item for Your Summer Wardrobe.\nFeatures: Standard V Neck T Shirts, Plain Tee Shirts, Short Sleeve Tshirts, Loose Fit Summer Tops, Casual Basic Shirts, All Seasons Clothes.\nSize Note: Available in S-2XL,Please Refer to The WIHOLL Size Chart Before Purchase Order,It's Different with Amazon Size.\nT-Shirts Care: Machine Washable in Gentle, Recommend Hand Wash in Cold Water, Line Dry, Do Not Bleach, Low Iron If Needed.",
			"reviews": {
				"customerProfileNames": [
					"KatD",
					"ELMAGARCIA",
					"Kevin&Liz",
					"Donna",
					"CalamityNan",
					"D.Lane",
					"StephanieAdkins",
					"TrueJack"
				],
				"customerProfilePictures": [
					"https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif",
					"https://images-na.ssl-images-amazon.com/images/S/amazon-avatars-global/ceb23bb7-ceb8-4346-98d5-0715df0d20f5._CR0,0,408,408_SX48_.jpg",
					"https://images-na.ssl-images-amazon.com/images/S/amazon-avatars-global/db994bd2-c9ae-4150-bf40-31b977c36a2b._CR0,0,1125,1125_SX48_.jpg"
				],
				"customerRatings": [
					"5.0 out of 5 stars",
					"5.0 out of 5 stars",
					"5.0 out of 5 stars",
					"5.0 out of 5 stars",
					"5.0 out of 5 stars",
					"5.0 out of 5 stars",
					"4.0 out of 5 stars",
					"5.0 out of 5 stars"
				],
				"customerReviewTitles": [
					"Love it!",
					"SO nice and what I was looking for",
					"Really nice casual shirt",
					"BRB Buying this shirt in every color!",
					"Love it but runs a tad small.",
					"Comfortable, beautiful colors great summer top.",
					"Nice shirt not oversized",
					"Love these!"
				],
				"customerReviewBodies": [
					"I love this shirt! I am going to buy it in a ton of colors. The material is soft and light but not see through. I am large busted and the v neck sits high enough that my boobs aren't hanging out. I bought a large. I usually wear a 14 women's and I wear a 38H bra.",
					"**Update**.This tshirt is exactly what I was looking for. it hangs right at the bum and is not too loose fitting but enough to cover the back side to wear with leggings.i wanted to add that, I bought 2 more colors, I bought the blue and pink... the pink is more of a salmon color and the blue has a mint undertone not really blue. Just thought I would share that because I wanted a pink shirt. I'm still keeping it but. It's not pink!!",
					"I",
					"This shirt is perfect. The length and fit is great. It’s not too revealing up top, while still being flattering. This shirt would look great on its own with a pair of jeans or as a layering top. I’m so pleased with this shirt. 100% recommend!",
					"I had to return first one for being too tight across bust. I bought the size up and love it. The fabric is thin, flows and perfect for hot summers.",
					"I wear a size 16 top and I have ordered six of these tee tops in different colors. They fit beautifully and they are longer so they work well tucked in or worn outside your jeans/shorts. The material is soft/ stretchy and washing/drying on delicate cycle works well. I ordered an xl in all of the colors and the fit is perfect. I am five foot eight/190#. Also, the sleeves come down to about 1 inch above the elbow. Not see through, even in white.",
					"Nice shirt, good quality material. My only ehh is that it fits a little more snug than I would have thought for an oversized shirt. I wear an XL but ordered an XXL because I wanted a little bit of room. The shirt doesn't fit like a fitted shirt, but definitely not roomy either.",
					"Excuse the photo, not the best shot as I’m\nriding my bike. I have this shirt in three colors, love them all! The lighter blue is more of subtle grayish blue. The burgundy is a nice color too. True dark red\n\nI bought these in a Large. (135lbs, 5.5”) I like a looser fit so this size is perfect for me. The sleeve length is what I love most. I don’t have the tight arms that I use to have :I so the longer sleeve length is a huge plus, way more flattering. The large hits below my hips, doesnt quite cover my entire back end, but I still feel comfortable wearing these with leggings. Long enough.\n\nThey wash well (warm or cold) but I do hang dry all my tops so not sure how they will hold up in a hot dryer."
				]
			}
		},
		{
			"id": "6AMaXz7",
			"title": "Columbia Women's Tamiami Ii Ss Shirt",
			"price": "$24.99",
			"image": "https://m.media-amazon.com/images/I/616-E5VM0bS._AC_SY355_.jpg",
			"description": "Our lightest-weight fishing shirt now comes in a crisp yarn-dye fabric with wicking treatment to protect this shirt from bacterial growth and mesh-lined ventilation at center back for the ultimate in cool-wearing comfort.",
			"reviews": {
				"customerProfileNames": [
					"ZooMa68",
					"N.Ellenwood",
					"Cruiser1",
					"DoloresJones",
					"Leah",
					"Emily",
					"Panda5",
					"MauiLady"
				],
				"customerProfilePictures": [
					"https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif"
				],
				"customerRatings": [
					"5.0 out of 5 stars",
					"5.0 out of 5 stars",
					"5.0 out of 5 stars",
					"5.0 out of 5 stars",
					"5.0 out of 5 stars",
					"5.0 out of 5 stars",
					"5.0 out of 5 stars",
					"5.0 out of 5 stars"
				],
				"customerReviewTitles": [
					"Cool and comfortable and great tailored fit for curvy women.",
					"Runs small in the bust but otherwise great value",
					"Great travel shirt",
					"It’s Columbia!!!!",
					"SO many good features",
					"Amazing for Work!",
					"Very comfortable",
					"Go to travel shirt"
				],
				"customerReviewBodies": [
					"Super comfy, perfect fit. I am 5'9\" and 195# and got a large. Love the side zip pockets! Not sure what the velcro things are for on the lapels, though. Tailored fit for curves and lightweight enough for my trip to Africa next month. I can wash in sink and it looks like it will dry quickly. I wish my size had been available in darker colors.",
					"I like these shirts because they look nice, are comfortable, and can be dressed up or down while traveling. Don't be fooled, they aren't as comfortable as cotton but I still use them as my go to shirt while traveling to adventure destinations. I am busty so had to go for the bigger size making the rest of the shirt baggy so I may try to take them in on the sides on my own or price it with a tailor, same with the hem that I wish were the same length all the way around.",
					"This shirt is of excellent and consistent quality. I have ordered three in different colors. It is fitted to the body but not tight. The shirts are exactly as described, cool, easily washed & dried. If you are looking for a camping shirt for hot weather, this is the one.",
					"It’s Columbia!",
					"Where to start. Fabric - fabulous. Light weight, soft and comfy. Fit - FINALLY a slightly fitted shirt that isn't boxy or way too fitted and tight. It is tapered at the waist just enough to have a contoured fit, plenty of space across the shoulders, length is exactly the right front and back with a curved hem, there is a small split in the sleeve hem which is functional and decorative. Pockets are hidden with zipper closures, but add NO bulk to the shirt.....can be used if you want to, but invisible if you don't. SNAPS NOT BUTTONS......this is such a nice touch. Easy to get on and off with no button to pop off. Love everything about this blouse so much I bought it in 5 colors. As soon as Covid is a mere memory, I am ready to pack and head for the airport.....",
					"I",
					"Well made. Fits perfectly. Good looking.",
					"These short sleeve shirts are perfect for travel as they take up almost no room, wash in the bathroom sink, dry quickly and are ready to go again.",
					"Quality item. Great fit. Fast delivery.",
					"I like really these shirts. They are cool for the summer, and I'm able to get away with them for our office dress code. I order xl in Columbia where medium/large usually works with orher brands. Mainly because as a DD I find the Columbia brand tight in the chest. (Yet it if order the shirt in a mens, small will work kind of odd.) I like the snap closure buttons, but do wish they'd add an additional button or even Velcro closure between the button at the chest on their women's shirts, they do have that gap lots of button down shirts do with larger chested women. I'm also not a fan of that PFG logo on the back and had to add an additional shoulder guard to my work delivery bag because the strap catches in the stupid logo. But overall do recommend.",
					"Esta marca es de mis favoritas, costuras perfectas y cuidan los detalles, para mi esposa mido 168cm y peso 80kg compré talla L y me quedó perfecto.",
					"",
					"Chemisier très léger; sèche rapidement. Taille non ajustée, très confortable. Belle couleur rose vif. Boutons pressions (en plastique, cependant). Bonne longueur (la taille Medium arrive aux hanches pour une femme de 5'4''). Excellent achat.",
					"",
					"La prenda esta muy bonita, pero me quedo justa a punto del botonazo",
					""
				]
			}
		},
		{
			"id": "MJSQ72Z",
			"title": "Amazon Essentials Women's Classic-Fit Long-Sleeve Crewneck T-Shirt (Available in Plus Size)",
			"price": "$9.96",
			"image": "https://m.media-amazon.com/images/I/61lx7PxgG3L._AC_UX342_.jpg",
			"description": "Amazon Essentials is focused on creating affordable, high-quality, and long-lasting everyday clothing you can rely on. Our line of women's apparel includes cashmere sweaters, fleece and down jackets, and more, including plus-size options. Our consistent sizing takes the guesswork out of shopping, and each piece is put to the test to maintain the highest standards in quality and comfort.",
			"reviews": {
				"customerProfileNames": [
					"AmazonUser",
					"Stacey-AnnAllen",
					"TabithaNikolaev",
					"Jess",
					"kellyroxmysox",
					"CassaundraG",
					"vulturebee",
					"LucyLu"
				],
				"customerProfilePictures": [
					"https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif",
					"https://images-na.ssl-images-amazon.com/images/S/amazon-avatars-global/2e19a6d7-c345-45d9-859e-1ca10394175f._CR0,51.0,230,230_SX48_.jpg",
					"https://images-na.ssl-images-amazon.com/images/S/amazon-avatars-global/84868a17-e0d2-4307-bcb2-435bf55645e3._CR0,93.0,2795,2795_SX48_.jpg",
					"https://images-na.ssl-images-amazon.com/images/S/amazon-avatars-global/c8847bb6-a49f-4097-bb02-51586035a7e2._CR0,0,500,500_SX48_.jpg"
				],
				"customerRatings": [
					"5.0 out of 5 stars",
					"5.0 out of 5 stars",
					"5.0 out of 5 stars",
					"5.0 out of 5 stars",
					"5.0 out of 5 stars",
					"5.0 out of 5 stars",
					"2.0 out of 5 stars",
					"5.0 out of 5 stars"
				],
				"customerReviewTitles": [
					"My new favorite fall top!",
					"Love these tops.",
					"Addicted to Amazon Essential shirts!",
					"Best basic long sleeve tee I’ve ever found!",
					"Amazing quality for $11",
					"Most Comfortable Shirt Ever",
					"Very Long Sleeves, Not Cottony Enough",
					"Soft, a \"must have\" tshirt"
				],
				"customerReviewBodies": [
					"LOVE this tee. I am usually a M-L, with a little post-babies pooch, so I don't like clingy clothing. Ordered the olive in L, and it's PERFECT. I'm 5'9\"+, between 135-145lbs. The material is breathable, and the cotton/modal/spandex blend makes it feel slightly more polished than plain cotton, and I love the somewhat thicker weight... I've washed it in cool water, and while I was planning to air-dry it, a helpful kiddo put the laundry through the dryer, normal heat. The shirt did not shrink at all- YAY! I came back today to order three more of these, in different colors. For the price, comfort, and fit, you cannot beat this shirt.",
					"I love them. They fit me just fine and I weigh 340 pounds. I ordered XXL and it fits perfectly. I have absolutely no complaints.",
					"If you have ever worn Lularoe leggings, then you know what kind of softness I’m comparing this shirt to. It’s buttery soft and with wonderful stretch. I love black and white strip cause it goes with everything from jeans to green army vests. I wore this shirt every week and even bought other colors. I bought an XL because I wanted the shirt to be loose on me. I just had a baby and didn’t want to accentuate my love handles that take time to go away. I was 195lbs when u bought the shirt and my chest was a DDD. It fit great. Long enough to come midway down my bottom (leggings approved shirt). Most Importantly- it didn’t shrink too much in the dryer like all my other thin shirts! That’s the major headliner. Because all my clothes from China shrink the the dryer.\n\nStripes look awesome with solid colored vests! I posted pics. It’s just down right cozy, but you still look good enough to leave the house.",
					"These are the best basic long sleeve tees I’ve ever found! They are a really nice light stretchy material, and they are actually long enough! They aren’t like most shirts that are way too short and tight. I’m 5’7” 112 lbs, and I got an XS. It is a little bit loose, but that’s how I like my shirts to fit. I have an extremely long torso, and these shirts are a perfect length for me. I don’t even have to wear an undershirt.",
					"The fit and fabric of this shirt are wonderful - and the sizing is as expected. It's got a nice taper and the length is perfect for tucking into scrubs comfortably. The sleeves are tight, but not restrictive, so you don't have to worry about the opening of your sleeve dipping into any questionable substances. Overall, this long sleeve tee is worth every penny. I bought navy and white, and even the white is thick and doesn't have that sheer quality that some white tees have. Highly recommend this product.",
					"This shirt is SO soft! I'm 5'5\" and 170lbs and I got a medium and it fits comfortably how I like. I'm really looking forward to layering with this shirt to keep warm during the winter. 5 stars and love the price!",
					"I don't know why my images don't load right side up anymore. I am 5' 9\" 145lbs, 37, 31, 38 as I write this, and the medium fits well as usual. I am always on the hunt for the perfect long sleeve tee, and this isn't it, but it's great for $11. I ordered more colors, but after wearing this one for the day I think I'll return them. I want to see if Woolworth's long sleeve tees are the ones I'm searching for. Patty Boutik has gloriously long sleeves, but her tops tend to be low cut with tight sleeves.\n\nPros:\nTHE SLEEVES ARE LONG ENOUGH.\nThe burgundy is a lovely deep purple hue just like on the model.\nThe torso is also long enough.\nNeckline is comfy, not too high, not too low: I don't have to worry about bending over to chase kids and revealing anything.\nCons:\nThe material isn't cottony enough. I felt my pits get moist when I was moving around a lot earlier.\nThe sleeves could be looser at the bottom, but maybe they'll stretch a bit. They're also a little snugger over all than I prefer, but not awful.\nThe shirt does sort of cling to my meager chest. It doesn't form to my body quite the way I like. Like cotton. sigh.\n\nIt's a nice shirt, but it's not THE shirt.\n\nUPDATE:\nI changed my review to 2 stars after stocking up on Eddie Bauer, Carhartt, and Woolrich long sleeve tees. They're all more cottony and move with my body better. This shirt sort of got caught on my bustline and I ended up adjusting often throughout the day.",
					"H",
					"I haven’t worn the shirt out yet but right out of the package I LOVED it. The fit and feel is amazing. It’s like a silky cool touch. I bought to wear under my medical scrubs. A lot of times I find tee shirts that are too hot and not breathable but I can’t already I’m going to LOVE this.\n\nThe fit is also great. I’ve got a longer torso than most and I often find shirts to be awkwardly short And not fitting just right. This is definitely long enough and hugs me just right.",
					"It’s a fab item in terms of fit,stretch,durability and value for money. I tend to chose fabric with elasticity as they are more comfortable and softer to skin compare to 100% cotton which doesn’t have any stretch. I’ve found the sizing is in slightly large,I bought XS for my second purchase which fits perfectly,rather than my normal size S.",
					"T",
					"I liked the colour but it comes up on the tight side. Not as long as it appears on the photo and thin ,poor quality,not worth the money in my opinion.",
					"I was looking for a cotton blend stretch T-shirt, and gave this one a try. I initially bought two; figured the price is OK if they don't turn out to be that great. Was I pleasantly surprised!\n\nThe shirts are true to size, very soft and stretchy. They feel heavy, but in a good way (in other words, they are not flimsy). The fabric is not see-through and these shirts can be worn either by itself or as a base layer. They wash well too.\n\nThe fit is amazing. The length is substantial, which is exactly what I was looking for. I ended up ordering a few more shirts in different colors. The colors are as shown in images. I washed them a few times and there were no issues thus far. I highly recommend."
				]
			}
		},
		{
			"id": "1naMtjE",
			"title": "Amazon Essentials Women's Studio Relaxed-Fit Lightweight Crewneck T-Shirt, Multipacks",
			"price": "$11.03",
			"image": "https://m.media-amazon.com/images/I/71B-GnknMrS._AC_UX342_.jpg",
			"description": "We listen to customer feedback and fine-tune every detail to ensure our clothes are more comfortable, higher quality, and longer lasting—at affordable prices for the whole family.",
			"reviews": {
				"customerProfileNames": [
					"HeatherRiddles",
					"Momof8",
					"Lyuba",
					"KSul",
					"JijieF",
					"KatrinaDMcLeod",
					"0",
					"EV"
				],
				"customerProfilePictures": [
					"https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif",
					"https://images-na.ssl-images-amazon.com/images/S/amazon-avatars-global/599a6819-1c11-4adc-a7b5-f2a51bcd0db1._CR62,0,375,375_SX48_.jpg"
				],
				"customerRatings": [
					"5.0 out of 5 stars",
					"5.0 out of 5 stars",
					"4.0 out of 5 stars",
					"5.0 out of 5 stars",
					"3.0 out of 5 stars",
					"5.0 out of 5 stars",
					"5.0 out of 5 stars",
					"5.0 out of 5 stars"
				],
				"customerReviewTitles": [
					"Give a nice, flattering body appearance.",
					"LOVE IT!",
					"Runs bigger",
					"Hides your shape, if that's what you want.",
					"It has a weird cut around the shoulders",
					"Favorite workout shirt!",
					"A beautiful fitting t.",
					"I listened to the other reviews - runs large"
				],
				"customerReviewBodies": [
					"Backstory: Due to rare health complications I am required, by law, to be on birth control in order to continue getting my life-saving specialty medication as my specialty medication causes birth defects. Birth control tricks your body into thinking it’s pregnant, and as a result, I’ve got a protruding, rounded-belly. Gasp.\n\nReview: Media likes to showcase girls with 0% body fat and I’d say that’s a very dumb standard for the average woman to follow. Every woman is different and your body has its own story to tell. Your body type is YOUR body type, don’t let the media make you feel ashamed for not being a size 0. It is an unrealistic standard-no offense to any naturally thin ladies out there, everyone has a different metabolism/different story. But that doesn’t mean you can’t find clothing that flatters your unique shape! I for one hate clothes that stick to my skin! I like loose fitting clothes such as this shirt cause it’s easier to walk/run around, bend over, and reach up high. I don’t like “baggy clothing” that doesn’t flatter my shape at all. The shirt is good quality, I don’t have to worry about exposing some skin, and it’s tight and loose where it needs to be and gives me a nice, modest, feminine appearance. I got the color in Heather-gray as I do not like bright-colored clothing due to my introverted personality. The fabric is lightweight, stretchy, and comfy. I wouldn’t buy lighter colors as I can see there might be the problem of it being see-thru but one could fix that by wearing an under-shirt. After seeing how this one fits on me I will definitely be buying a couple more to complete my wardrobe for 2020.",
					"Awesome shirts! I ordered two and I want more! Great casual fit if you have larger boobs especially- hangs very flatteringly! Looks great with casual jeans or with workout leggings.",
					"C",
					"This was the perfect lightweight shirt for hiding my first trimester belly. We didn't want to announce until second trimester. It hid it for the first half of my second as well but by then I didn't care. It has a boxy shape with a comfortable material. Other women's shirts were too fitted and men's shirts weren't cute. If you aren't pregnant but have a belly you want to hide, this will work for you. If you want to show off your curves, this is not your shirt.",
					" I love the material. It's stretchy but the cut of the shoulders and neckline looks really awkward. (It's in the front and because of that it doesn't sit or lay flat.) It almost looks like I have my shirt on backwards. I bought a medium, it's pretty roomy and there's a shiny logo like it's a sporty top.\n\nI added a video, I hope it gives a picture of my complaints about this design.",
					"Perfect workout shirt! I am heavier than I like right now, so I want a workout shirt that is flattering, not so thick I’m hot, but not so thin my unflattering parts can been seen bulging under the shirt. This one is perfect. And it’s not too short. I am 5’8”.",
					"I Am a 36C/D, with 44” hips. Usually t’s fit too tight or are way too loose these are perfect!",
					"I listened to the other reviews and ordered an XS (I am usually a S/M in shirts) because this shirt runs large as it is meant to fit loose around the body and be a little longer in length. I am 5' 2\", 125 lbs, 34B and the XS fits perfectly. Its fits relaxed while still being flattering. The quality of the shirt is awesome and I can wear this with a nude bra without an undershirt. I can dress this up or down too. I definitely recommend this shirt.",
					"I am happy with my purchase. the sizing can be a bit confusing, so I would advise anyone to use a tapemeasure before ordering the size that they want. the one I ordered is a bit baggy but is still okay. i really love the softness of this tshirt. I will happily recommend this product and seller. It arrived very quickly, which i was very happy with. I would definatly buy more of these when other colours become available.",
					"Bought medium as I’m size twelve but too big.",
					"Beautiful colours and fabulous quality. Have bought 4 colours, and various for my daughter too- it was worth paying that little bit more . Washes well and looks as good as new when it comes out of the dryer .",
					"Lovely soft fabric, quite thin, nice relaxed fit but only really suitable for lockdown loungewear or pyjamas.",
					"I'm 5' 6\" and wanted a top that covered my bum when wearing yoga pants. The tee shirt quite a lot shorter than I was expecting, and shorter that the images. It is a good 3-4 inches shorter than required to cover my bum. It looks shapeless (which I was ok with had it of covered by bum). Returning."
				]
			}
		},
		{
			"id": "J4mI3y9",
			"title": "Nautica Women's 3-Button Short Sleeve Breathable 100% Cotton Polo Shirt, Red, Medium",
			"price": "$20.44",
			"image": "https://m.media-amazon.com/images/I/61P+QK4Lk2L._AC_UX342_.jpg",
			"description": "Move with ease in a breathable pique knit that fits and flatters This button-placket polo, a timeless sportswear piece.",
			"reviews": {
				"customerProfileNames": [
					"Yupitsmeagain",
					"coffeelover",
					"AlejandroAngulo",
					"AnaR.",
					"RobetsysGraffe"
				],
				"customerProfilePictures": [
					"https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif"
				],
				"customerRatings": [
					"5.0 out of 5 stars",
					"3.0 out of 5 stars",
					"1.0 out of 5 stars",
					"4.0 out of 5 stars",
					"5.0 out of 5 stars"
				],
				"customerReviewTitles": [
					"Great top!",
					"Not a fan",
					"Polo náutica malo",
					"Soy Talla M ,",
					"",
					"Made to measure, I loved it !!! I want many more"
				],
				"customerReviewBodies": [
					"I wanted a nice classy casual top that wasn't thin or transparent. These tops are great!\nI am 35\" 25\" 38\" a 34D bust. I ordered the M it fits perfect as a slightly looser tuck the front in type top. If you like closer to form fitting get the small. The colors and fit look like the pictures and the length hits just below my hips. I am 5'6 122lbs. The perfect casual preppy top :)",
					"I love polo shirts, but this one is cut just a little too small. I am a Medium in every brand of polo shirt I’ve tried, but this one has narrow shoulder seams and the sleeves are very short and tight. I won’t buy another one. And it’s expensive too!",
					"Mal",
					"Queda un poco ancho, normlamente soy talla M sugiero tomar una talla menos. Excelente calidad, muy lindo.",
					"",
					"I have no complaints, everything was perfect. I loved the color, it fit me perfectly",
					"Esperaba una mejor calidad del producto lo pensaba utilizar para uniforme de empleadas una mala decisión comprar en estados unidos de norte América no trato de ofender ni quiero que lo tomen personal preguntaron mi opinion esta es gracias",
					"",
					"Color tal cual la foto. La talla es justa y la tela es mas delgada q la tela normal\nDe las playeras polo de esta marca.",
					"",
					"Je n'ai pas aimé acheté un produit qui n'est pas ce qui est annoncé.",
					"",
					"Muy cómodo para cualquier ocasión",
					""
				]
			}
		},
		{
			"id": "wPLhxWg",
			"title": "Amazon Essentials Womens Relaxed-fit Short-sleeve V-neck Tunic, Pack of 2",
			"price": "$23.59",
			"image": "https://m.media-amazon.com/images/I/811pbyzMkYL._AC_UX342_.jpg",
			"description": "Amazon Essentials is focused on creating affordable, high-quality, and long-lasting everyday clothing you can rely on. Our line of women's apparel includes cashmere sweaters, fleece and down jackets, and more, including plus-size options. Our consistent sizing takes the guesswork out of shopping, and each piece is put to the test to maintain the highest standards in quality and comfort",
			"reviews": {
				"customerProfileNames": [
					"kelly",
					"Kim",
					"D-M-R",
					"ElleB.",
					"Rachel",
					"Becky",
					"DebbieLeeWesselmann"
				],
				"customerProfilePictures": [
					"https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif",
					"https://images-na.ssl-images-amazon.com/images/S/amazon-avatars-global/0ea57625-1e5f-4642-be3c-d5b553c32777._CR0,0,375,375_SX48_.jpg"
				],
				"customerRatings": [
					"5.0 out of 5 stars",
					"5.0 out of 5 stars",
					"5.0 out of 5 stars",
					"4.0 out of 5 stars",
					"5.0 out of 5 stars",
					"4.0 out of 5 stars",
					"4.0 out of 5 stars"
				],
				"customerReviewTitles": [
					"Comfort",
					"Another win for Amazon Essentials! LOVE these tops, but they run large so I would size down…",
					"Soft, breathable, comfortable, with a bit of stretch",
					"Super soft shirts with a weighted feel",
					"Love this brand for reliable shirts",
					"Nice shirts, wish I would've read reviews on sizing.",
					"Soft, Comfy, But Relaxed Fit Only With Narrow Hips"
				],
				"customerReviewBodies": [
					"Love the fabric. Very comfortable",
					"I",
					"I",
					"Pros:\nFit true-to-size\nSuper soft\nWeighted\nRich coloring\nEasy to wash (cold wash, tumble dry low)\n\nCons:\nWrinkle easily\n\nThese shirts are a great choice for those looking for thick, high-quality, and super soft options. They’re attractive, work super well as a closet basic, and manage to be both breathable and weighted.\n\nThe best thing about these shirts is the material. The 95% Viscose and 5% Elastane blend makes these super soft and breathable. When I first took these out of the package, I was worried that they would be too heavy to summer-wear, however, I found that they are comfortable in high heat despite the weight. The fabric is so soft that while I wear these day-to-day, they would also work great as loungewear or sleepwear.\n\nThe coloring of these is rich and perfectly worn looking. Straight out of the bag they look comfortable and well-loved. The coloring is vibrant but still looks casual and comfy. It makes it super easy to dress these up or down.\n\nOverall, I would highly recommend these shirts to anyone looking for any reason. The only complaint that I have about them is that they tend to wrinkle easily, but if you hang them quickly after drying, it isn’t much of an issue.",
					"I",
					"T",
					"Because these two tunics are stretchy, you need to have the right body shape if you want them to sway at the bottom in the usual \"relaxed-fit\" style. My usual medium fits me, but because I'm hippy, they hug my hips instead of falling loose. If I were larger on top than at the hips, they would be perfect. Still, I like these shirts. The material is soft and thin without being see-through. As expected, the length is tunic-long. I like wearing them over bike/yoga shorts.\n\n-- Debbie Lee Wesselmann",
					"Ganz tolle Shirts\nGute Qualität, nach dem waschen noch in Form\nFarbe wie abgebildet\n💯 Prozent kaufempfehlung",
					"",
					"Mi piace molto il modello e i colori sono belli. Speravo in un tessuto un po’ più fresco.",
					"",
					"Sono soddisfatta 😀",
					"",
					"Die groesse\nGr. M reicht vollkommen fallen sehr gross aus\nBesser 2 Nr kleiner bestellen",
					""
				]
			}
		},
		{
			"id": "Jgdw9nl",
			"title": "Amazon Essentials Women's Long Sleeve Tunic Poplin Shirt",
			"price": "$11.50",
			"image": "https://m.media-amazon.com/images/I/81kP4PAkNSL._AC_UX342_.jpg",
			"description": "An Amazon Brand - A wardrobe staple, this classic long-sleeve shirt provides an easy look perfect for any occasion\n\nAmazon Essentials is focused on creating affordable, high-quality, and long-lasting everyday clothing you can rely on. Our line of women's apparel includes cashmere sweaters, fleece and down jackets, and more, including plus-size options. Our consistent sizing takes the guesswork out of shopping, and each piece is put to the test to maintain the highest standards in quality and comfort.",
			"reviews": {
				"customerProfileNames": [
					"wendyA.Mcgrath",
					"Haly",
					"Marsha",
					"BH",
					"Becky",
					"KindleCustomerAa",
					"KarefulShopper",
					"Bev"
				],
				"customerProfilePictures": [
					"https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif"
				],
				"customerRatings": [
					"5.0 out of 5 stars",
					"5.0 out of 5 stars",
					"4.0 out of 5 stars",
					"2.0 out of 5 stars",
					"2.0 out of 5 stars",
					"5.0 out of 5 stars",
					"2.0 out of 5 stars",
					"3.0 out of 5 stars"
				],
				"customerReviewTitles": [
					"Very good choice",
					"Love this!!",
					"Nice quality. Too big.",
					"Nice Loose Fitting Tunic",
					"Very large baggy shirt",
					"Love it!",
					"Unflattering",
					"Too long"
				],
				"customerReviewBodies": [
					"I have been looking for a white tunic blouse that was not gauzy. I saw this and thought I would try it. It came quickly and was exactly what I wanted. Seems to be nice quality and well-made. I am very happy with my purchase",
					"Great basic with tunic! The material is great quality and keeps me cool in the summer. It’s a classic that everyone needs in their wardrobe",
					"Loved the quality. But it's too large. Size down",
					"This would be nice if it weren't for all of the wrinkles. This top is too much maintenance for me to keep. I am not a fan of having to iron my clothes so I returned it.",
					"I really wanted to like this top because it seems like such a good staple to have in a work closet, but it was way too big. Long sleeves and baggy around the middle. Maybe I should’ve ordered extra small? I will be returning it.",
					"I love this tunic top! It washes up with no problem with wrinkles. I'm short, so it is very long on me but it fits so well otherwise and I love tunics that are long.",
					"Don’t think about ordering this shirt unless you’re at least 5’7” tall. I’m 5’4” and it came down to my knees. It’s basically a man’s shirt with a few gathers on the back. Very unflattering, sleeves were too long and narrow, and it would definitely require ironing. Returning it.",
					"I like the shirt but found it to be too long … unusual due to I am 5” 10’ inches tall. Just not used to wearing such a long shirt. Otherwise the shirt fits true to size and is very comfortable.",
					"Erst in XL bestellt und dann in M\nM passt sehr perfekt( normal habe ich 42)\nBei 1,80m geht es mir bis zu den Oberschenkel!In Marineblau wirkt es sehr chic wie Tommy Hillfiger nur viel günstiger sieht aber genau so edel aus👌🏻Hab es mir gerade nochmal bestellt! Bin begeistert schöner weicher Popeline Stoff, macht was her!",
					"",
					"praticamente è un abito e non una camicia. ho preso la mia solita taglia ma veste enorme. il tessuto è ottimo.",
					"",
					"chemise confortable a porter dans la maison; la couleur bleu pale est belle et le coton souple et mince est conforme a mes attentes. merci....",
					"",
					"Ich liebe diese Bluse , tolle Qualität zu mega Preis",
					"",
					"Talla grande",
					""
				]
			}
		},
		{
			"id": "YMXvXv8",
			"title": "Hanes Women's Shirred V-Neck T-Shirt",
			"price": "$6.99",
			"image": "https://m.media-amazon.com/images/I/81mHPmuyAQL._AC_UX342_.jpg",
			"description": "This Hanes women's slub shirred v-neck tee stands out three ways from your ordinary tees: it's lightweight, the neckline is shirred and the slub fabric gives it a textured look. You can't go wrong with this tee",
			"reviews": {
				"customerProfileNames": [
					"RRJCRVT2912",
					"Corinna",
					"DianeP.",
					"rebeccaweston",
					"kfoster-martin",
					"zdamaw",
					"KarenLamberson",
					"MomtoMAKE"
				],
				"customerProfilePictures": [
					"https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif"
				],
				"customerRatings": [
					"5.0 out of 5 stars",
					"5.0 out of 5 stars",
					"1.0 out of 5 stars",
					"5.0 out of 5 stars",
					"5.0 out of 5 stars",
					"3.0 out of 5 stars",
					"1.0 out of 5 stars",
					"5.0 out of 5 stars"
				],
				"customerReviewTitles": [
					"Perfect shirt for me",
					"Nice top",
					"Unhappy with purchase but already washed",
					"An inexpensive soft well-fit Tee that looks pretty!",
					"Bought cause cotton and cheap",
					"Another mid-sections disaster...",
					"Poor quality",
					"My favorite shirt, but the color in the photo was very misleading"
				],
				"customerReviewBodies": [
					"I don't like tight fitting clothes. I love this shirt because it is long, it does not fit tight around the middle,it is lightweight but not shear, the neckline is flattering for my neck but is not too low, & the shirring brings it steps up from a plain v-neck tee shirt. The shirring is a feminine touch. You can wear this shirt with so many types of bottom clothing. The shirt washes & dries well. I've had this for a little while now & it does not pill & it still looks good. I'll buy more colors soon.",
					"I have ordered other Hanes tops that shrunk a little bit after washing and drying. This top says they are pre-shrunk but these tops shrunk a little bit as well. Turned out fine for me because I ordered a large. I normally wear medium to large sizes for tops (8-10 U S size). Also when I first got it and tried it on it was a little rough and itchy on the inside but after washing and drying with fabric softener they are fine. Glad for that! Itchy clothes are not good.",
					"I grabbed 3 of these when they were listed for $5 a piece. My mistake for not completely reading the description. Missed \"shirred\" somehow. Actually I had never heard that word before! Lol. I automatically thought the shirts would be wonderful because of the Hanes lable. \"Hanes is a Classic American Company that makes standard and reliable underwear. Hanes is most widely known for their basic white collection. A standard in everyone's drawer. Hanes is made in the USA but sold around the world.\" These shirts were NOT MADE IN THE USA ( which it states in description) . They're not even 100% cotton. Again, my bad not fully reading the description. They're itchy. They make me sweat and I've already donated them. Guess I should've only washed one and returned the others. My fault so maybe I shouldn't have given them such a lousy review?",
					"Coverage,shape,colors,workmanship and price so impressed me, I bought another three. At 140 lbs and 5'3\" in a soft lumpy 73 year old frame, the large is nicely form-fitting and and the XL fits in a loosely casual way. Buy these!",
					"Ive got a pair of navy pants with this blueish green print. So, im trying to find a top that doesnt clash with it. I decided to try this in the blue and greenish blue colors, because: 1. they are cotton and 2. they are $7/each. They are very well made. The cotton fabric is comfy and breathes. The gathered neck is flattering, and they are pretty long (im 5’3” and they cover my butt) and actually the blue/green works with the pants, so its all good. Even if i sleep in them they are worth the price but i can find several pants and shorts that work with both colors. I havent washed them yet, but i will wash in cold water and hang to dry. If they shrink appreciably i will update my review.",
					"The material is soft and comfortable. It fits great through the shoulders and bust. My mid-section is a whole nother story! This is a top that will only be used under something else. It's very form fitting - not a good look for a fat old granny :-( .",
					"So I got this tshirt and it fit ok but washed it and now it’s two sizes small and shorter :/ and has a hole now. I guess you get what you pay for but never got to wear it",
					"I",
					"I ignored most of the (negative reviews)and ordered first XL and it fitted perfectly. So I then ordered 4 more, washes well in medium hot water. Ordered the bright pink. Beautiful colour for my complexion and blonde hair. My bust size is 42 B cup.",
					"This is my new favourite shirt. I found it fits true to size and is a perfect fit for me. I liked it so much I bought an extra black one and 2 other colours. Quality is great and they wash up really well. I don’t put my shirts in the dryer and so far after 5 or so washes they’re holding shape, not pilling and colours are still bold.",
					"It fits small, I ordered an XL, no way is it an XL. I checked the tag inside to make sure it was an XM and it was. My other XL t-shirts are comfortably roomy without being baggy. A lot of women of all ages carry their weight across the lower abdomen. This should be remembered when designing a t-shirt or any other top for women. The XL t-shirt fit ok across the top, but tight across the abdomen, really not much use to me unless I loose weight or buy an XXL but then it will be big across the top. T-shirts, most tops, are best if they are slightly a-line in design. Material is a little on the thick side for summer for me, I prefer lighter weight material for t-shirts.",
					"Cuando llego me quedó un poco grande y la lavé y eché a la secadora. Encogió dos tallas. El algodón es súper corriente. Áspero antes y después de tres lavadas sigue igual.",
					"",
					"This T-shirt is 100% cotton (read: prone to shrinking), and I sized up from my regular Medium to a Large. I am 5’4”, 140-ish lbs. I had bought Hanes tees before and they shrunk a LOT, so I was not surprised that these also shrunk considerably after the first wash and dry. I do still find it a slightly roomy fit (which is my preference), so if you prefer a fitted Tshirt, get your regular size. The shirt is a slub material, so it has a slightly rumpled texture, but the material was not too thin, in my opinion. It was also a nice length, covering halfway down my bum."
				]
			}
		},
		{
			"id": "XRy_qGP",
			"title": "MIROL Women's Ruffle Sleeve Tops Summer Casual Blouse Crew Neck Solid Cute Tunic Shirt",
			"price": "$14.99",
			"image": "https://m.media-amazon.com/images/I/71-rXt+t3oL._AC_UY445_.jpg",
			"description": "60% Polyester, 35% Rayon, 5% Spandex\nPull On closure\nMachine Wash\nMEASUREMENT: S(US 4-6),M(US 8-10),L(US 12-14),XL(US 16-18); For more detials, please refer to the size chart. If you are not sure about size, feel free to contact us.\nMATERIAL: Lightweight and soft knitted fabric, skin-friendly, breathable, non-irritating, loose and comfortable, perfect partner in summer.\nFEATURES: Solid color round neck design, simple and versatile, flutter sleeves and ruffle edges perfectly modifies the shape of your arm. Tunic tops is moderate in length, you can easily match jeans, casual pants, skirts, high heels or boots to create a stylish and attractive look.\nOCCASION: This cute and elegant summer tees is suitable for most occasions. For example, office, home, party, travel, vacation, hang out, shopping, photo. Fashion and never out of style. It is definitely a must-have item for your wardrobe. Of course, this also be an ideal gift for your girlfriend, wife and daughters!\nGARMENT CARE: Hand wash or machine wash, hang to air dry, do not bleach.",
			"reviews": {
				"customerProfileNames": [
					"Aleisha",
					"Megan",
					"cls",
					"KristenH.",
					"Lisa",
					"Kat",
					"BetsyWeaver",
					"TeamMed"
				],
				"customerProfilePictures": [
					"https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif",
					"https://images-na.ssl-images-amazon.com/images/S/amazon-avatars-global/64029850-e3fd-428f-bf4b-0891a1548494._CR0,26.0,281,281_SX48_.jpg"
				],
				"customerRatings": [
					"5.0 out of 5 stars",
					"5.0 out of 5 stars",
					"5.0 out of 5 stars",
					"5.0 out of 5 stars",
					"5.0 out of 5 stars",
					"5.0 out of 5 stars",
					"5.0 out of 5 stars",
					"5.0 out of 5 stars"
				],
				"customerReviewTitles": [
					"Nice basic shirt for a good price",
					"Cute girly shirt",
					"Super cute & good quality",
					"Great Versatile Summer Top!",
					"Comfy and Versatile, great quality",
					"Very nice",
					"Very cute",
					"Perfect!"
				],
				"customerReviewBodies": [
					"I was looking for basic, inexpensive pieces to add to my wardrobe. The flowy sleeves are a nice simple upgrade to a basic tee. I like that the sleeves don't show the sides of my bra at all, which can happen sometimes with this sleeve style. Nope, completely covered! I'm 5'3 and 125 lbs and ordered the small, it fits nicely with a bit of extra room at the tummy like I wanted. I like the bright royal blue color too. I may consider buying it in other colors if this one holds up after a few washes.",
					"This shirt is so soft and so comfortable! It's very simple, but with the cute detail sleeve it makes to shirt so versatile. You can dress this up or wear casual.",
					"This shirt is very cute, not too thin and not too thick. I ordered a small as i usually wear small or medium in women's, and reviews had suggested sizing down if between sizes. Fits great! I'm 5'10\", 36B, 150 lbs.",
					"I really love this top! It can be worn casual, or dressed up to look nicer! I love the flowy sleeves, and like the length of it. It's incredibly soft, and very comfortable to wear all day at work! I am 5'3\", 130lb, 32DDD, and I ordered a medium. I plan to wash it and see if it shrinks, and if it does I'll order another one in large and I'm sure it'll be perfect. Either way, I'll be ordering more colors.",
					"I waited until after I have washed these blouses before reviewing. First, I hang dry my clothes (don't use a dryer for blouses). I was surprised at how the fabric is thick enough to give a pleasant look yes light weight enough to feel airy and cool. The body is not at all transparent. The sleeves give it a look that makes it versatile - can be worn super casual or as part of a more dressed up look. For me, the bottom hangs out too loose (but I have that issue with other shirts), so I always tie a dressy knot on the side, which I feel adds to it's cuteness.",
					"Flattering.. comfortable… looks nice on",
					"Way cute and very flattering. It doesn’t snug to you.",
					"Love this top! I've worn it 4 or 5 times so far. It's cute, comfortable, flattering, and great for warm weather."
				]
			}
		},
		{
			"id": "PjunYIe",
			"title": "Daily Ritual Women's Jersey Twist Front Cropped Crewneck Tee",
			"price": "$16.98",
			"image": "https://m.media-amazon.com/images/I/71qqiaN2W4L._AC_UX342_.jpg",
			"description": "An Amazon Brand - This classic, versatile shirt provides an easy look perfect for any occasion\n\nDaily Ritual celebrates the beauty in simplicity. Our range of coveted classics features tees, tanks, dresses, and leggings that are ready to be styled, layered, and lived in. Each piece is made with luxuriously soft fabrics and is priced to make stocking-up a breeze—you'll want one in every color.",
			"reviews": {
				"customerProfileNames": [
					"Radar626",
					"OpinionsRLike...",
					"Sarah",
					"Cindy",
					"SteveandAmy",
					"Sailor",
					"Self-CareMama",
					"OurBigActiveFamily"
				],
				"customerProfilePictures": [
					"https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif",
					"https://images-na.ssl-images-amazon.com/images/S/amazon-avatars-global/96e43d08-2401-4d83-8993-ccb862efa761._CR0,0,500,500_SX48_.jpg",
					"https://images-na.ssl-images-amazon.com/images/S/amazon-avatars-global/019763ae-1bb4-4370-8104-e60b007d448e._CR0,0,493,493_SX48_.jpg",
					"https://images-na.ssl-images-amazon.com/images/S/amazon-avatars-global/402e6f06-9448-4e7d-a347-20ac5d91c445._CR0,0,374,374_SX48_.jpg",
					"https://images-na.ssl-images-amazon.com/images/S/amazon-avatars-global/7a77cc8d-7f3f-4c58-ad3b-709c31ffeae5._CR0,0,500,500_SX48_.jpg"
				],
				"customerRatings": [
					"4.0 out of 5 stars",
					"5.0 out of 5 stars",
					"5.0 out of 5 stars",
					"4.0 out of 5 stars",
					"5.0 out of 5 stars",
					"5.0 out of 5 stars",
					"5.0 out of 5 stars",
					"5.0 out of 5 stars"
				],
				"customerReviewTitles": [
					"Better than a basic tee",
					"SO comfy; surprisingly flattering",
					"My mom belly can pull of a crop top?!! 🙌🏼",
					"True to Size but I Sized Up! Soft - Well Made - Comfortable!",
					"The cut of this is incredibly flattering!!!",
					"Pretty cute, elevated basic tee",
					"Flattering, butter soft",
					"Very cute and flattering!"
				],
				"customerReviewBodies": [
					"A super comfortable tee that can be worn to work! How great is that? The front twist that goes into a wide rear hem on this top gives it enough of an upgrade that there is no reason why this can't be worn into the office. It says it's a crop top, but with my short torso this fits closer to a regular tee. Having a larger chest will impact this, however. I did notice the difference in where the hem reached on me when trying on sans bra versus wearing one. I think if I had sized up, this problem wouldn't be present. Even going up a size or two to get the extra length in the front, this shirt won't be sloppy or baggy thanks to the way it's designed. The twist in the front helps with a nice little optical illusion of a smaller waist and fitted top even when it's a size bigger than you normally wear.\n\nThe fabric is silky soft and breathable, and isn't see through. Arm holes are aren't tight or restricting, and aren't so oversized that someone can see your side chest any time you raise your arm. Pretty easy to dress up or down with accessories, too. Being made from viscose means it won't shrink and doesn't wrinkle easily. Care is basic - machine wash on delicate cold and dry on low heat. Easy to care for, comfortable, flattering fit, decent price - what more can you ask for?",
					"This is an incredibly comfortable shirt. It is made from a soft, smooth, stretchy jersey fabric. It does not look like active wear, though it could be used as such; this is actually a pretty versatile wardrobe piece, especially in the black color I ordered. The material is thin enough to comfortably layer over another shirt, or I can layer a sweater over it. Depending on what I pair it with, it can look dressy or casual. I am apple-shaped with a short torso, and on my body, this top hits at the perfect length to create a flattering illusion of a smaller waist. For size reference, I am 5 foot 7, weigh 165 pounds, have a 36C bust with narrow shoulders and (as mentioned) a short torso, carry most of my weight in the middle, and wear a US women's size 10 (medium sizes at Old Navy and H&M). I ordered this shirt in the \"large\", and love the fit, though to prevent my jiggly belly showing when I raise my arms, I either wear it with higher waisted skirts/ pants or over a tunic length cami. I included pictures with regular mid-rise pants to give a better idea of the shirt's length.\nI love this comfortable, versatile, and surprisingly flattering shirt, and would not hesitate to order it again.",
					"I loved the way this top looked on the model… but when I saw the word “crop” I freaked out. I’m 40 and have a toddler; there’s no way i’d ever wear something that exposes my stomach. It looked like this could be pulled down a little, so I took a risk and ordered it in a size bigger than usual. SO GLAD I DID! For reference, I’m 5’0”, 150-155 lbs, and 36C.\n\nI’m normally a Medium or Large, so I went Large hoping it would add a little length. It still looks nice and fitted in the waist, and somehow creates the illusion of a smaller midsection! I definitely won’t feel comfortable raising my arms too high because it goes up past my belly button when I do. Wearing it with high waisted pants solves that issue.\n\nThe material is super soft and stretchy. Reminds me of bamboo fabric. Looks like it’ll wash well. To be honest, I’m shocked this is as cheap as it is! I’d probably pay $40 for something like this.\n\nHighly recommend it. If you’re worried about your tummy showing, go up one or two sizes. I actually think an XL would fit me without looking sloppy, too.\n\nHope this helps! 😉",
					"Current price $27.30. I'm 5'6\" and 130 lb. I normally order a medium but due to the type of top it is, I ordered the large. It is a bit big; however, I love how the bottom waist area fits and I like the extra length.\nThe fabric is super soft and not see through the fabric is on the softer, thinner side. I love this type of top with high waisted pants and skirts. This top is comparably priced to other tops like this. Soft and comfortable to wear. 4 Stars. Hope you find this review and picture helpful. I think this top looks great with my new high waisted, wide leg pants!",
					"Love this shirt! It will be perfect with high-waisted jeans, paper bag pants, and with skirts in the summer. I'm older (53), so I won't want to be showing any midriff. Younger gals will love to wear this with jeans or pants that maybe show a little skin in the summer or warmer climates. How much midriff is exposed totally depends on the pants/skirts you wear with it. If you don't want to show skin (like me), you'll be fine as long as you pair it with something high-waisted, and the look will be so, so cute!!!!! ~Amy",
					"Ok so I am in my early 40s and I'm in fashion and I love a good black tee. I grabbed this top because it already looks like what I do with my tees now, twist and tuck. I was a little worried about the cropped aspect of this just because I'd wear this to work and don't want to feel super exposed. I will say this shows a lot more of my midriff than this picture implies, but with high rise jeans it totally works for me.",
					"I’m in love with this crop. It’s a nice long length crop so you can wear it with a high waisted bottom without worrying about accidentally showing too much skin. The twist at the bottom is SO flattering. And it’s so, so soft it gives that very comfy, pajama feel. This will be a go-to for this me this summer for sure. Highly recommend.",
					"I sized up one size as this is listed as a crop top and I wanted a little more coverage. This is a very flattering top. Even with the crop, it really only shows my belly button because of the twist front.\n\nIt's soft and very cute and appropriate to wear to work even, with the upsizing.",
					"Vom Schnitt und von der Verarbeitung her, ist es wirklich ein hübsches Teil, ABER! Ich habe noch nie erlebt, dass ein Kleidungsstück so abscheulich nach Chemie und Duftstoffen stinkt.\nIch reagiere normalerweise überhaupt nicht empfindlich auf sowas, aber da ist mir wirklich schlecht und schwindelig bei geworden, besonders beim Bügeln.\nAbartige Dämpfe.",
					""
				]
			}
		}
	]
}
