{
	"womensJackets": [
		{
			"id": "rbsukDT",
			"title": "Columbia Women's Benton Springs Full Zip",
			"price": "$23.29",
			"image": "https://m.media-amazon.com/images/I/61NTLJotLRL._AC_UX342_.jpg",
			"description": "An updated Columbia classic, this cozy fleece offers instant insulation in a versatile, everyday style with a new, more active slim cut.",
			"reviews": {
				"customerProfileNames": [
					"RebeccaForbes",
					"Audrey_Ruth",
					"Nneka",
					"H.Clark",
					"PaulaG.Cannon"
				],
				"customerProfilePictures": [
					"https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif",
					"https://images-na.ssl-images-amazon.com/images/S/amazon-avatars-global/99b1943f-265f-4efa-90b6-cb356c7cb70c._CR0,0,960,960_SX48_.jpg",
					"https://images-na.ssl-images-amazon.com/images/S/amazon-avatars-global/37b0055f-7332-4e98-bbe1-89905de863bd._CR0,0,497,497_SX48_.jpg",
					"https://images-na.ssl-images-amazon.com/images/S/amazon-avatars-global/a8432241-fa63-4699-b358-e72286828f54._CR62,0,375,375_SX48_.jpg"
				],
				"customerRatings": [
					"1.0 out of 5 stars",
					"4.0 out of 5 stars",
					"5.0 out of 5 stars",
					"5.0 out of 5 stars",
					"5.0 out of 5 stars"
				],
				"customerReviewTitles": [
					"Beware! You may unknowingly get a used jacket!",
					"LACKING SHAPE BUT SO SOFT",
					"Good for Cool Spring Days",
					"Pretty & Practical",
					"Most comfortable warm jacket ever! true to size LOVE these!"
				],
				"customerReviewBodies": [
					"I",
					"S",
					"I love this fleece. I had already ordered one in the Paisley Purple color and I liked it so much that I decided to get another one in Heather Gray! I got a medium and it's a good fit. I'm 5'3\", 124 lbs, with 34\" bust, 28.5\" waist, and 36\" hips. I am usually a small in women's sizes and the purple one I have is a small. Both fit me. The medium is a little looser for a more relaxed fit. I want one in the Lychee color too! These fleece jackets are so cozy and pretty colors. Glad I bought it. The only thing I didn't like was that the gray one took longer to ship to me than the purple one. It arrived 8 days after I ordered it, whereas I got the purple one in 2 days if I recall correctly. It seems to be a popular jacket, so that's probably why. Will probably order another just to have different colors!",
					"I wanted to do a review for others with what might be called a \"wiry build\" , since I didn't many reviews from someone similar to my body size.\n\nI'm 5'7', 115pds, 34x24x34, lean athletic build, bought Stone Green & Columbia Navy in an XS.\nThe sizing on these jackets is very generous, to me it fits 1 to even 1.5 sizes too big, but the cut makes it fit nicely. It's not fitted anywhere, but is a nice relaxed shape that doesn't \"balloon out\" from the body, and the drawstring at the bottom hem allows you to cinch it in as much as you'd like. In my photo, the bottom is cinched in ~2\", without this it flares noticeably outward & away from my lower body.\n\nThe length of the jacket is perfect for me, hits slightly high but still hip level, and sleeves are long enough to reach past my wrist bone as I type this review. Nothing rides up or shows anything when I raise my hands above my head.\n\nThe colors are really lovely, but they aren't what I would call vibrant or saturated- they look more or less as they do on the screen, there is a certain flatness. That being said, the Stone Green surprised me, it's a really gorgeous silvery sage green that I LOVE, not dead drab green as I was worried it might be. The Columbia Blue is as others have described, it's not a true navy, but more a medium slightly washed out denim blue with the slightest bit of green to it. Definitely not navy, but not teal either. The pictures listed for the color are most accurately represented in the photos of the plus size model, IMO. Being familiar with this brand, I knew this. BUT if you're looking for traditional navy, go with Dark Nocturnal instead.\n\nFabric is medium thickness, somewhat stiff, no stretch, blocks wind well. There is some drape in these jackets but not much; it's very reminiscent of the polar fleece from the 80's & 90's- not built to look luxe like an Osito jacket, but will handle wear and tear beautifully (while standing away from your body a bit due to stiffness). It's warm, but I don't think it would hold up alone in much less than 40 degrees Fahrenheit, or if you were in extremely \"wet cold\" conditions.\n\nOverall, it is a wonderful option if you just need a reliable fleece that holds up well to wear, has some nice color options, & won't break your heart if it gets ruined doing outdoor activities or playing with kids, etc. Really can't find a better option at this price, so if you're on the fence, I would say buy it. Just size down!!!",
					"O",
					"It's comfortable, fits well and looks good. Been wearing the fleece non stop since purchased!",
					"I was very disappointed. The colour was lighter than depicted and it was very boxy , not slightly fitted as shown in the photo. The fleece was poor quality, more like a Costco or Walmart brand when I compared it to other Columbia fleeces my daughter owns. I suspect it is a counterfeit.",
					"Good quality and perfect fit",
					"Good quality, nice cut, lightweight to throw on and stay warm on cooler days.\nLove the colour too.\nCool jacket.",
					"Very wide across shoulders."
				]
			}
		},
		{
			"id": "MCb0iGB",
			"title": "Columbia Women's Switchback Iii Jacket",
			"price": "$39.95",
			"image": "https://m.media-amazon.com/images/I/51hoafZvCpL._AC_UX342_.jpg",
			"description": "100% Polyester; 100% Nylon\nImported\nZipper closure\nMachine Wash\nCOMFORTABLE RAIN JACKET: The Columbia Women’s Switchback III Waterproof Rain Jacket is a lightweight waterproof rain coat designed to keep you perfectly dry.\nADVANCED TECHNOLOGY: This light rain jacket features our waterproof Hyrdroplus 100% nylon shell designed to keep you dry and protected in even the hardest of downpours.\nMODERN CLASSIC CUT: When the weather is on the edge, this is a universal rain jacket great for everyday use, with a clean feminine cut and comfortable range of motion. How to measure Use a soft, flexible tape measure from a sewing kit. A metal tape measure from your toolbox or a yard stick may give you inaccurate readings\nShow more",
			"reviews": {
				"customerProfileNames": [
					"ForeverYOUNG",
					"BobbyKoger",
					"LukeD.Beck",
					"NancyF",
					"TutyRu18",
					"Abby"
				],
				"customerProfilePictures": [
					"https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif",
					"https://images-na.ssl-images-amazon.com/images/S/amazon-avatars-global/58a32404-237e-4e1a-9088-b6eded9f94a6._CR0,26.0,281,281_SX48_.jpg",
					"https://images-na.ssl-images-amazon.com/images/S/amazon-avatars-global/7690b338-c52b-45e0-91c3-f56db204f99e._CR0,0,500,500_SX48_.jpg"
				],
				"customerRatings": [
					"5.0 out of 5 stars",
					"5.0 out of 5 stars",
					"1.0 out of 5 stars",
					"1.0 out of 5 stars",
					"4.0 out of 5 stars",
					"5.0 out of 5 stars"
				],
				"customerReviewTitles": [
					"Columbia Rain Jacket Womens",
					"Would recommend",
					"Not Waterproof",
					"Not waterproof",
					"Waterproof-ish",
					"A+ Ultra Packable Waterproof Windbreaker"
				],
				"customerReviewBodies": [
					"I am 5'7\"... 38DDD and usually wear a 14/16 or 0x/1x. I purchased this jacket in a 3x because I wanted to CERTAIN I could wear with sweaters and I wanted it to be longer... It is huge. I will wear it and enjoy it... but I could have done the 1 or 2x I think. I've included some pics to help. I chose the black. It is VERY light - not lined. The pockets are side slash, with zipper closures - the lining of the pockets is a mesh material. The hood is hidden in a velcro'd collar flap - the hood itself has elastic pull cords. There is a Columbia logo on the left upper chest. The sleeves are very long - and have velcro's strips to adjust fit around your wrist. Because I purchased the really huge size, the jacket falls well below my back end. All of that is ok with me! The washing instructions say cold water, powdered detergent, , wash separately - Do not bleach. Tumble dry on low. Do NOT use fabric softener and Do NOT dry clean. Lists 100% nylon - except mesh... 100% polyester. I haven't worn it in a rain storm yet, but it looks like it will work well for Spring in Oregon. Having said all of that, I never hesitate to update my reviews should new info seem useful and I hope this review was helpful to you.",
					"I bought this last minute, a few days before our trip to Disneyland, when I checked the weather and saw that it would be raining a majority of the time that we were there. I saw that some reviews said it wasn't completely waterproof, but we got POURED on and my clothes underneath never got wet. It definitely kept me dry! It's mesh lined (not fleece lined), so if it is cold out, I'd definitely recommend wearing a long sleeve underneath if you want to stay warmer. My only complaint is that its difficult to fold the hood back into the pocket without it looking/feeling too bulky, but I also haven't spent much time trying to make it fit better, anyways. I would definitely recommend this.",
					"Disappointed with this purchase. I bought this jacket because it was advertised as waterproof. I took my dog for a walk on a rainy day for about 20 minutes. I didn't notice during the walk because I was wearing a hoodie underneath the jacket, but when I got home and took the jacket off, my hoodie was damp and the entire inside of the jacket was wet as well. I wasn't able to wear it to work that morning because the inside was still damp. It's a cute jacket and nice for a DRY fall day, but unfortunately would not recommend it to anyone looking to wear it in the rain. I expected a lot more from such a reputable brand.",
					"I don’t normal write reviews but I was so disappointed in this product that I felt I had to. I bought this jacket based on reviews for a bicycle trip. It rained the entire first day so of course I wore what I thought would keep me dry..... I was soaked through and through within an hour. This was not a heavy rain but a steady rain . Needless to say I would never purchase again.",
					"I purchased this jacket to wear for a half marathon with rain in the forecast. The jacket definitely didn't keep me completely dry after spending 3+ hours in the rain, but it did a relatively good job and kept me comfortable. I was nervous about sizing but the jacket was a perfect fit! If you're looking to layer with a sweater I would recommend sizing up. For reference, I am just under 5'2\" and typically a size L top and 12/14 in pants with 34E bust.",
					"For sizing, I'm a 36\" bust, 29.5\" waist. I bought the small in green in August 2020. I wanted a packable shell for my go-bag. Fit is perfect around my waist. A tiny bit baggy around the bust, but still really flattering. I feel like sleeves are a tad long, but Velcroed tight, it looks fine.\n\nIn November 2020, I bought a medium in moon gray to use on my daily power walks. Color is on the lavender side of gray. It's fit is just a little bigger than the small, with enough space for a thick fleece jacket layer underneath.\nReviews are what helped me make the purchase, so I'd like to share my experience as I think it would be helpful. I've seen reviews of people who were wet after using the jacket in the rain, so I'm including my experience with that also.\n\nWhile wearing the jacket, the packable hood is super easy to unfurl, and just as easy to roll back into the collar. Our Northern New England winter has already begun, so I've been able to test using this as a windbreaker shell. I've been able to go out in windy 14 degrees with a thin base layer and a thick fleece hoodie underneath this jacket, and been warm enough. I actually get a little overheated half way through the walk, but unzipping the pockets (which are its \"vents\") and the main zipper does help cool me down.\n\nOne warning! Because it traps body heat so well, it also traps moisture! I have one picture of the inside of the back of jacket after a walk. Needless to say this is not a breathable Gore-tex jacket, so it's to be expected. When I tried the first jacket on in the summer, it did start to get sticky wearing it on my bare skin, so if you live in a warmer climate, this feature might get annoying.\n\nAs for waterproofness, I've been out in the pouring rain a few times and come home dry -except if I've been sweating. The rain water just beads up on the jacket. Being that it wicks my sweat on the interior, I decided to performed a test in the shower to be sure about its waterproofness. After about 5 minutes of showering my arm, you can see that indeed the inside of my sleeve is bone dry.\n\nThis jacket is very packable. You'll find in one of the hand pockets, there's a double zipper. Turn that pocket inside out, and feed the jacket body into the pocket/sack. Zips shut. You can search the web to find a video showing it, but it's very easy and quick to do. The packed-down size is 5\"h x 9\"w, and as flat as an inch thick.",
					"So I bought this jacket on sale to replace my worn out north face waterproof windbreaker. Loved the colour selection and was super excited when it arrived. The fit was great when I tried it on and couldn’t wait for the weather to change so I could wear it. Fast forward to spring. Unless you plan on using it for weight loss this jacket is awful. Does it keep you dry? From rain-absolutely. You will however not be dry as this glorified garbage bag will make you sweat more than you ever have in any workout. For a non insulated jacket it made me sweat more than wearing a winter parka in 40 degree weather.\n1 star for being waterproof\n1 star for weight loss",
					"Perfect outer layer. Pair with a fleece or sweatshirt for fall/winter. Totally waterproof. I live in Vancouver and have walked through a down pour in this... outfit, make up, and hair bone dry!",
					"We bought this to use as a winter top layer garment for 0 to -20C that will accommodate layers. That it does but I should have read closer for waterproof standards as it doesn't have taped seams or a waterproofness pressure rating - one good downpour and it may lose any waterproofing. For a moderately priced jacket it should at least have an adjustable hood for the top otherwise you need another hat with a peak to keep it from flopping over and covering your eyes. Disappointing from a company with a reputation for providing top shelve technical garments but I get their target as it's hard to find 'extended sizes' with all the proper bling from any company at any price. That said my wife loves it, she's between a 2X and 3X ... it was abit large at first but adjusted nicely around the bottom and will accept layers.",
					"The description says it has a polyester mesh lining. The one I got does not have a lining at all.\nI'm super disappointed in this because I hate the feel of \"wearing a shower curtain\" on my arms. But it fits and looks nice. I will order another one in hopes that it will have the lining.",
					"I find this product to be so-so and here is why:\nPROS\n- it is waterproof\n- it packs up nicely and doesn’t take up a lot of space\n- very light\n\nCONS\n- The ruching in the back is very unflattering and causes the jacket to ride up (shown in photos\n- RUNS SMALL I purposely sized up because Columbia runs small (I’m normally a medium, I bought a large). This means the torso fits but the arms are super long for me\n- the colour matches the second model (light blue) NOT the off-white colour\n- this is the lowest quality piece of Colombia clothing I have ever purchased. The stitching is good but the material feels so cheap and is slightly see through"
				]
			}
		},
		{
			"id": "YY6lO_y",
			"title": "MOERDENG Women's Waterproof Ski Jacket Warm Winter Snow Coat Mountain Windbreaker Hooded Raincoat Jacket",
			"price": "$69.99",
			"image": "https://m.media-amazon.com/images/I/51JmUR1wv+L._AC_UY445_.jpg",
			"description": "Zipper closure\nHand Wash Only\nWaterproof Windproof Snow Ski Jacket, also can fights bad rainy or misty weather, Keep your body always dry and comfortable when you are outside.\nAdjustable cuffs help to seal and keep warm, and the inner wear-resistant soft shell is highly wind-resistant.\nProfessional water repellent coated, fluff lining and durable fabric guarantees the best heat retention, Relaxed-fit style with quick-dry material.\nMultipurpose：Downhill Skiing, Snowboarding, Snowsports and other winter outdoor sports.\nSize notes: Jacket offers a standard fit. Please choose by US size.",
			"reviews": {
				"customerProfileNames": [
					"Aslea",
					"JesseCimino",
					"Kblack",
					"Tyler",
					"Kon",
					"Biance",
					"Lita",
					"Lilyisme"
				],
				"customerProfilePictures": [
					"https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif"
				],
				"customerRatings": [
					"5.0 out of 5 stars",
					"5.0 out of 5 stars",
					"5.0 out of 5 stars",
					"5.0 out of 5 stars",
					"5.0 out of 5 stars",
					"2.0 out of 5 stars",
					"4.0 out of 5 stars",
					"5.0 out of 5 stars"
				],
				"customerReviewTitles": [
					"Buy this now!!! Don't look anymore!!!",
					"Women’s size fantastic quality!",
					"Impressed!✔🌞🥰",
					"Would recommend!",
					"Detachable hood, waterproof and wind protection",
					"Fake pockets for women only🙄",
					"Love these but a bit small",
					"VERY WARM"
				],
				"customerReviewBodies": [
					" OMG this jacket is so warm it is ridiculous seriously I was not expecting this quality for this price. I have worn northface jackets/hoodies that claim to do the same thing and I didn't understand why people spend that much money for that type of jacket.. but I was right lol... because here's a perfect jacket for less than half the price. I purchased a 2X but it was too large so definitely get your size I am 5'7 ...270 pounds and I should have gotten a x-large",
					"Wow! Received earlier today. Strong zippers. Plush lining. Got the black and in the cold rain there were no issues. Love the black. I am 5’ 7” and weigh 170 lbs. the extra large for me and my broad shoulders gave me room with a heavy sweatshirt and did not feel smothered. I know people don’t give the frame size etc and that is why people look at reviews when purchasing any clothes, jackets, etc. I am telling you that if you where a large in women’s coats or an extra large, that this is NOT junior sizing and not sizing for small frame women. This is TRUE to size and the size chart is spot on. Do NOT size up as you will put this coat in a closet and not wear it. I could of gotten away with a large but it would of fit snug. Buy your women’s size coat and this product will NOT disappoint. I hope this helps with sizing issues! I have been burned before with sizing and this time was lucky.",
					"Wow!! I am very impressed with this jacket especially for the price!! It fits wonderful and such great quality heck yeah! Its warm and soft inside! If you are going to layer I suggest sizing up one size, I love the fit and its non restrictive in the armpits like a lot of coats which is a huge peave of mine. I need that movement to work. I'm 5'5\" 145 34DD its non binding through the chest, just excellent! When I got it and opened the box I was bummed at first cause it looked and felt too light, but its vaccum sealed! Once opened, pleasantly surprised. Highly recommend this one.* front zipper pocket isnt real but still, great jacket!",
					"Was kind of hesitant upon buying this jacket in regards to if it would really keep me warm... let me tell you so far this jacket is AWESOME. The last few weeks have been 30 F and lower with heavy winds and this jacket has kept me so warm! The pockets are deep which is a plus. I ordered a Large and I typically wear Medium shirts. I got a size up so that I can still wear it when I layer my thicker sweaters/vests. Wore it out in the rain the other day and it stood up great with that. Really have no complaints with this jacket. 11/1/19",
					"The jacket arrived last week, and I couldn’t wait to try it on even though it is not winter yet. The jacket feels nice and soft because of the good quality fleece. It didn’t leave any fuzzy bits when I tried it on without first washing it. This is a good indication of the quality of the fleece. The hood can be detached from the jacket by unzipping the zipper. The shell of the jacket is made of thick water proof material. This jacket will block water and provide wind protection.\n\nI especially like that there is an inside pocket for phones. Most jackets made for women do not have inside pockets. I’m petite and the length reaches mid-thigh. I sized up because I like to wear layers while allowing free movement. I’m sure this jacket will keep me dry and warm during winter and on snowy days. I ordered the jacket in black camo for a change and I love how it looks on me.",
					"Nowhere on the description does it say that the women's jacket has a fake pocket on the front breast pocket. But one in men's and women's both the same size and everything is the exact same except for that woman's has a fake pocket and the men's is a real pocket on the front..... makes no sense!!! Fit true to size, and fuzzy and warm here in mn. For an avid ice Fisher that outside pocket is key.",
					"I usually don't have issues with sizing. If anything, things tend to be too big. I ordered a Small in this and it fits but I can't wear a sweater underneath it without it being too small. I'm 5'4\" 125 lbs for reference",
					"I needed a warm coat, but not so bulky. Of course I always read the reviews and decided to go for it. I'm very happy with this coat. It's super warm, I mean I have to open my jacket for air. I don't have to wear a sweater underneath so that's a plus!",
					"Delivery was fast\nFor the price, this is a very nice coat\nIts well finished and the lining is so soft\nEven the hood is lined\nI got the pink one and the color is exactly what I wanted\nThe front zipper is sturdy but the pockets ones are smaller\nIm 5,2 120 pounds and I got a large so I can wear a big sweather underneat as I live in Quebec and our winters are really cold\n\nA Medium would have done the trick, but I dont like to be thight in my clothes especially in winter.",
					"Cons- not shape fitting for a woman’s form, inside sleeves stick to bare skin when hot. (Went out with a t-shirt underneath and when inside I didn’t take off my coat, was waiting inline at the post office, I got so hot, holding three parcels, I had no where to put my coat, so I started to heat up, the sleeves stuck to me and I got even more hot. So next time I’ll wear a long sleeve tee underneath to avoid this.)\nPros- the faux fur is so warm. I usually have trouble with lengths of sleeves but this is great, goes down to my fingers. Some reviews talk about the zippers, but I have no problem with mine. I ordered a 2x but I could have went a size down. I’m usually a 2x. Overall I’m pleased with this jacket.",
					"This is a great jacket. I was torn between the small and medium I’m about 5’1 140 ish lbs and got the small. I’m not much for laying so it didn’t matter but there certainly isn’t a lot of extra room I could have went up in size. It’s short in the arms so if I would buy another it would be a size up.\nThe pink is a beautiful color just like the photo and I was impressed on how nice the jacket actually was once I received it. I would recommend getting this",
					"The jacket is very nice but I’ve already had problems with the pockets. First the zippers broke and the the seam came apart below the pocket. The jacket is not snug on me, but I use the pockets a lot. I will reinforce the seam to keep it from coming apart more.",
					"I love the jacket but I hated all that unnecessary embroidery they put on the hood, arm and chest. I had to buy a seam ripper and pull it all out because I had no idea what it meant or what language it was in. I didn't understand what the symptoms were either. I washed it and im going to put more waterproofing on it. I ordered a couple patches and some reflector material to add to the jacket to cover up where the ugly embroidery was. It is a very nice jacket but I dont get all that embroidery. They aren't a big name brand and no one cares for their embroidery to show it off because I couldn't even pronounce it."
				]
			}
		},
		{
			"id": "4BhLlYB",
			"title": "Columbia Women's Switchback Lined Long Jacket, Cirrus Grey, X-Small",
			"price": "$100.00",
			"image": "https://m.media-amazon.com/images/I/61AbS-ae+VL._AC_UX342_.jpg",
			"description": "100% Polyester; 100% Nylon\nImported\nZipper closure\nMachine Wash\nCOMFORTABLE RAIN JACKET: The Columbia Women’s Switchback Lined Long Rain Jacket is a longer version, fully lined and waterproof rain coat with elastic cuffs, and a drop tail, designed to keep you cozy and dry.\nADVANCED TECHNOLOGY: This all-season rain jacket features our waterproof Hyrdroplus 100% nylon shell with full polyester lining, designed to take the edge off, while keeping you dry and protected in even the hardest of downpours.\nMODERN CLASSIC CUT: When the weather is on the edge, this is a universal rain jacket great for everyday use, with a long feminine cut and comfortable range of motion.\nShow more",
			"reviews": {
				"customerProfileNames": [],
				"customerProfilePictures": [],
				"customerRatings": [],
				"customerReviewTitles": [],
				"customerReviewBodies": []
			}
		},
		{
			"id": "566W2f4",
			"title": "Marmot Women's Essential Lightweight, Waterproof, Gore-tex Jacket",
			"price": "$137.97",
			"image": "https://m.media-amazon.com/images/I/61vmx2iuqWL._AC_UX385_.jpg",
			"description": "100% Polyester\nImported\nZipper closure\nStay Dry In A Downpour - Durable yet lightweight, this long jacket is designed specifically for heavy rain and sleet. It can also be worn as a shell over an insulated jacket on days when you need a little added warmth.\nThe Ultimate Gear For Inclement Weather - What rainstorm? Our Essential Collection is made with GORE-TEX Paclite fabric, which is then treated with a PFC-free DWR (Durable Water-Repellent) finish that repels moisture from the fabric’s surface. Its 100% seam-taped construction also keeps moisture out and warmth in.\nPractical Yet Comfortable - The Essential Rain Jacket’s hydrophobic membrane effectively blocks wind, but fabric is also highly breathable and lightweight. This jacket’s drop-tail hem and fixed, adjustable hood offer enhanced protection in even the wettest conditions.\nInnovating To Improve The Human Experience - Marmot strives to deliver best-in-class comfort, protection and ease of use on every product. The Essential Rain Jacket also features zippered handwarmer pockets and an interior zip pocket for dry storage of your personal items.\nWe Have You Covered - With Marmot, we warrant every product we make to be free of manufacturer defects. The best part is you do not need to register your product. Our lifetime warranty covers you from the moment you purchase our apparel or equipment.",
			"reviews": {
				"customerProfileNames": [
					"Lucy",
					"M",
					"RuthieCustomer",
					"my2c",
					"S.A.V.",
					"Anna",
					"Cinzia",
					"NoStoneLeftUnturned"
				],
				"customerProfilePictures": [
					"https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif"
				],
				"customerRatings": [
					"2.0 out of 5 stars",
					"3.0 out of 5 stars",
					"4.0 out of 5 stars",
					"5.0 out of 5 stars",
					"1.0 out of 5 stars",
					"4.0 out of 5 stars",
					"5.0 out of 5 stars",
					"4.0 out of 5 stars"
				],
				"customerReviewTitles": [
					"deficient in many ways",
					"Good raincoat poor hood; Head got wet",
					"Nice rain coat",
					"This is my second coat,",
					"Not what I was hoping for! Is NOT waterproof in the rain!",
					"Nice jacket",
					"Very comfortable waterproof coat",
					"Nice with no logo"
				],
				"customerReviewBodies": [
					"Cold, clammy rubberized material for lining, no alternate closure at placket (snaps or Velcro) in case zipper breaks, no Velcro at cuffs to keep water out, no tie on hood to keep the wind from blowing it off.",
					"While I liked the raincoat and it kept my body warm and dry the hood was a problem. It adjusted on the back of my head not in a drawstring around my face. To pull out tight enough to stay on in the wind it pulled it back from my face. My head got soaked. My face, my upper neck and bangs and front of my hair not behind my ears was all dripping wet after a one mile walk. I’m returning it and making sure the next rain coat I buy has a proper drawstring hood that fits not pull off my face.",
					"I wanted a longer goretex raincoat and this one is mostly very good. I wish it had an upper left front zip front pocket to hold keys or phone. The longer length is great and the slender design is flattering but it does bring water directly onto your upper legs using it for walking the dog. The coat is rainproof and windproof and breathes very well. There is no lining and the sleeves are slim so not a lot of room for warm layers. The light color gray is nice for those out in darker hours for more visibility.",
					"the first, in off-white, I have worn and washed for years, and it looks brand new. How could I not buy it in black (marked down)? It's roomy, comfortable, waterproof, and I get compliments all the time. It was packaged well and arrived on time, I definitely recommend...",
					"Sorry but a Gore-Tex rain jacket should keep you dry and this dues not! Bought this for a trip to Iceland and got soaked!!\nIt is generous in size. It blocks the wind.",
					"Nice jacket, only velcros at the end of the sleeves are missing.",
					"No Velcro to catch on sweater , light weight waterproof",
					"I like the slimming fit and length of this Marmot waterproof jacket. However, note that it does NOT have pit zips, as one ad alleges, and is not lined. Lightweight polyester with an inner coating.\nMine had a strong odor when opened, but, this has dissipated.\nThe cuffs are longer, which keeps hands warmer, although there is no closing to prevent wind, water from entering through cuff. Roomy enough to accommodate a liner jacket without sizing up.\nI chose this Marmot because the ad above claims it uses the best/ no environmental impact DWR finish. The tag on the coat says it is only \"Better\", but, says it does NOT have PFOAS.\nOverall a very nice raincoat.\n\nAdvertisement",
					"This is a good quality Gore-Tex jacket which I bought for walks with the dog and it does serve the purpose well. But it is hugely overpriced for what it is - a very simple hardshell jacket without any velcro to keep very long sleeves in place. It has a good length though and it is truly waterproof.",
					"L",
					"Overall the jacket is nice and exactly what is needed for the Dutch weather but there is no pit vents as per the description. This was a huge bummer for the summer.",
					"Extrem lange Arme, ansonsten paßt er gut, habe ihn auch schon gleich testen dürfen, hält dicht, und trägt sich auch ganz angenehm. Sonst hätte ich ihn wegen der langen Ärmel wahrscheinlich zurück geschickt.",
					"",
					"Kupiłam te kurtkę, gdyż mąż posiada podobną męską Marmot i ją uwielbia. Materiał jest rewelacyjny. Niestety, w modelu są bardzo długie rękawy stąd musiałam towar zwrócić. Co dziwne w modelu S rękaw jest jeszcze o 1 cm dłuższy niż w rozmiarze M. Sugeruję aby przy zakupie zapoznać sie z długością rekawa bo są dziwnie długie. Poza tym, rewelacyjna kurtka :))",
					""
				]
			}
		},
		{
			"id": "bSPnM5Z",
			"title": "Levi's Women's Faux Leather Classic Asymmetrical Motorcycle Jacket (Standard & Plus Sizes)",
			"price": "$35.08",
			"image": "https://m.media-amazon.com/images/I/81YKjX5JK9L._AC_UX385_.jpg",
			"description": "Classic mid weight textured faux leather motorcycle jacket",
			"reviews": {
				"customerProfileNames": [
					"emme",
					"NewKO2013",
					"SallyO'Malley",
					"JustACustomer",
					"TomF",
					"PaulP.",
					"Jasmine",
					"M"
				],
				"customerProfilePictures": [
					"https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif"
				],
				"customerRatings": [
					"5.0 out of 5 stars",
					"5.0 out of 5 stars",
					"5.0 out of 5 stars",
					"5.0 out of 5 stars",
					"5.0 out of 5 stars",
					"5.0 out of 5 stars",
					"5.0 out of 5 stars",
					"5.0 out of 5 stars"
				],
				"customerReviewTitles": [
					"40 42 53 18/20. 255lbs 5'6",
					"Great fitting jacket",
					"Very impressed!",
					"I'm in love. Surprised at quality and fit.",
					"Beautiful and cool jacket",
					"Great jacket !!",
					"This jacket is everything! Perfect trendy jacket!",
					"This Jacket is Awsome!!!"
				],
				"customerReviewBodies": [
					"I was nervous about the fit because i am plus size but small chested 40b. I am 5'6, 255lbs pear shaped (42'' waist 53'' hips). I usually wear 18/20 lane bryant and 20w in levis jeans. After careful review i got the 3x and i love the fit. It is roomy especially at the chest level of course but without looking frumpy. The sleeves fall a little below my wrists even after adding a thick sweater I was afraid it might be too short but my ample bottom looks goooood!!!\nI love it!!!!!\n\nI tried to include the kind of information i myself was looking for. I hope it was helpful.",
					"This jacket is soft, supple, with a nice matte luster, not at all shiny. The snaps and zippers are a gunmetal silver color. I am 5'6\", 176 lbs and normally wear a 10 or12 in pants and a L/XL in tops and jackets, depending on the cut. I carry my weight in my stomach but was still able to zip this jacket closed (will never wear it zipped up, just wanted to see if I could and still move). Also, I have long arms and both sleeves cover my wrist bone. With a thin, long sleeve top the jacket sleeve fit is close, but I could still raise both arms above my head, wave, and hug myself comfortably. Very happy with this purchase.",
					"Beautiful jacket. Very well-made. I don't wear leather, so I was thrilled to find a quality, vegan leather jacket. I ended up returning it though because of the slim fit. I'm top heavy (36DD) and the medium was snug around my chest, but fit everywhere else. I didn't go up to a large because I was afraid it might look too bulky around my shoulders. I may try one of the other faux leather Levi's moto style jackets because the quality is amazing.",
					"F",
					"Fit is awesome. It is a bit short for what I usually wear, but that's the cool style I hear and so I got it. Man am I glad I did. It's so comfy and so cool, but without being TOO cool. I think if you're someone who likes classic styles but wants something feminine with a bit of edge you'll love this.\n\nIt's also super comfy and almost seems like it has some stretch, which makes no sense. It's very supple and fits beautifully. I love it.",
					"I",
					"This jacket is awesome! Literally exactly what I was looking for. In terms of fit, I’m usually a solid 18, and the 2x fits perfectly. My chest is definitely on the bigger side, and I’m use to buying jackets that don’t always zip, this zips, and I can fit a medium thickness hoodie underneath. I have bigger arms, and this jacket is perfectly wide enough to fit my arms in! I’m insanely happy with my purchase. If you are between sizes, you should probably go with the smaller one as it’s definitely cut bigger.",
					"For anyone that is wondering this is an official Levis Jacket I own other Levis Jackets that i have received from Macys and Levis.com and this one is definetly official and of good quality . I got the Navy one with no band in the back and Its a great fit. It's a nice leatherette material. As far as the size goes I'm 5'3 127lbs and the xsmall fit me great not to snug not too big",
					"The quality and design are excellent. It is slightly tight in the arms but has some stretch so that it will loosen somewhat in time. This jacket is not meant for wearing bulky sweaters underneath. It will be great for the fall weather. It could also be worn indoors. Love the true red colour.",
					"Love this jacket. Well made. Soft and comfortable faux leather. People think it is real leather. Would highly recommend.",
					"It was too big for me. I usually take XL but it was not available so I had to order xxL and it was too big. Too bad. I loved the color",
					"Love this jacket. Looks very stylish and is soft and durable. It feels and looks like leather but is totally cool, durable and washable."
				]
			}
		},
		{
			"id": "h6HB0nl",
			"title": "MARMOT Women's Precip Waterproof Rain Jacket",
			"price": "$47.99",
			"image": "https://m.media-amazon.com/images/I/718x5dgBngL._AC_UX385_.jpg",
			"description": "100% Nylon\nImported\nZipper closure\nMachine Wash\nAvoid Getting Soaked - Sturdy and durable with a patented dry-touch finish, this waterproof jacket will keep you comfortable and protected during planned treks in stormy weather or as a just-in-case layer in your pack for unexpected downpours.\nThe Next Generation Of Waterproofing - Our PreCip collection of pants and jackets is made with PFC-free NanoPro recycled nylon fabric that keeps you dry in the wettest conditions and is highly breathable thanks to an advanced microporous coating.\nComfort In Any Condition - An attached adjustable hood and DriClime-lined chin guard enable the wearer to feel less clammy and more comfortable over a wide range of temperatures and conditions.\nShow more",
			"reviews": {
				"customerProfileNames": [
					"Pat",
					"Smile",
					"Jack",
					"SuzyJackson",
					"JenniferWarren",
					"Narcoosseegal",
					"LC",
					"RebeccaWanagel"
				],
				"customerProfilePictures": [
					"https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif"
				],
				"customerRatings": [
					"5.0 out of 5 stars",
					"5.0 out of 5 stars",
					"4.0 out of 5 stars",
					"5.0 out of 5 stars",
					"5.0 out of 5 stars",
					"5.0 out of 5 stars",
					"5.0 out of 5 stars",
					"3.0 out of 5 stars"
				],
				"customerReviewTitles": [
					"This One's A Winner!",
					"Fitted waterproof rain jacket",
					"Seems to work better for lighter precipitation",
					"Great jacket",
					"Absolute favorite jacket, my most recent pre-cup lasted 5 years!",
					"High quality and comfort",
					"Works well",
					"Great pants except for velcro closures"
				],
				"customerReviewBodies": [
					"This was the winner of the 7 brands/styles of waterproof rain jackets I tried. (Others were the North Face Resolve 2, Resolve Plus & Ventura; Black Diamond Stormline; Columbia Arcadia II (solid & print, which were slightly different), & Patagonia TorrentShell.) The Marmot Pre-Cip's adjustable hood stows in the collar when not in use (a big plus), & the 2-part collar & hood are both more open feeling, yet also provide more coverage, than 1-piece versions do. This jacket is extremely light, & packs down small in it's own pocket, which is great for travel. In part this is b/c it lacks the mesh lining some other jackets have. But it doesn't need it, b/c it doesn't stick to your skin or feel clammy when the temp rises ~ it's waterproof, but also really breathable. This is one of the few (along with the Patagonia TorrentShell) that had sleeves the right (average) length. (North Face, Black Diamond & Columbia all ran long.) The sleeves are also easily adjustable with velcro tabs. The overall fit is flattering, but accommodates a sweater or down vest if it gets chilly. (I'm 5'5\", 118 lbs, & the small fit great. The medium also worked, & could even fit over my Patagonia NanoAir jacket. But since I'll wear it more often in the spring/summer/fall, & the MED sleeves were a little long on me, I opted for the small.) This jacket also comes in a nice range of colors, for those who want to brighten up a rainy day.",
					"This jacket was so much better than I expected, and I had high expectations. I wanted a packable, waterproof/breathable jacket that complemented my shape. The color is beautiful (Arctic Navy). I expected it to be cold since it does not have a fleece lining, however I wanted a jacket that I could use for travel and year round since I live in New England. I figured it was better to get a jacket that I could put a fleece under. This jacket kept me warm even without a fleece on a 40 degree day. I love the velcro sleeves and zippered collar to hide the hood when it is not being used. I am pear shaped, 5’5” and 139 lbs and chose a size medium, and it fits nicely. My recommendation is to size up if you are hippy since that is where it runs smaller. When I am not using it, I can fold it up into one of the interior pockets for use when I travel. I would definitely recommend this jacket.",
					"Worked well for running in the snow with multiple layers.\nDidn't hold up to prolonged exposure to continuous rain; it ended up soaking through after maybe an hour or so. Seems to work better for lighter precipitation.",
					"Tested this out recently on a backpacking trip that was pretty much all rain and this jacket handle perfectly. It was cold and rainy. It kept me warm and dry. Love the zipper pockets and hood that rolls up into the back if not needed. I went with a size larger to make sure what I was wearing under it would still have room to move my arms. I'm 5'8\" and 145 lbs, and the large was perfect when having a l/s shirt and sweatshirt on under it.",
					"I ordered a Small, it fits perfectly for my 5’4, 135 lbs frame. I have enough room for my down jacket or vest underneath. Pre-cip is my favorite rain jacket, my previous one lasted 5 years. It’s also the only rain jacket I’ve found that has adjustable hood, adjustable cuffs, AND is adjustable on the bottom of the jacket. So not only is it 100% waterproof, but the other adjustments allow to keep the heat in, as well as unzipping the armpits to get the heat out. I used my previous jacket in torrential rain/hurricane weather, wore it during snow/ice storms, wore it traveling abroad, and wore it for all the rain back home. I wore the heck out of it, it was worth every last penny!",
					"Top quality and style. This coat has waterproof ability along with breathe-abilty. The cut is flattering and the length is perfect to cover low back and waist. Hood, zippers, vents, drawstrings work as promised. Very light weight and folds small for travel. Sizing is small so consider next size up if you plan to wear a sweater underneath. My shirt size is 8-10 and I purchased a LARGE to fit my shoulders. Buy it. This coat will last many years.",
					"I'm 5'6\" 130lbs and got a medium. The medium is definitely loose on me but I wanted something that I could layer with a puffy jacket and this works perfectly. I went out in a Louisiana rainstorm for a couple of hours in this jacket and got a little bit damp but that may just have been the humidity. The only gripe I have is that the pockets are only mesh on the inside so they don't have any structure and my keys will catch on the mesh. For reference my measurements are 30 waist 37 bust and 39 hip.",
					"I am an extremely active volunteer trail crew leader in the Olympic Mountains, where it does actually rain a lot. Rain pants are critical for my trail work and backpacking. These are perfect in every possible way (fit, genuinely waterproof, etc). The one problem, which is a big one, is the way they are designed to stay closed, since they are full zip. Full zip is great - it allows me to put the pants on and off without having to remove my boots every time. This is the second time I've owned these pants (I literally wore the other ones out, which is hard to do) and I've had the same problem with the velcro closures both times. They simply don't hold well. Yes, I bought these a second time after I wore my first pair out, but I guess I was feeling optimistic that maybe I just wore the velcro out too and couldn't remember if they ever held well. They don't. If Marmot would fix those velcro closures to something more reliable, I would easily give these rain pants a 5 star. Meanwhile, I will now use these but I tend to use them with suspenders due to the weakness of the velcro closures.",
					"My brother bought me the black version of this for my Christmas last year. I liked it so much that I wanted another but in a different colour. Since I live mostly in black and blue (and that doesn't refer to bruises), I went for Arctic Navy. I have worn it once and a friend remarked that she was glad to see me in a 'bit of colour'.",
					"I really like these jackets. I bought two. One for me, and one for my girlfriend. Both male and female fits are good.\nOnly thing to remember is that one really needs the trouser to go with it if out in the rain. Otherwise the water just runs off it and makes your legs wet. But that is just an observation.\nFolds up into a small size for putting in backpack for travel.",
					"Bought to replace my old precip jacket that finally bit the dust after several years of keeping me totally dry and comfortable. Best lightweight waterproof jacket I have ever owned and I have had many over the years!",
					"Folds up properly small, has zips under arm pits for ventilation, decent sized pockets on either size,.fits over my down jacket and has a good sized hood for the rain! Perfect, good investment and comfortable",
					"So far, so great! Not as glamorous as some ladies jackets but certainly great at doing what it should- being very waterproof and also allows space for a thick jumper if necessary. It has already been brilliant on a number of walks and I have actually found that it breathes better than I was expecting. I'd definitely recommend it."
				]
			}
		},
		{
			"id": "yWMbHbL",
			"title": "Columbia Women's Fast Trek Ii Jacket",
			"price": "$35.82",
			"image": "https://m.media-amazon.com/images/I/61yIxVjbr4S._AC_UX342_.jpg",
			"description": "A soft, durable, lightweight fleece for every season, featuring a minimal design and ample pockets. You're bound to find lasting warmth in this jacket crafted from super-soft microfleece. It's the perfect everyday defense to combat those cold mornings. Includes zippered pockets, and drawcord adjustable hem. As an added bonus, the tall collar is flexible enough to wear up or down, depending on your desired level of toastiness. Columbia offers this women’s fleece jacket in a wide range of colors and sizes. Regular Fit. Available in extended sizing. To ensure the size you choose is right, utilize our sizing chart and the following measurement instructions: For the sleeves, start at the center back of your neck and measure across the shoulder and down to the sleeve. If you come up with a partial number, round up to the next even number. For the chest, measure at the fullest part of the chest, under the armpits and over the shoulder blades, keeping the tape measure firm and level.",
			"reviews": {
				"customerProfileNames": [
					"asmith6kids",
					"LaurieE.Verson",
					"spark*l",
					"J",
					"S.SOARES",
					"Patsy",
					"Marilyn",
					"Customer12"
				],
				"customerProfilePictures": [
					"https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif"
				],
				"customerRatings": [
					"5.0 out of 5 stars",
					"5.0 out of 5 stars",
					"5.0 out of 5 stars",
					"5.0 out of 5 stars",
					"5.0 out of 5 stars",
					"5.0 out of 5 stars",
					"5.0 out of 5 stars",
					"5.0 out of 5 stars"
				],
				"customerReviewTitles": [
					"Great jacket for cooler days when heavier jacket isnt needed",
					"I love this fleece zipper top!",
					"i'm wearing this most waking hours",
					"Very comfortable, looks nice.",
					"Love it, order a size up",
					"Warmth and style",
					"I love this",
					"Comfort"
				],
				"customerReviewBodies": [
					"I was in between sizes according to the size chart. I could fit the medium possibly or perhaps the large. Mediums numbers matched better but I ordered the large just incase because I'm a bit busty and glad I did because it fits great.",
					"I",
					"i love this jacket! beautiful midnight blue color, quality construction, quality fleece (medium weight), just the right fit, outside zippered pockets *and deep inside pockets,* and non-elasticized sleeves. soft as can be, and launders like a dream without losing its color. my only complaints: i've had to trim a lot of threads, especially around the zipper. also, i found the elastic drawstring unnecessary and uncomfortable when lying down, so i removed it by cutting two 1/4-inch holes near the zipper and cutting the elastic there.",
					"I’m 5’7”, 165 lbs. I have been wearing the Benton Springs zip up, but I’m not a fan of the cuff. This one is more comfortable. I could probably wear the Medium comfortably, but I’m wearing this over my underscrub shirt and scrub top so I wanted a little extra room. I will be buying another one.",
					"I",
					"This jacket is beautiful and attractive. It is perfect for cold days and for mildly cool ones as well. It is perfect to use as a bed jacket. The colors are vibrant and has many open pockets and zippered ones as well.",
					"So warm perfect for what I wanted it for which is the gym! And I will also wear it out because I love the fit and the comfort of being warm I truly recommend this sweater stay to your true size",
					"I bought one size up which fits perfectly. I am a nurse and it is super comfortable in the clinic especially if it is cold. Great to use if you are just going outside for a little it keeps you nice and warm.",
					"Buen forro a buen precio,es gordito, a mi mujer le encanto, eso si, pedir una talla menos a la habitual,si te ha parecido útil el comentario pulsa si.Gracias",
					"",
					"Lovely fleece, but the fit isn't good if you're on the shorter side. I'm 5'0\" and both the sleeves and jacket length are very long. It's also quite a slim-fit, I ordered an S (rather than my usual XS) to have more space but it's less boxy, more fitted in shape. I'm returning it due to these issues. If you're tall, I would recommend.",
					"This is perfect for me. It has a nice fitted waist - not too tight, yet not bulky, and so does not look fattening. The sleeves are a good length and the back covers my waist and stops cold coming in. It has a nice thickness that is perfect for wearing outdoors in the UK autumn without any other layers or jacket. It has zips on the pockets and they are deep enough for a phone.",
					"This was for my wife who has a Columbia waterproof coat she bought around 7 years ago still looks like new, great fit and wears well.\nThis fleece looked good and upon receiving it the quality was apparent, it’s the thicker weight too so is nice and warm. I think this make is underrated as I feel it’s better quality than for other big names !",
					"Ideal for wear outdoors on very cold days when a full-length coat is not appropriate. Fits quite snuggly, but I find extra jumpers are not needed in the south of the UK. For the additional warmth of extra jumpers, choose the next size up."
				]
			}
		},
		{
			"id": "uWl7zUk",
			"title": "FASHION BOOMY Women's Zip Up Safari Military Anorak Jacket with Hood Drawstring - Regular and Plus Sizes",
			"price": "$19.99",
			"image": "https://m.media-amazon.com/images/I/81R6-FlK--L._AC_UX342_.jpg",
			"description": "Wear Season : suit for SPRING / FALL / SUMMER / WINTER all seasons\n\nIt is warm and long enough to shield you from the STRONG WIND / LIGHT RAIN and COLD WEATHER",
			"reviews": {
				"customerProfileNames": [
					"Stephanie",
					"RobinYoung",
					"Customer",
					"Customer",
					"J_White",
					"Charm1723",
					"A.Ayala",
					"TrillyMadison",
					"Customer",
					"Customer"
				],
				"customerProfilePictures": [
					"https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif",
					"https://images-na.ssl-images-amazon.com/images/S/amazon-avatars-global/1c8e337e-164c-47ca-b890-a6e4911decdf._CR0,26.0,281,281_SX48_.jpg",
					"https://images-na.ssl-images-amazon.com/images/S/amazon-avatars-global/f3fe1da9-948d-49c4-8d88-5b7e35653398._CR62,0,375,375_SX48_.jpg"
				],
				"customerRatings": [
					"5.0 out of 5 stars",
					"3.0 out of 5 stars",
					"5.0 out of 5 stars",
					"4.0 out of 5 stars",
					"5.0 out of 5 stars",
					"5.0 out of 5 stars",
					"1.0 out of 5 stars",
					"5.0 out of 5 stars"
				],
				"customerReviewTitles": [
					"Great jacket at a great price!",
					"Frustrating fit issue",
					"True to size and beautiful color",
					"This is a great light jacket",
					"Better than I expected!!",
					"Five Stars",
					"DO. NOT. BUY. THIS IS TRASH!!",
					"I love my new jaket it's a little big on the ..."
				],
				"customerReviewBodies": [
					"Really love this jacket!!!! Bought an XXL because I read they run small, but it was too big, so I returned it and got the XL. I wear an 18 short in old Navy jeans, for size reference in the photos. I love everything about this jacket. Enough room to wear a light sweater underneath, warm in cold weather but not too bulky that you're hot when you go into a store or are in the car. Love love love.",
					"I wear a Large, but several reviews have said this jackets runs small so I ordered XL. It arrived, and XL is actually 1X, which anyone who knows how women's clothing sizes work, knows is not the same as an XL. I tried it on and it was too big. I figured I could just pull the ties tight to make it tighter in the waist. That probably would have been fine except on one side I guess the lining is detached from the outer layer and the tie,so when I pulled it tight the lining was tighter but the outer material didn't move. Plus it was very baggy in the bag and just looked too big. I thought, no big deal, I'll get the Large. Well the Large just arrived today and it's too small! It fits more like a medium. The shoulders were tight and it couldn't quite zip. I like the jacket itself. It's a cute style, and perfect color for what I wanted. Not the best quality but I didn't expect that so that's fine. But it's very frustrating that I have 2 jackets, 1 size apart from each other and one is way too big while the other is too small. There's no size in between, so they just don't make a size that fits me. Very annoying. So if you wear a small or medium you'll like this. But if you typically wear a Large be careful about sizing up. Going up one size is really like going up 2 or 3 sizes, and there's nothing in between.",
					"Fits wonderful and is true to size. Rich, mustard color with darker, brassy hardware. Looks expensive and has nice pockets and details.",
					"This is a great light jacket. Definitely needs layering for real warmth but I love the look of it. Sleeves are slightly short but I make it work. I’m 5’7 145lbs and I got a medium.",
					"I usually wear a 2X but I purchased a 3X and it fit PERFECTLY!! I'm in LOVE with this coat! If you're considering buying, you MUST purchase it! It's the best rainy/cool weather coat, probably not the best for winter weather though.\n\n**Update**\n-April 2020-\nThis is still one of my favorite go to jackets!",
					"This fits and looks really well! I'm 5ft, 110lbs and ordered a small, and it fit me.",
					"T",
					"I love my new jaket it's a little big on the sleeves are little longer but it fits perfectly I normally am L and I Shoshone XL but they send me 1XL maybe that's way the sleeves are little longer the good thing it brings the strings to tight in the middle because with out that the jaket would fit me a little bigger. But anyway I loved it thank you",
					"The shoulder and chest fit was perfect but it is slightly tight near the bottom. Another size up would have made the shoulder+chest too loose. The shape is strange like that but I love the cut and shape. Not too warm, just right for when the cold starts.",
					"Mangas largas y espalda pequeña, malas costuras y bolsillos extremadamente pequeños",
					"",
					"Muy cómoda, acordé a la talla, color muy opaco",
					"",
					"Jacket is exactly what wanted, true to size and color.also came on time.",
					"Good quality, I am very happy with the product. Seller was excellent"
				]
			}
		},
		{
			"id": "lVaLjL7",
			"title": "Tommy Hilfiger Women's Mid-Length Puffer Hooded Down Jacket with Drawstring Packing Bag",
			"price": "$58.78",
			"image": "https://m.media-amazon.com/images/I/71lypSMJyhS._AC_UX342_.jpg",
			"description": "Mid length chevron quilted packable down jacket with exposed zip front, invisible on seam zippered body pockets, attached hood, and iconic striped draw cord. Jacket comes with a small fabric bag to easily fold and pack away.",
			"reviews": {
				"customerProfileNames": [
					"AJ",
					"divine55",
					"Pumpkinlover",
					"NikkiPayne",
					"Suelee🐸",
					"GaithersburgMDClient",
					"Mom",
					"Shari"
				],
				"customerProfilePictures": [
					"https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif"
				],
				"customerRatings": [
					"5.0 out of 5 stars",
					"5.0 out of 5 stars",
					"5.0 out of 5 stars",
					"5.0 out of 5 stars",
					"4.0 out of 5 stars",
					"5.0 out of 5 stars",
					"5.0 out of 5 stars",
					"5.0 out of 5 stars"
				],
				"customerReviewTitles": [
					"Gorgeous coat",
					"Wonderfully Soft!",
					"Great coat!",
					"Great quality",
					"Great Lightweight Jacket",
					"Great fit and slimming.",
					"Very Thin, Soft, and Warm",
					"take your measurements to get the right fit"
				],
				"customerReviewBodies": [
					"This coat is elegant, gorgeous. It's so soft. I will wear this out to dinner in the winter in Buffalo. This is not an outdoors coat. I love my down coats and have coats for all purposes. This is a beautiful lightweight down perfect for evening. I'm 150 lbs 5'4\" and the medium fits beautifully even over a sweater. If you're bigger on top, go for the large.",
					"V",
					"I am so glad I purchased this coat. I purchased it for a overseas trip during the winter. It's been the ideal traveling coat, because I can fit it in a small bag and store it in a backpack if needed. I was concerned about the arm length, as I have long arms and frequently things are too short. However, I purchased a medium (which is my typical size) and I am very pleased that the sleeves are long enough. It ended up being the perfect size, I can wear several layers under it, but it doesn't look too big alone either. I have worn this coat in weather as cold as 20 degrees Fahrenheit and found it sufficient with moderate activity (walking quickly). I do wear several layers when it's that cold, but would do that regardless of the coat I was wearing. It goes to my mid thigh, and this adds to the warmth of the coat. I found the first feather from this coat the other day, it does not shed them frequently. I'm also pleased that this coat has a hood. I purchased this coat in black. It can be easily dressed up or down if needed. This is not the first down coat that I have purchased, but it is the first one that I have kept. I highly recommend purchasing this coat. I am very pleased.",
					"I am 5’3” and size 4/6, 36”B. I got a size Extra small and fits great. Wonderful quality. Very warm. Classy. Color as shown.",
					"Just got this coat in the mail and can’t believe how lightweight it is! Bought it for my upcoming trip to Alaska in which they say to dress in layers. Gave this 4 stars because I haven’t really used it yet. I am 5’ and a little busty. I bought the large which is what I usually wear. I was concerned it was a little too tight in the chest area for layering, but I was able to have a t-shirt and my fleece zip-up underneath without being too tight (a little snug). Love that it folds up and comes with a carry bag which is exactly what I need for my trip.",
					"Really like this jacket. Very lightweight, and its slimming; emphasizes your waist. I'm plus size - 5'3\" and 189 lbs., with hips). I bought the XL.",
					"I am one of those people that freaks out in winter jackets if I feel like I can't move my arms or if the jacket is too tight and thick. I went years without wearing a winter coat and my down puffer coat that I could wearing comfortably had holes and was wearing out. I ordered about 6 coats and this one was perfect. The outer silky material is soft and does not make a noise when I move like other coats I've tried on. It is thin and I can move my arms easily and don't feel \"stuck.\" I wore it in <20 degree weather and was very warm. I am 5'4\" and weigh 144 lbs. I ordered a medium and it fits loose on me but not overly big. I prefer coats to not be super fitted and snug. It goes further down than upper thighs, more like the lower portion of my thighs.",
					"following the size chart based on measurements I received a coat that fit well. If I relied on the generic sizes (small, medium, large, etc.) I think the size I would have ordered would have been too small or a tight fit. Coat appears to be nice quality, it will be some time before I actually wear it for warmth.",
					"I had purchased 2 packable down coats with the intent of seeing which was most suitable. I have to admit that I loved this coat because it's overall shape and styling were very flattering. Also, I liked that it had a hood and that the front pockets were zippered. I had a hard time making up my mind because the other coat I was considering didn't have a hood or zippered pockets and was a very slightly less-flattering shape. However, I noticed that every time I tried this coat on, I would find a few feathers poking out at various different spots. I know that shedding feathers can be extremely annoying in a down coat so I posted a question to the forum asking any previous purchasers whether there were any issues with shedding feathers for this coat. I have to say that except for a very small minority - extremely small minority - the majority of past purchasers reported no shedding feathers long into the coat's use. Yet every time I went to mine, I found a few more stray feathers. So sadly, I returned it. I think I may just have gotten a lemon and that's unfortunate because I really would have loved to keep this coat but I have had a terrible experience in the past with shedding feathers and I didn't want a repeat of that situation.",
					"I really like this lightweight coat but unfortunately I had to return it because it was just a hair too tight across the bust for me. I usually wear a size 16 and am a 42D so ordered the XL. But I was very impressed on the quality of this coat - the seams were all finished inside and you could see it wasn't cheaply made. The fabric was so soft to the touch and overall a very light coat. For the price it was a good deal. I didn't get to test how cold resistant it is though but I'm sure you could wear it to about -5 to -10 celcius with a light sweater underneath. You won't be disappointed with this Tommy Hilfiger coat for sure!!",
					"I would have returned the item if I had not missed the window due to COVID. The coat is lightweight, fits reasonably well (flares outward too much for my taste, but I have no hips to speak of), the colour is a bit darker than expected but ok. It’s ok for around 0 degrees Celsius or a bit colder (-5) as long as I am walking at a brisk pace. The zipper isn’t working reliably. It’s not sturdy and I can already see it breaking before long. As another reviewer noted, it sheds feathers. I wore the coat twice and have never washed it and can see small white dots where the feathers are starting to poke through—not expected from such an expensive item and TH.",
					"This is a very nice and light weight coat, and it is what I expected after reading most of the reviews. Perfect for spring and fall but not for Canadian winters. At least not where I am being in Northern Ontario. This would be ideal for maybe no colder than -10C and no warmer than 10C. My only dislike about it is the sleeves run a little short. I’m normally around a large but I got XL just to have more room. I’m 5’9 for reference and when I put my arms out in front of me, to drive for example, the sleeves go up past my wrists.",
					"Great lightweight jacket that packs up for easy travel. Warm enough for -15 I'd say and room for a sweater underneath as well. Knee length and super comfortable. Not bulky at all."
				]
			}
		},
		{
			"id": "pn3MZKq",
			"title": "Amazon Essentials Women's Faux Shearling Mixed Media Jacket",
			"price": "$9.11",
			"image": "https://m.media-amazon.com/images/I/81mNDIFr29L._AC_UX342_.jpg",
			"description": "An Amazon brand - A wardrobe staple, this coat is a mixed media jacket\n\nAmazon Essentials is focused on creating affordable, high-quality, and long-lasting everyday clothing you can rely on. Our line of women's apparel includes cashmere sweaters, fleece and down jackets, and more, including plus-size options. Our consistent sizing takes the guesswork out of shopping, and each piece is put to the test to maintain the highest standards in quality and comfort.",
			"reviews": {
				"customerProfileNames": [
					"Jbotz1234",
					"Deabella",
					"Kimberly",
					"dianemetz",
					"boogrubb",
					"CindyRoberts",
					"BruceCarter",
					"LC"
				],
				"customerProfilePictures": [
					"https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif"
				],
				"customerRatings": [
					"2.0 out of 5 stars",
					"4.0 out of 5 stars",
					"5.0 out of 5 stars",
					"4.0 out of 5 stars",
					"5.0 out of 5 stars",
					"5.0 out of 5 stars",
					"5.0 out of 5 stars",
					"4.0 out of 5 stars"
				],
				"customerReviewTitles": [
					"Pockets not symmetrical :(",
					"Shoulder is too big",
					"Completely impressed!",
					"Very nice jacket. Just runs small.",
					"only brand to buy",
					"Light weight winter jacket",
					"Very nice and Comfortable.",
					"Jacket adequate for 30-40F"
				],
				"customerReviewBodies": [
					"The jacket is cute and fits well BUT the left pocket is not even with the right where it hits the waist. I noticed as soon as I unwrapped the package. Hello quality control- are you there?",
					"I usually wear xs and bough xs. Color is beautiful. Love the adjustable waist. The sleeve length and jacket length are perfect, however shoulder span of the jacket is too big.",
					"T",
					"Very nice jacket. Just runs small.",
					"G",
					"The coat was very reasonable price and good quality.",
					"The style 👌",
					"I"
				]
			}
		},
		{
			"id": "8oxa7da",
			"title": "The Drop Women's @lisadnyc Faux Leather Long Shirt Jacket",
			"price": "$59.90",
			"image": "https://m.media-amazon.com/images/I/91Yz3GSFAtL._AC_UX342_.jpg",
			"description": "The Drop is your inside source for must-have style inspiration from global influencers. Shop limited-edition collections and discover chic wardrobe essentials from Staples by the Drop. Look out for trend inspiration, exclusive brand collaborations, and expert styling tips from those in the know.",
			"reviews": {
				"customerProfileNames": [
					"PutriStefanic",
					"Kimberly",
					"AnnaKubitz",
					"KateStarkey",
					"tehreemkhokhar",
					"Shannon",
					"AE",
					"JenniferWunderlich"
				],
				"customerProfilePictures": [
					"https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif",
					"https://images-na.ssl-images-amazon.com/images/S/amazon-avatars-global/f22bfcdc-f7e8-4cd5-8228-5849ab2ab5f3._CR0,0,500,500_SX48_.jpg"
				],
				"customerRatings": [
					"3.0 out of 5 stars",
					"4.0 out of 5 stars",
					"5.0 out of 5 stars",
					"5.0 out of 5 stars",
					"5.0 out of 5 stars",
					"4.0 out of 5 stars",
					"4.0 out of 5 stars",
					"4.0 out of 5 stars"
				],
				"customerReviewTitles": [
					"Great, but not for me.",
					"Order a size or two smaller for a 'normal' fit",
					"Great quality and comfortable fit!",
					"Love this jacket!",
					"Bought 2 sizes, preferred oversized look",
					"Cute, oversized",
					"Pleasantly surprised.",
					"Great quality, awesome price"
				],
				"customerReviewBodies": [
					" Although a great “leather” shacket, it just wasn’t for me. I ordered and XS and it fit a little more oversized than I like.\nI was more finicky at the type of faux leather used. The material made a weird squeaky sound (as shown in video LOL pls I was trying to capture the noise. I know people don’t move like all the time). It’s like that sound when you get off a leather couch on a hot day.\n\nNow I know this is unique to everyone, but I just feel like there are better faux leathers out there.\n\nHowever, if you’re looking for a faux leather shacket, this isn’t bad. Just not for Me.",
					"The fabric is great - warm, soft, and has some stretch. The shirt is oversized and I ordered one sizes down to get the fit i want. It is still a relaxed fit, but not oversized. I am sometimes a medium and sometimes a small in tops (5'-6\", 145lb, B cup). I ordered an extra small and the sleeves are the right length and the shirt looks like it fits in a loose, relaxed way. I am happy with the fit. I ordered the size M pants to match and am typically an 8 in pants. Both are cute and appear well made, which I expect at this price. I would order another set if this was available in black. I only ordered the white.",
					"This shirt jacket fits so well! I usually wear a size 14/16 but I have a larger chest so I was worried that the button up wouldn’t fit. But a size XL was perfect and the faux leather is soft and has a bit of stretch. This is a great quality piece!",
					"This product was exactly what I was looking for",
					"I went ahead and bought both colors in different sizes. Tan is a Small, Ivory is a Medium. I worried that Medium would have been too big, however, after trying both the small and medium, I realized that Medium was giving me a more “sleek” and “shacket” style and look. I’ll keep them both for different looks.\n\nFor reference I am 5’6, 36D bust, and 135-140 lb. very cute colors and jackets! Love the Medium size best!",
					"It’s cute and will be great as a shacket I’m Spring when it warms up a bit. Definitely oversized although the sleeves are fairly true to size. I sized down to XS and sleeves are just long enough, while body is loose. This is great for me but maybe not if you have larger/longer arms.",
					"Ordered this on a whim and I was pleasantly surprised. This is a shacket so it’s supposed to fit oversized. I actually sized up to a large because I have long arms and I also like an oversized fit and it’s perfect. I am tall so it likely drapes on me differently than it would someone of average height. This would be true to size for most people and if you want a more fitted look size down. If you’re tall and/or have long arms you may want to size up so the sleeves aren’t too short and so you also get that oversized look. I’m picky about my faux leather, and while this is not the most expensive looking faux leather in my opinion, it isn’t bad at all.",
					"Great quality piece at a great price. It fits a little boxy and is pretty long in the sleeves. Otherwise it’s so cute worn almost like a cardigan with a cami and skinny jeans. I’m hoping it “breaks in” a bit and the material relaxes a bit. All in all it’s a great, versatile piece!",
					"It's beautiful I love it.. Good quality",
					"Ich bin echt extrem positiv überrascht. Preis-Leistung ist perfekt. Sieht mega schön aus, richtig angenehm zu tragen und genau so wie auf dem Foto. Bin 1.58m groß habe xs bestellt, ist etwas oversized was mir aber gefällt & sitzt genau so wie ich es mag! Kann ich jedem empfehlen :))",
					"",
					"Tolle Farbe, angenehme Haptik, gut verarbeitet. Das ist der erste Eindruck. Doch die oversized-Schultern stehen leider waagerecht ab, statt am Arm entlang nach unten zu fallen. Und das sieht dann nicht schön aus. Liegt vermutlich am ziemlich festen Kunstleder und der dicken Schulternaht. Vielleicht funktioniert das bei schmaleren Schultern.",
					"",
					"Better then expected! So soft and quite flattering! It’s meant to look oversized and my regular size is small, was perfect. Can wear tucked or untucked , open or closed. Very chic and colour is very pretty winter white / cream. LOVE it.",
					"Honestly, this has become one of my favourite clothing pieces ! I am so sad because I really wanted to purchase another one to have just in case, but they're always sold out. If anyone finds one, please message me somehow lol thanks!!!"
				]
			}
		},
		{
			"id": "b0gI-er",
			"title": "Columbia Women's Mighty Lite Hooded Jacket",
			"price": "$51.32",
			"image": "https://m.media-amazon.com/images/I/61UHUq3z2wS._AC_UX342_.jpg",
			"description": "This long hooded jacket is an essential in the cold season, with a stain and water resistant shell, lightweight insulation, and our signature thermal-reflective lining, you’ll stay cozy warm and dry while on the go. The Columbia women’s Mighty Lite Hooded Jacket offers the perfect blend of heat retention across a mix of outdoor climates. The long outer shell is infused with Omni-Shield technology to repel water and stains, while the insulation and Omni-Heat thermal reflective lining will keep you warm. With a full two-way zippered front you'll find maximum flexibility for range of motion and warmth control. The zippered side pockets and internal security pocket will keep your small items secure, including hands — a comfortable coat for most cold Fall, Winter or Spring days. Columbia offers this jacket in multiple colors and sizes. Active Fit. To ensure the size you choose is right, utilize our sizing chart and the following measurement instructions: For the sleeves, start at the center back of your neck and measure across the shoulder and down to the sleeve. If you come up with a partial number, round up to the next even number. For the chest, measure at the fullest part of the chest, under the armpits and over the shoulder blades, keeping the tape measure firm and level.",
			"reviews": {
				"customerProfileNames": [
					"A.Marie",
					"Gamermomstl",
					"NellyB",
					"KattieMeyer",
					"ceehee"
				],
				"customerProfilePictures": [
					"https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif",
					"https://images-na.ssl-images-amazon.com/images/S/amazon-avatars-global/e66f9598-c018-45a9-8828-5ad2c66d0d07._CR0,0,375,375_SX48_.jpg",
					"https://images-na.ssl-images-amazon.com/images/S/amazon-avatars-global/1b6b0895-08ec-41ad-80d1-33e54c659fcc._CR62,0,375,375_SX48_.jpg",
					"https://images-na.ssl-images-amazon.com/images/S/amazon-avatars-global/eeea247b-028f-4910-ab1e-17bb849cd332._CR0,0,500,500_SX48_.jpg"
				],
				"customerRatings": [
					"4.0 out of 5 stars",
					"4.0 out of 5 stars",
					"4.0 out of 5 stars",
					"5.0 out of 5 stars",
					"5.0 out of 5 stars"
				],
				"customerReviewTitles": [
					"Do your research first",
					"You might need to size up, depending on your hips.",
					"Cute Long Jacket",
					"Love this jacket!",
					"My \"Go-To\" Jacket!"
				],
				"customerReviewBodies": [
					"I absolutely love this coat, but before you buy it, do you research about this coat's capabilities and limitations. This is my 2x buying this coat. The only reason I'm replacing it after 3 years is because I gained weight and needed a bigger size. 😊 My original coat still looks brand new and I wore it a ton over the span of 3 years.\n\n-Consider what this jacket will be used for, as this jacket is limited in its warmth. If you need a coat for under 32 degrees, this is not the jacket for you - even with layers. However, you live somewhere with a mostly mild winter, like Portland, this is a great winter coat. I live it Boise, and I cannot wear this jacket when it gets colder than 32 degrees. I use this jacket in the late fall, early spring, and the occasional warmer winter day. I would guess this jacket mimics a 500 fill jacket at best. I use this coat when it's too warm for my 700 fill down coat. I like having options.\n-This jacket is very, very durable. Compared to many down jackets, I'm not afraid of it snagging on every little thing. This jacket doesn't hinder mobility. It's easy to drive in, and is super light. It takes up little room in closets and suitcases. It's easy to clean.\n-Jacket runs a little small. I am a size 8 in dresses and the medium fits OK. It's a little more snug around the hips than I would normally prefer. I've read the Columbia Heavenly is more forgiving for pear-shaped figures.\n-Jacket is water repellent, not water proof. I like wearing this jacket on damp, cool days. You may want to consider a waterproof shell if you live in a wet climate.\n-The omni-heat technology is nice - but be patient. The jacket will warm up as you move. Keep that in consideration.\n-The hood doesn't stay on well. This is my only qualm about this coat, thus 4/5 stars.\n\nI love this jacket. It isn't a coat for harsh winters, but it's great for your 32-50 degree range. I hope this model never discontinues.",
					"So size was definitely an issues on this one. I typically wear a medium. I'm 5'4\" and 140 lbs. I ordered the medium but it was tight around my hips. I could zip it but it didn't look attractive. I exchanged if for a large and it's a little big now, but I would rather that than tight. The arms are LONG. I have to fold them up and under, which works fine. The white is picking up a lot of dirt around the neck, the inside is softer material and getting nasty from makeup. I think the warmth is great for basic day to day use. I wore it to and from work during a cold snap with temps around 0-10 and I felt fine. I wouldn't have worn it on a long walk in that weather though. I did wear it on a walk when it was around 17 degrees with a fleece under it and felt fine.",
					"Hey Y’all. So I’m 5’5” 165-170 lbs. my chest is 34D my waist is a 30. Idk my hip size but I know they are wide. I have a lil stomach pouch from two kids and not exercising consistently. I usually wear a medium but lately more large’s. Currently in 8-10. Medium fits good but large fits better. I’m totally in denial about my size. Wish I was still in mediums. Anyways.\n\nI read a few reviews and ppl said this coat runs small. I was gonna get a medium but I ordered a large instead. I have plenty of room in the large for a fleece to go underneath. A medium would’ve fit but I’ve been buying my clothes a little loose instead of snug. This coat is very thin which I like. I get in and out the car. I’m not outside too much when its cold. And in Chicago it sure gets cold. I do not like the cold weather. This is a nice spring/ fall jacket. I doubt I test it out in the winter.\n\nAny jacket I buy I try to get with a hood. I’m a hood lover. This jacket’s hood leaves a lot of room for wind to get in. I wish the hood was extended a little. Or had fur to block some of the wind. Definitely need a hat under this hood. I like the reflective inside. I do wish the purple was a tad bit darker. I’ve had a few Columbia jackets but they didn’t last. The feathers kept coming out. Imma give this one a try.",
					"Love this jacket! Finally a plus size jacket made for actually plus size women. Let's start with the fit. If you're plus sized you know that most jackets can have weird fit quirks. Big in the chest but nowhere else, tight in the arms, no room to move. I'm a size 20 without huge boobs and an average looking, although large frame. This fit awesome. It's super comfortable and i have room for comfy sweaters or layers underneath. The length is great. Not too long, not too short. Covers your bottom when you sit but not cumbersome and bulky. The zipper can unzip from the bottom while still zipped up top to give you extra comfort while sitting (because we don't all sit prim and proper with crossed legs all the time). The jacket feels light and is not bulky at all with flattering seaming but it is warm. There are thumb holes to keep snow out of your gloves. The pockets are deep enough to actually use and put your hands in. There is an inside pocket to hold your phone, even a large phone, with a button hole for feeding your earphones through. The only feature that it doesn't have and would be a bonus is a drawstring for the hood. This is my go to jacket now for everyday wear don into the 20s and 30s. I have a heavier down parka for heavy snow days and playing outside for extended periods but this is comfortable and warm enough for regular winter days. It packs up small and I use it a lot for fall hiking and camping. Great buy!",
					"Just ordered my third Mighty Lite in five years, and I cannot praise this jacket enough. I live in Texas where we have cold mornings but warm afternoons at certain times of the year. Instead of lugging a bulky jacket home with me in the afternoon, I can easily pack this away in my backpack for my commute. And when winter really sets in, I can count on this jacket to keep me warm and dry all day long. The thumb hole cuffs really help seal in the warmth around the wrists, especially when paired with gloves. I am 5'9\" and a size 6-8 -- for me the medium fits great. A bit of caution: my first Mighty Lite had some stitching rip out due to my own carelessness with wearing a sharp ring, so be careful with your jewelry! I also washed my first one too often, causing the Omni Heat coating to fade prematurely, so wash sparingly and gently with no fabric softener. Air dry!",
					"I ordered Columbia's Mighty Lite Hooded Jacket and the Heavenly Long Hooded Jacket so that I could compare them. For anyone else wondering what the difference is, here's what I found:\n--Mighty Lite (ML) is a bit lighter than the Heavenly Long (HL), and I believe the HL would keep you a bit warmer because I noticed a difference even while wearing it indoors for a few minutes\n--HL has a much cozier, fleece-lined hood, whereas the ML hood is just the same material as the outside of the jacket\n--ML is slightly more fitted around the waist and hips, sort of like a 'slim fit' whereas the HL is a more generous, 'classic fit'. (I didn't notice a difference in the bust or shoulders.)\n--Zipper on HL seemed a bit better and more smooth to zip up than ML, but not a big difference\n\nOverall I give the Mighty Lite a 4/5 because it's a great lightweight jacket, but I took away 1 star because the hood is not cozy, and I'm not sure it would stay up in a wind.",
					"This is the second (exactly same) coat I am buying from Columbia. The other one is still good, I have used it everyday for 2 years in cold Canadian winters (Montreal - Quebec) but I am afraid it might be discontinued so am ordering another one. It keeps me warm, In extremely cold weather (-25C), I add a sweater or 2 underneath. I love the thinness and lightness of the coat. The hood is perfect with a scarf around it but even without a scarf, it is good for light weather and stays put. I am totally sold on the omni-heat technology and bought another Columbia ski jacket (omni-heat and out-dry). The idea that down, duvet, etc...is the only thing that will keep us warm is a total myth. I even tested the coat in -30C and I was fine.\nI am 5'4, 120lbs and took a size small.",
					"The good:\n- Excellent quality of the fabrics, the shell and the lining\n- Two-ways zipper, perfect for driving or commuting\n- The zipper is kind of \"hidden\" both on front and pockets, which add elegance to the coat\n- The sewing work is impeccable\n- The coat's style is flattering on any body type\n\nThe bad:\n- The size runs small. I would compare the 1X to XXL.\n- Not waterproof, but water repellent which is not convenient during snowy weather.\n- The pocket's fleece lining is annoying if you have dry-skin hands.\n\nNote:\n- Great for up to -5C not windy weather.",
					"I probably could have sized down, but I wanted to leave room for wearing cozy winter sweaters. The style of the coat is still very flattering though, and it's longer and covers perfectly. The jacket feels thin, but is super warm! I go to the rink with just a t-shirt underneath and I keep plenty warm. The high neck, and cuffs with thumbholes are a nice addition. Very impressed and happy with this coat! I definitely recommend:)",
					"I have been very pleasantly surprised by this jacket. I wasn't sure it was going to be warm enough for a winter coat but I have been out walking for the last 2 weeks in -20 to -30 degree Celsius windchills have been quite warm with just basic layers (wool t shirt and a light fleece). I usually walk for at least an hour and have stayed warm the entire time.\nThe coat is light weight so I don't feel overly layered. The hood stays up on my hat surprisingly well give that it doesn't have drawstrings. The only drawback is that when the hood is down cool air can get in around my neck. It's easily solved with a scarf or cowl.\nIt's not rainproof - when walking in the rain in late fall I got wet but was still warm.\nI love the length (Mid thigh) and double zipper, thumb holes and generous fleece lined pockets as well as a breast pocket for my phone."
				]
			}
		},
		{
			"id": "p_Bzyvw",
			"title": "Levi's Women's Diamond Quilted Bomber Jacket",
			"price": "$22.46",
			"image": "https://m.media-amazon.com/images/I/81UigMEQ8pL._AC_UY445_.jpg",
			"description": "Classic bomber jacket in lux memory fabric with rib knit collar and cuffs, Smocked hem for better fit, Center front zipper closure, Two lower welt pockets, Signature Levi's red tab at left side seam",
			"reviews": {
				"customerProfileNames": [
					"ASoccermom",
					"Hope",
					"UtochVandra",
					"Jbosslady",
					"LizL",
					"Liz",
					"Bythmut",
					"Lars'"
				],
				"customerProfilePictures": [
					"https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif"
				],
				"customerRatings": [
					"5.0 out of 5 stars",
					"5.0 out of 5 stars",
					"3.0 out of 5 stars",
					"5.0 out of 5 stars",
					"5.0 out of 5 stars",
					"5.0 out of 5 stars",
					"5.0 out of 5 stars",
					"4.0 out of 5 stars"
				],
				"customerReviewTitles": [
					"Love the feel and look",
					"Exactly what I was looking for!",
					"Too tight in chest and upper arm and the zipper is intrusive",
					"Love it",
					"Stylish for Spring!",
					"Great buy",
					"Great!",
					"Very cute and good for the price..."
				],
				"customerReviewBodies": [
					"I love the feel and cut of this jacket. I am petite and this fits great.",
					"Super comfortable and exactly what I was expecting. Really love this jacket :)",
					"I wear a Small and ordered a Small. I was disappointed in the cut of this jacket: it is way too narrow across the chest and arms. When zipped up, the fabric pulls on both sides of the zipper and the arms are uncomfortable. They pinch in the upper arm just below the armhole seam. Once I got the jacket zipped up, all I could do was stand with my arms pinned against my sides. The rest of the garment fit normally, if a bit short (but I think that was the style).\n\nFrom looking at the photos online, I was expecting a jacket that was lightweight and puffy. In reality, this isn't so. While there isn't much padding, the fabric is pretty stiff. The zipper and the cuffs (on sleeves, waist and neck) are also kind of chunky. So the jacket feels chunky -- even when you zip it open to put it on, the zipper weighs down the sides of the jacket. I was looking for something a little more lightweight, a little more airy and puffy and this didn't do that for me.\n\nIt is a nice jacket for something more of a school letterman style and if you want a zipper with a big chunky zipper pull, but not what I was going for.\n\nReturning due to very poor fit.",
					"I love this jacket it’s lightweight and keeps you warm and runs small",
					"I love this lightweight jacket! Very stylish. If you plan to wear something bulky underneath it, size up!",
					"Love the fit",
					"Great product that’s why I want to return it for a bigger size!",
					"I was looking for something a little heavier than this coat but it's like a lined windbreaker for weight. It's really cute and doesn't look cheap at all. I wish I needed something like this because it is really good looking. Only other complaint for me is that there is no zipped or secured pockets? I returned but it's a great deal really.",
					"T",
					"It fits large but tight in the chest. The sleeves are too long. I wanted it to wear with tennis clothes which are a pure white. Like one reviewer said it is more of a slight yellow white versus a blue white I ordered a large. A medium would fit except for the chest area is tight",
					"Commandé small et est exactement comme sur la photo avec le branding Levis. Bonne achat!",
					""
				]
			}
		},
		{
			"id": "-hX6nCE",
			"title": "Columbia Women's Switchback III Jacket, Chalk, X-Large",
			"price": "$55.13",
			"image": "https://m.media-amazon.com/images/I/613NCGMt8VL._AC_UX342_.jpg",
			"description": "An everyday essential, this lightweight, waterproof rain jacket packs versatile protection in a variety of stylish color options. What’s more, packing down into its own pocket, you can keep this trusty jacket ready for any surprise downpour. A rain jacket is so lightweight and versatile it’s just as comfortable acting as an everyday windbreaker. Features adjustable cuffs and hem, full zip front, two hand pockets, and reflective accents to keep you safe and dry. Offered in an assortment of colors and sizes. Extended sizing available. Regular Fit. To ensure the size you choose is right, utilize our sizing chart and the following measurement instructions: For the sleeves, start at the center back of your neck and measure across the shoulder and down to the sleeve. If you come up with a partial number, round up to the next even number. For the chest, measure at the fullest part of the chest, under the armpits and over the shoulder blades, keeping the tape measure firm and level.",
			"reviews": {
				"customerProfileNames": [],
				"customerProfilePictures": [],
				"customerRatings": [],
				"customerReviewTitles": [],
				"customerReviewBodies": []
			}
		},
		{
			"id": "XzBT8FG",
			"title": "Cherokee Women's Infinity Zip Front Warm-up Jacket",
			"price": "$31.18",
			"image": "https://m.media-amazon.com/images/I/71e+DUFEazL._AC_UX342_.jpg",
			"description": "95% Polyester, 5% Spandex\nImported\nZipper closure\nMachine Wash\nZip front\nFront and back shoulder yokes\nPrincess seaming\nShow more",
			"reviews": {
				"customerProfileNames": [
					"AndreaDelanty",
					"Leidy",
					"ezckimo",
					"Kenzie",
					"melaniedonmoyer",
					"Samantha",
					"Briela",
					"Sandy"
				],
				"customerProfilePictures": [
					"https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif",
					"https://images-na.ssl-images-amazon.com/images/S/amazon-avatars-global/ab85209c-d35d-4529-a069-0e28f0bd8b9e._CR0,0,960,960_SX48_.jpg"
				],
				"customerRatings": [
					"5.0 out of 5 stars",
					"5.0 out of 5 stars",
					"5.0 out of 5 stars",
					"5.0 out of 5 stars",
					"5.0 out of 5 stars",
					"5.0 out of 5 stars",
					"2.0 out of 5 stars",
					"5.0 out of 5 stars"
				],
				"customerReviewTitles": [
					"Professional and functional",
					"My fav!!!",
					"Just buy it!",
					"It's a keeper",
					"Comfortable fit.",
					"Go to scrub jacket",
					"NOT WORTH YOUR MONEY",
					"Comfortable"
				],
				"customerReviewBodies": [
					"I wear this jacket almost every day at work and constantly get compliments on it. If you are familiar with the fabric from the Cherokee Infinity line, this is the same. It is silky and doesn’t wrinkle easily or attract lint at ALL. It keeps me warm but never stifling hot. The sleeves are a bit too long but they look cute pushed back a little too. I am 5’3 and 118 lbs. I believe I got the xs. Highly recommend this jacket. It looks brand new after many washes. I like the high neck and the roomy zip pockets on the front. This is pretty much an essential to my every day workwear!",
					"This is my favorite scrub jacket. Had one in blue and one in burgundy from previous units and was very happy to see that they had one in the pink color for my new unit. I am 5’0 and weigh 125. I purchased the XS and it fit perfect.",
					"This is my favorite scrub jacket! I work 5 days a week, and I admit I wash and wear this every other day! I thought about ordering a second so I could wear it everyday, but then I think people would question my hygiene. Anyway, I ordered an XL, and I usually wear a women’s size 16. I carry weight in my middle but this fit perfectly to zip, so I would say the sizing probably runs large. I own several scrub jackets, this one is the best.",
					"Fits a tiny on the big size but great for wearing over a scrub top or if you don't like wearing tight things to work- which I do not. Sleeves are just a tiny bit long. I am 5'4 158, athletic build- broad shoulders- normally a med/ large. I got a medium - I will definitely keep it. I think I'll order another one- different color to wear outside work and I will order a small.",
					"Love this jacket. The fabric is soft and breathable. It's easy to move in when I'm busy and is the perfect weight for an air conditioned medical office. I also wear the same brand/ style scrub pants and they look good together. I like that the pockets zip, so I don't loose my phone or pens while moving around.",
					"This jacket is lightweight, flattering, and made of material that won’t made with multiple washes in the hot water. I owned the same jacket in black for years and always received compliments from coworkers . I am 155 , 5’5” , athletic build and purchased the small. For perfect . Not tight nor lose.",
					"This product is sooooo thin! And the fabric is very cooling so when it touches your skin it makes you colder. It’s so thin it’s actually embarrassing that they even charge more than $20 for it. I couldn’t even return it because I had already worn it. I went and naught another, better jacket.",
					"Previously bought this for my mom in a larger size. She recently lost weight and liked this jacket so much she made me buy the exact same one in a smaller size. She wears it every time she leaves the house so it must be comfortable.",
					"Cute little jacket. I got a small and it’s a bit\nOversized, but that’s okay as I rather have a bit baggy of a sweater ! There are nice pockets in the Jacket, It’s breathable, easy to move in, and light weight.I used to wear cotton sweaters to work, but now I realize what I’ve been missing out on- Polyester and spandex is where it’s at!",
					"I ordered this in navy and although the material is lovely, the sleeves are just a little short and a little....puffy for my liking. The body fits very true to size, but the sleeves seem like 2 sizes too big in comparison. The jacket is also fairly short on me, so I'm going to return it for something else. I normally love the cherokee infinity line but this doesn't keep with the rest of the line's aesthetic in my opinion.",
					"Léger et confortable. Très belle qualité de tissus. Cette veste n'est pas très chaude, elle est fait du même tissus que les uniforme infinity mock wrap. Ne se froisse pas facilement, sèche rapidement à l'air ambiante. Les couleurs et le tissus résiste bien aux lavages fréquents.",
					"",
					"I love this sweater/jacket. I ordered the grey the navy and the black in a size small, I am 5'4, wear a size small-medium shirt and sweater. Could size down if I wanted to but the small is perfect! Very good quality as well! Worth the money.",
					"Amé esta chamarra, la tela está de muy buena calidad, y protege muy bien contra el frío del quirófano, pedí XS y me quedó bien, sólo un poco larga. Mido 1.52 y peso 46 kg",
					""
				]
			}
		},
		{
			"id": "mDFPTKl",
			"title": "Levi's Women's Cropped Loose Trucker Jacket",
			"price": "$19.87",
			"image": "https://m.media-amazon.com/images/I/912KZWJQwBL._AC_UX342_.jpg",
			"description": "A Trucker Jacket with a relaxed, cropped fit that takes on a unique look and feel over time.",
			"reviews": {
				"customerProfileNames": [
					"jadiemazing",
					"angelinam.",
					"E&CMichaels",
					"Doggymcnuggets",
					"Chellebble"
				],
				"customerProfilePictures": [
					"https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif"
				],
				"customerRatings": [
					"4.0 out of 5 stars",
					"5.0 out of 5 stars",
					"5.0 out of 5 stars",
					"5.0 out of 5 stars",
					"4.0 out of 5 stars"
				],
				"customerReviewTitles": [
					"Runs Large, Size down",
					"Loose fit",
					"Surprisingly soft",
					"Cute Cropped Jacket & Good Quality",
					"Runs large and has wings"
				],
				"customerReviewBodies": [
					"The jacket is cropped length but runs large. I’d normally go for a L but got a Medium. I could have worn a Small. Closes on a 36DD chest, softer denim, and overall comfortable. If you’re a smaller size person, go for the smallest size unless you want that Oversized look, then order as normal.",
					"I like this jacket a lot.The dark wash can match many things.The loose fit allows me to wear a thicker shirt underneath.The quality is very good.",
					"This is a really cute, on-trend jacket. It’s very soft and comfortable. I sized up to make sure it would fit right but if I had to do it again I would use my regular size. I can’t wait to wear it this spring with my floral dresses",
					"We got this jacket for our 12 year old (who is 5'5\") and she likes it. The quality is very good, with nice sturdy denim that's comfortable and attractive. The cropped cut gives it a unique and youthful style, and the roomy fit makes it a good choice for layering. Versatile and fun piece and very reasonably priced!",
					"Feels and looks like a flight suit. The arms are attached too low. Makes me look like a linebacker. Not cute but excellent quality. Maybe sizing down would be better."
				]
			}
		},
		{
			"id": "aYRvHqS",
			"title": "Arctix Women's River Rain Jacket, Island Azure, Large",
			"price": "$36.97",
			"image": "https://m.media-amazon.com/images/I/71U3hjZsF+L._AC_UY445_.jpg",
			"description": "The Arctix Women's River Rain Jacket is an excellent choice for any outdoor activity, the perfect mix of fashion and function. Made with 100% Nylon shell with 100% Polyester mesh lining, they include Thermalock advanced water and wind repellency, and are fully seam taped for additional protection from the elements. Lightweight and easily packable. Adjustable cuffs and hood closure. Secured zippered pocket offers convenient and secure storage space. Back vent for added breathability. The River Rain Jacket is machine washable, perfect for a quick and easy cleaning after outdoor activities. Arctix makes affordable high-quality weatherproof outerwear for every kind of winter activity. Arctix clothing is rigorously tested in extreme winter weather, and is proven to protect against the harshest elements. Each garment is designed and engineered to offer more flexibility, accurate sizing, and a comfortable fit. It's an internationally trusted brand enjoyed by winter enthusiasts around the world. Arctix keeps you warmer, drier, and happier longer.",
			"reviews": {
				"customerProfileNames": ["Shelby"],
				"customerProfilePictures": [
					"https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif"
				],
				"customerRatings": ["5.0 out of 5 stars"],
				"customerReviewTitles": ["Worth what ya pay"],
				"customerReviewBodies": [
					"VERY good price for what ya pay. Completely waterproof."
				]
			}
		},
		{
			"id": "BnS_YBE",
			"title": "Columbia Women's Heavenly Long Hooded Jacket",
			"price": "$72.00",
			"image": "https://m.media-amazon.com/images/I/61Nwl6ObmUS._AC_UX342_.jpg",
			"description": "Being an industry leader in outdoor apparel and products takes passion, and an understanding of people who love the outdoors as much as we do. That's why, from cutting edge technology, to our innovative heritage in Bugaboo, our jackets, pants, fleece, boots, and shoes are all tested tough so you can enjoy the outdoors longer.",
			"reviews": {
				"customerProfileNames": [
					"MicheleS.",
					"SarastainVA",
					"ErinH.",
					"Janet",
					"N",
					"Shawnie"
				],
				"customerProfilePictures": [
					"https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif"
				],
				"customerRatings": [
					"5.0 out of 5 stars",
					"5.0 out of 5 stars",
					"5.0 out of 5 stars",
					"5.0 out of 5 stars",
					"5.0 out of 5 stars",
					"5.0 out of 5 stars"
				],
				"customerReviewTitles": [
					"Love this jacket!!",
					"Have I found the PERFECT Winter Coat? Yes, I have!!! Flattering and comfortable. Thumb holes!!!",
					"Perfect winter coat!",
					"Cozy, Comfortable, and Stylish",
					"My favorite winter coat",
					"BEST Coat Ever!!!"
				],
				"customerReviewBodies": [
					"Love this jacket!!! A few things to note about this one, and also a few things when comparing to the Mighty Lite jacket. First, this one is more padded and was warmer. I wore both for 10 min and the difference was noticable. Also, the hood is padded in this one but isnt on the mighty lite so hopefully it should help it stay up better. Second is the fit. I ordered the XL and 1XL (im a size 14 but have a 38DDD chest) and the XL fit but was a little too snug in the chest so im keeping the larger size. I prefer the cut on this one as well. The mighty lite but is straight down, this one is taylored more, a little more flare on the bottom half, and the bottom doesnt feel uncomfortable when you sit. Its made more for non-stick figure women IMO. The columbia size chart is accurate, measure yourself and if youre in between sizes for any of the measurements like i was, size up. Overall, I think this jacket is amazing and dont think you will be disappointed!!",
					"Columbia really knows how to make clothes for curvier women, though I do feel like the sizing runs small. I gained some weight and was not going to be able to cram myself into my old Columbia coat which was admittedly tight when I bought it. Got the 2X, and it fits so well. I even have some room in the hip area. And, it has adorable extended sleeves with thumb holes! So cute! I can't really speak to waterproof or warmth, but it appears to be the same awesome quality as my other Columbia winter gear. For your reference, I'm 245, 5'7\", and pear shaped. I love the shape and length!",
					"Columbia never disappoints! I'm a pretty solid 3x, size 24 jeans gal and this coat is roomy enough the zipper doesn't pull apart when you sit in it. I'm 5'11\" and the length hits a few inches above my knee, hips are fully covered. It has kept me plenty warm so far, and has room to layer under when temps drop even more.",
					"I've had this coat all winter and it has been nothing short of amazing. I really think it adapts to your temperature because I can wear it when it's 45 or 0 and it still works which is what you need in the Midwest. The diagonal pattern is more slimming than a lot of other patterns and I just love how comfortable it is. The sleeves with the arm holes are also nice for those gusty, windy days. The only negative about this coat is I would say that the hood is quite big so sometimes if I put it up, it will fall down but I've fixed that by adding ear muffs. This isn't a coat you would want to wear in anything below 0 however since it is more of a lightweight winter coat.",
					"I love love love this coat. I wore it in Chicago when it was -10 before windchill and it kept me pretty warm. It’s very light and easy to move in.",
					"Stats: 5’2 and 178lbs...apple shape. Ordered size XL (giving me room for bulky sweaters and sweatshirts) That being said, I have LITERALLY been researching/product testing several winter coats for well over a year now and THIS one is by far, the BEST for several reasons. While I have a closet full of jackets/coats for all seasons and occasions, I was searching for a solid winter jacket that could be worn daily that could be dressed up or dressed down. Don’t let the lack of thickness (puff) deceive you...it is super warm for long walks outdoors (Michigan gets cold). In fact, it’s so warm that I typically just wear a tank top or tshirt underneath for my walks despite the frigid temps! Also too, when driving, you don’t feel like a total fat snowball behind the wheel. It’s non restricting that doesn’t impede the use of a seatbelt and feels similar to wearing a standard hoodie while driving. I was specifically looking for a white colored winter coat, but selected the bisque color which is more like an ivory or vanilla color and am happy with it as it looks super classy. There is a soft fur material inside the hood which is a bonus. I hate wearing gloves, so the extended, hand covering has been my favorite thing about this coat. I’ve washed this twice in both hot and warm water settings and dried on high heat...no changes in the way of “shrinkage” and no pilling with the fur lined hood. My ONLY issue has been with the dbl zipper pull. Lining up the zipper is a bit wonky, but once connected it’s fine and with consistent usage, seems to be easier each time. I just wish it was a standard zipper. Seriously though...it’s a great coat and I have gotten many compliments and questions about it from random strangers. I can’t stress this enough...stop shopping around and just get this one.",
					"Needed a winter coat to walk my dogs (nov 2020) I generate alot of heat and sweat when I walk, even at a moderate pace. I rarely wear more than one layer and it is usually a long sleeve t-shirt. I live near Montréal, Québec in Canada, where the winters can get pretty cold, -15/-20 degrees celcius is nothing to us. It gets much colder than that and with the dreaded wind chill factor -40 celcius is not unusual. High humidity is common. The coldest I wore this coat at was -4 celsius with wind chill bringing it to -8. I could feel the cold wind on my back in the middle of my walk after having warmed up. To me, that's not a winter coat, certainly not for here. The fit runs a bit small, so I don't have the option of adding a layer. I wear a 3x and with most brands I have some room for a thin extra layer even though I rarely need it. I tried a thin extra layer with this coat and the sleeves were a bit tight and uncomfortable. I'm 5'6\" and the coat reaches just above my knees, which was perfect. Love the double zipper. Pockets are big enough to put your hands in, but they are not deep, only about 1 inch below the bottom of pocket opening, but there are zippers so you can secure any objects you want to put in them. There is also a pocket over left chest area, also with zipper. I like that the hood is smaller and the thin fleece is a nice touch, but it's an inch or 2 too small and does not protect your face (or glasses) from the elements. Since you cannot tighten the hood, if it gets windy the hood fills with air and blows up like a balloon and raises the lower part of the hood up towards your nose. (That was fun!!!) If you don't have a hat on you get cool and if you sweat like I do, your head gets cold. It's a nice looking coat, I like the fit and colour (dark nocturnal, which is a navy blue,). I like that it's light, but even with Columbia's dot technology, it wasn't warm enough even for someone who generates so much heat. I wore it at warmer temperatures as well (-1 to 5 degrees celcius) for my walks and I was quite comfortable. Because it has breathable technology, it helped reduce the humidity/coolness I felt on my back with my old regular coat. I will use this as a mid season coat as I have worn it at least 10 times already and can't return it. For someone who easily gets cold this would definitely not even come close to being a winter coat maybe you would use this as a car coat... I also wore the coat when it was snowing/sleeting and the outer layer is not even water proof, got completely wet. I wasn't out long enough to find out if the wetness would make it's way to the inner layer. I contacted Columbia to get an idea of what would be the temperature rating on this coat. They said, get this, \"that it's impossible to give a rating because of varying weather conditions and personal differences such as the heat we generate and the # of layers...\" I wrote back and told them nicely what I thought about that... I also told them I understood why they didn't assign ratings. They sell more coats that way. Look at myself and all the other people who have reviewed this coat and got stuck with a coat they did not need because it is not for winter. Most of the people who have reviewed the coat haven't even worn it yet, but it looks nice and the colour is pretty so let's give it a 5 star, really useless reviews that essentially tell you nothing about the coat. Is it a winter coat? No! I had to, like so many others here, look for a real winter coat after spending over $200 on this one. Not impressed by Columbia, but they don't care, they're selling lot's of coats. I got a great deal on a winter coat with Eddie Bauer, where they do assign temperature ratings, and I was able to know right away that I would be warm enough and I have not been disappointed so far and it's been much colder. Won't be buying another Columbia coat.",
					"I had to return this item because the XL was too snug, however, the return options did not allow an exchange to plus size nor did it have the option to choose too small as a reason for the return. It is charging $10.40 for the return even as a prime customer!",
					"T",
					"I don't know if I got a lemon or what but I usually wear a 1x for jackets giving me room for a sweater under and being comfortable to drive in, this particular jacket didn't have a 1x or 2x so I took a risk for the 3x and my God it was massive lol I was expecting it to be a little big (huge price drop for a larger size was why I went bigger). The fit was wide and boxy, not flattering at all - I was trying to see if I could pair it with a belt of some kind just to give it some shape and bring in the waist but it's just too big and coming from a plus size jacket girl, I could have worn an XL or maybe even a large - it was that big. I really wanted to love this but sadly only the price was right. I Saw other reviews that said it was a smaller fit which is another reason I wasn't too concerned going up a bigger size. Be prepared if you purchase this that you may have an issue with the size.",
					"I bought this for fall-winter in Vancouver, Canada. The coat is very flattering, true to size, soft and well made. I was excited to wear it out for the first time while trick or treating on Halloween. I was disappointed to quickly find that this coat did not keep me warm very well and the temperature was 10 degrees Celsius, and I had a light sweater underneath. Much colder and the coat will not cut it. I was expecting this coat to keep me toasty warm in temperatures hovering around freezing, but not so. I already washed it otherwise I would return and get something warmer, even though I like the style and feel of it... got to actually do what it's supposed to."
				]
			}
		},
		{
			"id": "cMPQIQI",
			"title": "Amazon Essentials Women's Lightweight Water-Resistant Hooded Puffer Coat (Available in Plus Size)",
			"price": "$17.82",
			"image": "https://m.media-amazon.com/images/I/71vvLEZdbpL._AC_UX342_.jpg",
			"description": "An Amazon brand - Puffer coat, this is a winter essential wardrobe staple\n\nAmazon Essentials is focused on creating affordable, high-quality, and long-lasting everyday clothing you can rely on. Our line of women's apparel includes cashmere sweaters, fleece and down jackets, and more, including plus-size options. Our consistent sizing takes the guesswork out of shopping, and each piece is put to the test to maintain the highest standards in quality and comfort.",
			"reviews": {
				"customerProfileNames": [
					"T.Zelinka",
					"angie",
					"Macromama",
					"Customer",
					"Customer"
				],
				"customerProfilePictures": [
					"https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif",
					"https://images-na.ssl-images-amazon.com/images/S/amazon-avatars-global/c384ea7a-1328-4bf7-bdab-dbb0e0f199bc._CR0,0,355,355_SX48_.jpg"
				],
				"customerRatings": [
					"5.0 out of 5 stars",
					"5.0 out of 5 stars",
					"5.0 out of 5 stars",
					"5.0 out of 5 stars"
				],
				"customerReviewTitles": [
					"Absolutely love this coat! Not too hot, not too cold.. just right.",
					"Best Clothing Item Ever Purchased Online!",
					"A terrific coat all around!",
					"Great Long Coat Runs A Little Small"
				],
				"customerReviewBodies": [
					"I was hesitant to order this online as I don't always have great luck with clothing purchases.\nPros: I was pleasantly surprised with this great winter coat. I sized up because I wear bulky sweaters, so the xl fits with plenty of room, but doesn't look oversized when not wearing something bulky underneath. This coat is plenty warm (I live in the frozen north) but I am not sweating the second I walk into a store, like with some puffy coats. It is very comfy and the pockets are decent sized with zippers so you can be sure not to lose what you put in them. It does not collect pet fur!! That is a super bonus for me, having 4 animals in the house.\nCons: Not really a con for me but if you plan to use the bag they say you can stuff it into you'd better be Houdini... no way that coat is fitting into that little bag (see pic). Don't mistake the inside slits for inside pockets- I did and my phone fell right through and onto the ground (it's fine). The cons aren't really cons for me, just worth mentioning. Oh, maybe if the hood came off, that would be nice, but not a deal breaker. Seriously, just buy it!!",
					"LOVE!\nI’ve never had success buying clothes online let alone a coat but this coat IS AMAZING!!!\n\nI purchased the XXL and it’s perfect:\nI’m 5.5, 220lbs, size 20 pants and DD bra.\n\nIt’s super warm and excellent quality. I couldn’t be happier. Merry Christmas to me!",
					"A",
					"Get this coat. You won’t be sorry!!! I always read the reviews for everything. I shop online mainly. Let me say this - if you want a Northface or Columbia coat or jacket stop here and go get one of those. I have some of those. They are great coats. I wanted a long coat to wear with my long cardigans and NOT look like a fool. Plus we go to a lot of hockey games and by behind gets COLD! I don’t know what idiot said they could see through this coat??? I can’r!?!? I don’t know what crazy person said they would NOT wear this is subzero weather or EXTREMELY COLD weather - why would you unless this is all you have??? Look I lived in the frozen tundra of northern Minnesota and I wouldn’t wear this coat there either. We wore real coats snow pants snow boats wool hats scarves and gloves. SOOOO with all that NONSENSE out of the way THIS IS A GOOD COAT!!! It’s long (longgg on me but I’m short) and very warm. I wear it zipped or unzipped. Here in Tennessee the weather is like the lottery. It’s 20 in the morning and snowing and 60 in the afternoon. The hat is handy when the wind picks up but never in the way. YES me and my daughter managed to STUFF it back in that tiny bag. DON’T DO IT! I’m a veteran packer so we wanted to try. I was afraid we tear the coat. Instead put it in a gallon baggie to pack it or compression bag. I just grabbed on so you can see how it will go in. I also placed a normal sized blender bottle there so you can see the see of the coat and bag. I didn’t even really squeeze the compression bag down. The coat isn’t huge on me but it is big enough to wear a thin shirt with my thicker cardigan under it and still zip it up and I am very comfy. But I will say the coat does run smaller. So order UP! For the money it’s a great coat. Oh and it is not shiny! The material is subdued. I have worn this coat from 10 degrees with little wind to 40s with gusting winds and been plenty warm enough.",
					"I really like this jacket! I’m 5’3” and a bit heavy so I ordered a large! It fits nicely. Let me tell you, we have had an early snowfall, here in Grande Prairie, AB, and the jacket was surprisingly great against the wind. It rained yesterday then it turned to snow and the jacket is water resistant for going in and out of the vehicle. As far as keeping me warm....it was -2 C today (when picture was taken) and I only wore a fleece sweater underneath. It was toasty! I loved that my lower back, bum and upper thighs were protected, too. I wouldn’t doubt that I could wear it well to -10, but mostly for going in and out of vehicle. For today’s long walk it was perfect! We shall see how the wear goes (others say it has ripped), mine is fairly new, love it!",
					"It's difficult to find a longer coat when you're a pear shaped woman. When I buy larger sized hip length or longer jackets/coats to accommodate my shape, I normally end up with excessive sleeve widths and bust areas. They seem to be cut with the impression that women are the same size all the way down, whether that be slim or curvy. The coats can end up looking ridiculous on me and unflattering. I am delighted to say that this coat is excellent. It flares gently from the waist and there's no excess material bulging about at the arms and chest. It creates a really flattering silhouette. I'm delighted. There's plenty of room to wear a t-shirt and a fleece underneath, if required, and it's cosy. I'm 5' 3\" and it comes down to about 3\" above my knees. I cannot comment on durability yet but for fit and the ability to not make a curvy woman look like a shapeless ball, it's 5 stars from me.",
					"Ich habe wirklich lange nach einem leichten Stepp-Kurzmantel für die Übergangszeit mit Kapuze gesucht, weil ich es gar nicht mag, kurze Steppjacken über längere Oberteile zu ziehen - hier bin ich endlich fündig geworden. Und er passt auch tatsächlich in die beigefügte Tasche, die kleiner als ein Din A 4-Blatt ist, ohne zerknittert wieder rauszukommen.\nDer Mantel reicht mir bei 170 cm Größe bis zur Mitte der Oberschenkel, ist so federleicht, dass man ihn kaum spürt und passt mir in meiner normalen Größe 36/S wunderbar. Ein etwas dickerer Pulli passt noch drunter und durch die leichte Taillierung sitzt er auch gut.\nEr ist insgesamt akkurat vernäht und das Material lässt Wasser eine ganze Weile abperlen, bis es die obere Stoffschicht durchdringt, aber nicht bis nach innen durchnässt. Da es gerade keinen Regen gibt, habe ich einfach mit dem Sprühnebel meiner Blumen-Sprühflasche draufgehalten.\nEinem leichten Regen standzuhalten, traue ich dem Mantel daher locker zu, eine Outdoor-Funktionsjacke ist er aber natürlich nicht.",
					"",
					"I’m size 14 and ordered Large. This fits well across shoulders and under arms but is huge across body. I suspect Medium would have been too snug for under arm comfort. Good Sandy colour ( camel), and nice, non shiny fabric.",
					"Manteau comme sur la photo! Bon rapport qualité-prix. Belle couleur rose pastel :-) assez chaud pour la fin de l’hiver ou le début du printemps ici au Québec. Grandeur légèrement trop grande mais idéal pour mettre une veste ou un chandail plus épais en dessous. Idéal pour voyager avec puisqu’il entre dans la pochette avec un peu d’effort (voir photo). Bref, je le recommande :-)",
					""
				]
			}
		},
		{
			"id": "4CTPaue",
			"title": "Amazon Essentials Women's Studio Terry Long-Sleeve Full-Zip Jacket",
			"price": "$12.76",
			"image": "https://m.media-amazon.com/images/I/91L5aJ1d8MS._AC_UX342_.jpg",
			"description": "Amazon Essentials is focused on creating affordable, high-quality, and long-lasting everyday clothing you can rely on. Our line of women's apparel includes cashmere sweaters, fleece and down jackets, and more, including plus-size options. Our consistent sizing takes the guesswork out of shopping, and each piece is put to the test to maintain the highest standards in quality and comfort",
			"reviews": {
				"customerProfileNames": [
					"Brasadi",
					"Lenna",
					"M.West",
					"PaulaG.Cannon",
					"Nikki",
					"Wanderlust",
					"TW",
					"KatieBoyle"
				],
				"customerProfilePictures": [
					"https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif",
					"https://images-na.ssl-images-amazon.com/images/S/amazon-avatars-global/a8432241-fa63-4699-b358-e72286828f54._CR62,0,375,375_SX48_.jpg"
				],
				"customerRatings": [
					"1.0 out of 5 stars",
					"5.0 out of 5 stars",
					"5.0 out of 5 stars",
					"5.0 out of 5 stars",
					"5.0 out of 5 stars",
					"5.0 out of 5 stars",
					"5.0 out of 5 stars",
					"1.0 out of 5 stars"
				],
				"customerReviewTitles": [
					"Loses shape after 1 wash",
					"True to size",
					"Very comfy and lightweight but not too light",
					"OH, this is a MUST HAVE wardrobe piece!",
					"Great fabric and feel!",
					"Flattering and works well with anything",
					"The “Just Right” Zip-Up!",
					"Shrinks terribly"
				],
				"customerReviewBodies": [
					"This is perfect. It's flattering and light weight, perfect for over scrubs. I'm 5'6\" and size 14/16, and the xxl fits with extra room- I wanted it kinda loose in case it shrinks\n\nUpdate: so this does not hold its shape. After 1 wash it's saggy and the bottom sticks out in weird spots. I've now washed it probably 5 times, and realized I'm just not going to wear it anymore because it looks awful",
					"This jacket is light weight, true to size, doesn't shrink in the wash and has cozy thumb holes. I got this to wear with scrubs when the air is too cool in the summer. I purchased a large, and it fits well without being too tight or baggy. I would not call this fabric terry cloth though, but it still gets the job done.",
					"Very soft fabric and lightweight. Well made for the price, I went with an XL to wear over shirts, think I will get a lot of use out of this. I’m 6’1 165 lbs and also got a Large in black and really like it too.\nYou won’t be disappointed with this!",
					"10 stars on this one! This is exactly what I needed for our cooler Spring and Fall weather. This jacket is so soft and comfortable, I don’t want to take it off even when it gets warmer out. There is so much nice detailing on this jacket, it’s very well made. The contoured cut is very flattering and seamed in a way that lets you really move, perfect for active women like me. This is perfect for a run in the park or a trip to the market. I absolutely love that the sleeves are long and have a thumb hole, this really keeps your hands warm with no need to carry glovess, Yet, there not so long you can’t just push them up. The stretch on the wrist. Is just right for keeping the sleeve at your wrist. I love the mock neck option or roll down into a collar, keeps my neck nice and comfortable. Love the slit kangaroo front pockets rather then on the sides, way more comfortable location. The bottom band is wide, 2.5” in the front and so cool that it gets wider in the back at 4 3/4”, gives this a really great updated style. The quality YKK zipper is awesome and very easy to zip and it’s rigid, so it’s very easy to start. Really awesome are the two pockets on the inside of both sides! The fabric is 57% viscose, 38% cotton, 5% elastane, incredibly soft feel. This may be my favorite piece of clothing in the closet but it’s most often on me. This one is a big hit, I high recommend this fab jacket.\nThe sizing is true, this is not a big slouchy fit, it has a nice tapered in contour, it sits closer to the body then a sweatshirt jacket but not at all tight. I wear a 12 in shirts and the Large was perfect with room to move and have a shirt underneath. The Large chest measures 42”, shoulder 17”, sleeve 26.5” and length 24”. Hope that helps",
					"This fabric is fabulous, I am ordering another. I think the viscose with cotton and nylon is soft and smooth. My suggested size was medium but I took a large because I like it a bit roomy and longer. I am sure the medium (true to medium as we have known it!) would have been fine but I love the way the large fit! I feel so lucky to have found this-the zip closure is a necessity for me! And the pockets were a plus (wish they were zips too). So very satisfied, beyond my expectations! Would buy some cool colors as well, if they became available (like forest green, teal or purple!)",
					"I love this jacket. I wear it on top of my scrubs at work and it's just enough to keep me warm but not overheat. It's very flattering, zipper works well and the collar can be turned up or left down. It looks very professional. I love it and am so glad I bought it. It's a little pricey but if it lasts long, then I guess it will be worth it. I've only had it for a few weeks but I wear it quite a bit.",
					"LOVE these jackets! I’ve since ordered 3 more in other colors, and I have a feeling I’ll be more or less living in them. They are exactly what I was looking for- a flattering fit, lightweight zip-up at an affordable price. This is not easy to find for a short curvy gal such as myself. But these seem like they were made me for. Arm and overall length is perfect. I think the material is just the right amount of stretchy to make it look good on most body types. It seems very well made too. Get yourself one (or 5!) you won’t be disappointed.",
					"I could literally only wear this twice. Shrunk so bad it might be able to fit a toddler at this point. Very disappointed.",
					"I previously bought the dark red one in M, which fitted well, I ordered a black one in the same size, this seemed slightly longer, but kept it anyway.\nIt's only terry on the inside, the outside feels like a stretch jersey.\nBut I love these zip up jackets around the house, nice material, comfy and wash well.",
					"Loved this top, fitted well looks good. keeps its shape when washed. Not a thick material to wear outside in the cold but lovely in the summer or wearing around the house. . Bought one then got another after in another colour, just waiting for my other colour to come in to get yet another.",
					"Excellent",
					"Bought in blk and would highly recommend. For the price the quality is amazing. Will definitely get the job done.",
					"Lovely texture would highly recommend it"
				]
			}
		},
		{
			"id": "7XzMMvI",
			"title": "Hanes Women's French Terry Zip Hoodie",
			"price": "$15.98",
			"image": "https://m.media-amazon.com/images/I/91cfrNHuDRL._AC_UX342_.jpg",
			"description": "This hoodie is made from French terry fabric, which is smooth outside and brushed inside for extra softness",
			"reviews": {
				"customerProfileNames": [
					"Cindy",
					"VioletGrandma",
					"HeatherSansom",
					"TK",
					"Sharona.D",
					"PKP",
					"Bowiedog77",
					"TiminOP"
				],
				"customerProfilePictures": [
					"https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif",
					"https://images-na.ssl-images-amazon.com/images/S/amazon-avatars/default._CR0,0,1024,1024_SX48_.png"
				],
				"customerRatings": [
					"5.0 out of 5 stars",
					"5.0 out of 5 stars",
					"5.0 out of 5 stars",
					"5.0 out of 5 stars",
					"5.0 out of 5 stars",
					"4.0 out of 5 stars",
					"5.0 out of 5 stars",
					"5.0 out of 5 stars"
				],
				"customerReviewTitles": [
					"GOOD DEAL - WELL MADE - COMFY!",
					"I want another one!",
					"Cute and cozy but runs big!!!",
					"Five Stars",
					"Great lightweight sweater",
					"Good, lightweight Zip-up!",
					"Great material and length",
					"Awesome hoodie for a great price!"
				],
				"customerReviewBodies": [
					"Nice quality. The fabric is not like the typical soft fuzzy on the inside sweat pant fabric. It's more like a thick cotton, slightly more rough, knit, t shirt fabric. It's not thin like a T shirt it's more strong but it's not fleece. I bought this jacket and the Hanes pants in the same blue space dye color & fabric from another seller but they don't match. They're close but not identical as I was hoping. I bought a big size because I wanted an oversized comfy sweat outfit for lazy days and it's perfect. Not too big and not too small.\nAs a person who owns an online clothing business and loves and has been buying designer high quality clothing for 15 years now, this is good quality. It's not thin and flimsy cheap. I wont wear total junk! I only took a chance on this cheaply priced jacket because it was Hanes. It's great for the price. I love a good deal. I am a small biz owner after all. This is a good deal for the price.",
					"Fantastic purchase! I’m 5’3” 108lbs. Roomy and comfortable. Nice soft fabric. If you put an iPhone in the pocket and move around too much, the phone will fall out but the pockets are large enough to fit your hands, tissues, keys, etc.",
					"I followed other people reviews on how this runs big and it sure does. I usually purchase large size jackets cause I do like a little bit of room just incase of layering (I'm a naturally cold person) however, I bought a medium and it fits like a large.\nI'm 5\"3' and I fluxate between 140 and 155, I have a very short torso too which makes the jacket look way longer on me than it should but looks cute paired with jeans.\n*** update ***\nLoved so much bought in the navy space dye color and even considering getting in the black space dye... this jacket is that comfortable and cute!!!",
					"Great over leggings, just loose enough for a tshirt underneath, doesn't cling to puffy bellies like mine.",
					"I’ve been looking a long time for something to replace a French terry sweater that Ive worn out. Tried a few and was disappointed.\nThis one is the perfect weight - not too heavy, so I’m weighed down, but not so light that I have to do calisthenics to keep warm.\nI wear the old one constantly, and have been able to do the same with this one. Quality is typical Hanes, not as rugged as I’d like, but then I’m not paying a huge amount for it. I love the way it feels and that (in my size) it’s not tight or form fitting, which is what I looked for.",
					"Good, lightweight zip-up. I usually wear a Medium and it fit perfectly. The back is a little longer than the front which is perfect for leggings or a little more coverage.",
					"I honestly can’t see how anyone would not like this jacket. I have been on a search for a grey zip up for about a year. I have even bought men’s and boys hoodies. This is about the 20# one I bought. I LOVE it. Material is really nice and the fit is perfect. Just below my bum in the back. I was worried there would be a noticeable penguin tail in the back. There is not, it is perfect for me.\n\nI am pear shaped. Right now I am a little heavier than I normally am. Quarantine pudge happened. I am 5’5 and 140.\nLots of junk in the trunk and I am fully covered by this. I am a 36 C/D bra and 40 hips ( maybe 42 right now). It’s perfect weight material. It’s not super heavy but it’s not too light either. It’s like a light terry cloth material and soft. I have found this type of material to wash really well and without shrinking. I am going to hang dry it instead of the dryer. I really love this hoodie. I will be buying more!",
					"I love this hoodie- soft, comfortable, great fit. I am 5'6\" 133 lbs and the medium is perfect- not too loose, not too tight. Light weight and perfect for Southwest FL winter nights.",
					"Hi, I ordered the same hoodie in 2 different colors & 2 different sizes. I am just over *5\"6/175Lbs.* 1st ordered the space dye blue in xl. it was a little big but still kept it...\nThis is the 2nd hoodie. i got the hoodie in black, *SIZE L* and it fits really well.\n(SUGGESTION: I usually soak my new clothes inside out in cold water with a little baby detergent, rinse them out and hang them to dry... Once dry, i lay them flat & spray with febreeze to get the wrinkles out by smoothing the garment out with my hands. Washing machines & dryers will shrink most of your clothes. They will loose their shape & color, especially these hoodies.) Good Luck & stay safe in this crazy world that we live in.",
					"Pleased with purchase . Fits well , ideal light weight hooded jacket .",
					"I really don’t understand why there’s so many good reviews. I thought it was a good product based on them.\nFirst there was no tag on the product, so I had to put it back inside a cheap ripe bag that the product was in and had the label. Second the material was really really cheap. It was a type of Shirt you would find in a cheap clothing store. I would never buy a shirt of this quality for more than 10$\nThird the design of this jacket was very very old fashion. Not flattering nor comfortable. So this is the reason I’m giving 2 stars. I took 1 star off for each of those reasons.",
					"I should have got an L or maybe an M as the XL I went with for safety is too large but I didn't want the hassle of exchanging them and so kept both of them. I got them for winter wear around the house, which I prefer instead of a instead of larger housecoat, so the fit is not top of list for me.\n\nThe material is the perfect lightweight fabric I wanted, so I can comfortably sleep in it as a jammie top in very cold weather, with the hood up on chilly nights.",
					"Estas chaquetas me gustaron porque son ligeras. Los inviernos en mi ciudad no son muy fríos, así que no necesitamos cosas gruesas, solamente algo que te proteja “del fresco”.\nNo tiene afelpado por dentro.\nLe regalé una a mi mamá y me dijo que la talla le quedó bien y que le agradaba mucho que las mangas no fueran demasiado ajustadas, ya que no siente que le aprieta los brazos.\nLa compré en dos colores porque me agradó bastante.",
					""
				]
			}
		},
		{
			"id": "hPQtrjg",
			"title": "Cherokee Women Scrubs Jacket Workwear Revolution Zip Front High-Low WW301",
			"price": "$35.98",
			"image": "https://m.media-amazon.com/images/I/61yihmLD6hL._AC_UY445_.jpg",
			"description": "78% Polyester, 20% Rayon, 2% Spandex\nImported\nZipper closure\nMachine Wash\nWomen Stand-up Collar\nLong Sleeve Jacket\nBack Length: 27\"\nPatch Pockets, Cell Phone Pocket",
			"reviews": {
				"customerProfileNames": [
					"BritnieHoyle",
					"AmandaT",
					"TerriZee",
					"RWR",
					"Blao",
					"Customer",
					"Nataliarave",
					"DemoyneFerris"
				],
				"customerProfilePictures": [
					"https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif",
					"https://images-na.ssl-images-amazon.com/images/S/amazon-avatars-global/17d18ad7-88ab-4982-a9a0-7749ac5b1f80._CR0,0,1080,1080_SX48_.jpg"
				],
				"customerRatings": [
					"5.0 out of 5 stars",
					"5.0 out of 5 stars",
					"5.0 out of 5 stars",
					"5.0 out of 5 stars",
					"5.0 out of 5 stars",
					"5.0 out of 5 stars",
					"5.0 out of 5 stars",
					"5.0 out of 5 stars"
				],
				"customerReviewTitles": [
					"Cheaper than the Scrub Store!",
					"Comfy, stylish, breathable, great jacket!",
					"Very Comfortable!",
					"Good basic jacket",
					"Light weight, breathable, pockets! Im about 5 ft and it's a bit long, but not too long.",
					"I like this material",
					"Divina fresca comoda",
					"So comfortable"
				],
				"customerReviewBodies": [
					"Ok, not by much, but it was worth it because it came straight to my door (with FREE shipping). Anyway, the jacket itself fits just as expected and I LOVE that it has not only the antimicrobial treatment but a moisture barrier. YEAH! for keeping myself safe and not letting liquid dwell and cause stains!!! It fits as you would expect from Cherokee products and this particular jacket has two large pockets in the front (very similar to pockets it would have if it was just a scrub top). There is also a smaller pocket on the right that's nice to slip in a smartphone or keep your pens safe from thieves. I also find the fit/cut very flattering. I'm always cold at work so I wanted something with more coverage than a regular scrub top. This jacket, particularly because of the pockets, has replaced my scrub tops and now I just wear a long sleeve t-shirt and this jacket to work (most of the time, at least). I'm definitely going to order another one.",
					"It’s hard to find the perfect scrub jacket to wear to work that won’t over heat you when you have to run around taking care of patients. Well- THIS IS IT!!! Great price for a great jacket! Breathable, slim fitting, pockets with room, cute style. Will definitely be purchasing more!",
					"This lightweight jacket is perfect for nurses who like to keep slightly warm while working. It has a comfortable stretch and not too snug so u can move around. I ordered a M and it fit just right. I love it!",
					"I was skeptical of buying this jacket at first, but it turned out as my favorite one! Im a nurse and it gets hot as I'm always running around. This jacket is so light and breathable. Has amazin pockets to love! Happy with purchase!",
					"My good choice",
					"This is such a great jacket, so comfortable and it’s light weight so I don’t get over heated, the fit is perfect."
				]
			}
		},
		{
			"id": "fD2kDgo",
			"title": "The Drop Women's Blake Long Blazer",
			"price": "$63.51",
			"image": "https://m.media-amazon.com/images/I/8188njzpFwL._AC_UX342_.jpg",
			"description": "The Drop partners with international influencers to design of-the-moment collections that could release at any instant-and are gone in 30 hours or less. Pair these designs with everyday pieces from Staples by The Drop to create your own desirable look.",
			"reviews": {
				"customerProfileNames": [
					"BJG",
					"KarenW.",
					"CarmenFletcher",
					"NatalieSkominas",
					"Susie",
					"Y",
					"MissyMoore",
					"Customer"
				],
				"customerProfilePictures": [
					"https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif",
					"https://images-na.ssl-images-amazon.com/images/S/amazon-avatars-global/8a04cae8-dac5-48ba-abac-fde113133802._CR0,0,471,471_SX48_.jpg",
					"https://images-eu.ssl-images-amazon.com/images/S/amazon-avatars-global/default._CR0,0,1024,1024_SX48_.png"
				],
				"customerRatings": [
					"5.0 out of 5 stars",
					"5.0 out of 5 stars",
					"5.0 out of 5 stars",
					"5.0 out of 5 stars",
					"5.0 out of 5 stars",
					"5.0 out of 5 stars",
					"5.0 out of 5 stars",
					"1.0 out of 5 stars"
				],
				"customerReviewTitles": [
					"Great Quality",
					"Flattering, lined jacket",
					"Excellent quality",
					"Awesome, but maybe size down.",
					"Wow ! Gorgeous",
					"Perfect Blazer",
					"Perfect",
					"Very disappointing"
				],
				"customerReviewBodies": [
					" I absolutely love this blazer, it’s a loose fit and great thick quality. I paired it with some cute white shorts for an all white and gold event. I’m 5’2 120 lbs and got a small.",
					"I",
					"Formal or casual fit. Im 185lbs and 38d the large fits fine",
					"I am 5’5” and 175-180 lbs. I usually wear a large, but the large was way too big. I sized down to a medium and still got that oversized look and the length was still long. There’s plenty of room in the shoulders and arms.",
					"My blazer arrived in a plastic bag all balled up and sat outside in the sun all afternoon. I figured it would be a mess when i pulled it out of the sack. It came out looking perfect! No wrinkles at all , this blazer is beautifully made has great detail and fits perfect. I intend to wear mine with tight jeans , a white tee shirt and black ankle boots. It is very cool . Buy it! Get it! You will love it .I'm 5'1 117 lbs i got the small.",
					"This blazer is exactly what I hoped for. The drape is fantastic, skims my belly and hips, makes me look slimmer. So comfortable and it gives my outfits that polished look. Dress it up or dress it down, it's versatile and would be great for travel.",
					"Best fitting longer couple days I’ve ever had! Really good deal for the money. Light weight but has a lining.",
					"Poorly constructed, cheap material. I suppose you get what you pay for. This is the reason shopping for clothing online is not all it is cracked up to be. A disappointing purchase. It arrived on my doorstep and within the hour I am sending it back for a full refund.",
					"This looks so cheap and nasty, definitely not what I expected for such a high price. Fits nice but that's about it, returned",
					"Material is cheap and not flattering at all. Don't waste your money, they're are similar priced blazers out there with much better material & fit. H&H, Mango, Zara do great ones.",
					"Très beau blazer.Il est très qualitatif avec un rembourrage aux épaules pour une tenue parfaite. Je l’adore,J'ai pris un xxl car je fais un bon 100 de poitrine,1,65 il m'arrive juste en dessous des fesses comme je desirais,j aurais pu prendre qu'un xl mais ca va quand même,j' aime pas les vestes qui moule,je recommande!",
					"",
					"Absolutely fabulous. Nice stretch to it. I bought an XS, and it’s perfect. Lovely long, tailored look.",
					"This must have been the worst jacket I’ve seen it looked like it had been in a fight and not worth the £50 they were asking"
				]
			}
		},
		{
			"id": "jLyQ_7-",
			"title": "The North Face Womens Thermoball Full Zip Jacket",
			"price": "$229.00",
			"image": "https://m.media-amazon.com/images/I/71lWQ63hwbL._AC_UX342_.jpg",
			"description": "Nylon\nMade in USA\nWomen’s water-resistant, insulated jacket packs into its own hand pocket. Women's water-resistant, insulated jacket packs into its own hand pocket. Standard Fit. 15D nylon ripstop. Lightweight, durable VISLON center front zip. Internal, secure-zip chest pocket. Internal, elastic-bound cuffs. Covered, secure-zip hand pockets. Hem cinch-cord.\nDeveloped in partnership with Primaloft, Inc., ThermoBall is a revolution in insulation technology. Unlike traditional continuous-filament synthetic insulation, the small, round PrimaLoft synthetic-fiber clusters closely mimic down clusters, trapping heat within small air pockets to retain warmth. Independent clo testing by Kansas State University has shown that ThermoBall has warmth equivalent to 600 fill goose down. As a result, ThermoBall can offer the lightweight warmth and compressibility o\nThe North Face's fundamental mission remains unchanged since 1966: Provide the best gear for our athletes and the modern day explorer, support the preservation of the outdoors, and inspire a global movement of exploration.\nThe North Face delivers an extensive line of performance apparel, equipment, and footwear. We push the boundaries of innovation so that you can push the boundaries of exploration. We remain deeply proud to be the first choice of the world's most accomplished climbers, mountaineers, extreme skiers, snowboarders, endurance runners, and explorers.",
			"reviews": {
				"customerProfileNames": [
					"Malibugrl",
					"Gypzi_00",
					"meper",
					"Renee",
					"Junnmara",
					"Questant",
					"becca",
					"MelissaBee"
				],
				"customerProfilePictures": [
					"https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif"
				],
				"customerRatings": [
					"5.0 out of 5 stars",
					"3.0 out of 5 stars",
					"5.0 out of 5 stars",
					"3.0 out of 5 stars",
					"5.0 out of 5 stars",
					"5.0 out of 5 stars",
					"5.0 out of 5 stars",
					"5.0 out of 5 stars"
				],
				"customerReviewTitles": [
					"Perfect and true to size",
					"Wish it fit",
					"Beautiful Color",
					"Looks great but not the warmest",
					"Expensive but worth it",
					"LOVE LOVE LOVE this jacket.",
					"Amazingly light!",
					"The perfect slim fit puff jacket"
				],
				"customerReviewBodies": [
					"This jacket is exactly like the picture. I received the harbor blue color ( much prettier in person) Size is true. I ordered a size large and it’s perfect. I wear 36D (40 bust) size large shirt and size 10 waist just some info for size preference. Definitely recommend and will order a different color in the future when the other color I want becomes available.",
					"The material was a nice matte finish, felt like quality, beautiful deep purple color, all in all it seemed worth the money. However, the fit was horrendous! I did the fit finder on the North Face website that said I should be XL. I think that estimation is made largely on hip size (I have 41\" hips), but I have a 31\" waist. Therefore, I was swimming in this jacket. The sleeves were huge on me and my waist completely disappeared. I was a big purple potato. I went to try on some TNF jackets at the sporting goods store and the large fits everywhere perfectly EXCEPT my hips. It's like they don't expect curvy women to wear coats! If it had a bi-direction zipper I could make it work, but a jacket I can't close does me no good. Returning and buying Columbia. For reference, my measurements are 39\" bust, 31\" waist, 41\" hips. I'm 5'10\" and pretty fit, I just got a big booty.",
					"Haven't had a chance to use the jacket yet (weather's too warm still). But the fit and the color are great. Like this blue; not to bright or shiny. I originally ordered a large because I generally fall between medium & large (I am 5'4\" and 129 lbs. but I have broad shoulders & back). Ended up with the medium which looks trimmer when I have just a light layer underneath, but is not too tight with t-neck & sweatshirt.",
					"I have always loved North Face products, but this is my first Thermoball jacket. It is definitely very comfortable, looks great and has been nice with temps in the 40s. I just moved to NC from PA, so I bought this jacket in hopes of not needing such a bulky winter coat. After several recess duties of temps in the 30s, I am slightly nervous about wearing this jacket all winter long. Under 40 degrees, this jacket does not keep you very warm. It is slightly less expensive than the Patagonia jacket I had before this, so it may not be a fair comparison. However, I will probably purchase another Patagonia down sweater, which has a similar look and is slightly pricier but MUCH warmer (I wore that with temps in the teens without feeling the least bit chilly). I still love this and will wear it on warmer winter days, but it is not a stand-alone winter jacket when the temps drop below 40.",
					"While the price tag was very expensive, I expect to have this jacket for a long time. I love the navy color with white insignia and stylish fit. I use it constantly on my winter hiking trips in the mountains as well as walking around town. The jacket is perfect for travel, lightweight yet warm.",
					"L",
					"A steal at discount price! Small is a bit roomy on me. This is what I had hoped for so the layer under for warmth. I’m 5’4 and 105lbs so for a young tighter fit, size to you regular size. I’m not so young and the looser fit is perfect",
					"I love this lightweight but warm and cruelty free puffy jacket. Very warm but not bulky, the last years purplish navy color is really beautiful. I usually wear an extra small in ladies shirts but got a small because I have long arms and didn't want the sleeves too short and it fits great with plenty of room for layers underneath."
				]
			}
		},
		{
			"id": "UwzMvVK",
			"title": "Amazon Essentials Women's Studio Terry Long-Sleeve Full-Zip Jacket, Grey Marl, Medium",
			"price": "$27.30",
			"image": "https://m.media-amazon.com/images/I/91L5aJ1d8MS._AC_UX342_.jpg",
			"description": "We listen to customer feedback and fine-tune every detail to ensure our clothes are more comfortable, higher quality, and longer lasting—at affordable prices for the whole family.\n\nAmazon Essentials is focused on creating affordable, high-quality, and long-lasting everyday clothing you can rely on. Our line of women's apparel includes cashmere sweaters, fleece and down jackets, and more, including plus-size options. Our consistent sizing takes the guesswork out of shopping, and each piece is put to the test to maintain the highest standards in quality and comfort",
			"reviews": {
				"customerProfileNames": [
					"AshT",
					"Sukha",
					"Luli",
					"NR",
					"Cindy",
					"jbkersey",
					"JoanS.",
					"Amanda"
				],
				"customerProfilePictures": [
					"https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif"
				],
				"customerRatings": [
					"5.0 out of 5 stars",
					"5.0 out of 5 stars",
					"5.0 out of 5 stars",
					"5.0 out of 5 stars",
					"5.0 out of 5 stars",
					"5.0 out of 5 stars",
					"5.0 out of 5 stars",
					"5.0 out of 5 stars"
				],
				"customerReviewTitles": [
					"Great jacket",
					"Great quality an fit!",
					"perfect new england summer jacket.",
					"Versatile and comfortable",
					"Perfect",
					"Cute",
					"Great warm up jacket b",
					"Works well over scrubs"
				],
				"customerReviewBodies": [
					"I love this zip up jacket. It's so lightweight and perfect to wear over my scrubs. I did order a size up based on other reviews and it fits perfect. I have washed it and line dryed it, it did not loose shape.",
					"I love it! The fabric is so soft, washes nicely and fits very good. Perfect for spring and fall!",
					"The fit is great - very flattering, it's comfortable and I love the look of the lighy gray with black zipper.",
					"Comfortable and light weight. Fits perfectly. Great to just throw on and step out for any casual visit.",
					"Love this lightweight jacket",
					"This is a cute jacket but it reminds me of a jacket you would work out in",
					"Soft, comfortable and cute.",
					"I got a medium. I’m 5’6 135lbs. Works great over my scrubs at work! Soft & stretchy material!",
					"Love the thumb holes. Fits as expected. Soft and comfortable. It does bunch a bit in the front with the pockets but it's still my favorite. Love that it doesn't have a hood.",
					"Angenehm zu tragen. Habe bei einem Stück den Fehler gemacht, dass ich die Jacke wie einen Pulli auszog und da war der Bund gleich mal gedehnt und zu weit. Sollte das ausheben aber ich habe gelernt und bei einer anderen nicht mehr gemacht - die hält die Form",
					"",
					"I really like the colour and style of this jacket. I am a medium and it fits as described.",
					"Pour sa chaleur pour mon épouse",
					"",
					"Love the material and fit"
				]
			}
		},
		{
			"id": "0P1GKYa",
			"title": "Vetinee Women Casual Faux Fur Lapel Zip Pockets Quilted Parka Jacket Puffer Coat",
			"price": "$38.99",
			"image": "https://m.media-amazon.com/images/I/61gH+Y1ZIIL._AC_UX342_.jpg",
			"description": "Faux Fur\nZipper closure\nHand Wash Only\nWinter hooded jacket for women with lapel V-neck or stand neck, and front zipper closure. Warm and cozy loungewear.\nFaux fur trim along its neckline provides moderate warmth. Two functional buttons for this parka outerwear.\nSide pockets with zipper detailing. Long sleeve puffer coat let you gorgeously meets with cold weather. Hooded design will keep you warm in the cold days.\nWomen winter coat is great for casual, daily life, going out, chilly day, fall, winter, holiday, vacation and so on.\nSize Small fits size 4 - size 6, size Medium fits size 8 - size 10, size Large fits size 12 - size 14, size X-Large fits size 16 - size 18, size XX-Large fits size 20 - size 22.",
			"reviews": {
				"customerProfileNames": [
					"JulieY",
					"Patricia",
					"KristenTurner",
					"CarissaAndrews",
					"Theresa",
					"lindseyluttrell",
					"VickiRios",
					"Shantelrose"
				],
				"customerProfilePictures": [
					"https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif",
					"https://images-na.ssl-images-amazon.com/images/S/amazon-avatars-global/bb436d88-0997-4243-b1dd-f1ee681b469b._CR0,0,375,375_SX48_.jpg"
				],
				"customerRatings": [
					"5.0 out of 5 stars",
					"5.0 out of 5 stars",
					"5.0 out of 5 stars",
					"5.0 out of 5 stars",
					"5.0 out of 5 stars",
					"3.0 out of 5 stars",
					"5.0 out of 5 stars",
					"5.0 out of 5 stars"
				],
				"customerReviewTitles": [
					"Keeps you warm",
					"Well made and zips up great",
					"High-end look for one low price",
					"Love this coat!",
					"WOW - love this jacket !!",
					"Order 2 sizes Up if you plan on wearing winter clothing underneath this jacket",
					"Good Looking",
					"Super cute!"
				],
				"customerReviewBodies": [
					"Based on reviews I thought I would hate this jacket and it wouldn’t be warm enough but it’s been great. We are living in a 5th wheel while renovating our house and it’s always freezing but this coat keeps me warm. I’ve also worn it in snow, I do usually have a hoodie on under it if it’s extra cold outside, but all in all it’s been great. I usually wear medium and ordered large, happy I did! Fits perfect.",
					"Love it! I'm 5'6 155 pounds and I bought the medium. It fits perfect! I drive a lot and was afraid the fur would be in my face but its not. It also is slimming and I don't look like I'm wearing a huge snow jacket. I highly recommend!",
					"Great product for the price fits true to size. Great color",
					"It's been a while since I had to purchase a coat. I was a little leery buying this one online... especially since it took a bit of time to arrive. My fears vanished the moment I put it on. It's perfect! Thank you!",
					"terrific jacket - fit color style quality price - all perfect - the faux fur collar is so much nicer than jackets at twice the price ( i don't need a hood) -and it arrived early\nI\"m 5ft 6in tall and weigh 117 pounds - the small fits great",
					"If you plan on wearing anything thicker than a tight t-shirt under this jacket I suggest ordering 2 sizes up. It is warm and cute the arm length is good it hits perfectly on your waist but it is rather tight when you try to zip it up while wearing winter clothing. Also the pictures make it look like it has a hood it does not it is just a for collar still cute but would have liked to have a hood.",
					"I love my new coat fits great, I'm size10 and Med. fit",
					"Love this coat, supercute! If you want to layer under i would definately size up though.. But it fits just like it should with normal clothes on under!",
					"This coat is exactly as described - and looks just as good when you get it as in the pictures! It was a gift for my 17yr old daughter who is 6\"1\" - I ordered the 2XL and it fits perfectly - she is normally a size 16-18. The sleeves are also long enough - which is always a concern with someone so tall - which was a godsend! The overall length of the jacket is also perfect for a taller person - as many women's coats are too short for her - but this one is proportioned perfectly as the sizes increase, so it is not just wider, and it sits on her hips perfectly. The fur collar is a nice touch to not having a hood - it makes it much more comfortable to wear a hoodie underneath, and it looks sharp! I can't say enough good things about this jacket, and the blessing it is for a tall person!! I can't say how warm it is in extremely cold weather, but it is more fashionable than anything. I don't expect it to be warm enough to spend hours outside doing sports in the snow, but for hanging out with friends or going to the mall, school or work it will be perfect for the cold weather."
				]
			}
		}
	]
}
